{
    "season": "Season 2Edit",
    "li": [
        "None (\"The Dundies\")\n",
        "None (\"Sexual Harassment\")\n",
        "Michael has Ryan get him a breakfast sandwich on the way in to the office. Michael said he needs Ryan to come in early for something, that \"something\" is Michael's breakfast sandwich. (\"Office Olympics\")\n",
        "Pam gets a call from Katy asking for Jim. Jealous, she tells him to give her the extension next time. (\"The Fire\")\n",
        "Michael has to provide Jan with the name of the employee he's firing. He tells her assistant that he'll get back to Jan with a name. Thinking he'd disconnected the line, he says he wishes he could fire the assistant, only to learn he hadn't disconnected the line and she heard him. (\"Halloween\")\n",
        "Dwight's desk is missing because Jim hid it in the bathroom. Dwight goes into the bathroom, telling Kevin to wash his hands. (\"The Fight\")\n",
        "Michael wears his casual jeans around the office and Ryan is forced to dry clean them. (\"The Client\")\n",
        "Dwight tells Jim about his yoga ball and Jim then pops it with a pair of scissors. (\"Performance Review\")\n",
        "Michael freaks when he sees a man with a turban approach his office. He makes everyone cut off the lights and go silent. He later says, \"The IT tech guy and me did not get off to a great start.\"(\"Email Surveillance\")\n",
        "Michael gets a Christmas Tree for the office, but it is too big, leading to it breaking into the ceiling. (\"Christmas Party\")\n",
        "Dwight's things are in the vending machine because Jim hides it and makes him pay to get his wallet with nickels. (\"Booze Cruise\")\n",
        "Dwight crashes into a pole and throws up while rushing to get Michael after he calls for help because he burned his foot on a George Foreman Grill. (\"The Injury\")\n",
        "Jim says, \"Up dog\" leading Michael getting tricked into saying \"What's Up Dog?\". Michael tries to use it unsuccessfully. (\"The Secret\")\n",
        "Jim keeps looking up to reception where Pam is missing and Ryan is. Ryan finds it odd that Jim keeps looking at him, but it's nothing like Michael looking at him. Cut to Michael creepily staring at Ryan through his office blinds. (\"The Carpet\")\n",
        "It's Women in the Workplace Day at Dunder Mifflin, and Pam expresses her thoughts. (\"Boys and Girls\")\n",
        "It's Valentine's Day at Dunder-Mifflin and Pam says it's like grade school. (\"Valentine's Day\")\n",
        "Michael and Dwight throw a football around the office, and it ends with Dwight tackling Ryan down. Michael then is about to throw it at Pam before the theme cuts it off. (\"Dwight's Speech\")\n",
        "Michael says he works with a bunch of nerds when Jim and Dwight correct his use of superhero analogies when talking to the kids. (\"Take Your Daughter to Work Day\")\n",
        "Michael tries to interest the guys in purchasing calling cards. Jim asks Michael how is it not a pyramid scheme and goes on draw a pyramid around the sketch Michael has drawn to explain the idea, proving to everyone that this indeed is a pyramid scheme. (\"Michael's Birthday\")\n",
        "Dwight finds drugs in the parking lot and starts a huge investigation. Jim explains that \"Dwight finding drugs is worse than anyone actually doing drugs.\" (\"Drug Testing\")\n",
        "Pam is still making wedding preparations and Phyllis tells her she has received her 'save the date.' Angela says she doesn't have hers yet. (\"Conflict Resolution\")\n",
        "Jim convinces Dwight that he can move objects with his mind and Dwight begins to believe it when he moves a coat rack. Pam helps him by using an umbrella to pull the coat rack. (\"Casino Night\")\n"
    ]
}