{
    "season": "Season 9Edit",
    "li": [
        "The Dunder Mifflin crew talked about their summer. Kevin smashed a turtle.(\"New Guys\")\n",
        "The Dunder Mifflin crew set up the chore wheel.(\"Roy's Wedding\")\n",
        "An Asian man pretends to be Jim, a prank set up by Jim to play on Dwight.(\"Andy's Ancestry\")\n",
        "Andy makes a fail reel of the summer softball tournament.(\"Work Bus\")\n",
        "Dwight puts a jack-o'-lantern on his head but it gets stuck.(\"Here Comes Treble\")\n",
        "Oscar admits he is having an affair with the Senator and Kevin overhears.(\"The Boat\")\n",
        "Andy video-chats the office via his laptop. but then proceeds to drop it in the sea.(\"The Whale\")\n",
        "Oscar worries about Angela knowing about the affair. As it turns out, she is oblivious.(\"The Target\")\n",
        "None (\"Dwight Christmas\")\n",
        "Jim bites his lip talking about sports with Darryl and Kevin. He tries not to let it bother him but he later storms out of the interview in annoyance.(\"Lice\")\n",
        "Dwight tries to persuade Jim to form a sales team with him to get a client, however Jim cannot come. Dwight embarrasses himself by accidentally saying \"love you\" at the end.(\"Suit Warehouse\")\n",
        "Dwight discovers an old prank established by Jim a long time ago, leading to a wild goose chase throughout the building.(\"Customer Loyalty\")\n",
        "Pam thanks Brian for his support however he tells Pam that his agency does not want the camera crew to talk to the office staff. Meredith then tries to flirt with Brian and he happily tells her the same thing.(\"Junior Salesman\")\n",
        "Darryl has began working for Jim's company in Philadelphia and has to sneak out of work. Erin distracts the office when he sneaks out and uses a giant teddy bear dressed like him to make him appear as though he is in his office.(\"Vandalism\")\n",
        "None (\"Couples Discount\")\n",
        "David Wallace yells at Andy for lying however he decides not to fire Andy since he got David to buy the company.(\"Moving On\")\n",
        "Dwight announces that his aunt has died and begins to throw dirt in people's face to tell them to stay away from him in his time of mourning as is Schrute tradition. He does this to everyone except Oscar and throws a large dirt-ball at Jim.(\"The Farm\")\n",
        "Phyllis gets aroused while listening to the Fifty Shades of Grey audiobook. Dwight pours a bucket of water on her head and Andy confiscates her iPod. Andy is shown getting aroused from listening to the book and a bucket of water is quickly poured on him.(\"Promos\")\n",
        "The elevator is out of order and Stanley is forced to walk up the stairs to which he tires out quickly.(\"Stairmageddon\")\n",
        "The office talk about the paper airplane contest they are competing in. Pam accidentally hits Toby in the eye with her paper airplane.(\"Paper Airplane\")\n",
        "None (\"Livin' the Dream\")\n",
        "Kevin enters the office using the new security door Dwight installed. Dwight later tries to use it himself and gets the password wrong causing him to get blasted by steam (\"A.A.R.M.\")\n",
        "Dwight recaps his first year as Regional Manager. A flashback of Stanley retiring and Kevin and Toby getting fired is shown.(\"Finale\")\n"
    ]
}