{
    "season": "Season 4Edit",
    "li": [
        " Michael hits Meredith with his car when he is distracted while talking to the documentary crew about living at home with Jan, and how Jim is back and Ryan is boss. He is shocked, while Meredith is injured. (\"Fun Run\")\n",
        " Everyone realizes Pam and Jim are in a relationship when Toby sends a notice regarding relationships in the office, after he sees Pam and Jim kiss in the office. Michael says that it will a day remembered in infamy. (\"Dunder Mifflin Infinity\")\n",
        " Michael is holding a meeting, but instead of everyone paying attention, they are waiting for a square to go into the corner of the TV because it never happens. When it finally does go into the corner everyone cheers, which Michael mistakes as laughter for his jokes. (\"Launch Party\")\n",
        "Michael treats Pam like Meryl Streep's character in Devil Wears Prada and apologizes when he finishes the movie. However, when he uses a term from Million Dollar Baby, Pam thinks Michael is going to try to kill her. (\"Money\")\n",
        "Michael tries to get ideas from a local ad and Andy is angry when he can't remember a rhyme from a commercial. However, Jim tells everyone not to tell him. Jim explains that a local ad is great because no one knows what Dunder Mifflin is. (\"Local Ad\")\n",
        "Stanley tells Michael he is going to Utica to work with Karen (who claimed in a talking head that, without an incompetent boss and a boyfriend in love with another woman, Regional Manager was a \"pretty easy job\"). (\"Branch Wars\")\n",
        "Michael wasn't invited to a corporate retreat when Ryan lets everyone else go, and replaces Michael with Toby. Everyone comments that Michael wasn't invited and Pam is interested in what happened. (\"Survivor Man\")\n",
        "Michael has Pam write notes to him during meetings so that he can feel important. However, it gets him in trouble when Ryan thinks he has a client, but doesn't and has to take it. (\"The Deposition\")\n",
        "Michael pretends to call corporate and says that everyone can go home instead of working late. He, however, has a plan and gets Jim, Pam, Angela and Andy to come because they rescheduled all of their plans (at which point Jim realizes that the project that would require them to work late never existed). Dwight is distraught at not being invited. (\"Dinner Party\")\n",
        "There are parking problems and Pam and Jim explain they saw \"nature.\" Kevin is most angry and has to stop walking throughout. (\"Chair Model\")\n",
        "Michael has gum in his hair because he saw a shiny thing under a car. Dwight puts peanut butter in his hair, and Dwight eats it. (\"Night Out\")\n"
    ]
}