{
    "season": "Season 3Edit",
    "li": [
        " Ryan explains that he was promoted and footage of Pam kissing Jim comes up. Dwight then pretends to cry because Jim is gone, but says he doesn't miss him. (\"Gay Witch Hunt\")\n",
        "Michael wants to adopt a child because of watching Oprah. He asks Pam to look it up, but she doesn't, and Michael asks if in thirty years she will want to have a kid with him. Pam agrees. (\"The Convention\")\n",
        "Pam makes popcorn because it is Movie Monday but no one wants it. (\"The Coup\")\n",
        "Michael asks Ryan if he wants a pencil from the warehouse then walks to the 'warehouse' behind a stack of boxes. (\"Grief Counseling\")\n",
        "Dwight keeps trying to trick Ryan with riddles. However, Ryan shuts Dwight down by answering before Dwight can get his answer out. (\"Initiation\")\n",
        "Ryan is bought Indian Clothes causing Michael to make fun of him. However, when Pam points out that it's nice, Michael asks Kelly why she didn't get more for him. (\"Diwali\")\n",
        "Dwight gets letters from Future Dwight as a prank from Jim in Stamford and rushes to save Stanley from being poisoned by his coffee. (\"Branch Closing\")\n",
        "The Stamford branch packs up their belongings, with Andy pressing Jim for the goods on Michael. Pam \"times\" how fast Dwight can run with a thermometer when Toby tells Pam that he finished a marathon, and Dwight says he could run faster than Toby. (\"The Merger\")\n",
        "Michael imitates the baby from Look Who's Talking when Hannah Smoterich-Barr brings in her baby boy who is mistaken for a girl because of bizarre and nonsensical gender roles. She confirms his favorite color is pink. (\"The Convict\")\n",
        "Dwight brings in a dead goose in the office and convinces Toby that they can eat it. Creed says it's crazy, but Phyllis wants to eat it. Pam is overly irritated and is told to lighten up. (\"A Benihana Christmas\")\n",
        "The salespeople make fun of Dwight when they are forced to record their meeting for Michael, who is on vacation. It ends up with Andy making a stupid remark of Dwight cutting Phyllis' head off. (\"Back From Vacation\")\n",
        "Michael forces Jim and Pam to meet Harvey, his computer, and keeps making mistakes when typing what Harvey says. Pam and Jim anger Michael when they pretend not to know what Harvey means. (\"Traveling Salesmen\")\n",
        "Dwight tries to get a job and meets two people, describing himself as merciless, but fails and decides to work at Staples for the time being. Meanwhile, back at the office, Andy is grating on everyone, and Jim in particular, to the point that he admits to missing Dwight. (\"The Return\")\n",
        "Michael makes a tape for his future son which Dwight tapes. When Michael needs to take off a bra, he asks Pam if she wants to, but does it to Dwight. Dwight suggests that Michael dies because his future son kills him. (\"Ben Franklin\")\n",
        "Jim makes a Pavlov Experiment for Dwight, giving him altoids when he reboots his computer, until he expects to get one. Dwight is finally tricked. (\"Phyllis' Wedding\")\n",
        "Michael reminisces about the eighth grade because he is going to be the guest speaker at Ryan's business school - even though it will bump him up a full letter grade, Ryan is uneasy about bring Michael to school. (\"Business School\")\n",
        "Michael traps himself in chains and drops the key, but before he asked no one to help him. He can't get out. (\"Cocktails\")\n",
        "Roy attacks Jim and Dwight sprays Jim with pepper spray. Dwight explains that he always brings paper spray. Everyone, including Pam and Karen are shocked. (\"The Negotiation\")\n",
        "Andy comes back from anger management and requests to be called \"Drew.\" Dwight and Jim refuse, and Dwight explains that he is going to shun him for the next three years, like he was in his childhood for not saving tuna fish juice. (\"Safety Training\")\n",
        "Jim pretends to be Dwight and brings in everything that Dwight would. Dwight goes into Michael's office after Jim imitates him going into Michael's office. (\"Product Recall\")\n",
        "Dwight gives Jim a demerit and explains what happens after that. Jim tells him that he is going to give him a full \"disadulation\". (\"Women's Appreciation\")\n",
        "Michael gets a call from David Wallace telling him that he is up for a job at corporate. Michael tells him god will be with him. (\"Beach Games\")\n",
        "Michael goes to New York only to realize his interview is tomorrow. Michael calls Pam telling her, that he'll be three hours late. (\"The Job\")\n"
    ]
}