{"sections":[{"title":"A Benihana Christmas Quotes","level":1,"content":[{"type":"paragraph","text":"Dwight: Once I brought in a duck. To prepare for lunch. And, people got...upset. Apparently, they got attached to the duck, and didn't want to see it killed."},{"type":"paragraph","text":"Dwight: He was already dead, and we Schrutes use every part of the goose. The meat has a delicious, smoky, rich flavor. Plus you can use the molten goose grease and save it in the refrigerator, thus saving you a trip to the store for a can of expensive goose grease.\nJim: Wow...win-win.\nDwight: Exactly! Thank you Jim...\nPhyllis: I like goose...It's already dead - is it so crazy that we eat it?\nCreed: That's crazy...It's crazy."},{"type":"paragraph","text":"Jim: It's a bold move, to photoshop yourself into a picture with your girlfriend and her kids on a ski trip with their real father - but then again Michael's a bold guy...Is \"bold\" the right word?"},{"type":"paragraph","text":"Pam: For the past few months, I've been sending Dwight letters from the CIA...They're considering him for a top-secret mission...This is where I made list every secret he promised he'd never, ever tell!...So, here's the gift - you get to decide what his top-secret mission is!\nJim: You know what, I really don't think I should be doing this stuff anymore though...\nPam: Oh...of course..."},{"type":"paragraph","text":"Michael: We're going to Asian Hooters!\nRyan: I can't...\nMichael: Why not?\nRyan: I'm not feeling so well...I've got a ton of work to do here...MSG allergy...peanut allergy...I just ate there last night...\nJim: Wow! Thanks for taking all the excuses, dude...\nRyan: Doctor's appointment...car trouble...planter warts...granddad fought in World War II...Use your head, man - I keep mine in here...Look alive, Halpert - welcome back!"},{"type":"paragraph","text":"Kevin: I hear Angela's party will have double-fudge brownies...but it will also have Angela. So, double-fudge...Angela... Double fudge......Angela...Hmmmmmmm..."},{"type":"paragraph","text":"Karen: Are we taking this too far? No, I don't think we're taking this far enough.\n (Pam shudders)\nKaren: What?\nPam: You gave me goosebumps."},{"type":"paragraph","text":"Jim: Oh, no, this is different! The CIA thing? That was a prank on Dwight, this is more like a, um...OK, it's pretty much the same thing!"},{"type":"paragraph","text":"Jim: You just had a rebound...which, don't get me wrong, can be a really fun distraction...but when it's over, you're left thinking about the girl you really like, the one that broke your heart."},{"type":"paragraph","text":"Jim: Goodnight, Pam.\nPam: G'nite!\nJim: Oh, you know what? Sorry, I forgot to tell you - I intercepted a transmission earlier, and it seems that the CIA is gonna need Dwight down at their headquarters at Langley for training...and an ice cream social with the other agents.\nPam: We should get him a bus ticket - to make his trip easier...It costs $75...\nJim: Well, maybe the CIA could send a helicopter!"}],"images":[]}]}