{
  "sections": [
    {
      "title": "Basketball Quotes",
      "level": 1,
      "content": [
        {
          "type": "paragraph",
          "text": "Michael: [Talking head] Who am I? Am I Michael Scott? I don't know... I might just be a basketball machine. What's Dunder Mifflin? I've never heard of it. Filing? Paperwork? Who cares? Possible downsizing? Um... well, that's probably gonna happen, actually."
        },
        {
          "type": "paragraph",
          "text": "Michael: Oh yuck! That's even worse than you playing!"
        },
        {
          "type": "paragraph",
          "text": "Pam: Please don't throw garbage at me.\nMichael: Oh, Pam with a zinger!"
        },
        {
          "type": "paragraph",
          "text": "Michael: [watching Stanley play basketball] What? You gotta be kidding me!"
        },
        {
          "type": "paragraph",
          "text": "Michael: This is our warehouse or as I like to call it, the whorehouse! But, don't you call it that. I've earned the right.\nRyan: Fine, don't worry about that."
        },
        {
          "type": "paragraph",
          "text": "Michael: [discussing his basketball team] We have Ryan, the new guy, right? Untested, willing to prove himself right now, a lot of passion, a lot of heart.\nRyan: But I'm getting paid to skip lunch, right?"
        },
        {
          "type": "paragraph",
          "text": "Michael: And this is the foreman, Mr. Rogers!\nDarryl: That's not my real name.\nMichael: No, Darryl. Darryl is Mr. Rogers!\nRyan: Darryl Rogers?\nDarryl: Darryl Philbin. Then Regis, then Reeg, then Roger, then Mr... Rogers."
        },
        {
          "type": "paragraph",
          "text": "Michael: The hand strikes and gives a flower."
        },
        {
          "type": "paragraph",
          "text": "Michael: Let's put together the starting line-up, shall we? Stanley, of course.\nStanley: I'm sorry?\nMichael: Um, what do you play? Center?\nStanley: Why 'of course'? What's that supposed to mean?\nMichael: I dunno... I don't remember saying that.\nJim: Uh, I heard it.\nMichael: Well people hear a lot of things, man."
        },
        {
          "type": "paragraph",
          "text": "Michael: The great thing about sports is that it is all about character and you can learn lessons about life even if you don't win but we did because we were ahead."
        },
        {
          "type": "paragraph",
          "text": "Michael: [Talking head] Today at lunchtime we're going to be playing the warehouse staff at a friendly little game of basketball. My idea. Last time I was down there, I noticed they'd put up a couple of hoops, and I play basketball every weekend. So I thought, \"This might be kinda fun.\" And so I started messing around and... I'm sinking a few, you know. Swish, swish, swish. Nothing but net. And their jaws just dropped to the floor. African-Americans! So... you know, it's really just a good friendly game, a reason to get together."
        },
        {
          "type": "paragraph",
          "text": "Dwight: So we need someone to work this Saturday and I think that should be...Jim."
        },
        {
          "type": "paragraph",
          "text": "Jim: God this is so sad. This is the smallest amount of power I've seen go to someone's head. Phyllis, can you believe this?"
        },
        { "type": "paragraph", "text": "Phyllis: Keep me out of it." },
        {
          "type": "paragraph",
          "text": "Michael: [Talking head] Football is like rock and roll, it's just bam-bam-boo... And basketball is like jazz, you know? You're kind of... Dupee-doo, dupee-do. It's all downbeat, it's in the pocket, it's like... [singing] Dupee-do, dupee-do, dapee-dah..."
        }
      ],
      "images": []
    }
  ]
}
