{"sections":[{"title":"Casino Night Quotes","level":1,"content":[{"type":"paragraph","text":"Michael: Tonight the Scranton Business Park is having Casino Night and we are converting our warehouse into a full-blown gambling hall. And I know it's illegal in Pennsylvania, but it's for charity. And I consider myself a great philanderer. It's just... It's nice to know at the end of the day, I can look in the mirror and say, \"Michael, because of you, some little kid in the Congo has a belly full of rice this evening.\" Makes you feel good."},{"type":"paragraph","text":"Pam: Hey."},{"type":"paragraph","text":"Jim: Hey, how's it going?"},{"type":"paragraph","text":"Pam: Good. Especially after I took all your money in poker."},{"type":"paragraph","text":"Jim: [laughing] Yeah. Uh... Hey can I talk to you about something?"},{"type":"paragraph","text":"Pam: About when you want to give me more of your money?"},{"type":"paragraph","text":"Jim: No, I..."},{"type":"paragraph","text":"Pam: Did you want to do that now? We can go inside. I'm feeling kind of good tonight."},{"type":"paragraph","text":"Jim: I was just...um...I'm in love with you."},{"type":"paragraph","text":"Pam: What?"},{"type":"paragraph","text":"Jim: I'm really sorry if that's weird for you to hear, but I needed you to hear that. Probably not good timing, I know that, I just..."},{"type":"paragraph","text":"Pam: What are you doing? What do you expect me to say to that?"},{"type":"paragraph","text":"Jim: I just needed you to know. Once."},{"type":"paragraph","text":"Pam: Well, I um...I...I can't."},{"type":"paragraph","text":"Jim: Yeah."},{"type":"paragraph","text":"Pam: You have no idea..."},{"type":"paragraph","text":"Jim: Don't do that."},{"type":"paragraph","text":"Pam: ...what your friendship means to me."},{"type":"paragraph","text":"Jim: C'mon. I don't want to do that. I want to be more than that"},{"type":"paragraph","text":"Pam: I can't. I'm really sorry...if you misinterpreted things. It's probably my fault."},{"type":"paragraph","text":"Jim: Not your fault. I'm sorry I misinterpreted uh our friendship. (a tear rolls down his cheek)"},{"type":"paragraph","text":"Pam: [looks at her engagement ring, sadly and awkwardly.]"},{"type":"paragraph","text":"Creed: Thanks. I never owned a refrigerator."},{"type":"paragraph","text":"Michael: Oh, and another fun thing. We - at the end of the night - are going to give the check to an actual group of Boy Scouts, right Toby? We're gonna..."},{"type":"paragraph","text":"Toby: Actually, I didn't think it was appropriate to invite children since it's, uh, you know there's gambling and alcohol, and it's in our dangerous warehouse, and... it's a school night, and, you know, Hooters is catering, you know... is that... is that enough? Should I keep going?"},{"type":"paragraph","text":"Michael: (to Toby) Why are you the way that you are? Honestly, every time I try to do something fun or exciting, you make it not that way. I hate so much about the things that you choose to be."}],"images":[]}]}