{"sections":[{"title":"Christmas Party Quotes","level":1,"content":[{"type":"paragraph","text":"Michael: Presents are the best way to show someone how much you care. It's like this tangible thing that you can point to and say, \"Hey, man, I love you this many dollars worth.\""},{"type":"paragraph","text":"Dwight: First present, Oscar."},{"type":"paragraph","text":"Oscar: Shower radio. Neat."},{"type":"paragraph","text":"Kelly: Oh good. That was from me."},{"type":"paragraph","text":"Oscar: Thanks, Kelly. You know I've been meaning to..."},{"type":"paragraph","text":"Dwight: Okay, okay. Let's keep moving on. Jim."},{"type":"paragraph","text":"Creed: That's from me."},{"type":"paragraph","text":"Jim: Great. Where'd you get it?"},{"type":"paragraph","text":"Creed: I don't know. It was so long ago."},{"type":"paragraph","text":"Jim: He obviously forgot to get me something. So he went into his closet and dug out this little number, and then threw it in a bag."},{"type":"paragraph","text":"Creed: Yep. That's exactly what happened"},{"type":"paragraph","text":"Michael: So Phyllis is basically saying \"Hey Michael, I know you did a lot to help out the office this year, but I only care about you a homemade oven mitt's worth.\" I gave Ryan an iPod."},{"type":"paragraph","text":"Kelly: I will steal the iPod."},{"type":"paragraph","text":"Michael: In addition to these paintball pellots, your gift includes two paintball lessons with Dwight Schrute."},{"type":"paragraph","text":"Dwight: You and me, Michael. Yes."},{"type":"paragraph","text":"Michael: Who wants to take paintball lessons? How is that better than an iPod?"},{"type":"paragraph","text":"Dwight: I never said it was better than an iPod. (Michael pulls off Dwight's elf ears and throws them at his face) (In the talking head) Michael keeps bragging about his iPod. But you know what? Two paintball lessons with someone as expierienced as I am is easily worth like two grand. Take that, Saddam."},{"type":"paragraph","text":"Michael: Last gift, Kevin."},{"type":"paragraph","text":"Kevin: I want the footbath. That's the thing I bought myself. I'm really psyched to use it. Maybe I should've taken the iPod. Oh shoot."},{"type":"paragraph","text":"Dwight: Yankee Swap is like Machevelli meets....Christmas."},{"type":"paragraph","text":"Michael: Uh oh. Looks like Santa was a little naughty."},{"type":"paragraph","text":"Michael: Now you're the expert. Is this enough to get 20 people plastered?"},{"type":"paragraph","text":"Liquor Store Clerk: 15 bottles of vodka? Yea, that should do it."}],"images":[]}]}