{"sections":[{"title":"Diversity Day Quotes","level":1,"content":[{"type":"paragraph","text":"Dwight: Dit for tit"},{"type":"paragraph","text":"Mr. Brown: Now, this is a simple acronym. HERO. Uh, at Diversity Today, we believe it is very easy to be a HERO. All you need are honesty, empathy, respect, and open-mindedness.\nDwight: Excuse me, I'm sorry, but that's not all it takes to be a hero.\nMr. Brown: Oh, great. Well, what is a hero to you?\nDwight: A hero kills people, people that wish him harm.\nMr. Brown: OK.\nDwight: A hero is part-human and part-supernatural. A hero is born out of a childhood trauma, or out of a disaster, that must be avenged.\nMr. Brown: Ok, you're thinking of a superhero.\nDwight: We all have a hero in our heart."},{"type":"paragraph","text":"Michael: Kevin is a great guy. He's a great accountant. He is not much of an entertainer."},{"type":"paragraph","text":"Kevin: Basically, there are two types of black people and black people are actually more racist because they hate the other type of black people. Every time the one type wants to have a good time, then the other type comes in and makes a real mess."},{"type":"paragraph","text":"Michael: OK. I'm sorry. I'm sorry. He's ruin... He's butchering it. Could you just let me... [As Chris Rock] Every time... Every time black people want to have a good time, some ignant ass... [Bleep] I take care of my kid!"},{"type":"paragraph","text":"Mr. Brown: Wait a second."},{"type":"paragraph","text":"Michael: [Bleep] They always want credit for something they supposed to do!"},{"type":"paragraph","text":"Mr. Brown: Stop it!"},{"type":"paragraph","text":"Michael: [As Chris Rock] What you want a cookie?"},{"type":"paragraph","text":"Michael: I'm Michael Scott, founder of Diversity Tomorrow because today is almost over."},{"type":"paragraph","text":"Michael: [to Oscar] Is there a term besides Mexican that you prefer or is it too offensive?"},{"type":"paragraph","text":"Michael: [Talking head] Abraham Lincoln once said that \"If you're a racist, I will attack you with the North.\" And those are the principles that I carry with me in the workplace."},{"type":"paragraph","text":"Michael: You'll notice I didn't have anybody be an Arab. I thought that would be too explosive. No pun intended. But I just though. \"Too soon for Arabs.\" Maybe next year. Um... You know, the ball's in their court."},{"type":"paragraph","text":"Michael: All right? Everybody pretty? Come on. Here we go. It's time. Let's do some good."},{"type":"paragraph","text":"Toby: Hey, we're not all going to sit in a circle Indian style are we? [Laughing]"},{"type":"paragraph","text":"Michael: Get out."},{"type":"paragraph","text":"Toby: I'm sorry."},{"type":"paragraph","text":"Michael: No, this is not a joke. OK? That was offensive and lame. So double offensive. This is an environment of welcoming and you should just get the hell out of here. OK, let's go. Let's do it. Come on. Let's have some fun, everybody. Here we go. Take a seat. Cop a squat. And um... thanks for coming in. Um... Diversity... is the cornerstone of progress as I've always said. But don't take my word for it. Let's take a look at the tape."},{"type":"paragraph","text":"Michael: I want you all to take a card, put it on your forehead... [Pam picks up a card] Don't look at it! I want you to take the card and I want you to put it on your forehead, and take a card, any card... [Angela and Pam place their cards on their foreheads, with the cards saying \"Jamaican\" and \"Jewish\" respectively] and I want you to treat other people like the race [Kevin places his card on his head; it says \"Italian\"] that is on their forehead. OK, so everyone has a different race, and nobody knows what their race is. [The camera pans over to Stanley, whose card says \"Black\".] So, I want you to really go for it, cause this is real, this isn't just an exercise, this is real life [Places a card saying \"Martin Luther King Jr.\" on his forehead] and I have a dream that you will really let the sparks fly... Git-r-done!"},{"type":"paragraph","text":"Michael: [Goes over to Pam and Stanley] Oh! This is a good one!"},{"type":"paragraph","text":"Pam: [To Stanley, who has been assigned \"Black\" as his race] Hi, how are you?"},{"type":"paragraph","text":"Stanley:  I'm fine, how are you?"},{"type":"paragraph","text":"Pam: Great... Umm... "},{"type":"paragraph","text":"Stanley: I admire your cultural success in America."},{"type":"paragraph","text":"Pam: Thank you."},{"type":"paragraph","text":"Michael: Bomb! Bomb! Bomb! Bomb! Come on, Olympics of suffering right here - Slavery vs. The Holocaust, come on!"},{"type":"paragraph","text":"Stanley: [Removes his card] I know I'm not supposed to look, but who am I supposed to be? [Finds out his card says \"Black\"]."},{"type":"paragraph","text":"Michael: That was inadvertent, we didn't actually plan that."},{"type":"paragraph","text":"Dwight: [Having been assigned \"Asian\" as his race] Lots of cultures eat rice. That doesn't help me. [Goes over to Pam, who has been assigned with \"Jewish\"] Shalom! I would like to apply for a loan."},{"type":"paragraph","text":"Pam: That's nice, Dwight."},{"type":"paragraph","text":"Dwight: OK, do me. Something stereotypical so I can get it really quick."},{"type":"paragraph","text":"Pam: OK, I like your food."},{"type":"paragraph","text":"Dwight: Outback Steakhouse! [Australian accent] I'm Australian, mate!"},{"type":"paragraph","text":"Michael: Pam, come on. \"I like your food?\" Come on, stir the pot, stir the melting pot, Pam! Let's do it, let's get ugly, let's get real!"},{"type":"paragraph","text":"Pam: OK, if I have to do this, based on stereotypes that are totally untrue, that I do not agree with, you would maybe not be a very good driver."},{"type":"paragraph","text":"Dwight: Oh man! Am I a woman?!"},{"type":"paragraph","text":"Kevin: [To Angela, who has been assigned with \"Jamaican\"; He himself has been assigned with \"Italian\"] Hey."},{"type":"paragraph","text":"Angela: Hey."},{"type":"paragraph","text":"Kevin: You wanna go to the beach?"},{"type":"paragraph","text":"Angela: Sure."},{"type":"paragraph","text":"Kevin: You wanna get high?"},{"type":"paragraph","text":"Angela: No."},{"type":"paragraph","text":"Kevin: I think you do, mon."},{"type":"paragraph","text":"Angela: Stop..."},{"type":"paragraph","text":"Michael: [Voice raised, Indian accent] Kelly, how are you?"},{"type":"paragraph","text":"Kelly: I just had the longest meeting."},{"type":"paragraph","text":"Michael: Oh! Welcome to my convenience store. Would you like some googi googi? I have some very delicious googi, googi, only 99 cents plus tax. Try my googi, googi. [Lowering voice] Try my googi, googi. [High-pitched voice] Try my googi, googi. Try my... [slap!]"},{"type":"paragraph","text":"Michael: [Trying not to cry] All right! All right! Yes! That was great, she gets it! Now she knows what it's like to be a minority."},{"type":"paragraph","text":"Michael: Man, I hated it when that guy was in here. Mr. Brown, if that was his real name. I mean he has never met any of us before, and here he was, telling us how to do our thing. I just wanted... I just wanted to do it our way. You know? On our own. Man, I should've gotten some food."},{"type":"paragraph","text":"Kevin: [Italian accent] Maybe some spagh-etti!"},{"type":"paragraph","text":"Michael: OK, Kevin, you can take that thing off."}],"images":[]},{"title":"Deleted Scenes","level":2,"content":[{"type":"paragraph","text":"Mr. Brown: Thanks for filling these out. I promise this will be quick, we only have an hour."},{"type":"paragraph","text":"Michael: Yes, I would like to see us erase 100 years of racism in an hour."},{"type":"paragraph","text":"Mr. Brown: Does this company have 100 years of racism?"},{"type":"paragraph","text":"Michael: [Laughs] No, the country."},{"type":"paragraph","text":"Mr. Brown: All right, more like 200 years."},{"type":"paragraph","text":"Michael: More like 1000."},{"type":"paragraph","text":"Michael: I just think that \"HERO\", it's cute, but it's empty. You know, it's easy. Dwight, you know what, I came up with some terms of my own. Could you put these on the board?"},{"type":"paragraph","text":"[Dwight goes over to the board and writes down each of the terms Michael mentions]"},{"type":"paragraph","text":"Michael: First one is \"Inclusion\", \"New Attitudes\", Colorblind\", \"Expectations\", \"Sharing\", and \"Tolerance.\""},{"type":"paragraph","text":"Mr. Brown: Beautiful"},{"type":"paragraph","text":"Pam: Um, that spells \"Incest\"."},{"type":"paragraph","text":"Mr. Brown: I'm sorry, that is not appropriate."},{"type":"paragraph","text":"Michael: It's not ideal, but you have to give me some credit cause I made it into a word"},{"type":"paragraph","text":"Mr. Brown: Yeah, but it's not appropriate. This is not helpful as a memory aid."},{"type":"paragraph","text":"Michael: I will give you a number of reasons why it is, actually, OK, first: Incest is bad, racism is bad, no brainer, right? Two: Incest, we're all a family, right? We're all brothers and sisters, racial message? Hmm? Number three, and this is a fact: States, where they have a lot of racism, are states were they have a lot of incest, OK, and finally [Mr. Brown tries to stop him]"},{"type":"paragraph","text":"Michael: No, no, no, no, wait, final one, final one: The more we can encourage interracial dating as a society, the further away we get from incest. Literally."},{"type":"paragraph","text":"Pam: [Talking head] It could have been just as easy for him to write \"Insect\", of course, that wouldn't have made any sense either."},{"type":"paragraph","text":"Mr. Brown: Does anyone have anything else at all? Anyone besides Michael?"},{"type":"paragraph","text":"Ryan: I have something."},{"type":"paragraph","text":"Mr. Brown: Yes, please."},{"type":"paragraph","text":"Ryan: Um, well I grew up here in Scranton and when I was a kid the guy who lived next door was a former baseball player, who actually played pro ball before the leagues were integrated. And he had the most incredible stories about..."},{"type":"paragraph","text":"Michael: Okay. I'm sorry, I'm sorry this guy's a temp and I should've told you that."},{"type":"paragraph","text":"Mr. Brown: No, no, no, no. An outsider's perspective would probably be pretty helpful."},{"type":"paragraph","text":"Michael: Yeah, but no, seriously. Uh, you know, he's not a member of the full staff so, uh, Ryan you wanna just step outside?"},{"type":"paragraph","text":"Ryan: What do you want me to do?"},{"type":"paragraph","text":"Michael: Well, maybe you should go down to the parking lot. You know what. Yes, go down to the parking lot and check to see if any of our guests have parked in the handicapped spots. Cool? 'Cause the handicaps get a raw deal. Oh, you know what. That ties right into \"New Attitudes\". New attitudes about handicap people. Very important."},{"type":"paragraph","text":"Mr. Brown: I'm sorry, Michael. We're actually out of time."},{"type":"paragraph","text":"Ryan: The guy did some not so good things..."},{"type":"paragraph","text":"Jim: Um, what's going on here?"},{"type":"paragraph","text":"Pam: People treat us like the race on our forehead. And then we guess what race we are."},{"type":"paragraph","text":"Jim: Ah, good. Good luck. Doing good. [goes to the index cards and writes another race down]"},{"type":"paragraph","text":"Dwight: Oh, man, am I a woman?"},{"type":"paragraph","text":"Jim: Yes, yes."},{"type":"paragraph","text":"Dwight: God!"},{"type":"paragraph","text":"Jim: How embarrassing is it? That's not fair. Here..."},{"type":"paragraph","text":"Dwight: It's not fair."},{"type":"paragraph","text":"Jim: Try this. [takes Dwight's 'Asian' race and switches it with the one he wrote]"},{"type":"paragraph","text":"Dwight: Thank you. Thank you very much."},{"type":"paragraph","text":"Jim: Go get 'em."},{"type":"paragraph","text":"Dwight: Good. [clears throat] So, am I a hunter-gather culture?"},{"type":"paragraph","text":"Pam: No."},{"type":"paragraph","text":"Dwight: Do I live near a harbor or an ocean?"},{"type":"paragraph","text":"Pam: No."},{"type":"paragraph","text":"Dwight: No, I'm an inland. Am I a mountainous?"},{"type":"paragraph","text":"Pam: No."},{"type":"paragraph","text":"Dwight: Am I nomadic?"},{"type":"paragraph","text":"Pam: No."},{"type":"paragraph","text":"Dwight: Okay, okay, okay, okay. I think I got this. Um, I am treated in a foreign way with a great deal of prejudice. Am I one of those tribes in Africa? The piggies, or whatever?"},{"type":"paragraph","text":"Pam: No."},{"type":"paragraph","text":"Dwight: No. But I am, I am human, right? [Pam hesitates]"},{"type":"paragraph","text":"Dwight: [In a talking head, with his new race saying 'Dwight'] I could be French."},{"type":"paragraph","text":"Dwight: [takes his 'Dwight' race card off of his forehead] Damn it, Jim! That's not funny, Jim!"},{"type":"paragraph","text":"Michael: Oh, okay. Here we go, breakthrough radar. What happened? What happened here?"},{"type":"paragraph","text":"Pam: It didn't have anything to do with race."},{"type":"paragraph","text":"Michael: Okay, all right. Let's keep on track. Keep on point. Let's do it."}],"images":[]}]}