{"sections":[{"title":"Health Care Quotes","level":1,"content":[{"type":"paragraph","text":"Michael: Well, that is, kind of a tough assignment, it's not gonna be a popular decision around the old orifice."},{"type":"paragraph","text":"Dwight: What did I do? I did my job. I slashed benefits to the bone, I saved this company money. Was I too harsh? Maybe. I don't believe in coddling people, in the wild, there is no health care. In the wild health care is Ow, I hurt my leg, I can't run, a lion eats me and I'm dead. Wow. I'm not dead. [looks into camera] I'm the lion, you're dead"},{"type":"paragraph","text":"Dwight: I'm now going to read out loud your submitted medical conditions. When you hear yours read, please raise your hand to indicate that it is real. If you do not raise your hand, it will not be covered."},{"type":"paragraph","text":"Stanley: What about confidentiality?"},{"type":"paragraph","text":"Dwight: You know what? You have forfeited that privilege. I have tried to treat you all as adults, but obviously, I am the only adult here. Number one, inverted penis."},{"type":"paragraph","text":"Meredith: Could you mean vagina? Because if you do, I want that covered."},{"type":"paragraph","text":"Dwight: I thought your vagina was removed during your hysterectomy?"},{"type":"paragraph","text":"Meredith: A uterus is different from a vagina. I still have a vagina."},{"type":"paragraph","text":"Dwight: Okay, great. Dermatitis. Thank you, Angela. I'll make sure that's covered. Who wrote this hysterical one? Anal fissures?"},{"type":"paragraph","text":"Kevin: That's a real thing."},{"type":"paragraph","text":"Dwight: Yeah, but no one here has it."},{"type":"paragraph","text":"Kevin: Someone has it."},{"type":"paragraph","text":"Dwight: Through concentration, I can raise and lower my cholesterol at will."},{"type":"paragraph","text":"Pam: Why would you want to raise your cholesterol?"},{"type":"paragraph","text":"Dwight: So I can lower it."},{"type":"paragraph","text":"Jim: Wait, what are you writing? Don't write ebola or mad cow disease, all right? Because I'm suffering from both of them."},{"type":"paragraph","text":"Pam: I'm inventing new diseases."},{"type":"paragraph","text":"Jim: Oh, great."},{"type":"paragraph","text":"Pam: So, like, let's say that my teeth turn to liquid and then they drip down the back of my throat? What would you call that?"},{"type":"paragraph","text":"Jim: I thought you said you were inventing new diseases? That's spontaneous dental hydroplosion."},{"type":"paragraph","text":"Pam: Nice."},{"type":"paragraph","text":"Dwight: The problem, Jim, is that people who are really suffering from a medical condition won't receive the care they need because someone in this office is coming up with ridiculous stuff. \"Count Choculitis\""},{"type":"paragraph","text":"Jim: Sounds tough."},{"type":"paragraph","text":"Dwight: Why did you write that down Jim? Is it because you know I love Count Chocula?"},{"type":"paragraph","text":"Dwight: OK. First, let's go over some parameters. How many people can I fire?"},{"type":"paragraph","text":"Michael: Uh, none. You're picking a healthcare plan."},{"type":"paragraph","text":"Dwight: Please knock. This is an office."},{"type":"paragraph","text":"Jim: [Pointing to sign] It says \"workspace.\""},{"type":"paragraph","text":"Dwight: Same thing."},{"type":"paragraph","text":"Jim: If it's the same thing, then why'd you write \"workspace.\""},{"type":"paragraph","text":"Dwight: All right, who did this? I'm not mad, I just want to know who did it so I can punish them."},{"type":"paragraph","text":"Jim: What are you talking about?"},{"type":"paragraph","text":"Dwight: Uh, someone, uh, forged medical information, and that is a felony."},{"type":"paragraph","text":"Jim: Okay, whoa, all right, 'cause that's a pretty intense accusation. How do you know that they're fake?"},{"type":"paragraph","text":"Dwight: Uh, leprosy? Flesh-eating bacteria? Hot dog fingers. Government created killer nano robot infection."},{"type":"paragraph","text":"[to Jim]"},{"type":"paragraph","text":"Dwight: You did this, didn't you?"},{"type":"paragraph","text":"Jim: Absolutely not."},{"type":"paragraph","text":"Dwight: Yes you did."},{"type":"paragraph","text":"Jim: No I didn't."},{"type":"paragraph","text":"Dwight: I know it was you. OK, fine, you know what? I'm going to have to interview each and every one of you until the perpetrator makes him or herself known. And until that time, there will be no health care coverage for anyone."},{"type":"paragraph","text":"[Dwight slams the door to his workspace]"},{"type":"paragraph","text":"Jim: [to Pam] Killer nanorobots?"},{"type":"paragraph","text":"Pam: It's an epidemic."},{"type":"paragraph","text":"Jan: [On phone] Dwight, listen to me very carefully: You are not a manager of anything. Understand?"},{"type":"paragraph","text":"Dwight: That's not entirely true, because he put me in charge of picking a health care plan."},{"type":"paragraph","text":"Jan: Really? OK. When Michael gets back, you tell him to call me immediately."},{"type":"paragraph","text":"Dwight: Call you immediately, good. Hey, listen, since I have you on the phone, um, can I fire Jim?"},{"type":"paragraph","text":"Jan: No."},{"type":"paragraph","text":"[Michael doesn't want to come out of his office]"},{"type":"paragraph","text":"Kevin: He has to some time... To go to the bathroom!"},{"type":"paragraph","text":"Angela: Kevin, that's inappropriate."}],"images":[]},{"title":"Deleted Scenes","level":2,"content":[{"type":"paragraph","text":"Pam: We still have Dwight's trash can, and we found some early attempts at his sign."},{"type":"paragraph","text":"Jim: OK, this is very simple: [Holds up sign] \"Dwight's Workspace.\" Nice. Umm... This one's interesting, the power comes from the font in this one: \"Schrute Space.\" [Holds up a sign containing italics-style font.] Very medieval, very... England. This one's forceful, this one's very Dwight: \"QUIET! Dwight Schrute Working.\" [Holds up said sign]. That's good, I really heard him on that. This one's interesting, I'm not sure what he really meant by this, umm: [Holds up sign]. \"Dwight Schrute Privates.\" Tough to say."},{"type":"paragraph","text":"Pam: Yeah."},{"type":"paragraph","text":"Jim: OK, you know what, Dwight, what if you got a really serious disease, like Ebola?"},{"type":"paragraph","text":"Dwight: No."},{"type":"paragraph","text":"Jim: Well it could happen, ever seen the movie Outbreak?"},{"type":"paragraph","text":"Dwight: Yeah, well, have you ever seen the movie Unbreakable, because that guy couldn't get sick, just like me."},{"type":"paragraph","text":"Jim: Have you ever seen the movie The Sixth Sense? Maybe, you're already dead."},{"type":"paragraph","text":"Dwight: [Thinks] Unlikely."},{"type":"paragraph","text":"Pam: [Hands form to Dwight] You promise these are confidential?"},{"type":"paragraph","text":"Dwight: 100 percent. [Marks her form]"},{"type":"paragraph","text":"Pam: Did you just mark on that?"},{"type":"paragraph","text":"Dwight: I don't think so. No."},{"type":"paragraph","text":"Pam: You made a \"P\"."},{"type":"paragraph","text":"Dwight: Wrong."},{"type":"paragraph","text":"[Leaves her and starts collecting forms from other employees]"},{"type":"paragraph","text":"Dwight: Thank you, Jim, Kevin."},{"type":"paragraph","text":"'Stanley': Here you go."},{"type":"paragraph","text":"Dwight: Stanley. [Whispering] Pam, Jim, Kevin, Stanley. Pam, Jim, Kevin, Stanley. [To Oscar] You finished?"},{"type":"paragraph","text":"Oscar: Oh, here's the rest of them. [Hands Dwight a pile of forms]"},{"type":"paragraph","text":"Dwight: That was... Unauthorized."},{"type":"paragraph","text":"Jim: Dwight, I have something to confess."},{"type":"paragraph","text":"Dwight: You're doing the right thing. Go ahead. What's your confession? [Jim hesitates] Let it out."},{"type":"paragraph","text":"Jim: You're a jackass."},{"type":"paragraph","text":"Dwight: OK! You wanna do this the hard way? We'll do this the hard way. You wrote down those fake diseases, didn't you?"},{"type":"paragraph","text":"Jim: No. Was that the hard way?"},{"type":"paragraph","text":"Dwight: I know you did!"},{"type":"paragraph","text":"Jim: Then why are you wasting everyone else's time interrogating them?"},{"type":"paragraph","text":"Dwight: Because I wanna know who wrote those diseases down!"},{"type":"paragraph","text":"[Hands Jim a piece of paper and a pen]"},{"type":"paragraph","text":"Dwight: I want you to take this piece of paper and this pen and write this down. Write this down, OK: \"I, Jim Halpert confess to health care fraud.\""},{"type":"paragraph","text":"Jim: One second, cause that sounds really good. Is \"jackass\" one word or two? [Dwight sighs] One, right? Cause of the show, it's one."}],"images":[]}]}