{"sections":[{"title":"Hot Girl Quotes","level":1,"content":[{"type":"paragraph","text":"Dwight: The purse girl hits everything on my checklist. Creamy skin. Straight teeth. Curly hair. Amazing breasts. Not for me, for my children. The Schrutes produce very thirsty babies."},{"type":"paragraph","text":"Michael: Well, first what we have to do is find out what motivates people more than anything else.\nDwight: Sex.\nMichael: It's illegal. Can't do that. Next best thing.\nDwight: Torture."},{"type":"paragraph","text":"Michael: All right, girls! Break it up. You're being infiltrated. Cock in the henhouse!\nDwight: Cocks in the henhouse!\nMichael: Don't say cocks."},{"type":"paragraph","text":"Michael: I do read Small Businessman. I also subscribe to USA Today and American Way magazine, that's the in-flight magazine, some great articles in that. They did this great... profile last month of Doris Roberts and where she likes to eat when she's Phoenix. Illuminating."},{"type":"paragraph","text":"Jan: We've created an incentive program to increase sales. At the end of the month, you can reward your top seller with a prize worth up to $1,000.\nMichael: Whoa. Howdy ho. Wow, a thousand big ones. That's cool. Do, I, uh, do I get to pick the prize?\nJan: Uh, yes. Yes, you can.\nMichael: Um, question: does top salesman include people who were at one time such outstanding salesman that they've been promoted to...\nJan: No, Michael, no. You, you can't win this prize.\nMichael: I didn't mean me!"},{"type":"paragraph","text":"Pam: Uh, Michael...\nMichael: Pam!\nPam: Hey, there's....\nMichael: Burger with cheese!\nPam: There's a person...\nMichael: And fries!\nPam: There's...\nMichael: And shake! What? Go ahead.\nPam: There's a person here who wants to sell handbags."},{"type":"paragraph","text":"Michael: [to Katy] No, here's the thing, you know? I do my best to be my own man and go by the beat of a different drummer and nobody gets me and they're always putting up walls and I'm always tearing 'em down, just breaking down barriers, that's what I do all day. So... a coffee?"},{"type":"paragraph","text":"Ryan: Wow. How many filet-o-fishes did you eat?"}],"images":[]}]}