{"sections":[{"title":"Lecture Circuit Part 2 Quotes","level":1,"content":[{"type":"paragraph","text":"Angela: I am proud to announce that there is a new addition to the Martin family. She's hypoallergenic. She doesn't struggle when you try to dress her. She's a third-generation show cat. Her father was in 'Meet the Parents.' Needless to say, she was very, very expensive."},{"type":"paragraph","text":"Dwight: (from another room) What did you do?!\nKelly: Stop yelling at me!\nDwight: What did you do?!\nKelly: I didn't do anything!\nDwight:  What did you learn in there? I bet you learned something there, like how to fashion a sieve. Hmm?\nJim: Hey, what the hell's going on?\nDwight:  Why don't you tell Jim where you were from ages 14 to 15..\nKelly: I was kicking it.\nDwight: In juvie.\nJim: What?\nDwight: Juvie... nile detention center? where they send teenagers.\nJim: Yep.\nDwight: For reha-\nJim: Got it.\nDwight: What did you do? Huh?\nJim: Hey, Dwight, sounds like she was 14, so maybe we wanna go a little easy.\nDwight: Yeah, if she's old enough to get married, she's old enough to follow the law. [to Kelly] What did you do?\nKelly:My boyfriend dumped me, so, I stole his boat. I mean, he told me it was his boat. It was actually his father's. And I just thought it'd be really romantic, like \"Thelma and Louise\", but with, like, a boat. And it was the worst year of my life. And I can't believe that you guys are making me talk about this on my birthday!\nDwight: I thought you said yesterday was your birthday!\nJim: Hey, you know what? I got you a cake.\nKelly: Really? I want to see the cake.\n(we now cut to the kitchen area. Inside are Jim, Dwight, Kelly, and Phyllis. Jim shows a plain cake without flowers and her name.)\nJim: And, ta-da."},{"type":"paragraph","text":"Kelly: I hate it.\nJim:How do you hate it? It's a cake.\nKelly:Well, there's no flowers... or toys... or--- I mean, there's nothing on it. Where did you even find a cake like this? I mean, it doesn't have my name on it! Do you guys know what my name is? My name is Kelly!\nJim: Right. (in confessional) I forgot if there was an \"e\" between the \"l\" and the \"y.\" I still don't know."},{"type":"paragraph","text":"Kelly: I mean, I don't even know what the theme is. What's the theme?!\nDwight: Frosting.\nJim: Birthday.\nKelly: Those aren't... themes. There's always a theme. [walks out].\nPhyllis: There's always a theme.\nDwight: Nice job on the cake, Bozo!\nJim: OK. You know what? Next time, I'll let you get the cake, and I get to scream at the birthday girl."}],"images":[]}]}