{"sections":[{"title":"Money Quotes","level":1,"content":[{"type":"paragraph","text":"Dwight: My girlfriend and I broke up recently. And I must say, I am relieved. Gives me a chance to sow my wild oats. In the Schrute family, we have a tradition, where when the male has sex with another woman, he is rewarded with a bag of wild oats left on his door step by his parents. You can use these oats to make oatmeal, bread, whatever you want. I don't care, they're your oats."},{"type":"paragraph","text":"Jim: You know, I just realized, this is Pam's and my first night away together. I used to play it over in my head, and...it was just a little bit different. Maybe a nice hotel, or, a romantic dinner, wine...um, but wine that wasn't made out of beets...didn't think Dwight would be involved at all, and, uh, I always imagined less manure - I mean, some manure, just...less."},{"type":"paragraph","text":"Michael: Is Mr. Hudson there?"},{"type":"paragraph","text":"\"Mr. Hudson\": Yeah, who is this?"},{"type":"paragraph","text":"Michael: I'm just calling because you responded positively to..."},{"type":"paragraph","text":"\"Mr. Hudson\": Michael?!"},{"type":"paragraph","text":"Michael: Stanley?"},{"type":"paragraph","text":"Stanley: Why are you calling me here at home?!"},{"type":"paragraph","text":"Michael: (in a faux-Hispanic accent) Senor, are you happy with your long-distance..."},{"type":"paragraph","text":"Stanley: Michael, I know that's you - why are you calling me here at home?"},{"type":"paragraph","text":"Michael: (in a faux-Indian accent) Have you cons...have you considered satellite television..."},{"type":"paragraph","text":"Stanley: Michael, I know that's you - I know your voice. Why are you calling me here at home?!?!"},{"type":"paragraph","text":"Stanley: When I'm at home at night in my own house, in my sweats, drinkin' some red wine, watchin' my mystery stories, the last thing in the whole godforsaken world I wanna hear is the voice of Michael Scott!"},{"type":"paragraph","text":"Pam: Now that I think about it, Angela and Andy might actually make a good couple. But I couldn't do that to Dwight...or Angela......or Andy."},{"type":"paragraph","text":"Jim: Did I ever tell you why I left Scranton?...Yeah, I didn't think I had...Well, it was all about Pam...I mean, she was with Roy, and, uh, I just couldn't take it. I mean, I lost it, Dwight - I couldn't sleep, I couldn't concentrate on anything...even weird stuff, like, food had no taste. So my solution was to move away. It was awful...and it is something that I wouldn't wish on my worst enemy - and that includes you."},{"type":"paragraph","text":"Michael: I...declare......BANKRUPTCY!"}],"images":[]}]}