{
  "sections": [
    {
      "title": "Pilot Quotes",
      "level": 1,
      "content": [
        {
          "type": "paragraph",
          "text": " Michael: This is our receptionist Pam, and if you think she's cute now, you should've seen her a couple of years ago!"
        },
        {
          "type": "paragraph",
          "text": "Michael: Did we get a fax this morning?\nPam: Uh, yeah, the one...\nMichael: Why isn't it in my hand? A company runs on efficiency of communication, right? So what's the problem, Pam? Why didn't I get it?\nPam: You put it in the garbage can that was a special filing cabinet."
        },
        {
          "type": "paragraph",
          "text": "Michael: [Talking head] What is the most important thing for a company? Is it the cash flow? Is it the inventory? Nuh-uh. It's the people. The people. My proudest moment here was not when I increased profits by 17% or when I cut expenses without losing a single employee. No, no, no, no, no. It was a young Guatemalan guy. First job in the country, barely spoke English. He came to me, and said, \"Mr. Scott, would you be the godfather of my child?\" Wow. Wow. Didn't work out in the end. We had to let him go. He sucked."
        },
        {
          "type": "paragraph",
          "text": "Michael: Pam, as you know, there is going to be downsizing. And you have made my life so much easier that I am going to have to let you go first.\nPam: What? Why?\nMichael: Why? Well, theft and stealing.\nPam: Stealing? What am I supposed to have stolen?\nMichael: Post-it Notes.\nPam: Post-it Notes? What are those worth, fifty cents?\nMichael: Fifty cents, yeah. If you steal a thousand Post-it Notes at fifty cents apiece, and you know, you've made a profit... margin. You're gonna run us out of business, Pam."
        },
        {
          "type": "paragraph",
          "text": "Michael: And yeah, Jim this is the time to stop putting Dwight's personal effects into Jell-O."
        },
        {
          "type": "paragraph",
          "text": "Jim: Okay. Dwight, I'm sorry, because I have always been your biggest flan."
        },
        {
          "type": "paragraph",
          "text": "Michael: [Talking head] People I respect, heroes of mine would be Bob Hope, um, Abraham Lincoln, definitely. Bono, uh and probably God would be the fourth one and I just think all those people really, uh, helped the world in so many ways that it's, um, it's really beyond words. It's really incalculable."
        },
        {
          "type": "paragraph",
          "text": "Angela: [Talking about downsizing] I think it's gonna be me. It'll probably be me.\nKevin: Yeah, it'll be you."
        },
        {
          "type": "paragraph",
          "text": "Dwight: [Talking head] Downsizing? I have no problem with that. I have been recommending downsizing since I first got here. I even brought it up in my interview. I say, bring it on."
        }
      ],
      "images": []
    }
  ]
}
