{"sections":[{"title":"Safety Training Quotes","level":1,"content":[{"type":"paragraph","text":"Dwight: Yes, I have decided to shun Andy Bernard for the next three years. Which I'm looking forward to. It's an Amish technique. It's like slapping someone with silence. I was shunned from the age of four until my sixth birthday... for not saving the excess oil from a can of tuna."},{"type":"paragraph","text":"Darryl: We do safety training every year...or after an accident...We've never made it a full year - this particular time, I was reaching for a supply box on the top shelf, when one office worker - who, jdjdshall...remain nameless - kicked the ladder out from under me and yelled...\nMichael: \"Hey, Darrell, how's it hangin'?\"\nDarryl: ...And I fell and busted my ankle...I'm legitimately scared for my workers."},{"type":"paragraph","text":"Pam: Jim wins!\nKevin: That is not fair - he has spent hours up here at reception, with you - hours and hours!"},{"type":"paragraph","text":"Karen: I don't know this place as well as I thought I did - I'm getting cleaned out!"},{"type":"paragraph","text":"Michael: My life!\nDwight: Michael - what's wrong?\nMichael: Everything - the stress...of my modern office...has caused me to go into a depression!\nDwight: \"Depression\"? Isn't that just a fancy word for feeling bummed out?\nMichael: Dwight, you ignorant slut!"},{"type":"paragraph","text":"Michael: My life!\nDwight: Michael - what's wrong?\nMichael: Everything is wrong, Dwight - the stress of my modern office...has made me depressed!\nDwight: \"Depressed\"? Isn't that just a fancy word for feeling bummed out?\nMichael: Dwight, you ignorant slut!\nJim: Well, you know - the first performance was a little off...but I really think they hit their stride in the second show...might even bring my parents tomorrow, to the...matinee."},{"type":"paragraph","text":"Pam: Oh, God...oh my God, he's gonna jump!\nJim: Oh...he's going to kill himself pretending to kill himself!"}],"images":[]}]}