{"sections":[{"title":"Stress Relief Quotes","level":1,"content":[{"type":"paragraph","text":"Dwight: Today, smoking is going to save lives."},{"type":"paragraph","text":"Michael: Nobody should have to go to work thinking, \"Oh, this is the place that I might die today.\" That's what a hospital is for. An office is for not dying. An office is a place to live life to the fullest, to the max, to... An office is a place where dreams come true."},{"type":"paragraph","text":"Stanley: It's true - around this office in the past, I have been a little, abrupt with people, (clips from various episodes back him up)...but the doctor said, if I can't find a new way to relate more positively to my surroundings, I'm going to die."},{"type":"paragraph","text":"Andy: A throne for Your Highness!\nStanley: I'm not sittin' in a wheelchair.\nMichael: No debate - you are going to sit in that wheelchair until you are back on your feet...\nStanley: I'm going to die."},{"type":"paragraph","text":"Pam: We don't normally download films illegally...because, we're honest, hard-working people...\nJim: ...And we don't know how.\nPam: But, Andy does, so we have to watch it with him.\nJim: Punishment fits the crime."},{"type":"paragraph","text":"Kevin: Michael, I think you're what's stressing everybody out!"},{"type":"paragraph","text":"Pam: What could Jim have said to make my dad wanna leave my mom? And at what point in our marriage is he gonna say it to me?!"},{"type":"paragraph","text":"Oscar: I consider myself a good person......But I'm gonna try to make him cry."},{"type":"paragraph","text":"Meredith: Michael, you are the reason I drink...you are the reason I live to forget."},{"type":"paragraph","text":"Dwight: It's very unusual for Michael not to show up to work. My guess? He's either deeply depressed, or an icicle has snapped off his roof and impaled his brain...He has this terrible habit of standing directly underneath them, and staring up at them - and I always say, \"Michael, take two steps back, and stare at them from the side!\", and he's like, \"No, I like the way they look standing directly underneath them!\"...It was only a matter of time."},{"type":"paragraph","text":"Jim: So what'd he say...was it my fault?\nPam: Yeah...He said that you...told him how much you love me...about how you feel when I walk in a room, and...about how you've never for a second that I'm the woman you want to spend the rest of your life with...I guess he's never felt that with my mom, even at their best."},{"type":"paragraph","text":"Pam: When you're a kid, you assume your parents are soulmates - my kids are gonna be right about that...I guess it also means that, sometimes, love affairs look different to the people inside them."},{"type":"paragraph","text":"Andy: (singing during Michael's roast) What I hate about you, you really suck as a boss, you're the laziest, jerkiest and you're dumber than applesauce. We're stuck listening to you all day, Stanley tried to die just to get away, heeey, well it's true. That's what I hate about you. That's what I hate about you."},{"type":"paragraph","text":"Dwight: Last week I gave a fire safety talk. [clears throat] And nobody paid any attention. It's my own fault for using PowerPoint. PowerPoint is boring. People learn in a lot of different ways, but experience is the best teacher. [lights a cigarette] Today, smoking is gonna save lives. [throws cigarette into garbage can filled with paper and lighter fluid]\nDwight: [looking around office to see if anyone notices the smoke] Does anyone smell anything smoky?\nAngela: Did you bring your jerky in again?\nPam: [points to smoke] Oh, my God! Uh, Oh my God!\nPhyllis: What--\nAndy: Whoa, fire!\nDwight: Oh, fire! Oh my goodness! What's the procedure? What do we do, people?\nPam: The phones are dead.\nDwight: Oh, how did that happen?\nKevin: It's out in the hall.\nDwight: No, we don't know that. The smoke could be coming through an air duct.\nMichael: Oh my God! Okay, it happening. Everybody stay calm.\nDwight: What's the procedure, everyone? What's the procedure?\nMichael: Stay [bleep] calm!\nDwight: Wait, wait, wait.\nMichael: Everyone, now [bleep] calm down!\nDwight: No! No, Michael! No! Touch the handle. If it's hot, there could be a fire in the hallway.\nMichael: What does warm mean?\nEveryone: [groaning] Oh my God.\nDwight: Not a viable option.\nPam: Try a different door.\nDwight: Okay, what's next?\nMichael: Don't run.\nDwight: Oh! Here's a door. Check that one out. How's the handle?\nAndy: It-- it's warm.\nDwight: Well, uh, another option. [everyone chattering at once]\nJim: Back door.\nDwight: Back to our options. Jeez! Ok! settle down everyone. No bunching!\nPhyllis: Oh! I forgot my purse.\nStanley: Leave it woman!\nMichael: Get out of the way! Go, go, go!\nDwight: Things can be replaced, Phyllis! People, human lives, however, can...\nOscar: Ah! My hand! That's hot!\nAndy: Aah! This ones hot too!\nMichael: Okay, we're trapped. Everyone for himself.\nDwight: Okay, let's go. Okay, okay.\nEveryone: [shouting] Out of my way! Let's go. Get out of my way!\nDwight: Calm, please.\nAndy: Get out of the way!\nDwight: Have you ever seen a burn victim?\nAndy: Move it!\nDwight: Okay! Procedure, procedure. Exit options. Where do we go folks? Wha-- Use a what to cover the mouth?\nAngela: [pulling cat out of filing drawer] It's okay. Shh shhh.\nDwight: A what? A rag. A damp rag, perhaps. Let's remember those procedures. What are the options? Okay, that's the wrong way. We've already tried that. Remember your exit points. Exit points people.\nAngela: Oscar.\nDwight: What's next? Huh?\nAngela: Oscar!\nOscar: Stay alive! I'm getting help!\nAngela: Pull me up!\nOscar: You're too heavy!\nAngela: I only weigh 82 pounds! Save Bandit! [throws cat into air duct and he falls out through the other side] Oh!\nDwight: How about 911? Anyone? 911. [Michael throws a chair at the window, Kevin smashes a chair through the vending machine and begins to grab snacks, everyone is shouting.]\nPam: What do we do?\nDwight: Use the surge of fear and adrenaline to sharpen your decision-making.\nJim: Okay, I am not dying here. Come on. [everyone is coughing from the smoke, Dwight lights some fire crackers and they start popping]\nAngela: What is that? What is that?\nAndy: The fire's shooting at us!\nPhyllis: What in the name of God is going on?!\nAndy: Yes! [Dwight pulls fire alarm] Yes, ba-- Yes, battering ram! Battering ram!\nPhyllis and Creed: Ahhhh!!! [Oscar's leg crashes through the ceiling]\nAndy: Go, go, go, go, go!! [Andy and Jim ram the door with the copy machine]\nMichael: [throws the projector out the window] Help!! Help!!\nStanley: I'm about to die!\nDwight: [blowing air horn] Attention! Employees of Dunder Mifflin! This has been a test of our emergency preparedness. There was no fire. It was only a simulation.\nJim: What?!\nDwight: Fire not real. This was merely a training exercise. [Oscar drops down from the ceiling] So, what have we learned? [Stanley falls to the floor] Oh come on. It's not real Stanley. Don't have a heart attack.\nMichael: No, no, no! You will not die! Stanley! Stanley! You will not die! Stanley! Stanley! Barack is president! You are black, Stanley! I'm gonna give him mouth to mouth.\nJim: No, no, no! Don't give him mouth to mouth for this!\nMichael: He's going to swallow is tongue.\nJim: No. Michael. Michael.\nMichael: Open your mouth. Swal-Don't swallow it!\nJim: [everyone shouting at once] Michael! Michael!\nMichael: I'm fine, leave me al--\nAndy: You're choking him!\nMichael: Saving him!"},{"type":"paragraph","text":"Creed: Give it up, he's dead.\nJim: He just sent a text...\nCreed: What's a text?"},{"type":"paragraph","text":"Michael: Well I wrote them down so I wouldn't forget. Jim, you're 6'11 and you weigh 90 pounds, Gumby has a better body than you. Boom. Roasted. Dwight, you're a kiss ass. Boom. Roasted. Pam, you failed art school. Boom. Roasted. Meredith, you've slept with so many guys you're starting to look like one. Boom. Roasted. Kevin, I can't decide between a fat joke and a dumb joke. Boom. Roasted. Creed, you're teeth called, your breath stinks. Boom. Roasted. Angela where's Angela? [Angela raises her hand] Whoa there you are, I didn't see you there behind that grain of rice. Boom. Roasted. Stanley, you crush your wife during sex and your heart sucks. Boom. Roasted. Oscar, you are... [Stanley is laughing] Oscar, you're gay."},{"type":"paragraph","text":"Oscar: Wow."},{"type":"paragraph","text":"Michael: Andy, Cornell called, they think you suck. And you're gayer than Oscar. Boom. Roasted. [Stanley is still laughing] Alright. Alright everybody, you know I kid, you know I kid. You guys are the reason I went into the paper business, so, uh, goodnight, God bless, God bless America, and get home safe. [clapping and murmurs of appreciation]"},{"type":"paragraph","text":"Jim: So what did he say? Was it my fault?\nPam: Yeah. He said that you told him how much you love me. About how you feel when I walk in a room, and about how, you've never doubted for a second that I'm the woman you want to spend the rest of your life with. I guess he's never felt that with my mom, even at their best."}],"images":[]}]}