{"sections":[{"title":"The Job Quotes","level":1,"content":[{"type":"paragraph","text":"Jim: Karen suggested that I...get a haircut for the interview tomorrow, so I could look...presentable, and not, as she so lovingly puts it, homeless."},{"type":"paragraph","text":"Oscar: Hey Pam, I've been meaning to say something to you - I really miss our friendship.\nStanley: I've never heard you talk that much - I thought it was Kelly!\nKelly: Are you kidding? I would never have done that - it was Patheticville - no offense, Pam.\nMeredith: You know what? Don't even worry about it - everyone was so drunk, I bet no one even remembers what you said.\nCreed: I remember. I blogged the whole thing!"},{"type":"paragraph","text":"Creed: www.creedthoughts.gov.www\/creedthoughts - check it out!\nRyan: Last year, Creed asked me how to set up a blog. Wanting to protect the world from being exposed to Creed's brain, I...opened up a Word document on his computer and put an address at the top. I've read some of it - even for the internet, it's...pretty shocking."},{"type":"paragraph","text":"Dwight: How would you like to spend the night with the Regional Manager of Dunder-Mifflin Scranton?\nAngela: No, Dwight, I don't care if that's how they consolidated power in Ancient Rome...\nDwight: No, no, no...not Michael - me! I'm taking his job!\nAngela: Not now!...Goodbye, Kelly Kapoor!"},{"type":"paragraph","text":"Dwight: Once I'm officially Regional Manager my first order of business will be to demote Jim Halpert. So I will need a new number two. My ideal choice? Jack Bauer. But he is unavailable. Fictional. And overqualified."},{"type":"paragraph","text":"Meredith: I would never do that, waste of money...in my experience, guys are way more attracted to the back of you than to the front.\nKevin: I love fake boobs! Oftentimes, you find them on strippers.\nCreed: I find it offensive. Au natural, baby, that's how I like 'em - swing low, sweet chariots."},{"type":"paragraph","text":"David Wallace: What do you think about Michael Scott?\nKaren: He's a very nice man, and he's very well suited for the job he has now.\nDavid Wallace: This is off the record...\nKaren: He would be a disaster!"},{"type":"paragraph","text":"Pam: I haven't heard anything. But I bet Jim got the job - I mean, why wouldn't he? He's totally qualified, and smart, everyone loves him, and...if he never comes back again? That's OK - we're friends, and I'm sure we'll stay friends. We just, we never got the timing right, you know? I shot him down, and then, he did the same to me, and...but you know what? It's OK. I'm totally fine everything is going to be totally...\nJim: Pam...are you free for dinner tonight?\nPam: Yes...\nJim: All right, then...it's a date!\nPam: I'm sorry -what was the question?"}],"images":[]}]}