{"sections":[{"title":"The Dundies Quotes","level":1,"content":[{"type":"paragraph","text":"Dwight: Excuse me, everyone, could I have your attention please. I just wanted to say that the women in this office are terrible. Especially the ones who wrote that stuff about Michael on the bathroom wall. Having a bathroom is a privilege. It is called a ladies room for a reason. And if you cannot behave like ladies, well then you are not going to have a bathroom."},{"type":"paragraph","text":"Oscar: The Dundies are kind of like a kid's birthday party, and you go, and there's really nothing for you to do there, but the kid's having a really good time, so you're, you're kinda there, that's...that's kinda what it's like."},{"type":"paragraph","text":"Ryan: What am I gonna do with the award? Nothing...I don't know what I'm gonna do...That's the least of my concerns right now."},{"type":"paragraph","text":"Jim: What a great year for the Dundies! We got to see Ping...and, we learned Michael's true feelings for Ryan, which was touching...and, we heard Michael change the lyrics to a number of classic songs - which, for me, has ruined them for life!"},{"type":"paragraph","text":"Pam: God gave me this Dundie. I feel God in this Chili’s tonight."},{"type":"paragraph","text":"Michael: And now... to someone who quietly goes about their job, but always seems to land the biggest accounts..."},{"type":"paragraph","text":"Michael: ...the \"Busiest Beaver\" award goes to Phyllis Lapin.\n[Everybody starts clapping, Phyllis gets out of her booth and makes her way to Michael, she gives Jim a high five along the way]"},{"type":"paragraph","text":"Michael: Yeah, way to go Phyllis. Nice work, per usual."},{"type":"paragraph","text":"Phyllis: This says \"Bushiest Beaver\"."},{"type":"paragraph","text":"Michael: What? I told them busiest...idiots."},{"type":"paragraph","text":"Phyllis: It's, it's fine."},{"type":"paragraph","text":"Michael: Well, we'll fix it up. You don't have to display that."}],"images":[]}]}