{
  "sections": [
    {
      "title": "The Alliance Quotes",
      "level": 1,
      "content": [
        { "type": "paragraph", "text": "Dwight: Did you get your tickets?" },
        { "type": "paragraph", "text": "Jim: To what?" },
        {
          "type": "paragraph",
          "text": "Dwight: The gun show. [Rolls up his sleeve and kisses his bicep]"
        },
        {
          "type": "paragraph",
          "text": "Dwight: [Talking head] I'm a deer hunter. I go all the time with my dad. One thing about deer, they have very good vision. One thing about me, I am better at hiding than they are... at vision."
        },
        {
          "type": "paragraph",
          "text": "Michael: [Talking head] It looks like there's gonna be downsizing. And it's part of my job, but... blah! I hate it. I think the main difference between me and Donald Trump is that, uh, I get no pleasure out of saying the words, \"You're fired.\" [as Donald Trump] \"You're foir-ed. Uh, you're foir-ed.\" It just makes people sad, and an office can't function that way. No way. [as Donald Trump] \"You're foir-ed.\" I think if I had a catchphrase it would be, \"You're hired, and you can work here as long as you want.\" But that's unrealistic, so..."
        },
        {
          "type": "paragraph",
          "text": "Dwight: [Talking head] It's a real shame, 'cause studies have shown that more information gets passed through water-cooler gossip than through official memos. Which puts me at a disadvantage, because I bring my own water to work."
        },
        {
          "type": "paragraph",
          "text": "Phyllis: Well, uh, for decorations, maybe we could... it's stupid, forget it."
        },
        { "type": "paragraph", "text": "Angela: What?" },
        {
          "type": "paragraph",
          "text": "Phyllis: I was just going to say, maybe we could have streamers, but that's dumb, everybody has streamers. Never mind."
        },
        {
          "type": "paragraph",
          "text": "Angela: No, yeah, I think that's a good idea."
        },
        { "type": "paragraph", "text": "Phyllis: Yeah?" },
        {
          "type": "paragraph",
          "text": "Angela: What color do you guys think?"
        },
        {
          "type": "paragraph",
          "text": "Phyllis: Well, there's green, um, blue... yellow... red... "
        },
        { "type": "paragraph", "text": "Pam: How about green?" },
        {
          "type": "paragraph",
          "text": "Angela: I think green is kind of whoreish."
        },
        {
          "type": "paragraph",
          "text": "Pam: [Talking head] This was tough. I suggested we flip a coin, but Angela says she doesn't gamble. Of course by saying that, she was gambling that I wouldn't smack her."
        },
        {
          "type": "paragraph",
          "text": "Michael: So I was thinking, if you haven't already got a cake, um, maybe going for one of those ice-cream cakes from Baskin-Robbins. Those are very good. Very delicious."
        },
        {
          "type": "paragraph",
          "text": "Angela: Meredith's allergic to dairy, so..."
        },
        {
          "type": "paragraph",
          "text": "Michael: She's not the only one who's going to be eating it right? I think everybody likes ice-cream cake. It's not, uh, it's not just about her, so..."
        },
        { "type": "paragraph", "text": "Pam: It is... her birthday." },
        {
          "type": "paragraph",
          "text": "Michael: [to the camera] Can you get her? She's right there. [camera zooms in on Meredith at her desk] That is Meredith, the birthday girl. And this... is Meredith's card. Happy Bird-Day. [laughs] Um, let's see. Jim, Jim wrote, \"Meredith, I heard you're turning 46, but, come on, you're an accountant. Just fudge the numbers.\" Not bad, pretty funny, I don't appreciate condoning corporate fraud though. Uh, here's the thing. Whatever I write here has to be really, really funny. Because people out there are expecting it. I've already set the bar really high. And they're all worried about their jobs, you know. It's kinda dark out there. Can you imagine if I wrote something like, uh, \"Oh, Meredith, Happy Birthday. You're great. Love, Michael.\" [pretends to vomit and laughs]"
        },
        {
          "type": "paragraph",
          "text": "Jim: Toby and Kevin, they're trying to get Angela kicked off."
        },
        {
          "type": "paragraph",
          "text": "Dwight: Good, let them. It helps our cause."
        },
        {
          "type": "paragraph",
          "text": "Jim: Well, I don't know, if Kevin's in accounting, and Toby's in human resources, and they're talking..."
        },
        {
          "type": "paragraph",
          "text": "Dwight: Oh, they're forming an alliance."
        },
        { "type": "paragraph", "text": "Dwight: Dammit, god!" },
        {
          "type": "paragraph",
          "text": "Jim: OK, listen, we need to assume that everyone in the office is forming an alliance and is, therefore, trying to get us kicked off."
        },
        { "type": "paragraph", "text": "Dwight: God...dammit! Why us?!" },
        {
          "type": "paragraph",
          "text": "Jim: Because we're strong, Dwight. Because we're strong."
        },
        {
          "type": "paragraph",
          "text": "Michael: [Looking at birthday card] Meredith, bad breath. Meredith has bad breath."
        },
        { "type": "paragraph", "text": "Dwight: Hey, you wanted to see me?" },
        {
          "type": "paragraph",
          "text": "Michael: Yeah, what do you know about Meredith?"
        },
        {
          "type": "paragraph",
          "text": "Dwight: I don't think she'll be missed."
        },
        {
          "type": "paragraph",
          "text": "Michael: There's not going to be downsizing Dwight, OK? I just, I need to know a little bit more about my friend."
        },
        {
          "type": "paragraph",
          "text": "Dwight: Name: Meredith Palmer. Uh, personal information: divorced twice, two kids. Uh, employer: Dunder Mifflin Incorporated. Awards: Multiple Dundies."
        },
        {
          "type": "paragraph",
          "text": "Michael: I know all that. I know all that. I just, I need something kind of embarrassing, you know, kind of fun inside."
        },
        { "type": "paragraph", "text": "Dwight: She had a hysterectomy." },
        {
          "type": "paragraph",
          "text": "Michael: [Laughs] Which one's that again?"
        },
        {
          "type": "paragraph",
          "text": "Dwight: That's where they remove the uterus."
        },
        {
          "type": "paragraph",
          "text": "Michael: Oh god! Dwight, no, I'm trying to write something funny. What am I going to do with a removed uterus?"
        },
        { "type": "paragraph", "text": "Dwight: It could be kind of funny." },
        {
          "type": "paragraph",
          "text": "Michael: You know what, I'm on a deadline here, and just... OK. Thanks, thanks for your help. I'll work it out. Thank you, Dwight. That was a waste of time."
        },
        {
          "type": "paragraph",
          "text": "Jim: Wait, this isn't going to work. The lid's open."
        },
        { "type": "paragraph", "text": "Dwight: So tape it down." },
        {
          "type": "paragraph",
          "text": "Jim: I can't do that. You won't be able to breathe."
        },
        {
          "type": "paragraph",
          "text": "Dwight: Look, I can breathe just fine OK, but if it makes you feel better, I'll poke holes in the box."
        },
        {
          "type": "paragraph",
          "text": "Dwight: [Talking head] Can I trust Jim? I don't know. Do I have a choice? No, frankly, I don't. Will I trust Jim? Yes. Should I trust Jim? You tell me."
        },
        { "type": "paragraph", "text": "Pam: He's in a box?" },
        {
          "type": "paragraph",
          "text": "Jim: Pam, he's in a box. He's downstairs, in a box, on the floor, near the shelves. I'm serious. Go down there and work your magic."
        },
        {
          "type": "paragraph",
          "text": "Pam: [In warehouse; on her phone] Hey, where are you? Yeah, we were supposed to meet her. What? Oh my gosh! That ties in perfectly with something Michael was telling me earlier! I just don't know what some of the people in, like, accounting are going to do? It said specifically that..."
        },
        { "type": "paragraph", "text": "Dwight: [His box falls over] Oh." },
        {
          "type": "paragraph",
          "text": "Michael: Jim, good party, huh? Just a little something I whipped up. You know, a little morale boost. No big deal."
        },
        {
          "type": "paragraph",
          "text": "Jim: Speaking of which, I meant to tell you. Very impressive, the uh, donation you gave to Oscar's charity. What was it? 25 bucks?"
        },
        {
          "type": "paragraph",
          "text": "Michael: Well, you know, money isn't everything Jim. It's not the key to happiness. You know what is? Joy. You should remember that. Maybe you'll give more than three dollars next time."
        },
        {
          "type": "paragraph",
          "text": "Jim: Yeah, well, three dollars a mile. It's gonna end up being like 50 bucks. So... God, I can't even calculate what you're gonna have to give."
        },
        { "type": "paragraph", "text": "Michael: Is Oscar around?" },
        {
          "type": "paragraph",
          "text": "Pam: Happy Birthday. [gives Meredith her card]"
        },
        {
          "type": "paragraph",
          "text": "Michael: Read it out loud. And say who wrote everything so we know whose is the best."
        },
        {
          "type": "paragraph",
          "text": "Meredith: \"Happy Bird-day\" Um... \"Meredith, good news. You're not actually a year older because you work here, where time stands still.\""
        },
        {
          "type": "paragraph",
          "text": "Michael: [under his breath] I don't know about that."
        },
        {
          "type": "paragraph",
          "text": "Meredith: That was Stanley. \"Meredith, happy birthday, you're the best. Love, Pam.\""
        },
        {
          "type": "paragraph",
          "text": "Michael: [pretends to vomit] Huh! Thanks, downer."
        },
        {
          "type": "paragraph",
          "text": "Meredith: This is from Michael. \"Meredith, let's hope the only downsizing that happens to you is that someone downsizes your age.\""
        },
        {
          "type": "paragraph",
          "text": "Michael: Because of the downsizing. Rumors. And because you're gettin' old."
        },
        {
          "type": "paragraph",
          "text": "Meredith: No, I... I get it. It's funny."
        },
        {
          "type": "paragraph",
          "text": "Michael: [laughs] You didn't get the joke. So, that's cool. That's, you know what? Actually... I have a bunch of these, good ones, that I didn't use. Um... Oh, where's that? Oh, OK, here's a good one. Um... \"Hey Meredith, Liz Taylor called, she wants her age back and her divorces back.\" 'Cause Meredith's been divorced like, twice. Is that right?"
        },
        {
          "type": "paragraph",
          "text": "Meredith: You're right. You're right. Yes."
        },
        {
          "type": "paragraph",
          "text": "Michael: Divorce. Um... OK, \"Meredith is so old...\""
        },
        { "type": "paragraph", "text": "Oscar: How old is she?" },
        {
          "type": "paragraph",
          "text": "Michael: Everybody? If... could do it? \"Meredith is so old...\""
        },
        { "type": "paragraph", "text": "Everyone: How old is she?" },
        {
          "type": "paragraph",
          "text": "Michael: \"She's so old, she went into an antique store and they kept her.\" That wasn't even mine. I got that off the internet. Website. Um, don't get mad at me."
        },
        { "type": "paragraph", "text": "Oscar: Uh, nice party Michael." },
        {
          "type": "paragraph",
          "text": "Michael: This isn't my fault. Ladies, not your best effort. The streamers? I think we could have done better than that."
        },
        {
          "type": "paragraph",
          "text": "Angela: Phyllis wanted red, I didn't."
        },
        { "type": "paragraph", "text": "Phyllis: Oh, boy... You..." },
        {
          "type": "paragraph",
          "text": "Michael: OK, we... all right. People, hold on, hold on. Just a second. OK, I think we're losing sight of what is really important here. And that is that we are... a group of people... who work together. I was... I really wasn't gonna flaunt this. I have made a very sizable donation to Oscar's nephew's... walkathon. $25."
        },
        { "type": "paragraph", "text": "Oscar: Per mile." },
        { "type": "paragraph", "text": "Michael: Per mile, yes." },
        {
          "type": "paragraph",
          "text": "Jim: OK, OK. I have something that totally tops the box."
        },
        { "type": "paragraph", "text": "Pam: Oh, tell me, tell me." },
        {
          "type": "paragraph",
          "text": "Jim: OK. I have just convinced Dwight that he needs to go to Stamford and... [Pam starts laughing]... spy on our other branch. No no no. But before he does so, I told him that he should dye his hair to go undercover."
        },
        { "type": "paragraph", "text": "Pam: [laughing] That's perfect!" },
        {
          "type": "paragraph",
          "text": "Jim: If we can get him to drive to Connecticut... and put peroxide in his hair..."
        },
        {
          "type": "paragraph",
          "text": "Roy: [yelling] What the hell is this? What are you trying to cop a feel or something? Huh Halpert?"
        },
        { "type": "paragraph", "text": "Jim: No, no, dude, no." },
        { "type": "paragraph", "text": "Pam: Hey, Hey!" },
        {
          "type": "paragraph",
          "text": "Jim: No, dude, no, I was just, listen! Whoa."
        },
        { "type": "paragraph", "text": "Pam: Come on." },
        {
          "type": "paragraph",
          "text": "Jim: God, I don't even, I don't even know how to explain this. Uh, um... Dwight, uh, asked me to be in an alliance. And then um... um... we were... we've just been messing with him. Uh, because of the whole alliance thing. Um..."
        },
        { "type": "paragraph", "text": "Pam: It's just office pranks." },
        {
          "type": "paragraph",
          "text": "Jim: It's stupid. It's, it's just office pranks."
        },
        {
          "type": "paragraph",
          "text": "Roy: [looking at Dwight] An alliance? What the hell is he talking about?"
        },
        { "type": "paragraph", "text": "Dwight: I have absolutely no idea." },
        {
          "type": "paragraph",
          "text": "Dwight: [V/O] Do I feel bad about betraying Jim? Not at all. That's the game. Convince him we're in an alliance, get some information, throw him to the wolves."
        },
        {
          "type": "paragraph",
          "text": "Dwight: [In talking head, with blonde hair] That's politics baby. Get what you can out of someone, then crush them. I think Jim might have learned a very valuable lesson."
        }
      ],
      "images": []
    }
  ]
}
