{"sections":[{"title":"The Convict Quotes","level":1,"content":[{"type":"paragraph","text":"Dwight: I am greatly concerned about having a convict in the office. And I do not care if that convict is white, black, Asian, German, or some kind of halfsy. I do not like criminals."},{"type":"paragraph","text":"Michael: [puts on bandanna]. I'm prison Mike! You know why they call me prison Mike?!"},{"type":"paragraph","text":"Angela: Do you really expect us to believe you're somebody else?"},{"type":"paragraph","text":"Michael: Do you really expect me to not push you up against the wall, beeyotch?! [employees protest] All right, hey, hey, hey, hey, that's just the way we talk in the clink. Been a lot of fun talk about prison today, but I am here to scare you straight. I AM HERE TO SCARE YOU STRAIIIGHT!! In prison you are somebody's bitch. Oh, and you. [points to Ryan] You, my friend, would be da belle of da ball. Don't drop the soap! Don't drop the soap!"},{"type":"paragraph","text":"Ryan: Michael, please. [Michael makes kissing noises]"},{"type":"paragraph","text":"Jim: Where... did you learn all of this?"},{"type":"paragraph","text":"Michael: Internet. "},{"type":"paragraph","text":"Jim: So, not prison."},{"type":"paragraph","text":"Michael: And prison. Eh, fifty-fifty, both. Look, prison stinks, is what I'm saying. It's not like you can go home, and, recharge your batteries, and come back in the morning and, be with your friends, having fun in the office. "},{"type":"paragraph","text":"Jim: What'd you do, Prison Mike?"},{"type":"paragraph","text":"Michael: I stole. ... And I robbed. And I kidnapped... the... president's son. And held him for ransom."},{"type":"paragraph","text":"Jim: That is... quite the rap sheet, Prison Mike."},{"type":"paragraph","text":"Michael: And I nevah got caught, neither."},{"type":"paragraph","text":"Jim: Well, you're... in... prison, but, mmhmm."},{"type":"paragraph","text":"Pam: Prison Mike? What was the food like in prison?"},{"type":"paragraph","text":"Michael: Gruel. Sandwiches. Gruel omelettes. Nothing but gruel. Plus, you can eat your own hair."},{"type":"paragraph","text":"Andy: Wow. Prison sounds horrible."},{"type":"paragraph","text":"Michael: Yeah. Yeah. Well, thank you, Andy. Tanks."},{"type":"paragraph","text":"Dwight: Prison Mike. What's the very very worst thing about prison?"},{"type":"paragraph","text":"Angela: Don't encourage him, Dwight. "},{"type":"paragraph","text":"Michael: The worst thing about prison was the... was the Dementors. They... were flying all over the place, and they were scary. And they'd come down, and they'd suck the soul out of your body, and it hurt!"}],"images":[]}]}