{"sections":[{"title":"Weight Loss Quotes","level":1,"content":[{"type":"paragraph","text":"Michael: What is wrong with these people? They have no willpower. I went -- I once went 28 years without having sex. And then again for seven years."},{"type":"paragraph","text":"Jim: I can't believe I'm saying this - but Michael is actually killing it with Holly. And I think I know why - it's because Holly is kind of a major dork!"},{"type":"paragraph","text":"Jim: When Michael told us that Jan was pregnant, he led us to believe that he was the father - by telling us that...he was the father."},{"type":"paragraph","text":"Holly: Who's that woman in Michael's office, with the feet?\nOscar: That's his ex.\nHolly: Oh, she's...she's very beautiful...\nOscar: Yes, she is...and clinically insane."},{"type":"paragraph","text":"Holly: You do not talk to him like that!\nAngela: But he's an idiot!\nHolly: He is not an idiot! He is mentally challenged...but he's doing a super job here!\nKevin: Wait, back up. Do you think that I'm retarded?\nHolly:Wha...no...a...Dwight...\nAngela: (Clearly enjoying the spectacle) Oh Holly, that is very offensive!"},{"type":"paragraph","text":"Phyllis: I've replaced Angela as head of the Party Planning Committee...I guess I was just in the right place at the right time!"},{"type":"paragraph","text":"Holly: It's kind of a Good News-Bad News situation. The bad news is, we're not doing very well, so we really hadda starve ourselves this whole week. But the good news, is that all the other branches are doing just as bad as we are, so Corporate upped the prize to five days - so if we stay fat long enough, we may actually get a whole month off!"},{"type":"paragraph","text":"Kelly: I swallowed a tapeworm last night. It's going to grow up to three feet inside of me, and then it eats all my food so that I don't get fat, and then, after three months I take some medicine and I pass it - Creed sold it to me, it's from Mexico.\nCreed: That wasn't a tapeworm."},{"type":"paragraph","text":"Michael: Ronnie was...bllahh...things were at an all-time sad here. But then I got an e-mail from Ryan, that he was coming back to town, and I called the temp agency, and I told them, I will pay you any amount, just give me Ryan Howard - give him to me. I need him!"}],"images":[]}]}