{
    "season": "Season 8",
    "li": [
        "The employees begin planking around the office. Andy is revealed as the new manager of the office and Robert California as the CEO. Pam and Angela are pregnant.(\"The List\")\n",
        "Kevin speaks like an idiot to save time. Jim, Pam, and Andy convince him to stop.(\"The Incentive\")\n",
        "The employees find a dog inside of a car in the parking lot. Oscar smashes the window to save the dog, but has to put a cardboard cover on it.(\"Lotto\")\n",
        "Andy places billboards all around Scranton, but finds vulgar graffiti on all of them.(\"Garden Party\")\n",
        "Andy screens the Halloween costumes around the office. (\"Spooked\")\n",
        "Andy sings \"Closing Time\" around the office every day, but the employees aren't enthusiastic. Stanley, however, sings along.(\"Doomsday\")\n",
        "Andy asks Erin to fake a phone call to impress a client, but Erin, Dwight, and Darryl pretend Andy's mother has died.(\"Pam's Replacement\")\n",
        "Pam fakes her water breaking to get out of doing things in the office. The employees finally catch her faking it.(\"Gettysburg\")\n",
        "Dwight decides to stand at all times instead of sitting. Jim finds him faking it, and tips him over.(\"Mrs. California\")\n",
        "Stanley demands a traditional Christmas.(\"Christmas Wishes\")\n",
        "The employees see how long they can go without talking. Kevin breaks the streak by eating a candy bar and saying \"Oh Yeah\".(\"Trivia\")\n",
        "Jim pranks Dwight by placing meatballs in odd spots to make Stanley laugh. Dwight and Stanley reveal they have been scheming to get Jim to give them meatballs.(\"Pool Party\")\n",
        "Andy dances to \"Footloose\" in the warehouse. (\"Jury Duty\")\n",
        "Pam returns from maternity leave, but Angela returns much more quickly, with a better body and time to bake goodies for the employees.(\"Special Project\")\n",
        "Dwight wakes up the entire Tallahassee team in the hotel extremely early. Jim pranks Dwight by pretending to have been murdered in his room.(\"Tallahassee\")\n",
        "Pam, Angela, and Oscar talk behind each other's back about the others. Andy angers all of them by claiming a boat is the most difficult thing to take care of.(\"After Hours\")\n",
        "Dwight plans the opening of the Sabre Store. Erin pretends to be a hipster in line.(\"Test the Store\")\n",
        "Andy announces that Dwight is staying in Florida, but the employees think Dwight is dead. The employees let Creed open Dwight's treasure, and find a picture of the employees with a poison dart inside of it.(\"Last Day in Florida\")\n",
        "The employees go down to the warehouse to see a balloon falling from the ceiling. They realize how unaccomplished their lives are and decide to kill the balloon.(\"Get the Girl\")\n",
        "Stanley comes back from the hospital and the employees can't remember whether or not he has a mustache. (\"Welcome Party\")\n",
        "The employees count how many cliches about the rain Phyllis says. Phyllis enjoys the fact that the other employees are listening to her, and because of this, she doesn't say the last one.(\"Angry Andy\")\n",
        "Ryan is distraught over the death of Smokey Robinson, but Pam thinks he is only attempting to be deep about music. Oscar finds that Smokey is alive and they try getting Ryan to go to a Smokey concert, but he refuses.(\"Fundraiser\")\n",
        "Dwight and Gabe have a leg curl competition and Jim tricks them to make a photo of the two having a slumber party.(\"Turf War\")\n",
        "Oscar makes an \"It Gets Better\" video, but is interrupted by Robert, Kelly and Kevin. (\"Free Family Portrait Studio\")\n"
    ]
}