{
    "season": "Season 5",
    "li": [
        "None (\"Weight Loss\")\n",
        "Jim tells everyone that he is engaged to Pam and no one seems to care, until Michael comes to the office and takes Jim down.(\"Business Ethics\")\n",
        "Dwight and Michael prepare for Jan's baby by using a watermelon. Jim says that Michael and Jan's baby are connected through delusion.(\"Baby Shower\")\n",
        "Pam runs out of money in New York so Michael arranges for her to get a job at Corporate.(\"Crime Aid\")\n",
        "The office dresses up for Halloween and three employees (Creed, Kevin and Dwight) dress as Heath Ledger's Joker.(\"Employee Transfer\")\n",
        "Michael tells the office that he got engaged when he took Holly to Nashua - upon hearing this, Darryl, having actually been there, offers to pay for any psychiatric care Michael needs (\"Customer Survey\")\n",
        "Michael tells the office about local customs in foreign lands.(\"Business Trip\")\n",
        "Michael doesn't know that Toby is back from Costa Rica.(\"Frame Toby\")\n",
        "Oscar explains to Michael how well the office used its budget.(\"The Surplus\")\n",
        "Jim wrapped up many presents for Dwight.(\"Moroccan Christmas\")\n",
        "The office times their sprints using a radar gun located in front of the building.(\"The Duel\")\n",
        "Dwight looks for the source of the red wire coming from his computer.(\"Prince Family Paper\")\n",
        "Dwight sets up a fire test for the preparedness of a fire drill.(\"Stress Relief\")\n",
        "Michael does impressions on the intercom.(\"Lecture Circuit Part 1\")\n",
        "Recap of main events in the previous episode.(\"Lecture Circuit Part 2\")\n",
        "The phone systems gets an upgrade. Jim pretends he's Michael.(\"Blood Drive\")\n",
        "Michael and Dwight do knock knock jokes. Jim does a ding dong joke. Jim finishes Dwight's joke.(\"Golden Ticket\")\n",
        "Michael decides to celebrate his 15th anniversary. Dwight doesn't like his outfit. Jim is Mr. Peanut. Jim talks about ice sculptures.(\"New Boss\")\n",
        "Michael talks to his coworkers about his quitting story.(\"Two Weeks\")\n",
        "Kevin has trouble adjusting to his job as receptionist but is finally able to transfer a call to Andy which turns out to be bad news.(\"Dream Team\")\n",
        "Michael arrives back at Scranton business park to open Michael Scott Paper Company and in search of a good parking space.(\"Michael Scott Paper Company\")\n",
        "Michael, Pam, and Ryan become cheese puff aficionados around the office.(\"Heavy Competition\")\n",
        "Michael, Pam, and Ryan adjust to early morning paper deliveries while making sure their delivery van isn't mistaken for a Korean church van.(\"Broke\")\n",
        "Kevin brings a huge pot of his \"Kevin's Famous Chili\" dish to the office, and accidentally drops it onto the floor, making a big mess of the carpet and himself as he tries to scoop it back into the pot.(\"Casual Friday\")\n",
        "Dwight uses the new receptionist to pull a prank on Jim and Pam.(\"Cafe Disco\")\n",
        "After Michael falls asleep at the desk, the entire office conspires to convince him it's 5 o'clock when it really only 1 o'clock.(\"Company Picnic\")\n"
    ]
}