{
    "season": "Season 7",
    "li": [
        "The Scranton branch make a lip dub of the Human Beinz' Nobody But Me.(\"Nepotism\")\n",
        " Dwight gives Jim and Pam a tour of the day care facilities he is opening in the office.(\"Counseling\")\n",
        " Andy gives the office a preview of the musical, Sweeney Todd. (\"Andy's Play\")\n",
        "Dwight hires Nate to take care of the hornets nest.(\"Sex Ed\")\n",
        " Oscar brings his bike to work and Michael tries to ride it.(\"The Sting\")\n",
        "There is no limit to what Stanley will not notice.(\"Costume Contest\")\n",
        " Pam hosts the Sabre Hygiene Day. Dwight exposes himself to more germs.(\"Christening\")\n",
        "The Scranton Strangler escapes his house. The Scranton Branch watch him on the news and out the window. Michael grabs dirt from the road.(\"Viewing Party\")\n",
        "The power and server went off. The office tried to figure out the server password which ended up being \"bigboobz\".(\"WUPHF.com\")\n",
        "When Dwight attempts to use his feet as hands around the office, Jim proves to him how his experiment will fail.(\"China\")\n",
        "The office poses for their annual Christmas card but can't decide on the right pose or get it right.(\"Classy Christmas\")\n",
        "After returning to the office on a Saturday to retrieve his cell phone, Jim stumbles upon Dwight's neighborhood watch meeting in the conference room.(\"The Ultimatum\")\n",
        "Ricky Gervais guest stars when Michael Scott and his British The Office counterpart, David Brent, meet at last. (\"The Seminar\")\n",
        "Ryan and Kelly announce their pending divorce but the rest of the office was unaware of their past nuptials. (\"The Search\")\n",
        " Darryl's grandmother has passed away. Pam attempts to console him with a signed card from Dunder-Mifflin employees, but it was mistaken for a birthday card, thus prompting a party celebration. Darryl sheds a tear for the camera.(\"PDA\")\n",
        " The opening scene to Michael's movie  Threat Level Midnight opens this episode as Michael announces he is finally ready to premiere it to the office. (\"Threat Level Midnight\")\n",
        " Dwight uses lunch time to consume large quantities of nearly-expired food from his bomb shelter. Jim questions Dwight's deadline til the end of the world.(\"Todd Packer\")\n",
        " The office holds a garage sale in the warehouse. After Dwight lets the cold air from outside into the warehouse, Andy wrestles him to try and close the door. (\"Garage Sale\")\n",
        " Michael is meeting his replacement at a hotel bar, but after the guy is late, he strikes up a conversation with a stranger (Will Ferrell) who's companion is also late. After a few minute and a few drinks, they realize they are there to meet each other. (\"Training Day\")\n",
        " Michael and his replacement drive around and deliver Dundie nominations to their employees, particularly Jim & Pam, Stanley, Toby, and Meredith. (\"Michael's Last Dundies\")\n",
        " While Michael is sitting on the roof to prepare himself for the high altitude of Colorado, Dwight offers him a sabotaged gift for not naming him as his successor. After Michael tell Dwight that it was not his job to give, he makes amends by seeking Dwight's advice on bear attacks.(\"Goodbye, Michael\")\n",
        " Deangelo Vickers begins his first day as the new regional manager with conference room meeting (\"The Inner Circle\")\n",
        " The Party Planning Committee decide on a hospital gift for Deangelo. Jim explains how the office has been running in the absence of a boss, but corporate offers him the top spot to which he declines. When Dwight accepts the job instead, Jim regrets his decision. (\"Dwight K. Schrute, (Acting) Manager\")\n",
        " After he arrives to work in a new Porsche, we learn that Creed has been named the new acting manager based on seniority. He is performing exactly as you would expect him to perform.(\"Search Committee\")\n"
    ]
}