{
    "season": "Season 6",
    "li": [
        "Andy, Dwight, and Michael parkour around the office. (\"Gossip\")\n",
        "Michael asks Oscar's advice for a colonoscopy procedure. (\"The Meeting\")\n",
        "Dwight asks Jim to sign the expense reports, and tries filing a complaint against Jim. (\"The Promotion\")\n",
        "Pam asks the employees to be mindful of her sensitive nose, leading to everyone vomiting around the office.(\"Niagara\")\n",
        "Michael holds a conference room meeting about the fundamentals of business.(\"Mafia\")\n",
        "Jim and Pam return from their honeymoon; Michael plays Blind Guy McSqueezy.(\"The Lover\")\n",
        "Jim is annoyed when a client insists on Michael attending a meeting instead of just him.(\"Koi Pond\")\n",
        "The staff puts together a haunted warehouse for their children, but the scares fall flat, that is until Michael pretends to hang himself. ((\"Koi Pond\") - original airing)\n",
        "Dwight brings fresh bagels from New York for the entire office in exchange for their allegiance against Jim. (\"Double Date\")\n",
        "After Jim interrupts Dwight's martial arts seminar, Dwight begins to practice against himself. (\"Murder\")\n",
        "Jim gives us a history on the evolution of Dwight's alter ego, \"Recyclops.\" (\"Shareholder Meeting\")\n",
        "After Michael tells Andy he has received complaints about Andy's baby voice, Andy gives Michael tips about his Elvis impression.(\"Scott's Tots\")\n",
        "Jim and Dwight unveil the new office Christmas tree, but the office is not amused. (\"Secret Santa\")\n",
        "Michael outlines his plan to impress someone who is trying to determine the branch's worth to possible investors. (\"The Banker\")\n",
        "After Michael hastily opens and distributes the contents of a package meant for the new boss, he enlists the help of the entire office to reseal it. (\"Sabre\")\n",
        "Michael cancels a hotel reservation in Vancouver. (\"Manager and Salesman\")\n",
        "Dwight insists Jim and Pam are using their upcoming baby to increase their sales. They advise Dwight to open up to his clients about his personal life, to shocking results.(\"The Delivery\")\n",
        "The office, particularly Meredith, show their enthusiasm for St. Paddy's. (\"St. Patrick's Day\")\n",
        "Michael tries to prove to Jim that he has seen Johnny Depp in his condo complex. (\"New Leads\")\n",
        "Michael challenges the office and allows anyone who can do 25 push-ups the day off. (\"Happy Hour\")\n",
        "The office collects around Oscar's computer to watch a funny video of cookie monster with Kevin's voice. (\"Secretary's Day\")\n",
        "Michael wants everyone in the office to speak Spanish as he prepares for a trip to Cancun but has difficulty with the feminine and masculine forms of the language. (\"Body Language\")\n",
        "Jim and Pam learn Morse Code, sending Dwight into paranoia. (\"The Cover-Up\")\n",
        "In the conference room, an office safety meeting led by Toby turns into a discussion on how to get rid of Bin Laden, Hitler, and Toby at once. (\"The Chump\")\n",
        "Michael wants to keep a local newsclip featuring himself as the most viewed video and enlists the office to watch it 11 times each.The office instead gets distracted by a video of a baby otter at the Scranton Zoo.(\"Whistleblower\")\n"
    ]
}