{
  "sections": [
    {
      "title": "Andy Bernard",
      "level": 1,
      "content": [
        {
          "type": "paragraph",
          "text": "Andrew Baines \"Andy\" Bernard (born Walter Baines Bernard Jr. on January 24, 1975) is a fictional character played by Ed Helms in the television series, The Office. Andy is a Salesman at Dunder Mifflin. He enjoys singing a cappella, sailing, performing in theatre, and playing the guitar."
        },
        {
          "type": "paragraph",
          "text": "Andy was a Salesman at Dunder Mifflin/Sabre until being promoted to Regional Manager, starting with Season 8. He is currently not in a relationship. He was fired after Nellie stole his job causing Andy to react violently, but wins his job back after convincing David Wallace to buy out Dunder Mifflin/Sabre, re-instating Andy as manager. He quits his job at Dunder Mifflin in order to go into show business. He is now an admissions counselor at Cornell University."
        },
        {
          "type": "paragraph",
          "text": "When Andy was first introduced, it was revealed that Andy had issues with anger management."
        },
        {
          "type": "list",
          "elements": [
            {
              "text": "In Gay Witch Hunt, he shouts and angrily kicks a wastepaper basket when he discovers that someone has placed his calculator in Jell-O.",
              "elements": []
            },
            {
              "text": "In The Return, he punches a hole in a wall out of frustration when Jim hides Andy's cell phone. This results in Andy being sent to anger management training.",
              "elements": []
            },
            {
              "text": "In a deleted scene in Job Fair, he angrily flails his golf club and tries to break it, but ends up hurting himself.",
              "elements": []
            },
            {
              "text": "In Sex Ed, Andy believes that Erin and Gabe may be dating. Andy is mocked by his coworkers, most noticeably Meredith who called him Pencil Dick, causing him to throw a box of pizza at the wall and storm off.",
              "elements": []
            },
            {
              "text": "In Angry Andy, Andy punches the same wall as he does in The Return. Andy grew up in a life of wealth and often fails to comprehend how less wealthy people live.",
              "elements": []
            },
            {
              "text": "He frequently mentions that he went to Cornell University (see Andy Bernard's academic career).",
              "elements": []
            },
            {
              "text": "\"Like everybody,\" he hated golf lessons as a child and hung out at the sailing club instead (Job Fair).",
              "elements": []
            },
            {
              "text": "He tries to gain sympathy for personal reasons in the episode Andy's Ancestry and suggests to Darryl that he lived in an apartment as a child.",
              "elements": []
            }
          ]
        }
      ],
      "images": []
    },
    {
      "title": "Season 3",
      "level": 2,
      "content": [
        {
          "type": "paragraph",
          "text": "Andy is introduced in the Season 3 premiere, \"Gay Witch Hunt\", as a co-worker of Jim's at the Stamford branch. In the same episode, he calls Jim \"Big Tuna,\" in reference to Jim bringing a tuna sandwich on his first day at Stamford. He also reacts violently to being on the receiving end of Jim's prank of putting his calculator in Jell-o."
        },
        {
          "type": "paragraph",
          "text": "In fact, all of Jim's future tuna related nicknames, including but not limited to \"Big Tuna\" were coined by Andy and stemmed from this."
        },
        {
          "type": "paragraph",
          "text": "He is obsessed with Call of Duty, and once remarked to Jim that he is \"gonna kill [Jim] for real\" for using sniper rifles (The Coup, Season 3 Episode 3) on a close-range shooting map."
        },
        {
          "type": "paragraph",
          "text": "When Andy transferred to the Scranton Branch, he told Jim that he found Pam attractive, which caused Jim to play a practical joke on Pam and tell Andy many things that were the opposite of what Pam finds to be attractive in a man (The Convict, Season 3 Episode 9)."
        },
        {
          "type": "paragraph",
          "text": "Andy serves as the main antagonist for a short time in the office by constantly singing out loud, showing off and even pressuring Michael to have Dwight fired for being late to work and lying (a decision Michael would later regret). Michael turns him down by finally telling him to stop bothering him, Andy replies by saying, \"Sorry I annoyed you with my friendship.\" and walks away."
        },
        {
          "type": "paragraph",
          "text": "Jim and Pam then play a practical joke and hide Andy's cell phone in the ceiling tiles, though Karen warned that it wouldn't be a good thing to do. Andy becomes extremely aggravated and punches a hole in the wall, for which he is sent to anger management counseling (\"The Return\", Season 3 Episode 13). Andy says the program is ten weeks but promises that he'd be back after five weeks before meeting the counselor and leaving."
        }
      ],
      "images": []
    },
    {
      "title": "Season 4",
      "level": 2,
      "content": [
        {
          "type": "paragraph",
          "text": "After Karen leaves, Andy is the only member of the Stamford branch (excluding Jim) remaining in Scranton."
        },
        {
          "type": "paragraph",
          "text": "In the Season 4 premiere, \"Fun Run\", it is revealed that Andy has extremely sensitive nipples that are prone to chafing (\"I'm petrified of nipple chafing. Once it starts it is a vicious cycle. If you have sensitive nipples, they chafe, so they become more sensitive, so they chafe more.\")  Later in the episode, his nipples end up chafing and bleeding."
        },
        {
          "type": "paragraph",
          "text": "Andy, who is interested in Angela, decides to ask her out on a date, and while she continues to turn him down, he remains determined. At one point, he gives her a cat that he found outside, which prompts her to finally say yes (\"Money\" Season 4 Episode 4).  Prior to Did I Stutter?, Andy drove a Nissan Xterra, but then sold it to Dwight. Dwight then sold the car on eBay for a profit."
        },
        {
          "type": "paragraph",
          "text": "In Goodbye, Toby, he proposes to Angela, who replies with an unenthusiastic \"okay.\" In this episode, he also refers to his parents as \"Andrew and Ellen Bernard\" who is actually named \"Walter and Ellen Bernard.\" They are both later played by different actors. "
        }
      ],
      "images": [
        {
          "src": "https://vignette.wikia.nocookie.net/theoffice/images/f/f0/Screen_Shot_2017-01-28_at_11.15.31_PM.png/revision/latest/scale-to-width-down/130?cb=20170129051635",
          "caption": ""
        }
      ]
    },
    {
      "title": "Season 5",
      "level": 2,
      "content": [
        {
          "type": "paragraph",
          "text": "Andy is constantly making wedding plans at work, completely unaware that Angela is having an affair with Dwight. When Michael tells him this in \"The Duel\", Andy challenges Dwight to a duel, which he wins by pinning Dwight to a hedge with his car. However, both figure out that Angela has been sleeping with both men and are heartbroken."
        }
      ],
      "images": []
    },
    {
      "title": "Season 6",
      "level": 2,
      "content": [
        {
          "type": "paragraph",
          "text": "Andy spends almost every episode trying to impress Erin, the new receptionist. He succeeded in The Delivery, though in the episode \"Secretary's Day\", Erin finds out from Michael that Andy was engaged to Angela which Andy had never told her, so they broke up. In Gossip after Michael spread the rumor that Andy was gay, Andy started to believe he actually was gay and went to Oscar for help. Andy becomes the first Dunder Mifflin/Sabre employee to learn the printers they sell can spontaneously catch on fire (The Chump). He is also the first to be suspected of leaking the story to the press, which he vehemently denies (The Whistleblower). However, it is revealed he is one of at least four others who leaked the story, though he remains the only one blamed."
        }
      ],
      "images": [
        {
          "src": "https://vignette.wikia.nocookie.net/theoffice/images/8/84/The-office-get-the-girl-nbc-0.jpg/revision/latest/scale-to-width-down/220?cb=20170129051829",
          "caption": ""
        }
      ]
    },
    {
      "title": "Season 8",
      "level": 2,
      "content": [
        {
          "type": "paragraph",
          "text": "While on the elevator ride up, Andy believed Dwight felt resentment toward him so he hired Dwight to be second in command. A planking Kelly up on Andy's cabinet tells him that it was a smart move to which an annoyed Andy mutters \"this has got to stop\". He tasks Dwight with going around and stopping prankers. Andy is later confronted by Jim and Pam when they find a mysterious page in Robert's notebook with all their names on two lists. Andy tries to persuade them that the list doesn't mean anything and goes to prove it by asking Robert directly. Robert moves his name from one column on the list, moves it to the other column, and takes out the employees on the first column out for lunch, stating at lunch that these employees with him are the winners and everyone back at the office are losers. He even states \"winners, prove me right; losers, prove me wrong.\" After the Florida team return from their work in Tallahassee, Andy realizes Erin stayed in Tallahassee to be a caretaker. Andy realizes that he loves Erin and drives down to Florida with the determination to bring her back to Scranton to be with him. His decision is so spontaneous, that Andy fails to inform Robert California of his brief absence or any plans of returning. On the way back, Andy breaks up with his current girlfriend Jessica while she is attending her friend's bachelorette party. At first, he lies to Jessica in attributing the need for the break up to his homosexuality and then Andy finally tells the truth in stating that the cause of the break up is due to his love for Erin. Upon arriving in the Scranton office with Erin, he finds Nellie Bertram has usurped his role as Regional Manager and unsuccessfully attempts to get his position back. Andy and Erin express their violent rage in front of the entire office. Andy punches a wall again. Robert California calls Andy into his office and fires Andy from Dunder Mifflin.  Andy overhears Robert California discussing a major business requiring paper and races to the client's building to get them to sign on with Andy's spontaneously created and named \"Big Red Paper Company.\" Andy informs Robert California that he has the client's business and offers to bring the client to Dunder Mifflin Sabre if Robert California will make Andy the Regional Manager. Robert California refuses Andy's offer and promises to annihilate Andy's new company with Robert California's business savvy. Andy visits and persuades David Wallace to purchase Dunder Mifflin Sabre from Robert California and replace Nellie with Andy as the Regional Manager once more. Robert California agrees to the sale of the company. Andy is placed as Regional Manager."
        }
      ],
      "images": []
    },
    {
      "title": "Season 9",
      "level": 2,
      "content": [
        {
          "type": "paragraph",
          "text": "Andy is still the Regional Manager at Dunder Mifflin Scranton, but he has returned from going on a camping trip. David Wallace sent Andy to an outdoors camp in order to hone business skills necessary to successfully run an office, such as decision making. He also learned activities such as slacklining and survival skills. He ensures that he will be a \"huge bitch\" to Nellie Bertram. He sets up a slackline outside the building to purposefully embarrass Nellie when she cannot walk the slackline in heels. Instead of enjoying Andy's new found knowledge of slacklining, his outdoor activity comes off as being obviously vindictive towards Nellie. "
        },
        {
          "type": "paragraph",
          "text": "Andy attends Pam's chore wheel meeting."
        },
        {
          "type": "paragraph",
          "text": "Andy finds out that his family has gone broke, and that his dad has left.  Andy stuns the office in a tour de force of competence and forward-thinking in assisting his mother with the liquidation of the family assets. Andy is forced to sell the family boat to provide for the family.  He sells it to someone in the Bahamas and decides to sail it there himself because sailing the family boat has always been his lifelong dream.  He tells Erin that he'll be gone for two weeks and will return. Andy does not inform David Wallace of his absence but stays in contact with David as if he's still at the office and does so more frequently than he does with Erin. He sails the boat to the buyer and stays in the Bahamas. His two-week absence is stretched out to three months. The office runs smoothly without Andy and Erin grows increasingly upset with Andy's increasingly irresponsible behavior.  David visits the office shortly after Andy's return. David congratulates Andy on the branch outperforming quarterly expectations. This is less due to Andy's management skills than it is to the competence of the office staff at closing sales. Everyone resents Andy for taking credit that was not rightfully his. Andy finds out that Dwight was signing off on his own sales reports without consulting Andy. Despite the difficulty in being reached at sea, Andy is furious that he was not consulted. In his anger at Dwight, Andy loses their latest and biggest client The White Pages to date in a spiteful argumentative phone call while Dwight looks on in horror. Erin marches into Andy's office and breaks up with him, stating that his being gone for 3 months is the reason for her disgust with him. David overhears this information as he is on the phone with Andy on speaker. David decides to not fire Andy, as it was Andy who helped him get back on top at Dunder Mifflin, but he cautions Andy that he will not pardon any more unprofessional conduct. "
        },
        {
          "type": "paragraph",
          "text": "After Erin dumps Andy, Andy steals her phone to find out who she's dating. Andy realizes that she is going out with a guy named Pete. Andy doesn't know who Pete is at first because he's called Pete by the nickname Andy bestowed on Pete for so long that Andy forgot his real name. Once Andy figures out who Pete is, Andy is very upset, and he tries many methods to break them up, but Andy is unsuccessful."
        },
        {
          "type": "paragraph",
          "text": "In the episode \"Stairmageddon\", Andy goes to a talent agent named Carla Fern in order to pursue his dream of being famous. Carla signs him on as a client and he begins working as an actor."
        },
        {
          "type": "paragraph",
          "text": "In the episode \"Livin' the Dream\", Andy decides to pursue stardom by quitting his job at Dunder Mifflin. This comes as a boon to David Wallace who had finally decided to fire Andy when Andy stated that he wanted to step down from Regional Manager. Various people around the office tell Andy that he won't be successful. Andy asks David Wallace if he can stay on as a salesperson. David Wallace agrees and Andy becomes a salesman instead. Andy then decides that having a steady job would distract him from his goal to become a professional in show business. Intending to strengthen his resolve and eliminate his current job as a fallback, he asks Toby to enter falsified information into his employment record. After Toby refuses, Andy tries to grope Toby,  so Toby will have to file an incident of inappropriate sexual conduct in the office, thereby torching any chance Andy may have at returning. This does not work. Andy then confronts David Wallace and tries to get himself intentionally fired. Andy brings up the fact that he lost the White Pages account (\"Couples Discount\") and starts an argument with David Wallace. After Wallace becomes enraged and finally fires him, Andy tops it off by defecating on Wallace's new car."
        },
        {
          "type": "paragraph",
          "text": "Andy is next seen trying out for an a cappella talent show. Andy forces his way into an audition and it goes very badly. The judges are not impressed by his lackluster audition of Cornell's fight song and Andy begins breaking down and crying on camera. His audition and breakdown are leaked to the internet and the video goes viral. Andy gets the fame he was chasing, but not the fame he had in mind. Like many others in the office, his wish has come true.  His infamy causes Cornell to invite him to speak at their graduating class' commencement ceremony. The success of his commencement speech prompts Cornell to offer him a post as one of Cornell's admission counselors. After attending Dwight's wedding, Andy states that while he worked in the office, all he could think about were his old friends at Cornell and now that he's at Cornell, all Andy can think of are the friends he made in the office. "
        }
      ],
      "images": []
    },
    {
      "title": "Recurring jokes",
      "level": 2,
      "content": [
        {
          "type": "list",
          "elements": [
            {
              "text": "Andy went to Cornell and is smug about it. For more details, see Andy Bernard's academic career.",
              "elements": []
            },
            {
              "text": "Andy has a wide range of musical talent, which showcases Ed Helms' real-life musical talent. Dwight often makes fun of him because of this.",
              "elements": []
            },
            {
              "text": "Andy frequently breaks into a cappella:",
              "elements": [
                {
                  "text": "In \"The Convict\", Andy plays \"The Rainbow Connection\" on the banjo in a \"sexy, high falsetto voice\" in an attempt to woo Pam.",
                  "elements": []
                },
                {
                  "text": "In \"Back From Vacation\", Andy plays Michael's steel drum.",
                  "elements": []
                },
                {
                  "text": "In \"Launch Party\", Andy, with his Cornell buddies singing harmonies via speakerphone, serenades Angela with a rendition of ABBA's \"Take a Chance on Me\"",
                  "elements": []
                },
                {
                  "text": "In \"Moroccan Christmas\", Andy teaches himself to play the sitar.",
                  "elements": []
                },
                {
                  "text": "In \"Michael Scott Paper Company\", Andy, playing the banjo, breaks into a musical duel rendition of \"Country Roads\" with Dwight to compete for Erin's interest.",
                  "elements": []
                },
                {
                  "text": "In \"Cafe Disco\", Andy engages in a talented dance-off with Kelly.",
                  "elements": []
                },
                {
                  "text": "In \"Crime Aid\", Dwight calls Andy a \"singing buffoon\". Also, for the Roast of Michael Scott, Andy sings \"What I Hate About You\".",
                  "elements": []
                },
                {
                  "text": "In \"The Duel\", Dwight imitates Andy's singing by yelling \"lalalalala\" in his face.",
                  "elements": []
                },
                {
                  "text": "In \"Niagara\", Andy has a dance-off with Meredith but unfortunately tears his scrotum on his car keys while attempting a split.",
                  "elements": []
                }
              ]
            },
            {
              "text": "Angela defaces Andy's car:",
              "elements": [
                {
                  "text": "In a deleted scene from \"Safety Training\", Angela calmly walks around Andy's new car and scratches it with her key.",
                  "elements": []
                },
                {
                  "text": "In \"Dinner Party\", Angela smashes her ice cream cone against the side of Andy's car in disgust, after he playfully takes a bite of her ice cream.",
                  "elements": []
                }
              ]
            },
            {
              "text": "Andy consistently dresses in a \"preppy\" style, with khaki pants, matching striped or patterned neckties and shirts in bold colors. In Women's Appreciation, Dwight calls Andy a \"preppy freak.\" Notable fashion choices include:",
              "elements": [
                {
                  "text": "In \"Traveling Salesmen\", Andy wears a navy blue Nantucket rope bracelet.",
                  "elements": []
                },
                {
                  "text": "In \"Beach Games\", Andy wears J.Crew Madras shorts.",
                  "elements": []
                },
                {
                  "text": "In \"Chair Model\", Andy wears green socks to match his green necktie.",
                  "elements": []
                },
                {
                  "text": "In \"New Leads\", Andy wears red pants.",
                  "elements": []
                },
                {
                  "text": "Throughout a number of episodes, Andy dons bow-ties in various colors.",
                  "elements": []
                }
              ]
            },
            {
              "text": "Andy tries, but invariably fails, to impress Erin:",
              "elements": [
                {
                  "text": "In \"Murder\", during a murder-mystery type game, Andy asks out Erin while seemingly in character. This leads to confusion, so Andy backs off.",
                  "elements": []
                },
                {
                  "text": "In \"Secret Santa\", Andy requests Erin for secret Santa and gives her the Twelve Days of Christmas. This backfires when Erin shows up with a scratch on her face and tales of a bird massacre by her cat. However, he appears to succeed at the end when he brings in the twelve drummers drumming.",
                  "elements": []
                }
              ]
            }
          ]
        }
      ],
      "images": []
    },
    {
      "title": "Trivia",
      "level": 2,
      "content": [
        {
          "type": "list",
          "elements": [
            {
              "text": "According to the flyer in \"Did I Stutter?\", Andy's office extension is 1022 but in season 5, \"Dream Team \", Andy says that his extension is 134.",
              "elements": []
            },
            {
              "text": "Andy prefers Drew when he returns from anger management.",
              "elements": []
            },
            {
              "text": "The writers created the Web site AngelaAndy.com in the character of Andy Bernard as he prepared for his impending wedding to Angela. The site was periodically updated during the course of Season 5.",
              "elements": []
            },
            {
              "text": "It was shown that in a deleted scene from \"The Convict\", Andy was a model and actor as a baby, but \"didn't want to make a career out of it\", despite having done so.",
              "elements": []
            },
            {
              "text": "It was revealed in \"Shareholder Meeting\" that he received 1220 on the SAT.",
              "elements": []
            },
            {
              "text": "In a deleted scene from \"Branch Wars\", Andy reveals that he was originally wait-listed at Cornell and that his father donated a building to get him in.",
              "elements": []
            },
            {
              "text": "Andy was originally named Walter Jr. by his parents but was then renamed Andrew at the age of 6, his parents believed that his younger brother better exemplified the Walter Jr. name.",
              "elements": [
                {
                  "text": "Another bit of trivia, the writers made a continuity error about Andy's father; in \"Goodbye, Toby\", Andy introduces his father as Andrew Bernard. Presumably, they forgot about this when they later named him Walter for the purposes of the joke.",
                  "elements": []
                }
              ]
            },
            {
              "text": "Andy has a sister. He mentions that his kilt in \"St. Patrick's Day\" was originally his sister's field hockey skirt.",
              "elements": []
            },
            {
              "text": "In the same episode, \"St. Patrick's Day\", in a talking-head interview about his upcoming first date with Erin, it is hinted that he enjoys the show How I Met Your Mother, when he says his first date with her has to be perfect, because that is the date that his supposedly future children will want to hear.",
              "elements": []
            },
            {
              "text": "Whenever Andy's office is shown a Cornell hockey bobblehead is seen in the background.",
              "elements": []
            },
            {
              "text": "Andy has a tattoo on his bottom of a dog with the word \"Nard\" on it. (The Incentive)",
              "elements": []
            },
            {
              "text": "After Michael left, Andy took over as the regional manager of the Scranton branch.",
              "elements": []
            },
            {
              "text": "Darryl reveals that Andy's nickname in the warehouse was \"Jelly Roll\".",
              "elements": []
            },
            {
              "text": "Andy took women's studies at Cornell and wrote a companion to The Vagina Monologues called The Penis Apologies. (The Inner Circle)",
              "elements": []
            },
            {
              "text": "Andy graduated from Cornell in 1995. This would place his year of birth at 1973, making him 40 years of age (as of 2013). However, in Livin' the Dream, Andy stated that he was 38 years of age.",
              "elements": []
            },
            {
              "text": "Andy revealed that he was obese as a child but never talks about it to anyone (Livin' the Dream).",
              "elements": []
            },
            {
              "text": "In the season 6 episode Secretary's Day, Andy says that if it weren't for secretaries he would not have a step-mother.",
              "elements": []
            },
            {
              "text": "Andy is known for being unsuccessful at sales within Dunder Mifflin, however, the quarterly sales figures above Kelly's desk in season 6 episode 2 The Meeting show him to be the branch's leading salesperson.",
              "elements": []
            },
            {
              "text": "Andy spoke to the press about the printers catching on fire. When Jo confronts the office, demanding to know who did it, Phyllis calls Andy \"Norma Rae\", trying to make him confess (Whistleblower).",
              "elements": []
            },
            { "text": "Andy owns 7% of Gamma Labs.", "elements": [] },
            {
              "text": "He appears to love the environment since he drives a 2008 Toyota Prius and later, a 2010 model of the same car.",
              "elements": []
            },
            { "text": "He wears contacts (Christening).", "elements": [] },
            {
              "text": "In Traveling Salesman Andy says he used to work at Abercrombie and Fitch",
              "elements": []
            },
            {
              "text": "Andy has had, in total, four desks at the Scranton branch. Oscar's desk while he was on a sabbatical, a desk near the bookshelves across from Creed, the third desk connected to Stanley and Phyllis', and the manager desk.",
              "elements": []
            },
            {
              "text": "Andy may wear contacts, but he hates things going into eyes, such as water. (s9e20: Paper Airplane)",
              "elements": []
            }
          ]
        }
      ],
      "images": []
    },
    {
      "title": "Quotes",
      "level": 2,
      "content": [
        {
          "type": "list",
          "elements": [
            {
              "text": "\"Big Tuna is a super ambitious guy, you know? Cut your throat to get ahead kind of guy, but I mean I'm not threatened by him. I went to Cornell, you ever heard of it? (laughs) I graduated in four years. I never studied once. I was drunk the whole time, and I sang in the acapella group, 'Here Comes Treble.'\" (\"Gay Witch Hunt\" Season 3 Episode 1)",
              "elements": []
            },
            {
              "text": "\"OK. Who put my calculator in Jell-O? Good one. But uh, seriously, guys who did this? Seriously guys, who did this? I need to know who put my calculator in Jell-O, or I'm gonna lose my freaking mind!\" (\"Gay Witch Hunt\" Season 3 Episode 1)",
              "elements": []
            },
            {
              "text": "\"And I'm also sorry that a lot of people here for some reason think it's funny to steal someone's personal property and hide it from them. Here's a little newsflash! It's not funny! In fact, it's pretty freakin' unfunny! Oh, my God!\" <punches wall> (\"The Return\" Season 3 Episode 13)",
              "elements": []
            },
            {
              "text": "\"Not only is Erin really sweet and cute... she smells like my mom.\" (\"Niagara\")",
              "elements": []
            },
            {
              "text": "\"Oh, it is on like the prawn who yawns at dawn.\" (\"Casual Friday\")",
              "elements": []
            },
            {
              "text": "\"We trade on the New-York Stock Exchange, ever heard of it? It's in New-York\"",
              "elements": []
            },
            {
              "text": "\"Name repetition, personality mirroring, and positive reinforcement.\"",
              "elements": []
            },
            {
              "text": "\"I just want one motherf*cking delicious moment!\" (\"Free Family Portrait Studio\")",
              "elements": []
            },
            {
              "text": "\"Gotta burn those boats. So I need you to put down that I was fired for theft and/or groping weiners.\" (Livin' the Dream)",
              "elements": []
            },
            {
              "text": "\"I wish there was a way to know you're in the good old days before you've actually left them.\" (Finale)",
              "elements": []
            }
          ]
        }
      ],
      "images": []
    },
    {
      "title": "Extended Family",
      "level": 2,
      "content": [
        {
          "type": "list",
          "elements": [
            {
              "text": "Howard Bernard- Paternal Grandfather (silenced whistleblowers)",
              "elements": []
            },
            {
              "text": "Elizabeth Clark- Paternal Grandmother (slept with JFK, did not fornicate, merely slept)",
              "elements": []
            },
            {
              "text": "Jonathan Dorest- Maternal Grandfather (Founded Connecticut Communist Party)",
              "elements": []
            },
            {
              "text": "Catherine Potter- Maternal Grandmother (Typist, the world record holder for one-handed typist)",
              "elements": []
            },
            {
              "text": "Walter Bernard- Paternal Great- Grandfather",
              "elements": []
            },
            {
              "text": "Patricia Coffee- Paternal Great- Grandmother (Passenger on RMS Titanic)",
              "elements": []
            },
            {
              "text": "Charles Dorset- Maternal Great- Grandfather (Lost run for Senate 3 times in a row)",
              "elements": []
            },
            { "text": "Jane Plum- Maternal Great- Grandmother", "elements": [] }
          ]
        }
      ],
      "images": []
    },
    {
      "title": "Appearances",
      "level": 2,
      "content": [
        {
          "type": "paragraph",
          "text": "Starting with Gay Witch Hunt, Andy appears and has lines in every episode, with the following exceptions:"
        },
        {
          "type": "list",
          "elements": [
            { "text": "The Convention - does not appear", "elements": [] },
            {
              "text": "Ben Franklin through Cocktails - does not appear (character at anger management training)",
              "elements": []
            },
            {
              "text": "The Deposition - speaks only in a deleted scene",
              "elements": []
            },
            { "text": "Blood Drive - does not appear", "elements": [] },
            {
              "text": "The Target through Vandalism - does not appear (character on a three-month boat trip)",
              "elements": []
            }
          ]
        }
      ],
      "images": []
    },
    {
      "title": "Relationship with other Employees",
      "level": 2,
      "content": [
        {
          "type": "list",
          "elements": [
            {
              "text": "Dwight- Since the closure of the Stamford Branch, Andy and Dwight have had strained relations for some time, stemming from his attempts to appease Michael and to date Angela. Sometime later, both have somewhat become closer and cooperative with each other but still consider each other rivals.",
              "elements": []
            },
            {
              "text": "Angela- Before Erin arrives, Andy is attracted to Angela, which angers Dwight. He originally proposes to her, but after realizing that Angela has been sleeping with both Dwight and him, he becomes furious and cancels the planned wedding. Since then, Angela and Andy have stayed away from each other. As seen in Secretary's Day, Andy appears to still have respect for Angela and thank her for planning the Secretary party for Erin. Angela does not seem to have the same level of respect for Andy and docks his pay in Angry Andy at Nellie Bertram.",
              "elements": []
            },
            {
              "text": "Erin- Andy is greatly attracted to Erin and often attempts to surprise her and go all out. As is typical for Andy, most of his attempts backfire. Andy shows his love with his gifts in Secret Santa.",
              "elements": []
            },
            {
              "text": "Jim- Jim is the first employee to meet Andy and at times is unaware of the pranks Jim pulls on him. He always referred to Jim as \"Big Tuna\" and keeps a close relationship with him. At times, however, both get annoyed with each other's antics.",
              "elements": []
            },
            {
              "text": "Michael- Like Dwight, Andy is very close to him, only Michael does not cherish the relationship as much. Previously, Michael was severely annoyed with Andy's attempts to please him, resulting in Andy to punch a hole in the wall and going off to anger management. Eventually, Michael becomes somewhat friendly with Andy but still sees Dwight closer.",
              "elements": []
            },
            {
              "text": "Darryl- Darryl and Andy become good friends throughout the show, even though at times Darryl can get very aggravated with Andy. As seen in Lotto Darryl becomes very upset when the entire warehouse crew quit because they won the lottery and Darryl’s ex-wife leaves their newly rekindled relationship for one with the warehouse workers and their lottery winnings. Darryl tells Andy to fire him or give him the manager position. Darryl tells Andy he deserved the Regional Manager position, but Andy then tells Darryl that he wasn’t even in consideration for the spot because of Darryl’s recent laziness and slacking off. Darryl accepts this and they go back on to good terms.",
              "elements": []
            },
            {
              "text": "Oscar- Andy considers Oscar to be one of his closest companions from the office. In Business Trip , Andy, Michael, and Oscar take a company trip to Canada. Later that night at the hotel bar, Andy tries to find a love interest for Oscar from among the bar patrons. That night, a drunken Oscar asks Andy why Angela hasn't slept with him yet, so Andy drunk-dials Angela, which upsets her. The next morning Oscar conspiratorially mentions the drunk-dial call, causing Andy to realize that he hadn't dreamt it, as he originally thought. ",
              "elements": []
            }
          ]
        }
      ],
      "images": []
    },
    {
      "title": "See also",
      "level": 2,
      "content": [
        {
          "type": "list",
          "elements": [
            { "text": "Andy Bernard's academic career", "elements": [] }
          ]
        }
      ],
      "images": []
    },
    {
      "title": "Mentioned In",
      "level": 2,
      "content": [
        {
          "type": "list",
          "elements": [
            {
              "text": "Cocktails, though not by name. Karen says, \"There is one [employee] in anger management.\"",
              "elements": []
            },
            { "text": "Blood Drive, by Oscar.", "elements": [] },
            { "text": "The Target, by Pete.", "elements": [] },
            { "text": "Suit Warehouse, by Pam.", "elements": [] },
            { "text": "Customer Loyalty, by Nellie.", "elements": [] }
          ]
        }
      ],
      "images": []
    },
    {
      "title": "References",
      "level": 2,
      "content": [
        {
          "type": "list",
          "elements": [
            {
              "text": "↑ In part 1 of the episode \"The Delivery\" (Season 6, episode 17), Andy tells Jim that his parents originally named him Walter Jr., but after his little brother was born when he was 6, his parents felt that the brother better represented the Walter Jr. name, so they changed his name to Andrew, which they got out of a baby name book, and named his brother Walter Jr. In the episode \"Garden Party\" (Season 8, episode 4), Andy calls his dad by his full name, revealing his middle name to be Baines, and since Andy was originally named after his father, he would’ve most likely shared the middle name Baines.",
              "elements": []
            }
          ]
        }
      ],
      "images": []
    }
  ]
}
