{"sections":[{"title":"Astrid Levinson","level":1,"content":[{"type":"paragraph","text":"Astrid Levinson is the daughter of Jan Levinson and an unknown sperm donor, possibly being Kevin Malone. Her name is the name of a Viking princess."},{"type":"paragraph","text":"Michael first realizes that Jan is pregnant with Astrid in the episode, Goodbye, Toby. In Weight Loss, Jan is still pregnant and in deleted scenes in Weight Loss, uses her pregnancy as excuses for Michael to do everything. She is first seen in the episode \"Baby Shower\". Michael believes that the originally intended name for the child was \"Astrid\". Michael later misspelled the name as \"Astird\" in front of everybody in the office."}],"images":[]},{"title":"Season 5","level":2,"content":[{"type":"paragraph","text":"She enjoys being sung to sleep by her mother and riding around in her super-high quality stroller, a $1200 model called \"The Orbit\", which Dwight proceeds to thoroughly test out of disbelief for its quality. In a deleted scene, Michael gives Astrid a Dundie plushie toy and continues to feel ambivalent about her."}],"images":[]},{"title":"Season 7","level":2,"content":[{"type":"paragraph","text":"Astrid returns in the episode \"Sex Ed\", considerably older than she was in “Baby Shower”"}],"images":[]},{"title":"Season 9","level":2,"content":[{"type":"paragraph","text":"When Pam visits Jan's new office she notices a picture of Astrid and asks Jan how she is doing. Jan then forces Pam to watch a slideshow of her performing adorable acts that Jan likely made her do to appear as though she wants to be just like her mom. Jan then makes condescending remarks about Cece to make Astrid appear better than her (The Whale)."}],"images":[]},{"title":"Trivia","level":2,"content":[{"type":"list","elements":[{"text":"Michael's choice for Astrid's name, had she been a boy, was Chevy, after comedian and actor Chevy Chase.","elements":[]}]},{"type":"list","elements":[{"text":"A popular fan theory poses that Astrid's father is actually Jan's then 17-year-old assistant Hunter Raymond.","elements":[]},{"text":"A deleted scene from \"Baby Shower\" reveals that Kevin frequents the same sperm bank Jan became pregnant with Astrid from, which means that there is a (very small) possibily that Kevin could be Astrid's father.","elements":[]}]}],"images":[]}]}