{"sections":[{"title":"Background Employees","level":1,"content":[{"type":"paragraph","text":"The following are background employees of Dunder Mifflin Paper Company throughout various offices and branches."}],"images":[]},{"title":"Dunder Mifflin Scranton","level":2,"content":[],"images":[]},{"title":"Louanne","level":3,"content":[{"type":"paragraph","text":"Louanne appears frequently in the background of many scenes in earlier episodes of the show."}],"images":[{"src":"https:\/\/vignette.wikia.nocookie.net\/theoffice\/images\/4\/47\/Luanne.jpg\/revision\/latest\/scale-to-width-down\/150?cb=20070414225009"}]},{"title":"Pilot Employees","level":3,"content":[{"type":"paragraph","text":"Early on in the show, they had not yet established their supporting cast. In the pilot, four office workers are seen that are never seen or heard from again. It is possible they were fired, went to work at a different branch, or left after hearing rumors of downsizing."},{"type":"paragraph","text":"The male employee is played by Mike McCaul."},{"type":"paragraph","text":"The red-haired woman is Meredith Palmer, played by Henriette Mantel in the pilot. (The role was subsequently recast.) Footage of Mantel walking to a filing cabinet was used in the final scene of \"Hot Girl\", though she was in the same clothing as the pilot, clearly revealing the scene as a flashback. image"},{"type":"paragraph","text":"The other two women were the real-world accountants on the show. Rainn Wilson mentions this in the DVD commentary, and Angela Kinsey and Jenna Fischer explained in their podcast that director Ken Kwapis went into the production office asking for volunteers to be background characters. The two women volunteered and thoroughly enjoyed the experience."}],"images":[{"src":"https:\/\/vignette.wikia.nocookie.net\/theoffice\/images\/0\/0a\/Pilotemployees.jpg\/revision\/latest\/scale-to-width-down\/400?cb=20070413181717"}]},{"title":"Alliance warehouse worker","level":3,"content":[{"type":"paragraph","text":"In The Alliance, this unknown warehouse worker is seen carrying boxes and walking with frequent background character Philip."}],"images":[{"src":"https:\/\/vignette.wikia.nocookie.net\/theoffice\/images\/0\/0e\/Alliancewarehouseworker.jpg\/revision\/latest\/scale-to-width-down\/100?cb=20070414230153"}]},{"title":"Basketball warehouse worker","level":3,"content":[{"type":"paragraph","text":"In the episode Basketball, this unknown Asian warehouse worker is seen in the background frequently. He is seen talking to Philip. It is possible that the character is Hide"}],"images":[]},{"title":"Sexual Harassment warehouse worker","level":3,"content":[{"type":"paragraph","text":"In the episode Sexual Harassment, this unknown warehouse worker is seen watching the sexual harassment video along with Michael, Kevin, Roy, Darryl and frequent background character Lester."}],"images":[]},{"title":"Back From Vacation warehouse workers","level":3,"content":[{"type":"paragraph","text":"These two warehouse workers were seen counting inventory in Back From Vacation."}],"images":[]},{"title":"Finale Employees","level":2,"content":[],"images":[]},{"title":"Dakota","level":3,"content":[{"type":"paragraph","text":"A year after the documentary has aired, Kevin has been fired by Dwight and Dakota has taken his place. She appears to be quite young and she is tall with blond hair. She asks Oscar about a strange mark that Kevin made on all his forms. "}],"images":[]},{"title":"Asian Employee","level":3,"content":[{"type":"paragraph","text":"A year after the documentary has aired, Nellie has left the office and now lives in Poland and a middle age Asian woman now sits at her desk. "}],"images":[]},{"title":"White Male Employee","level":3,"content":[{"type":"paragraph","text":"A year after the documentary has aired, a young white male employee now works at an unspecified job at the Scranton branch. He has brown hair that is slightly spiked. As he is only seen doing Dwight's morning excercises and making copies, it is likely he works in the annex. As Toby was fired by Dwight, it is possible he may be the new head of Human Resources. "}],"images":[]},{"title":"Malcolm","level":3,"content":[{"type":"paragraph","text":"A year after the documentary has aired, Stanley has retired and a young black male has taken his place. Phyllis is slightly stunned how after so many years with sitting across from someone as grumpy as Stanley, someone who is very nice to her sits across from her. He seems to enjoy Phyllis's snacks."}],"images":[]},{"title":"Devon","level":3,"content":[{"type":"paragraph","text":"Devon was an employee to be present in seasons 1, 2, and 9. He was fired by Michael in season 2 for budget reasons (\"Halloween\"). Then after Creed faked his own death in the baler, Dwight re-hired him saying that he always liked Devon."}],"images":[]},{"title":"Scranton Business Park","level":2,"content":[],"images":[]},{"title":"Halloween janitor","level":3,"content":[{"type":"paragraph","text":"On Halloween, Angela wonders what happened to the spider web decorations that they hung up the day before. The camera cuts to a janitor vacuuming up the spider webs."}],"images":[]},{"title":"The Carpet cleaning lady","level":3,"content":[{"type":"paragraph","text":"In The Carpet, this cleaning lady attempts to clean Michael's office's awful carpet stain. She is none-too-successful."}],"images":[]},{"title":"Night Out cleaning staff","level":3,"content":[{"type":"paragraph","text":"In Night Out, the cleaning staff unlock the parking lot gates, permitting the locked-in office staff to go home."}],"images":[]},{"title":"Dunder Mifflin Stamford","level":2,"content":[],"images":[]},{"title":"Jocelyn","level":3,"content":[{"type":"paragraph","text":"Jocelyn appeared in the episode Gay Witch Hunt. Andy explains to Jim to stay away from her because she's crazy. She is played by Ginny Moore."}],"images":[]},{"title":"Stamford employees","level":3,"content":[{"type":"paragraph","text":"These two females were frequently seen at the Stamford branch before its closing. The woman on the left appears to be the Stamford receptionist."}],"images":[]},{"title":"The Merger Stamford employee","level":3,"content":[{"type":"paragraph","text":"In the episode The Merger, this unknown character is seen sitting next to Andy on the table in the conference room. Considering all the Stamford employees were told to sit on the table, it is assumed he was once an employee at Stamford. This character, however, is never seen again."}],"images":[]},{"title":"Dunder Mifflin Corporate Office","level":2,"content":[],"images":[]},{"title":"The Negotiation corporate receptionist","level":3,"content":[{"type":"paragraph","text":"In The Negotiation, this woman appears as the receptionist at corporate. The usual receptionist however, is Grace who appears in Valentine's Day (deleted scenes), Conflict Resolution and The Job."}],"images":[]},{"title":"Beardy","level":3,"content":[{"type":"paragraph","text":"In the episode The Job, Michael explains to Jim and Karen that since he's been there a bunch of times, if they need to know anybody's names, they should ask him. Jim notices a bearded man and asks Michael who that is. Michael responds that that is \"Beardy\", obviously not knowing his name. When Jim explains that he will introduce himself, Michael stops Jim suddenly, clarifying that \"Beardy\" is simply what Michael calls him."}],"images":[]},{"title":"The Job corporate security guard","level":3,"content":[{"type":"paragraph","text":"This security guard for the corporate office escorts Jan off the premises after she is fired in The Job."}],"images":[]},{"title":"Launch Party employee","level":3,"content":[{"type":"paragraph","text":"Just after the Launch Party ends, this corporate employee approaches Michael and Dwight to tell Michael that he enjoyed his statement and that it was funny to see Ryan embarrassed. He is played by Brad Graiff"}],"images":[]},{"title":"Ryan's Secretary","level":3,"content":[{"type":"paragraph","text":"Ryan's secretary delivers the message that he has a call from \"Eddie Murphy\" (actually Michael) in the episode Local Ad. She is played by Virginia Newcomb."}],"images":[]},{"title":"Ryan's Stooges","level":3,"content":[{"type":"paragraph","text":"In The Deposition, Ryan is accompanied by two employees who dress and groom themselves in a manner similar to Ryan. The shorter one types on his Blackberry."},{"type":"paragraph","text":"In the episode \"Night Out\", the shorter one is identified as Troy."}],"images":[]},{"title":"Crime Aid corporate employee","level":3,"content":[{"type":"paragraph","text":"In Crime Aid, this woman informs Pam that she has a phone call. She is played by Jennifer Ann Burton. She is also credited in Customer Survey, though does not appear on camera."}],"images":[]},{"title":"Stephanie","level":3,"content":[{"type":"paragraph","text":"Stephanie appeared in the episode New Boss. She is David Wallace's secretary. Presumably under David's instructions, she thwarts Michael's attempts to talk to him, at one point forwarding Michael to Charles Miner's cell phone. Michael circumvents Stephanie's efforts by driving to New York to see David in person. She also appeared in the Season 6 episodes, Scott's Tots and Secret Santa."}],"images":[]},{"title":"Corporate Employees at Shareholder Meeting","level":3,"content":[{"type":"paragraph","text":"In Shareholder Meeting, these people are seen talking to each other. They are at the Dunder Mifflin Corporate Officelounge."}],"images":[]},{"title":"Shareholder Meeting Woman","level":3,"content":[{"type":"paragraph","text":"In Shareholder Meeting, this woman is seen looking worried when Oscar enters the executive lounge, upstairs in the conference center."}],"images":[]},{"title":"Dunder Mifflin Utica","level":2,"content":[],"images":[]},{"title":"Branch Wars Extra","level":3,"content":[{"type":"paragraph","text":"This employee was frequently seen in the background at the Utica branch in the episode Branch Wars. She was played by a woman named Amy who won a contest for an on-screen role on The Office. According to her report, her character is Karen's friend."}],"images":[]},{"title":"Mark (AKA Baldy)","level":3,"content":[{"type":"paragraph","text":"In the episode Lecture Circuit Part 1, Michael gives this man, Mark, the nickname \"Baldy\". He is played by Brian Patrick Mulligan."}],"images":[]},{"title":"Shirty","level":3,"content":[{"type":"paragraph","text":"In the episode Lecture Circuit Part 1, Michael nicknames this man \"Shirty\"."}],"images":[]},{"title":"Lazy Eye","level":3,"content":[{"type":"paragraph","text":"In the episode Lecture Circuit Part 1, Michael nicknames this man \"Lazy Eye\"."}],"images":[]},{"title":"Mexico","level":3,"content":[{"type":"paragraph","text":"In the episode Lecture Circuit Part 1, Michael nicknames this man \"Mexico\"."}],"images":[]},{"title":"Sugar Boobs","level":3,"content":[{"type":"paragraph","text":"In the episode Lecture Circuit Part 1, Michael nicknames this woman \"Sugar Boobs\"."}],"images":[]},{"title":"Black Woman","level":3,"content":[{"type":"paragraph","text":"In the episode Lecture Circuit Part 1, Michael nicknames this woman \"Black Woman\"."}],"images":[]},{"title":"Other Utica Employees","level":3,"content":[{"type":"paragraph","text":"In the episode Lecture Circuit Part 1, these employees are also seen in Utica's conference room."}],"images":[]},{"title":"Dunder Mifflin Nashua","level":2,"content":[],"images":[]},{"title":"Nashua employees","level":3,"content":[{"type":"paragraph","text":"The employees of the Dunder Mifflin Nashua branch are briefly seen in their local ad waving to the camera. They are seen in much greater detail in the episode, Lecture Circuit Part 2, from Season 5"}],"images":[]},{"title":"Dunder Mifflin Buffalo","level":2,"content":[],"images":[]},{"title":"Jennie Tan","level":3,"content":[{"type":"paragraph","text":"Jennie Tan set up a website at Dunder Mifflin Buffalo. Her job is unknown. She is played by Jennie Tan."}],"images":[]},{"title":"Mark","level":3,"content":[{"type":"paragraph","text":"Mark was seen in the volleyball game between Scranton and Buffalo. He is portrayed by Brian Stack."}],"images":[]},{"title":"Lipophedrine Diet Pill Company","level":2,"content":[],"images":[]},{"title":"Man 1","level":3,"content":[{"type":"paragraph","text":"Man 1 is one of the employees of the Lipephedrine Diet Pill Company in \"Money\"."}],"images":[]},{"title":"Pregnant Woman","level":3,"content":[{"type":"paragraph","text":"Pregnant Woman is the wife of Man 1 and an employee of the Lipephedrine Diet Pill Company. Like her husband and some other employees, she finds Michael to be a nice guy and invites him for drinks after work."}],"images":[]},{"title":"Young Man","level":3,"content":[{"type":"paragraph","text":"Young Man is an employee of the Lipephedrine Diet Pill Company. He was one of the employees who took a liking to Michael and stated that he should review movies when Michael gave a comparison of Die Hard with Live Free or Die Hard."}],"images":[]}]}