{"sections":[{"title":"Bandit","level":1,"content":[{"type":"paragraph","text":"Bandit is Angela Martin's cat."}],"images":[{"src":"https:\/\/vignette.wikia.nocookie.net\/theoffice\/images\/1\/1f\/Bandit.png\/revision\/latest\/scale-to-width-down\/220?cb=20190920201312","caption":""}]},{"title":"Garbage vs Bandit controversy ","level":2,"content":[{"type":"paragraph","text":"Many people consider Garbage and Bandit to be the same cat, thinking that  when Andy gave Garbage to Angela, she named him Bandit and raised him in the office cabinet drawer."},{"type":"paragraph","text":"However this theory is not supported by the evidence. The last time garbage is seen is when Angela allows Andy to take her on a date. Since then, every time we see Bandit, it's a different cat than Garbage can be discernible by his fur pattern."}],"images":[{"src":"https:\/\/vignette.wikia.nocookie.net\/theoffice\/images\/b\/b5\/Badit_vs_garbage.png\/revision\/latest\/scale-to-width-down\/294?cb=20190618193735","caption":"Garbage(Left), Bandit (Right)"}]},{"title":"Season 5","level":2,"content":[{"type":"paragraph","text":"When Dwight sets the office on fire, Angela gets Bandit and yells to Oscar, who is in the ceiling, to \"Save Bandit!\" Angela then throws the cat up into the ceiling, until it falls down on to the other side of the office."},{"type":"paragraph","text":"Pam explains that copiers go through \"normal wear and tear\", which includes, in a cutaway, Bandit chewing on the wires and being scolded by Angela."}],"images":[]},{"title":"Season 6","level":2,"content":[{"type":"paragraph","text":"Jim tries to prove that he can put a diaper on anything. He does so to Bandit, with Angela looking at him, angered. "}],"images":[]},{"title":"Season 9","level":2,"content":[{"type":"paragraph","text":"When Angela and the Senator become separated, Angela, Phillip, and her many cats, including Bandit move into a small studio apartment (Paper Airplane)."},{"type":"paragraph","text":"Bandit is taken away by Animal Control after one of Angela's neighbors reported the number of cats she had which was more than the number of pets allowed in her studio apartment (Livin' the Dream)."}],"images":[]}]}