{"sections":[{"title":"Billy Merchant","level":1,"content":[{"type":"paragraph","text":"William \"Billy\" Merchant, is a fictional character played by Marcus A. York in the television series The Office. He was the building owner of the Scranton Business Park however Dwight buys it from him at the end of Season 6."}],"images":[]},{"title":"Season 2","level":2,"content":[{"type":"paragraph","text":"Billy is the property manager of Scranton Business Park. He has used a wheelchair since the age of four and claims, \"I don't really notice it any more.\" Billy uses Michael's invitation to the disability seminar to remind the employees of some of the rules for parking, including observing someone parked in the handicapped parking space."},{"type":"paragraph","text":"He attends Casino Night with his girlfriend, a waitress at Chili's, whom Michael mistakes for his nurse."}],"images":[]},{"title":"Season 3","level":2,"content":[{"type":"paragraph","text":"Once a year, Billy Merchant arranges for a pretzel cart to be brought into the lobby of the Scranton Business Park to give away free pretzels \"as a thank-you for our loyal tenants.\" (\"Initiation\")"}],"images":[]},{"title":"Season 4","level":2,"content":[{"type":"paragraph","text":"Billy was present at the Fun Run. He is not referred to throughout the episode however he is seen on numerous occasions, notably when passing Michael after he gives up during the Fun Run."}],"images":[]},{"title":"Season 5","level":2,"content":[{"type":"paragraph","text":"When Michael starts the \"Michael Scott Paper Company\" he calls Billy to find an office space. Billy has all of his property booked up however save for a storage closet in the Slough Avenue Business Park. Michael is hesitant to take it at first as it would be embarrassing to work next to the old office he left however he eventually takes it. Billy is with them when they enter the closet and Michael decides he will take it."}],"images":[]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":"The Injury","elements":[]},{"text":"Casino Night","elements":[]},{"text":"Initiation (voice)","elements":[]},{"text":"Fun Run","elements":[]},{"text":"Dream Team","elements":[]}]}],"images":[]}]}