{"sections":[{"title":"Bob Vance, Vance Refrigeration","level":1,"content":[{"type":"paragraph","text":"Robert \"Bob\" Vance is a fictional character played by Bobby Ray Shafer in the television series The Office."}],"images":[]},{"title":"Character Information","level":2,"content":[{"type":"list","elements":[{"text":"He owns Vance Refrigeration, which is in the same building and the same floor as Dunder Mifflin Scranton.","elements":[]},{"text":"He is married to Phyllis Vance as of Phyllis' Wedding","elements":[]}]},{"type":"list","elements":[{"text":"He always introduces himself as, \"Bob Vance, Vance Refrigeration.\". He will even do this multiple times in succession if meeting multiple new people at the same instant as in the episode \"Christmas Party \"","elements":[]},{"text":"He may or may not be a major Scranton Mob boss (The Outburst)","elements":[]},{"text":"Vance Refrigration may or may not be a money laundering front (The Outburst)","elements":[]}]}],"images":[]},{"title":"Season 2","level":2,"content":[{"type":"paragraph","text":"Phyllis introduces Kevin, Stanley, and Ryan to Bob when he attends the office Christmas party. As he shakes their hands he introduces himself with \"Vance Refrigeration\" tacked on at the end of his name. An awkward silence then leads Ryan to ask, \"So, what line of work are you in, Bob?\" (Christmas Party)."},{"type":"paragraph","text":"In Valentine's Day, Bob sends Phyllis an huge amount Valentine gifts including two arrangements of flowers and a gigantic teddy bear, much to Pam's annoyance."},{"type":"paragraph","text":"Bob donated a mini refrigerator as the prize for most chips winner in Casino Night."}],"images":[]},{"title":"Season 3","level":2,"content":[{"type":"paragraph","text":"In the season opener, Phyllis announces she is engaged to Bob Vance. Later, when he hears of the impending shutdown of Dunder Mifflin Scranton, he offers to buyout their warehouse space, thus ensuring Darryl, Roy and the other warehouse workers remain employed."},{"type":"paragraph","text":"In the episode Initiation , Bob Vance is standing in line to get a free pretzel. Phyllis comes up to him to give him a hug and a kiss in an attempt to cut the line, but is booed to the back by Michael and Stanley. "},{"type":"paragraph","text":"In mid-season, Bob marries Phyllis. At the wedding he is introduced as Bob Vance, Vance Refrigeration as usual."}],"images":[]},{"title":"Season 4","level":2,"content":[{"type":"paragraph","text":"Bob Vance was present at the Fun Run. In this episode, Phyllis mentions that Bob is Unitarian and she is Lutheran, so it \"keeps things spicy\"."},{"type":"paragraph","text":"In the episode Chair Model, W.B. Jones Heating & Air goes under renovations and their construction vehicles take up parking spaces. As a result of this, the leaders of the \"Five Families\" of the business park are called to discuss the parking problem. The problem is resolved quickly."}],"images":[]},{"title":"Season 5","level":2,"content":[{"type":"paragraph","text":"In the episode Crime Aid Bob attends Michael and Holly's crime aid auction and bids on a weekend at David Wallaces home in Martha's Vineyard. Bob also pays $1000 for a hug from Phyllis, beating out David and Dwight."},{"type":"paragraph","text":"In Stress Relief Phyllis states that Bob wishes she wouldn't call her sister so much, implying that the two don't get along. Bob is amused at Michael's roast and yells \"Yeah\" when Kelly Kapoor says she would rather make out with a fridge than with Michael."},{"type":"paragraph","text":"In the episode Blood Drive, Bob and Phyllis go on a double date with Pam and Jim on Valentines day, and engage in sexual intercourse in the bathroom."}],"images":[]},{"title":"Season 6","level":2,"content":[{"type":"paragraph","text":"Bob dresses up as Santa for Vance Refrigeration."}],"images":[]},{"title":"Season 7","level":2,"content":[{"type":"paragraph","text":"Bob Vance was present at the office's Halloween Party and was dressed as Dirty Harry (Costume Contest)."}],"images":[]},{"title":"Season 9","level":2,"content":[{"type":"paragraph","text":"Bob attends Roy Anderson's wedding along with Phyllis. When Roy reveals to his new bride that he got lessons on how to sing and play the piano he sings a song about his new wife while Bob and Phyllis begin to make out much to Pam and Jim's disgust (Roy's Wedding)."},{"type":"paragraph","text":"After the episode The Target aired, NBC put up several customer complaint cards that appeared in the episode. Bob Vance filed a complaint to Andy citing that he saw Dwight driving a bike across a wire citing the event that occurred in New Guys."},{"type":"paragraph","text":"Bob is seen dancing with Phyllis in the background during Dwight and Angela's wedding. (Finale)"}],"images":[]},{"title":"Trivia","level":2,"content":[{"type":"list","elements":[{"text":"Bob Vance prefers to be called \"Bob Vance, Vance Refrigeration\". He is even called that during his wedding ceremony. It is possible that he does this to advertise his business through the documentary.","elements":[]},{"text":"He is a member of the \"Five Families\" or the 5 owners of the businesses in Scranton Business Park.","elements":[]},{"text":"Phyllis tells stories about where she presents herself to other men, then Bob comes out and beats them up, showing him to be a bit combative. This was also present when Michael was ruining the Christmas Party where Phyllis was Santa, and he comes up looking to fight Michael.","elements":[]}]}],"images":[]},{"title":"Quotes","level":2,"content":[{"type":"list","elements":[{"text":"\"Bob Vance, Vance Refrigeration\"","elements":[]}]}],"images":[]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":"Christmas Party","elements":[]},{"text":"Casino Night","elements":[]},{"text":"Initiation","elements":[]},{"text":"Ben Franklin","elements":[]},{"text":"Phyllis' Wedding","elements":[]},{"text":"Women's Appreciation (deleted scenes)","elements":[]},{"text":"Fun Run","elements":[]},{"text":"Chair Model","elements":[]},{"text":"Goodbye, Toby","elements":[]},{"text":"Crime Aid","elements":[]},{"text":"Stress Relief","elements":[]},{"text":"Blood Drive","elements":[]},{"text":"Café Disco","elements":[]},{"text":"Niagara","elements":[]},{"text":"Secret Santa","elements":[]},{"text":"Happy Hour","elements":[]},{"text":"Golden Ticket","elements":[]},{"text":"Costume Contest","elements":[]},{"text":"Roy's Wedding","elements":[]},{"text":"Dwight Christmas","elements":[]},{"text":"Finale","elements":[]}]}],"images":[]}]}