{"sections":[{"title":"Carol Stills","level":1,"content":[{"type":"paragraph","text":"Carol or Carole Stills is a fictional character played by Nancy Carell, Steve Carell's actual wife, in the television series The Office."}],"images":[]},{"title":"Season 2","level":2,"content":[{"type":"paragraph","text":"Carol is the real estate agent who sells Michael his condo in Office Olympics. When Dwight accompanies Michael to the closing, she at first suspects that the two might be a homosexual couple."}],"images":[]},{"title":"Season 3","level":2,"content":[{"type":"paragraph","text":"Season 3 During the summer, Michael continued to see Carol (Gay Witch Hunt*) and the two then developed a sexual relationship (Initiation)."},{"type":"paragraph","text":"In a talking head interview in the episode Diwali, Michael relates that he tried to take Carol on a spooky hayride for $70 per person, but she is allergic to hay and prefers not to take unnecessary medicine. Michael's offer to loan her the $70 does not convince her to change her mind."},{"type":"paragraph","text":"Michael invites Carol to a Diwali festival, where she dresses as a cheerleader after being incorrectly informed by Michael that the holiday is an Indian version of Halloween. During the event, Michael takes the microphone and publicly proposes marriage. She declines, explaining privately that the Diwali party is only their ninth date, and leaves Michael to find his way home on his own."},{"type":"paragraph","text":"In A Benihana Christmas, Carol stops by the office to confront Michael for sending out Christmas cards containing a picture of Carol, her ex-husband, and her two children on a skiing vacation, but with Michael's head pasted over the head of her ex-husband, and she breaks up with him. Michael's offer to take her on a vacation to Jamaica does not sway her."},{"type":"paragraph","text":"During lunch at Benihana, Michael calls Carol to ask her what he did wrong. Carol discussed over an extended amount of time why she decided to break up with him, even though the audience cannot hear the conversation."},{"type":"paragraph","text":"The heartache of the breakup sends Michael into the arms of Jan Levinson."}],"images":[]},{"title":"Season 7","level":2,"content":[{"type":"paragraph","text":"In Sex Ed, Michael goes to a house that she is showing to a client to say that he had herpes and that he might have caught it from her back when they were together. Carol says that Michael makes a bigger deal out of things like a relationship and so that it was right to break up with him."}],"images":[]},{"title":"Season 9","level":2,"content":[{"type":"paragraph","text":"In Finale, Carol has been hired by Pam to sell the Halpert home without Jim's knowledge. She is showing a house to a potential buyer when the Halperts return home, exposing Pam's secret. The visitors choose to buy the house, allowing the Halperts to move to Austin."}],"images":[]},{"title":"Trivia","level":2,"content":[{"type":"list","elements":[{"text":"Actress Nancy Walls is married to Steve Carell, who plays Michael Scott.","elements":[]},{"text":"In Diwali, after Michael proposes, Carol says that it's only our \"ninth date\". But in Sex Ed, she says that Michael proposed to her on their \"fourth date\".","elements":[]}]}],"images":[]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":"Office Olympics","elements":[]},{"text":"Michael's Birthday","elements":[]},{"text":"Casino Night","elements":[]},{"text":"Diwali","elements":[]},{"text":"A Benihana Christmas","elements":[]},{"text":"Sex Ed","elements":[]},{"text":"Finale","elements":[]}]}],"images":[]},{"title":"Mentioned in","level":2,"content":[{"type":"list","elements":[{"text":"Initiation","elements":[]},{"text":"Launch Party","elements":[]},{"text":"The Cover-Up","elements":[]}]}],"images":[]},{"title":"References","level":2,"content":[{"type":"list","elements":[{"text":"↑ Threat Level Midnight","elements":[]}]}],"images":[]}]}