{"sections":[{"title":"Clients of Dunder Mifflin","level":1,"content":[{"type":"paragraph","text":"This page is a listing of Clients of Dunder Mifflin. This includes present clients, past clients, and potential clients."}],"images":[]},{"title":"Mr. Deckert","level":2,"content":[{"type":"paragraph","text":"Mr. Deckert is a client of Dunder Mifflin. His sales representative is Jim. In the episode Diversity Day, Jim spends the entire day trying to get a hold of Mr. Deckert in order to make the biggest sale of the year. The one call to this client makes up 25% of Jim's commission yearly. His attempts at making the sale are continually foiled by Dwight making noise, Michael calling meetings, etc. When Jim is finally successful at getting through to Mr. Decker, he discovers that Dwight has stolen his client."}],"images":[]},{"title":"Christian","level":2,"content":[{"type":"paragraph","text":"Christian is a representative of Lackawanna County and was a potential client of Dunder Mifflin."},{"type":"paragraph","text":"In the episode The Client, Christian meets with Michael and Jan at a Chili's restaurant for a business meeting. Michael and Christian hit it off and Michael makes a successful sale, which leads to Michael and Jan (so certain that the meeting would be a failure that she was falling-down drunk by the time Michael closed the deal) kissing for the first time."},{"type":"paragraph","text":"Christian is played by Tim Meadows, and his last name is unknown..."}],"images":[{"src":"https:\/\/vignette.wikia.nocookie.net\/theoffice\/images\/7\/7a\/Christian.jpg\/revision\/latest\/scale-to-width-down\/150?cb=20060602180212"}]},{"title":"Unnamed Client #1 from Traveling Salesmen","level":2,"content":[{"type":"paragraph","text":"In Traveling Salesmen, Michael and Andy visit a potential client. Andy undermines Michael's sales pitch, and they fail to land the sale.."}],"images":[{"src":"https:\/\/vignette.wikia.nocookie.net\/theoffice\/images\/5\/53\/TravelingSalesmenClient1.png\/revision\/latest\/scale-to-width-down\/150?cb=20090420203606"}]},{"title":"Kenny","level":2,"content":[{"type":"paragraph","text":"Kenny is a client of Dunder Mifflin Scranton. His sales representative is Phyllis and Karen. Phyllis and Karen win a big order from Kenny in Traveling Salesmen when Phyllis changes their hair and make-up to match that of Kenny's wife, Susie."}],"images":[]},{"title":"Julius","level":2,"content":[{"type":"paragraph","text":"Julius is a client of Dunder Mifflin Scranton. His sales representatives are Stanley and Ryan."},{"type":"paragraph","text":"Stanley leaves Ryan to attempt to land a sale from Julius, knowing that Ryan will fail miserably."}],"images":[]},{"title":"Unnamed Client #2 from Traveling Salesmen","level":2,"content":[{"type":"paragraph","text":"In Traveling Salesmen, Jim and Dwight land a sale from an unnamed client by demonstrating Dunder Mifflin's superior customer service."}],"images":[{"src":"https:\/\/vignette.wikia.nocookie.net\/theoffice\/images\/7\/7b\/TravelingSalesmenClient2.png\/revision\/latest\/scale-to-width-down\/150?cb=20090420204151"}]},{"title":"Barbara Allen","level":2,"content":[{"type":"paragraph","text":"Barbara Allen is a client of Dunder Mifflin Scranton who was affected by the inappropriate watermark in the episode Product Recall."},{"type":"paragraph","text":"Michael decides to call a press conference where he would apologize to Barbara and reward her with a check for 6 months of free paper products or 25 reams of paper (whichever comes first). Barbara is not accepting of Michael's apology and asks for his resignation. This prompts Michael to make a video explaining why he cannot and should not resign. Pam films this video with a handheld camcorder from Michael's desk and assures him that it is \"his best apology video yet\"."},{"type":"paragraph","text":"Barbara is played by Lisa Darr."}],"images":[]},{"title":"Dunmore High School","level":2,"content":[{"type":"paragraph","text":"Dunmore High School is a client of Dunder Mifflin Scranton. Their sales representative is Jim."},{"type":"paragraph","text":"In the episode Product Recall, Jim and Andy visit the school to apologize for the inappropriate watermark which the school unwittingly used for their prom invitations."},{"type":"paragraph","text":"The principal is played by Jim Jansen."}],"images":[]},{"title":"Aaron Grandy","level":2,"content":[{"type":"paragraph","text":"Aaron is an attorney with Stone, Cooper, and Grandy: Attorneys at Law. They are former clients of Dunder Mifflin Scranton."},{"type":"paragraph","text":"When Ryan unveils Dunder Mifflin Infinity (Dunder Mifflin's new interactive website), Michael decides to combat the new technology by attempting to win back clients with gift baskets. Aaron is one of these unfortunate clients. Aaron hesitantly accepts Michael's generous gift, but still decides against re-signing Dunder Mifflin as his paper provider."},{"type":"paragraph","text":"After Michael has an unfortunate incident with a GPS system, he insists that technology is evil, as it \"tried to kill him\". He and Dwight march back to the law office and demand back their gift basket from Aaron, causing a scene."},{"type":"paragraph","text":"He is played by Kevin Dorff."}],"images":[]},{"title":"Larry Meyers","level":2,"content":[{"type":"paragraph","text":"Larry Meyers is a former client of Dunder Mifflin Scranton. He had previously closed his account to switch over to Office Depot."},{"type":"paragraph","text":"Like, Aaron Grandy, Michael and Dwight visit Larry in the episode Dunder Mifflin Infinity. He accepts the gift basket, but still opts not to re-sign Dunder Mifflin as his paper provider."},{"type":"paragraph","text":"He is played by Edward James Gage."}],"images":[]},{"title":"Phil Maguire","level":2,"content":[{"type":"paragraph","text":"Phil Maguire is a businessman in Scranton."},{"type":"paragraph","text":"In \"Job Fair\", Jim, Andy, and Kevin meet him for a game of golf to discuss making him a client of Dunder Mifflin Scranton. Due to Andy and Kevin's antics, Phil loses interest in the business deal; however, Jim explains that he brought them because the client would enjoy a wager and hates Cornell. Eventually, Jim is able to land his account by blocking Phil's car for 15 minutes."},{"type":"paragraph","text":"He is played by Phil Reeves."}],"images":[]},{"title":"Canadian client","level":2,"content":[{"type":"paragraph","text":"In the episode Business Trip, Michael, along with Andy and Oscar, is sent on a business trip to Canada by David Wallace to meet with a potential client."},{"type":"paragraph","text":"Michael's meeting with the client went well as they signed a two-year agreement. During the meeting, however, Michael came to realize how hurt he was that Holly was transferred away from him by corporate."},{"type":"paragraph","text":"The client is played by Tony Pasqualini."}],"images":[]},{"title":"Julia","level":2,"content":[{"type":"paragraph","text":"Julia was originally a client of Stanley. In Lecture Circuit Part 1, Stanley trades her for two of Andy's clients when Andy expresses a romantic interest in her. Andy's attempts at wooing Julia are unsuccessful, and he also loses the account."}],"images":[]},{"title":"Tom","level":2,"content":[{"type":"paragraph","text":"Tom represents Blue Cross of Pennsylvania, Dunder Mifflin Scranton's biggest client. Tom's sales representative is Jim."},{"type":"paragraph","text":"In Golden Ticket, Blue Cross ends up with all of the discount coupons, entitling them to a total of 50% off their paper orders for the entire year. The disaster turns into a windfall when Blue Cross is so impressed by the promotion that they choose to make Dunder Mifflin their exclusive provider of office supplies."}],"images":[]},{"title":"Russel","level":2,"content":[{"type":"paragraph","text":"Russel was a client that Pam landed in the episode \"Michael Scott Paper Company\". He asks about the company at Michael's pancake luncheon. He later calls to inform them he would like to do business with them. Pam becomes excited because this was her first sale. When the Michael Scott Paper Company was bought out he was likely brought in. It is unknown if Pam kept him as her client."}],"images":[]},{"title":"Daniel Schofield","level":2,"content":[{"type":"paragraph","text":"Daniel Schofield is an executive with Harper Collins and currently a customer of Dunder Mifflin Scranton. His sales representative is Dwight."},{"type":"paragraph","text":"In the episode Heavy Competition, Michael tries to convince Dwight's top client to leave Dunder Mifflin and take his business to the Michael Scott Paper Company. Upon the company's buyout, he was likely given back to Dwight."},{"type":"paragraph","text":"Daniel Schofield is played by Bob Gebert"}],"images":[]},{"title":"Earl","level":2,"content":[{"type":"paragraph","text":"Dwight successfully steals a client from the Syracuse Branch after the Binghamton branch closed leaving all the clients up for grabs."}],"images":[]},{"title":"Mr. Rammel","level":2,"content":[{"type":"paragraph","text":"Mr. Rammel is the CEO of \"Prestige Postal Company\". A very important client of the Binghamton branch that was up for grabs after it was shut down. Jim, Dwight and Syracuse salesman Harry Jannerone all battle for his business however Andy sneaks in and lands him. After Andy becomes Regional Manager of the Scranton branch again he likely gave him to one of the sales representatives."}],"images":[]},{"title":"Gina Rogers","level":2,"content":[{"type":"paragraph","text":"Gina Rogers worked for Apex Technology. Her sales representative was Dwight. During the meeting he continuously mispronounced her name. Phyllis brings her up as an example as to why Dwight does not do well with female clients. The NBC website lists her name as \"Masterson\" however."}],"images":[]},{"title":"Jan Levinson","level":2,"content":[{"type":"paragraph","text":"Jan Levinson is the CEO of \"White Pages\" a phone book company. She originally only wants to wave this massive client in David Wallace's face to show him how powerful she had become in the episode The Whale. When Pam and Dwight shows up she has no intention of doing business with Dunder-Miflin. However when Dwight brings Clark in she becomes attracted to him and agrees to buy from them."}],"images":[]},{"title":"East Pennyslvania Seminary","level":2,"content":[{"type":"paragraph","text":"East Pennyslvania Seminary is a client of Dunder-Miflin that filed a complaint against Meredith after she called them \"a sausage fest\"."}],"images":[]},{"title":"Haymont Tires","level":2,"content":[{"type":"paragraph","text":"Haymont Tires is a former client of Dunder-Miflin that Pam purposefully insulted in order to get a customer complaint however she inadventedly insults the client's recently deceased mother causing the client to not only file a complaint but also dropping Dunder-Miflin as their paper supplier causing Pam to lose a client altogether."}],"images":[]},{"title":"Down! The Pet Emporium","level":2,"content":[{"type":"paragraph","text":"Down! The Pet Emporium is presumably a pet store that is a client of Dunder-Miflin Scranton. In a complaint card showed on NBC's website, a woman named Cassandra who worked there called about a late shipment and was transferred to Clark. Clark proceeded to hit on her and ask her sevral personal questions causing her to later complain about him. "}],"images":[]},{"title":"Tract Industries","level":2,"content":[{"type":"paragraph","text":"Tract Industries is a company that is a client of Dunder-Miflin. It complained about Darryl as seen in a complaint card  on NBC's website. "}],"images":[]},{"title":"Stone & Son Suit Warehouse","level":2,"content":[{"type":"paragraph","text":"Dwight and Clark go after this client after it loses its paper provider. They pretend to be a father and son sales team in order to better appeal to the father and son who run the company. They are presumably a high profile client as David Wallace tells Dwight about them."}],"images":[]}]}