{"sections":[{"title":"Creed Bratton","level":1,"content":[{"type":"paragraph","text":"For the actor, see Creed Bratton"},{"type":"paragraph","text":"Creed Bratton (claims to have been born November 1, 1925) is a character from the U.S. television series The Office. Confusion may arise from the fact that the character is played by and partially based on the musician of the same name, Creed Bratton. Unlike most characters of this version of The Office, he has no analog in the original BBC series despite sharing similar lines in the pilot episode with the character of Malcolm. B.J. Novak has said that the actual Creed Bratton is exactly like the character he plays, except that the real Creed is a good-hearted and likable person, while his character has a very dark side to him."},{"type":"paragraph","text":"Creed is a deviant and probable sociopath employed at the Scranton branch of paper distributor Dunder Mifflin as a quality assurance director. He is a mysterious figure who is prone to saying bizarre, disturbing, or confusing statements on a regular basis. As a result of heavy drug use during his former career as a rock musician in the 1960s, Creed has an incredibly poor memory. At one point, he can't even recall his official job title of Quality Assurance Director, instead of calling it \"Quabitty Assuance\", and later stating that he should have written it down. He unapologetically forgets the names of his own co-workers frequently, having referred to Angela as \"Andrea\", \"Pumpkin\" and \"the office bitch\", Stanley as \"Sammy\", Meredith as \"Mary Beth\", \"the redhead\", or \"the chick Michael hit with the car\", Andy as Jim, Oscar as \"Ace\", Dwight as \"Cheroot\" and Darryl as \"Darnell\". However, he usually remembers Pam's name, (although he has also referred to her simply as \"the receptionist\" even forgetting what her name was in an episode, asking, \"Which one is Pam?\") and in Night Out, he was ironically the only one to know the name of Hank, the security guard. He also referred to Jim as \"the tall guy\" when Michael asked about what had happened after his engagement announcement. He also thought that Jim & Pam were brother and sister, rather than a couple. In The Convention, he introduces himself to Meredith, implying that he thinks she just started working at Dunder Mifflin."},{"type":"paragraph","text":"In the episode Take Your Daughter to Work Day, Creed reveals that he had four toes on his right foot and attempts to show it to the group of children. In Casual Friday, he reveals he has a daughter and tries to hook Jim up with her when Jim says he already is engaged to Pam, Creed says \"I thought you were gay?\". Despite all of this, Creed has a rather cheery disposition most of the time and is consistently tolerated, or even included by his fellow coworkers."},{"type":"paragraph","text":"In Cocktails he is greeted by teenagers who compliment him, and then Creed admits on camera he runs a small fake id company in his car with a laminating machine he stole from the \"sheriff station\"."},{"type":"paragraph","text":"Little is known about Creed's life outside the office; the scattered details that emerge are invariably bizarre, and it is unknown how much of what he says is true. For example, in The Carpet, when Creed discovers the smell of what is implied to be feces in Michael's office he says, \"Is someone making soup?\""},{"type":"paragraph","text":"He is also extremely dishonest, with many vague details emerging of his countless scams, including faking his own death, and in Fun Run he admits to being involved in many religious cults, claiming that \"you have more fun as a follower, but you make more money as a leader\". He is an apparent kleptomaniac and regularly steals items from coworkers, charity drives, and even tears off a card from a gift at Phyllis' wedding in order to pretend that it's his. When asked his age, the reply varies wildly depending upon what suits him at the time. In Fun Run, Creed states that he will soon be 82. In the next episode, Dunder Mifflin Infinity, he attempts to look young by dying his hair black (with ink from a printer cartridge from a printer in the office) and saying that he is 30 years old. He then corrects himself, saying that he'll be 30 in November. During the poker game in Casino Night, Creed admits to stealing things very frequently and describes it as \"just something that I do\". For example, he steals large amounts of poker chips in order to win the refrigerator during the same episode. "},{"type":"paragraph","text":"In Money, while explaining how he never goes bankrupt, he holds up a U.S. passport issued under the name \"William Charles Schneider\"—which is actor Creed Bratton's actual birth name, and the passport shown is Bratton's passport in real life. He proudly explains that whenever he feels that he is in danger of being found out (by the police or otherwise), he simply creates a new false identity and disappears. The passport he shows indicates that he was born on February 8, 1943, in California, the real Creed Bratton's birthdate and place of birth."},{"type":"paragraph","text":"Creed seems to apparently be working towards a sort of retirement involving scuba diving, in Gossip stating, \"If I can't scuba, then what's this all been about? What have I been working towards?\". Creed's favorite thing to eat on his birthday is peach cobbler (Survivor Man). Creed drives an 80's Lincoln Town Car, a car that Michael believes was named after the first president in New Leads (Michael erroneously believes Abraham Lincoln was the first president of the United States)."},{"type":"paragraph","text":"He has admitted to having been formerly homeless at some point prior to working at Dunder Mifflin, stating that his job there is the only thing separating him from an actual homeless man and that he is willing to do anything in order to keep the said job (Product Recall)."},{"type":"paragraph","text":"Whenever the computer monitor at his desk is shown on camera, it almost always shows him absently playing a game of Solitaire."}],"images":[]},{"title":"Character history","level":2,"content":[{"type":"paragraph","text":"A dead product of the 60s, Creed is older than all of the other employees. Prior to joining Dunder Mifflin, he was most notably a member of the rock band The Grass Roots in the late 60s (as was the real-life Creed Bratton). Creed still relates to his years in the 60s while toking on the finest herb around; cannabis. One can assume that he correctly identifies the strain of cannabis (\"Northern Lights\" Cannabis indica) in a picture Dwight shows him. In the episode Baby Shower, Jan talks about giving birth in a birthing pool and says the afterbirth floats. Creed then comments on how it must be like the tide at Omaha Beach. This could imply that Creed served in the US Amry fought on D-Day and his age does support that theory."},{"type":"paragraph","text":"Creed was originally hired by then-regional manager Ed Truck. He now serves as the quality assurance manager. Creed can be counted on to shirk nearly all responsibility, ranging from informal office duties such as spring cleaning to his primary job responsibilities."},{"type":"paragraph","text":"Outside of work, Creed teeters on the edge of homelessness and has professed his willingness to do whatever it takes to avoid becoming homeless again. He lives in Toronto, spending three nights a week there in order to milk the welfare state, and surreptitiously sleeps under his desk the remainder of the week. However, since this was revealed in a deleted scene, it may not be considered wholly canonical. In another episode, he reveals to Jim that he lives in Scranton near \"the quarry,\" and invites Jim to \"throw things down there\" with him."},{"type":"paragraph","text":"Creed appears not to be bound by moral guidelines, exhibited most notably by his kleptomania. The episode Casino Night provides the first glimpse into this side of Creed's personality. He steals gambling chips in order to win the evening's prize, and admits in a talking head interview, \"I love stealing things.\" and \"Oh, I steal things all the time. It's just something I do. I stopped caring a long time ago. \" Once revealed, his kleptomania returns in subsequent episodes, either explicitly or implied. For example, he takes a toy from a toy drive drop box and returns $40 to Michael; when Michael says that he didn't give Creed the money, Creed tells him, \"In a way, you did,\" implying that he stole it from Michael's wallet. He has been caught stealing at least twice by Jim. In the episode Local Ad, Jim buys breakfast for Pam because she slept at her desk all night. When she wakes, Jim explains that Creed snatched her hash browns while she was asleep on her keyboard."},{"type":"paragraph","text":"Creed's lack of shame or morals extends beyond mere kleptomania. He places his wedding card on another guest's gift and continues to stare at Pam's chest when she wears a low-cut sweater. When she asks him to stop, he serenely says, \"In a minute.\" He even submits a formal complaint to Toby that says that he \"is sick of looking at the redhead all day, and wants a seat facing the receptionist.\" In a deleted scene, Creed says that he has a friend named Jorge who will hook Toby up with anything he wants, including \"this amazing coffee that you snort\"."},{"type":"paragraph","text":"Creed has likely been arrested multiple times, as he assumed he needed a profile shot for his ID photo."},{"type":"paragraph","text":"Little is known of Creed's childhood. In an interview, Creed explains that he was left on a doorstep and adopted by a Chinese family, which also explains his ability to speak Mandarin Chinese. He explains that the family bound his feet, unaware that the practice was traditionally restricted to young girls; he lost a toe in the process. He has tried to show off his four toes in many episodes. Creed also claims that he was in an iron lung when he was a child."},{"type":"paragraph","text":"Creed writes a blog called CreedThoughts. He believes its URL is www.creedthoughts.gov.www\\creedthoughts, but his \"blog\" is actually a Microsoft Word document set up by Ryan, wanting to \"protect the world from being exposed to Creed's brain\". Describing the content of the blog, Ryan says, \"Even for the Internet, it's...pretty shocking.\""}],"images":[]},{"title":"Season 1 and 2","level":2,"content":[{"type":"paragraph","text":"Creed can be seen in the background and in group scenes in the first season, but no storylines developed around him."},{"type":"paragraph","text":"In Halloween, Michael is ordered to fire someone and he considers Creed (who is dressed as a vampire), but Creed fights back and suggests Devon instead, and Devon is fired. Later in the season, it is revealed that Creed has four toes on his right foot (because his adoptive Chinese parents bound his feet as a young child) and enjoys arcade-style shooting games. He reveals to Michael that he spent some time in an iron lung when he was a teenager. In a deleted scene from Christmas Party, Creed reveals to Oscar that he was \"Wacky Weed Creed\", a radio D.J. during the 1970s which Oscar declares in a talking head interview \"that Creed is a very interesting guy to talk to.\""},{"type":"paragraph","text":"In a deleted scene from Booze Cruise, he takes an electric guitar from a failing Michael and performs a blues hit to an enthusiastic reception. He then reveals that he was once a member of The Grass Roots, and as a result of drug abuse cannot concentrate for longer than 90 seconds. He speaks simple Cantonese and has friends in China, possibly Huadu. He can identify a strain of cannabis, known as northern lights, in high-resolution photographs. He snacks on nutritious mung bean sprouts, which he keeps stashed in his desk on a damp paper towel, though he admits that \"they smell like death\". In Casino Night, Creed steals poker chips to win the evening's prize, a mini-fridge from Vance Refrigeration. He states that he has never owned a refrigerator before. In a talking head interview, Creed gleefully says \"I love stealing.\""},{"type":"paragraph","text":"In Take Your Daughter to Work Day, he offers to show the kids his four toes."}],"images":[]},{"title":"Season 3","level":2,"content":[{"type":"paragraph","text":"In Gay Witch Hunt, Creed says that he made love to many women during the 1960s \"often outdoors, in the mud and rain\", and \"it's possible a man slipped in; there would be no way of knowing.\" When Pam, at Kelly's insistence, wears a slightly more revealing shirt than is usual, Creed comes to her desk and stares at her for an awkwardly long time. When she asks him what he wants, he says that he is \"just looking.\""},{"type":"paragraph","text":"In Diwali, he immediately recognizes a sexual position in the Kama Sutra by name (\"The Union of the Monkey\")."},{"type":"paragraph","text":"In one episode, Karen is seen playing with Hannah Smoterich-Barr's baby. Creed approaches her and dangles a chain of paper clips in front of the infant. When Karen tells Creed that it's dangerous to let a baby play with paper clips, Creed replies that it's okay because he has lots of them."},{"type":"paragraph","text":"In Branch Closing, he expands on his love of stealing by selling $1,200 worth of office equipment when he thinks his branch is closing. When Hannah exposes her breast to put milk in a baby bottle, he takes a picture of it and puts it on the computer. When confronted about the picture, he states he was \"at the right place at the right time.\""},{"type":"paragraph","text":"In a deleted scene in The Convict, he tells of a Pruno wine that he made with ketchup in the toilets, and then said, \"God I miss that stuff\"."},{"type":"paragraph","text":"In A Benihana Christmas, he joins Karen and Pam's party and performs a real song of his, \"Spinnin' N Reelin'\"."},{"type":"paragraph","text":"In The Return, Creed's memory problems are revealed when he confuses the death of Ed Truck with the departure of Dwight from Dunder Mifflin. (This confusion also suggests Creed could have misinformed Michael about the circumstances of Ed Truck's death in the earlier episode Grief Counseling). He does seem to remember some facts, such as the funeral for the bird in the parking lot."},{"type":"paragraph","text":"In Business School, he attempts to exterminate a bat that has entered the office using a can of pesticide. When Kelly tells him not to, out of sympathy for the bat, Creed informs her that \"animals can't feel pain.\" Creed also readily enters into \"an alliance\" with Dwight to, if necessary, take violent action against Jim—Dwight fears Jim was bitten by the bat and may turn into a vampire, or perhaps merely carry the \"vampiric germ\". Without hesitation, Creed fashions a stake, using tools he has readily available in his desk."},{"type":"paragraph","text":"In Cocktails, Creed is greeted warmly by a group of teenagers entering Poor Richard's Pub. He reveals to the camera that he runs a fake ID business out of the trunk of his car with a laminator that he stole from the sheriff's department."},{"type":"paragraph","text":"In The Negotiation, Creed creates an extreme tale of Roy's attack of Jim, falsely claiming that \"Halpert\" had stolen Roy's car. He also said that Roy came in \"very late at night\" with a sock filled with nickels and that \"Cheroot\" defended himself with a can of hair spray and a lighter. When he tells this version of events, Angela denounces him as \"useless\", and Creed immediately returns to his business."},{"type":"paragraph","text":"In Product Recall, his negligence leads to the paper being sent out with an obscene watermark. Every week he is supposed to do a four-hour quality spot check at the paper mill, and he is indignant that the watermark problem happened during the one time that he skipped out on those duties. He then does everything he can to keep his job and survive, like \"I did when I was a homeless man\". Creed engineers the transfer of blame from himself to a paper mill manager, for whom he procures a card and farewell money collected from all the workers; on his way out, he pockets the money and tosses the card. In a deleted scene, it was revealed that Creed faked his own death 10 years ago \"for tax reasons\", and admits that he draws benefits as his own widow."},{"type":"paragraph","text":"In Women's Appreciation, Creed is shown using the women's bathroom. He says that he is a \"pretty normal guy\", who does one weird thing. \"I go to the woman's bathroom to do number two. I've been caught several times and I have paid dearly.\" In the same episode, Phyllis recounts her run-in with a flasher to which Creed responds with \"The guy was just hanging brain; what's all the fuss?\" He later tells the camera, \"If that's flashing, then lock me up.\""},{"type":"paragraph","text":"In Beach Games, Creed is seen catching a fish with his bare hands, and then shows up later to a hot dog eating contest holding a fish skeleton and says, \"Nobody told me we were having hot dogs!\""},{"type":"paragraph","text":"In The Job, Creed blogs about Pam's speech at the beach in his \"blog,\" which is actually a Microsoft Word document that Ryan opens up on his computer. Ryan describes the things Creed writes about as shocking, \"even for the Internet.\" In a deleted scene, Creed is seen counterfeiting Dwight's motivational \"Schrute Bucks\" and takes several 50-pound boxes of them to Dwight demanding payment. After Dwight uses an invisible ink marker to determine that they are fakes Creed tells him \"Listen, Schrutey\" and threatens to flood the market with the fake Schrute bucks to render them worthless."},{"type":"paragraph","text":"In a preview for Season 4, Creed states that \"it turns out\" he has grandchildren and children, presumably from his many relationships in the 1960s (NBC promotional video). In another video on NBC.com, he states that \"some kid he sold weed to got a job in Corporate\" (implying Ryan)."}],"images":[]},{"title":"Season 4","level":2,"content":[{"type":"paragraph","text":"In Fun Run, Creed states that he has been a member of many religious cults, both as a leader and follower. He prefers to be a follower but gets paid more for being a leader. He also displays an extensive knowledge of painkillers when he questions Meredith on what kinds of medication she has been administered for her pelvic fracture. In a deleted scene, he swallows all of Meredith's painkillers and leaves none for an incredulous Meredith to take."},{"type":"paragraph","text":"In Dunder Mifflin Infinity, Creed dyes his hair black with printer ink, drinks Red Bull, tries to use slang terms (\"later skater\") and refers to himself as being just under 30 to escape Ryan's supposedly imminent weeding out of older workers."},{"type":"paragraph","text":"In Chair Model, he is anxious for Michael to get a new chair, as Pam gets Michael's old chair and he gets Pam's. Then, Creed will have two chairs and will have \"only one to go.\" He also stated that he transfers his debt to another identity named \"William Charles Schneider\", which is the actor's birth name. It is suggested that this is the character's actual name as well."},{"type":"paragraph","text":"In Job Fair, Creed referred to Angela as \"pumpkin\", indicating that he had forgotten her name completely, as opposed to botching it by calling her \"Andrea\"."},{"type":"paragraph","text":"In Did I Stutter?, as Dwight is showing Michael a flow chart of workers in the office, the name \"Creed Bratton\" is seen in quotation marks, indicating that the office does not think that his real name is Creed Bratton."},{"type":"paragraph","text":"In Goodbye Toby, it is revealed that Creed does not remember his position at the company: when asked by Holly about his occupation, Creed is struck clueless by her inquiry, and abruptly excuses himself to avoid answering the question. In the following interview, he attempts to recall the name of his occupation, coming to the words, \"Quabitty Assuance\". While he acknowledges that this is not the name, he believes that he is \"getting close\" (Creed works as a Quality Assurance Rep. for Dunder Mifflin). In a deleted scene, Creed says fondly that he gave the departing Toby the number of his friend Jorge in Costa Rica, who will hook Toby up with various items including \"this amazing coffee that you snort\"."}],"images":[]},{"title":"Season 5","level":2,"content":[{"type":"paragraph","text":"In Weight Loss, Kelly says that Creed sold her a \"tapeworm\" which would eat all her food and help her lose more weight. Creed later tells the camera that it wasn't a tapeworm he sold her but never says what it actually was."},{"type":"paragraph","text":"In Baby Shower, Creed says that Jan's tub birth would be \"like the tide at Omaha Beach,\" which perhaps implies that Creed was possibly involved in the D-Day invasions. This makes sense if he was, indeed, born in 1925 as he claims, though this is extremely unlikely."},{"type":"paragraph","text":"In Crime Aid, Creed strongly implies that he, at some point, assumed the identity of \"Creed Bratton\" from a man who \"disappeared\" after stealing from him."},{"type":"paragraph","text":"In the cold opening of Employee Transfer, Creed dresses as The Joker from The Dark Knight, along with quoting the performance by Heath Ledger. Creed's costume choice upsets Kevin, who wears the same costume. It is soon revealed that Dwight is also wearing the same costume."},{"type":"paragraph","text":"In Frame Toby, Creed shows concern when two policemen show up at the office looking for narcotics. Michael and Dwight had actually called the cops in an attempt to frame Toby for the possession of these narcotics. Creed is then shown in a talking head interview telling the camera crew to pretend that they are talking until the cops leave."},{"type":"paragraph","text":"In Moroccan Christmas, Creed is shown enjoying a hookah. He also states that he could get a permit for reventilation in less than an hour, implying that he has connections with many people for various illegal activities."},{"type":"paragraph","text":"In Lecture Circuit Part 1\" Creed mentions to Andy he had a relationship with would-be presidential assassin \"Squeaky\" Fromme. Also, when Jim approaches Creed for a $3 donation for Kelly's birthday party, Creed hands Jim a $3 bill with George W. Bush's face on it."},{"type":"paragraph","text":"In Blood Drive, while Michael complains of the low number of people, he says \"and Creed signed up twice\". Creed later says that it is to receive the blood. Later in the episode, Creed steals blood packets from the Blood Drive Truck."},{"type":"paragraph","text":"In Golden Ticket, he and Jim openly praise Dwight for the success of the golden ticket idea, which was actually Michael's. Like the rest of the staff, Creed is aware that it was Michael's idea and jokingly gives Dwight the credit."},{"type":"paragraph","text":"In Casual Friday, Creed spends the day playing board games with Jim. While playing chess, Creed offers to set Jim up with his daughter. Jim replies that he is engaged to Pam. Surprised, Creed states that he thought Jim was gay. When Jim asks why Creed would try to set him up with his daughter if he were gay, Creed looks confused and mutters that he doesn't know why."}],"images":[]},{"title":"Season 6","level":2,"content":[{"type":"paragraph","text":"In Gossip, Michael starts rumors about everyone in the office and says Creed has asthma. Creed becomes upset over this because it would prevent him from scuba diving."},{"type":"paragraph","text":"In The Promotion, a very brief conversation between Creed and Meredith implies that they had sex once, but Creed didn't remember."},{"type":"paragraph","text":"In a deleted scene in Niagara, Creed tells Meredith that the restaurant where they are dining used to be the base of operations for his cigarette smuggling operation. Later, he goes to a booth and pulls the cushion out. From under the cushion, he digs out an old, dusty cigarette carton."},{"type":"paragraph","text":"In Murder, Creed shows up late to work and steps in during the middle of the office's murder mystery game. When Michael tells him that they have discovered a murder and he is a suspect, Creed steps out under the guise of settling at his desk, but is caught by the camera running back to his car and fleeing the parking lot (this is possibly an allusion to the disappearance of the \"other\" Creed Bratton as mentioned in Crime Aid)."},{"type":"paragraph","text":"In Scott's Tots,\" Creed joins the rest of the office in voicing his displeasure at the fact that Jim unknowingly named himself as 'employee of the month' and then followed up by naming Pam, his wife, as 'employee of the month', as she was next on the list. After this, Creed suggests to the rest of the office that he believes Pam isn't even pregnant."},{"type":"paragraph","text":"In Sabre after Michael opens up the box of items intended for the representative from Sabre, Creed is given a power cord to a printer which he happily accepts."},{"type":"paragraph","text":"In The Cover-Up, while Andy believes there is a conspiracy relating to faulty printers going on at Sabre, Creed mysteriously walks by him and slices his hand across his throat. Creed later explains that Darryl, who he calls \"Darnell\", paid him three dollars to walk by Andy and make that motion (Darryl had been attempting to scare Andy into thinking there was a conspiracy). Creed calls \"Darnell\" a \"Chump\", claiming he would have done it for anything of value, and that he has done \"a lot more for a lot less\"."}],"images":[]},{"title":"Season 7","level":2,"content":[{"type":"paragraph","text":"In Viewing Party Creed claims to read Chinese better than he can read English."},{"type":"paragraph","text":"In Dwight K. Schrute, (Acting) Manager, Dwight loses the position as acting manager and Jo Bennett gives Creed the position because he is the oldest and most experienced."},{"type":"paragraph","text":"In Search Committee, Creed was acting manager, though Pam was essentially running the branch due to his incompetence. He is shown to spell the word business as “biznus.”"},{"type":"paragraph","text":"In a most-likely non-canonical short played during the 2011 Emmy Awards, Creed buys crystal meth from the \"Breaking Bad' character Jesse Pinkman (Aaron Paul)."}],"images":[]},{"title":"Season 8","level":2,"content":[{"type":"paragraph","text":"In The List, Creed is placed on the \"losers\" side of Robert California's list as 'old man'. When Andy asks Pam if the group around her really are losers, Creed is seen eating pizza, oblivious to his surroundings."},{"type":"paragraph","text":"In Pool Party, Creed appears mostly in the background but a quick shot of him shows him wearing a white bathrobe playing some sort of instrument that resembles a guitar by the pool."},{"type":"paragraph","text":"In Tallahassee, when Andy remarks how quiet things are around the office, Creed comments that he likes the silence due to the copious amount of plays it has allowed him to write. He is later seen reading the magazine \"Dwell\" with Kevin."}],"images":[]},{"title":"Season 9","level":2,"content":[{"type":"paragraph","text":"In New Guys, Creed mistook the events of that day for a circus, claiming that the copier did tricks in the high wire, that there was a Jim impersonator and a Dwight impersonator, and mistook Dunder Mifflin for a dog-food company."},{"type":"paragraph","text":"In Lice, Creed and Pam ended up as partners for applying mayo to hair. Creed was upset with the idea, and after Pam applied mayonnaise to his hair he claimed she'd done a bad job and walked away, leaving her."},{"type":"paragraph","text":"In Finale, it is revealed that sometime between A.A.R.M. and this episode that he faked his death in order to escape the police (causing Dwight to rehire Devon). It is also revealed (officially) that he was a member of The Grass Roots in the 60s. Later in the episode when Erin meets her real parents, Creed is shown to be in the audience, wearing a white beard. He is also present at Dwight and Angela's wedding, giving very detailed information about his new persona. He later reappears during the final scene in the office, singing a song while playing the guitar to everyone. He is then promptly arrested, although he seems at least content with going to prison."}],"images":[{"src":"https:\/\/vignette.wikia.nocookie.net\/theoffice\/images\/b\/bb\/Capture66.png\/revision\/latest?cb=20190916200404","caption":""}]},{"title":"Trivia","level":2,"content":[{"type":"list","elements":[{"text":"In most shots where we can see Creed's monitor, he's playing Solitaire.","elements":[]},{"text":"The actor Creed Bratton was the lead guitarist for the Sixties rock group The Grass Roots. In a deleted scene from Booze Cruise, this piece of history was incorporated into his character as well. In The Office, Creed appears to be portraying a parody of himself, as a Sixties burnout.","elements":[]},{"text":"In the same deleted scene, Creed claims that thanks to his extended drug use during his rock and roll days, 90 seconds is the longest amount of time that he can remain focused and concentrated on any task.","elements":[]},{"text":"Creed claims to have spent time in an iron lung as a teenager (The Injury).","elements":[]},{"text":"Creed claims to had his own radio show in the 1970s, using the name \"DJ Wacky Weed Creed\" (The Return).","elements":[]},{"text":"Creed has extensive knowledge of potentially addictive pain killers (Fun Run).","elements":[]},{"text":"Creed is shown to not remember the title of his job position in the episode Goodbye, Toby.","elements":[]},{"text":"Very hardly seen in some episodes, Creed has what looks like a wrestling medal hanging on the wall to the left of his desk. Creed was a wrestler at some point, though this is never admitted.","elements":[]},{"text":"Creed's right foot has four toes (Take Your Daughter to Work Day).","elements":[]},{"text":"In the episode The Convict, Creed reveals that he was in prison and therein attained the name \"Creed\".","elements":[]},{"text":"In The Chump, Creed's favorite James MacAvoy film was \"Wanted\".","elements":[]},{"text":"During his time at Dunder Mifflin\/Sabre, he sprouted mung beans on damp paper towels in his desk drawer. Though nutritious, they gave him a distinct \"old man\" smell according to Ryan.","elements":[]},{"text":"He was a US Navy Commander of the USS Bon Homme Richard (CV-31) during the Vietnam war.","elements":[]},{"text":"He is one of eight characters to be Regional Manager of the Dunder Mifflin, Scranton branch, the others being Michael Scott, Jim Halpert, DeAngelo Vickers, Robert California, Andy Bernard, Nellie Bertram, and Dwight Schrute.","elements":[]},{"text":"Creed, like Oscar, Angela, Phyllis, Dakota and Clark have the same first names as their actors, however, he is the only character in the entire series to be played by himself and his real-life counterpart.","elements":[]},{"text":"It is implied that Meredith Palmer and Creed have had sex.","elements":[]}]}],"images":[]},{"title":"Creed's lack of morals and decency","level":2,"content":[{"type":"list","elements":[{"text":"Steals gambling chips (Casino Night).","elements":[]},{"text":"Steals office supplies - mentioned (Casino Night).","elements":[]},{"text":"Steals candy bars (Casino Night).","elements":[]},{"text":"Has been arrested at least once, during his photo ID session in Drug Testing, he assumes a profile pose after being photographed from the front, in a manner similar to a mugshot.","elements":[]},{"text":"Sells office equipment online (Branch Closing, Producer's Cut).","elements":[]},{"text":"Takes a toy from a toy drive collection box (A Benihana Christmas).","elements":[]},{"text":"Steals a laminating machine from the sheriff's office, uses it to start a fake ID business which he runs from his car (Cocktails).","elements":[]},{"text":"Eats steaks with his hands (Ben Franklin).","elements":[]},{"text":"Attaches his wedding card to another guest's gift (Phyllis' Wedding).","elements":[]},{"text":"Takes $40 from Michael - implied when he returns it (The Negotiation).","elements":[]},{"text":"Takes up a fake collection for Debbie Brown after he gets her fired (Product Recall).","elements":[]},{"text":"Lives in Toronto three days a week to take advantage of the welfare state; he spends the remainder of the week living in the office, sleeping on the couch in reception and using the water-cooler and paper towel to bathe.","elements":[]},{"text":"Has faked his own death and, at one point, was living off of his life insurance payout (Product Recall).","elements":[]},{"text":"Implied to have flashed before: \"If that's flashing, then lock me up\" (Women's Appreciation).","elements":[]},{"text":"Uses the women's restroom (Women's Appreciation).","elements":[]},{"text":"When Meredith stops the bus to pee by the side of the road, Creed watches her while the rest of the staff looks away (Beach Games, deleted scene).","elements":[]},{"text":"Takes a live fish and eats it raw (Beach Games).","elements":[]},{"text":"Lies about his age, claiming at various points to be 81 (Fun Run) and 29 (Dunder Mifflin Infinity).","elements":[]},{"text":"In Dunder Mifflin Infinity it is apparent that he stole the toner from the printer and used it to dye his hair black to appear young.","elements":[]},{"text":"Stares at Meredith's crotch when Jim uncomfortably signs the cast on her pelvis (Dunder Mifflin Infinity).","elements":[]},{"text":"Implied that he stole Pam's glasses when she can't find them (Did I Stutter?).","elements":[]},{"text":"Implied that when in jail, he made a man named \"Creed Bratton\" disappear and then stole his identity (Crime Aid).","elements":[]},{"text":"Implied that he has drugs or other illegal substance on him, as he tells the cameras to make it look like they were talking to keep him from getting discovered. (Frame Toby).","elements":[]},{"text":"At the end of Lecture Circuit Part 1, he gives Jim an obviously fake $3 bill (possibly bearing George W. Bush's face) as a donation to Kelly's party.","elements":[]},{"text":"Steals pancakes from Michael's \"Pancakes and Paper\" luncheon, and then gives them back, saying \"Well, I don't even want these anymore.\"","elements":[]},{"text":"Is seen stealing blood and blood taking equipment in Blood Drive.","elements":[]},{"text":"Blackmails Oscar (twice), Andy (twice), Kelly, Meredith, Angela, and Toby (The Office: Blackmail).","elements":[]},{"text":"In Secret Santa, he asks Phyllis what will happen to someone if they've been \"really, really bad, more evil than wrong.\"","elements":[]},{"text":"Has been in cults, both as a leader and a follower (Fun Run).","elements":[]},{"text":"Drug use is implied on numerous occasions.","elements":[]},{"text":"Gave Jim one of his old shirts wrapped in a plastic bag for Secret Santa (Christmas Party).","elements":[]},{"text":"In Here Comes Treble (Episode), he is seen covered in a substance that appears to be blood, then implying that he didn't know it was Halloween and it isn't part of any costume.","elements":[]},{"text":"Photographed as a \"thief\" twice, one disguised with a wig, at the Chinese restaurant where Michael ate without his wallet.","elements":[]},{"text":"(May be Scranton Strangler).","elements":[]}]}],"images":[]},{"title":"Recurring Jokes","level":2,"content":[{"type":"list","elements":[{"text":"Creed is unable to remember the names of his coworkers.","elements":[{"text":"First mentioned in The Secret: Creed asks Kevin \"Which one is Pam?\"","elements":[]},{"text":"In a deleted scene from Valentine's Day, he calls Oscar and someone on the phone \"Ace\".","elements":[]},{"text":"In Conflict Resolution, Creed calls Meredith \"the redhead\" and Pam \"the receptionist\" in a complaint.","elements":[]},{"text":"In The Convention, Creed calls Angela \"Andrea\" and introduces himself to Meredith.","elements":[]},{"text":"In Dunder Mifflin Infinity, Creed refers to Stanley as \"Sammy\" and Meredith as \"the chick you hit with the car.\"","elements":[]},{"text":"In Business School, Creed calls Meredith \"Mary Beth\" when she's trapped in the break room with the bat.","elements":[]},{"text":"Creed manages to remember Jim's name, calling him \"Jimmy\" (Dwight's Speech, Survivor Man) or \"Halpert\" (The Negotiation). In The Negotiation, he also nearly remembered Dwight's name (calling him \"sharoot\").","elements":[]},{"text":"Ironically, in the episode Night Out, Creed is the only one who remembers the name of the security guard.","elements":[]},{"text":"In Goodbye Toby, Creed said to Michael \"it's the temp\" when they saw Ryan getting arrested on YouTube.","elements":[]},{"text":"In Lecture Circuit Part 1, Creed seems to have forgotten Andy's name, calling him Jim.","elements":[]},{"text":"In Business Ethics, Creed calls Jim \"the tall guy\", when he tells Michael that Jim and Pam have just gotten engaged.","elements":[]},{"text":"In Darryl's plot against Andy he uses Creed for assistance, in an interview afterward, he calls Darryl 'Darnell'.","elements":[]},{"text":"In Threat Level Midnight, Creed called Pam his mom.","elements":[]},{"text":"In New Guys, Creed called Angela a lady, he called Clark and Pete \"Dwight and Jim impersonators\", called Kevin a strong man and called Dunder Mifflin a dog food company.","elements":[]},{"text":"In Classy Christmas he says that Holly is \"one sassy black lady\".","elements":[]}]}]}],"images":[]},{"title":"Quotes","level":2,"content":[{"type":"list","elements":[{"text":"\"I’m not offended by homosexuality. In the 60s I made love to many, many women – often outdoors in the mud and the rain – and it’s possible that a man slipped in. There’d be no way of knowing...\" (Gay Witch Hunt).","elements":[]},{"text":"\"The only difference between me and a homeless man is this job. I will do whatever it takes to survive…like I did when I was a homeless man\" (Product Recall).","elements":[]},{"text":"\"I'm a pretty normal guy. I do one weird thing. I like to go in the women's room for number two. I've been caught several times and I have paid dearly\" (Women's Appreciation).","elements":[]},{"text":"(About Jan's breast augmentation) \"I find it offensive. Au naturale baby, that’s how I like ‘em. Swing low sweet chariots\" (The Job).","elements":[]},{"text":"\"I’ve been involved in a number of cults both as a leader and a follower. You have more fun as a follower but you make more money as a leader\" (Fun Run).","elements":[]},{"text":"Two eyes, two ears. A chin. A mouth. Ten fingers, two nipples. A butt, two knee caps, a penis. I've just described to you the Lochness Monster. And the reward for its capture? All the riches in Scotland. So I have one question: why are you here?\" (The Seminar).","elements":[]},{"text":"\"It all seems so very arbitrary. I applied for a job at this company because they were hiring, I took a desk in back because it was empty. But no matter how you get there or where you end up, human beings have that miraculous gift to make that place home... Alright Boys, Let's do this\" (Finale).","elements":[]}]}],"images":[]},{"title":"Central Episodes","level":2,"content":[{"type":"list","elements":[{"text":"Halloween","elements":[]},{"text":"Branch Closing","elements":[]},{"text":"Product Recall","elements":[]},{"text":"Survivor Man","elements":[]},{"text":"The Ultimatum","elements":[]},{"text":"Search Committee","elements":[]}]}],"images":[]},{"title":"Appearances","level":2,"content":[{"type":"paragraph","text":"Creed appears and has lines in every episode, with the following exceptions:"},{"type":"list","elements":[{"text":"Pilot - has no lines","elements":[]},{"text":"Diversity Day - has no lines","elements":[]},{"text":"The Alliance - has no lines","elements":[]},{"text":"Basketball - has no lines","elements":[]},{"text":"Hot Girl - has no lines","elements":[]},{"text":"The Dundies - has no lines","elements":[]},{"text":"Sexual Harassment - has no lines","elements":[]},{"text":"The Fire - has no lines","elements":[]},{"text":"The Fight - has no lines","elements":[]},{"text":"The Client - has no lines","elements":[]},{"text":"Email Surveillance - has no lines","elements":[]},{"text":"Booze Cruise - speaks only in a deleted scene","elements":[]},{"text":"Boys and Girls - has no lines","elements":[]},{"text":"Valentine's Day - speaks only in a deleted scene","elements":[]},{"text":"Michael's Birthday - has no lines","elements":[]},{"text":"Initiation - has no lines","elements":[]},{"text":"Branch Closing - speaks only in a deleted scene","elements":[]},{"text":"Back From Vacation - speaks only in a deleted scene","elements":[]},{"text":"Traveling Salesmen - speaks only in a deleted scene","elements":[]},{"text":"The Return - speaks only in a deleted scene","elements":[]},{"text":"Ben Franklin - speaks only in a deleted scene","elements":[]},{"text":"Phyllis' Wedding - speaks only in a deleted scene","elements":[]},{"text":"Launch Party - speaks only in a deleted scene","elements":[]},{"text":"Branch Wars - has no lines","elements":[]},{"text":"The Deposition - speaks only in a deleted scene","elements":[]},{"text":"Dinner Party - has no lines","elements":[]},{"text":"The Client - speaks only in a deleted scene","elements":[]},{"text":"Valentine's Day - has no lines","elements":[]},{"text":"Women's Appreciation - speaks only in a deleted scene","elements":[]},{"text":"The Deposition - speaks only in a deleted scene","elements":[]},{"text":"The Banker - has no lines, seen only in the clip show","elements":[]},{"text":"The Inner Circle - has no lines","elements":[]}]}],"images":[]},{"title":"See also","level":2,"content":[{"type":"list","elements":[{"text":"Creed Thoughts","elements":[]}]}],"images":[]}]}