{"sections":[{"title":"Danny Cordray","level":1,"content":[{"type":"paragraph","text":"Danny Cordray is a very successful traveling salesman. Introduced in season 7, episode 5 \"The Sting\", Danny Cordray is played by actor Timothy Olyphant. He played in two episodes in Season 7."}],"images":[]},{"title":"Biography","level":2,"content":[{"type":"paragraph","text":"Danny was a traveling salesman for Osprey Paper, and moved to Dunder Mifflin Scranton after being confronted by Michael in \"The Sting\". He is the best salesman in the Scranton Wilkes-Barre area, much to the frustration of Jim and Dwight, who struggle to compete. Little is known about Danny's past, other than he dated Pam when Jim was transferred to the Stamford branch and was dating Karen Filippelli. However, after two dates, Danny never called Pam back and tries to make excuses as to why he never called back when Jim keeps asking him. He then reluctantly tells Jim and Pam that he never called Pam back because he thought Pam was a dork. (Costume Contest)."},{"type":"paragraph","text":"In a deleted scene (The Sting), it is revealed that Danny did a catalog model picture that Michael remembers and finds on the net."}],"images":[]},{"title":"Season 7","level":2,"content":[{"type":"paragraph","text":"Danny is a traveling salesman for Osprey Paper, and when Dwight, Jim, and Michael lose Steve Nash, an important client to Danny, they try to set up a sting to see his sale tactics. However, when Meredith tries to seduce Danny, Michael stops the sting operation. Michael hires Danny saying that if he was to lose a sale to Danny, he must as well do the next best thing and hire Danny. Danny is introduced to the rest of the office, where it is obvious that most, if not all, of the office employees, find Danny very attractive. Kelly mentions that he looks like \"Josh Duhamel\" and Angela agrees. Kevin says that Danny looks like a \"better-looking\" version of Andy, to which Andy, flattered, thanks, Kevin. Michael then explains to the camera in a head interview that Danny is the best thing to happen to this company since Packer (he then admits to forgetting about Packer) (The Sting)."},{"type":"paragraph","text":"Things get awkward when Andy and Kevin take their friendship with Jim and Pam too personally and tell Danny that they can't attend his Halloween party because of Jim and Pam. When Danny confronts Jim and Pam, they deny this and they are seen laughing. Jim tries to make a joke about their \"love relationship\", and it gets awkward when Pam points out that Danny never called back after the second date."},{"type":"paragraph","text":"Jim keeps asking Danny why he never called Pam back. Danny then tries to make excuses, claiming first he didn't have Pam's number and then that Pam talked about Jim all the time, but Pam and Jim don't buy this. They corner him into telling that he thought that Pam was \"a little dorky.\""},{"type":"paragraph","text":"At the end of the episode, (The Sting) Dwight yells at Danny for not calling Pam back for a third date. He tells Danny that even if Pam was too \"meh\" for Danny, or thin without being toned, 'she is one of the plain, hearty women of Scranton that make the city great'. Dwight, then warmly welcomes Danny to the company since it is after five, and Dwight doesn't take work home with him."},{"type":"paragraph","text":"Although he was not present at the award ceremony, Danny won the Dundie award for Hottest in the Office (Michael's Last Dundies). He accepts the award in a video Michael recorded at his home (deleted scene)."},{"type":"paragraph","text":"\"How do you not call a dork like that back?\" -Jim Halpert, Costume Contest"}],"images":[]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":"The Sting","elements":[]},{"text":"Costume Contest","elements":[]},{"text":"Michael's Last Dundies (Deleted scene)","elements":[]}]}],"images":[]},{"title":"Trivia","level":2,"content":[{"type":"list","elements":[{"text":"Danny owns a bar called Public School, which is located off Exit 11 from an unspecified interstate.","elements":[]}]}],"images":[]}]}