{"sections":[{"title":"Deangelo Vickers","level":1,"content":[{"type":"paragraph","text":"Deangelo Jeremitrius Vickers, played by Will Ferrell, is a former branch manager of the Scranton branch of Dunder Mifflin Sabre. Vickers served as the replacement of then-branch manager Michael Scott, who moved to Colorado with his then-fiancée, Holly Flax. Deangelo's tenure as branch manager was remarkably short, however, after a basketball injury left him comatose. "}],"images":[]},{"title":"Biography","level":2,"content":[{"type":"paragraph","text":"Deangelo appeared in a story arc that lasted four episodes. His first appearance was in \"Training Day\", where he was introduced to everyone. Deangelo was to be the regional Manager of the Dunder Mifflin Scranton Branch to replace long-time manager Michael Scott. In Michael's Last Dundies, Deangelo and Michael hosted the Dundies at Louie Volpes, and Deangelo later sang Michael's Goodbye Song with the rest of the branch. Deangelo became the Regional Manager of Dunder Mifflin Scranton in \"Goodbye, Michael\" when Michael departed Scranton and Dunder Mifflin for good. At Michael's going away party, Deangelo attacks the cake and the office realizes that he is going to be hard to work with."},{"type":"paragraph","text":"Deangelo is officially Regional Manager in \"The Inner Circle\". He considers himself to be a professional juggler, even though he juggles invisible juggling balls; he juggles to the song Bring Me to Life by Evanescence. The entire office believe Deangelo to be extremely childish and incapable to be manager. The only employees that are impressed with his \"juggling skills\" are Erin, Kevin, Gabe and Creed. "},{"type":"paragraph","text":"As Regional Manager, he sets up an Inner Circle of his favorite employees which includes Kevin Malone , Darryl Philbin, Gabe Lewis, Jim Halpert (temporary) and Andy Bernard (temporary). After playing Nerf basketball with the Inner Circle, Jim challenged Deangelo to a free-throw line dunk in which Deangelo accepts. However, after dunking, the hoop collapses on him, and he is sent to the hospital. He later reappears in the office dressed in a hospital smock while speaking gibberish. He was sent back to the hospital and is never seen again."},{"type":"paragraph","text":"In the producer's cut of \"Search Committee\", Jo lists all the former managers, mentioning Deangelo as \"the second idiot to dunk himself to death!\""},{"type":"paragraph","text":"In \"Lotto\", Deangelo was mentioned by Darryl saying that he's dead, but Andy corrects him saying he's not dead, just his brain.  "}],"images":[]},{"title":"Trivia","level":2,"content":[{"type":"list","elements":[{"text":"Deangelo is widely regarded by the Dunder Mifflin crew as a brash, obstinate and opinionated boss.","elements":[]},{"text":"Deangelo has 4 children (1 is a son) and a cousin. His cousin cracked a formula for a popular soda so Deangelo never has to buy it again.","elements":[]},{"text":"According to a deleted scene in The Inner Circle, Deangelo has a brother.","elements":[]},{"text":"In The Inner Circle, Deangelo states that he has a vagina.","elements":[]},{"text":"Deangelo's mother divorced his father and he had to go to court and choose between them.","elements":[]},{"text":"Deangelo is allergic to peanuts.","elements":[]},{"text":"Deangelo conquered obesity.","elements":[]},{"text":"Deangelo loves the American southwest. He even goes as far as referring to Arizona, Nevada, Utah, and New Mexico as \"heaven\".","elements":[]}]}],"images":[]}]}