{"sections":[{"title":"Devon White","level":1,"content":[{"type":"paragraph","text":"Devon White is a fictional character played by Devon Abner in the television series The Office."}],"images":[]},{"title":"Season 1:","level":2,"content":[{"type":"paragraph","text":"Devon is briefly seen working in the background several times. When Michael instigates Diversity Day 2, Devon is seen, alone on a balcony taking a smoke break, in a deleted scene with a \"West Nile\" card on his forehead."}],"images":[]},{"title":"Season 2:","level":2,"content":[{"type":"paragraph","text":"In The Dundies, Dwight calls out Devon for taking too long with his acceptance speech. The camera pans to the table where he is seen briefly. In The Fire, Devon (wearing sunglasses) can be seen in several scenes in the office's parking lot, standing with co-workers or using his cell phone."},{"type":"paragraph","text":"Due to downsizing, Michael was forced to fire somebody by the end of the month. Although he first attempted to fire Creed, Creed convinced Michael that Devon was a worse worker and that Devon should be fired instead. As a result, Devon, dressed as a hobo for Halloween, was fired by Michael. Devon did not take his firing lightly and invited everybody except for Michael, Creed, Dwight, and Angela to come to Poor Richard's with him. Before heading to the bar, however, Devon smashed a pumpkin over Michael's windshield."},{"type":"paragraph","text":"In deleted scenes from Valentine's Day, Devon, who has apparently stayed true to his Halloween costume as he is now a bum, encounters Michael on the streets of New York. He yells at Michael and chases him down the block. Afterwards, a typically clueless Michael reflects on how good it was to see Devon again."}],"images":[]},{"title":"Season 4:","level":2,"content":[{"type":"paragraph","text":"In a press still from Did I Stutter? Devon's last name is revealed to be White."}],"images":[]},{"title":"Season 7:","level":2,"content":[{"type":"paragraph","text":"In Costume Contest, the Season 7 Halloween episode, the writers recycle Devon's hobo outfit on Toby."}],"images":[]},{"title":"Season 9:","level":2,"content":[{"type":"paragraph","text":"In Finale, Dwight rehires Devon, as Creed faked his own death to avoid the police and Devon pretty much had the same job as Creed."}],"images":[]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":"Diversity Day (deleted scenes)","elements":[]},{"text":"Health Care (uncredited)","elements":[]},{"text":"The Alliance (uncredited)","elements":[]},{"text":"Basketball (uncredited)","elements":[]},{"text":"Hot Girl (uncredited)","elements":[]},{"text":"The Dundies (uncredited)","elements":[]},{"text":"The Fire (uncredited)","elements":[]},{"text":"Halloween","elements":[]},{"text":"Valentine's Day (deleted scenes)","elements":[]},{"text":"Finale","elements":[]}]}],"images":[]}]}