{"sections":[{"title":"Donna Newton","level":1,"content":[{"type":"paragraph","text":"Donna Newton is a manager of Sid & Dexter, the bar the office employees visit during Happy Hour."}],"images":[]},{"title":"Season 6","level":2,"content":[{"type":"paragraph","text":"Donna's first appearance is to reprimand Michael for his disruptive behavior in her establishment. She asks him to leave, he refuses, and she lets up. Michael goes over to talk to her, and they argue at first, but then they engage in a conversation and start flirting. Donna \"randomly\" selects Michael's business card from a fishbowl, awarding him a free lunch. She keeps asking Michael when he will come back to claim his lunch."},{"type":"paragraph","text":"Donna visits the office, ostensibly to buy office equipment. Jim and Pam team up as her sales representatives, but their pitch is undermined by Michael's flirtatious interruptions. Michael takes over the sales presentation. Michael is unsure whether her flirtatiousness demonstrates genuine interest or merely a ploy to extract a lower price. Donna leaves behind a barrette, which Michael returns to her in the parking lot. Michael apologizes for his behavior, only to find that Donna is indeed interested, and they share a kiss."},{"type":"paragraph","text":"Later on, their relationship begins to weaken after Michael suspects that she is cheating on him. Pam confirms this by showing him pictures of Donna and another man embracing. When Michael confronts Donna about this, she reveals that her relationship with Michael is actually an extramarital affair. After hearing of Michael's situation, the office tells him that he should break up with Donna because she is cheating on her husband. Michael rejects their pleas. The office workers retaliate by showing feelings of disgust toward Michael and he later realizes the error of his ways. He officially ends his relationship with Donna via text message."}],"images":[]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":"\"Happy Hour\"","elements":[]},{"text":"\"Body Language\"","elements":[]},{"text":"\"The Cover-Up\"","elements":[]},{"text":"\"The Chump\" (non-speaking appearance)","elements":[]},{"text":"\"Sex Ed\" (voice only)","elements":[]}]}],"images":[]}]}