{"sections":[{"title":"Dunder Mifflin family members and loved ones","level":1,"content":[{"type":"paragraph","text":"This page is a listing of Dunder Mifflin family members and loved ones."}],"images":[]},{"title":"Michael Scott","level":2,"content":[],"images":[]},{"title":"Michael's Mom","level":3,"content":[{"type":"paragraph","text":"Michael's Mom is mentioned frequently."},{"type":"paragraph","text":"In the Season 4 episode Night Out, Michael calls his mother, explaining how he hasn't met a good girl yet, but that he is trying hard."}],"images":[]},{"title":"Michael's Stepfather","level":3,"content":[{"type":"paragraph","text":"Michael's Stepfather Jeff married Michael's mother when Michael was very young. Michael does not like his stepfather."}],"images":[]},{"title":"Helene Beesly","level":3,"content":[{"type":"paragraph","text":"Helene Beesly is Michael's ex-girlfriend. Their relationship was disputed because Helene is Pam's mother."}],"images":[]},{"title":"Donna Newton","level":3,"content":[{"type":"paragraph","text":"Donna Newton is Michael's ex-girlfriend. Donna was married, but was having an affair with Michael."}],"images":[]},{"title":"Luke Cooper","level":3,"content":[{"type":"paragraph","text":"Luke is Michael's nephew. He worked briefly as an intern for the company (Nepotism), but did his job very badly."}],"images":[]},{"title":"Dwight Schrute","level":2,"content":[],"images":[]},{"title":"Melvina","level":3,"content":[{"type":"paragraph","text":"Melvina was Dwight's former babysitter. She was also his date to Michael and Jan's Dinner Party, to which they showed up uninvited. She also applies for the Dunder Mifflin junior sales associate position."}],"images":[{"src":"https:\/\/vignette.wikia.nocookie.net\/theoffice\/images\/3\/38\/85828_1212679703254_full.jpg\/revision\/latest\/scale-to-width-down\/100?cb=20130202011012"}]},{"title":"Rolf Ahl","level":3,"content":[{"type":"paragraph","text":"Dwight's new best friend in the Season 5 finale Company Picnic"}],"images":[]},{"title":"Isabel Poreba","level":3,"content":[{"type":"paragraph","text":"Isabel Poreba is Dwight's ex-girlfriend"}],"images":[]},{"title":"Phillip Schrute","level":3,"content":[{"type":"paragraph","text":"Dwight and Angela's child."}],"images":[]},{"title":"Jim Halpert","level":2,"content":[],"images":[]},{"title":"Katy","level":3,"content":[{"type":"paragraph","text":"Katy is Jim's ex-girlfriend."}],"images":[{"src":"https:\/\/vignette.wikia.nocookie.net\/theoffice\/images\/5\/50\/82983_1225487486152_331_300.jpg\/revision\/latest\/scale-to-width-down\/100?cb=20180220211951"}]},{"title":"Tom Halpert","level":3,"content":[],"images":[{"src":"https:\/\/vignette.wikia.nocookie.net\/theoffice\/images\/8\/8b\/82985_1225488002648_339_300.jpg\/revision\/latest\/scale-to-width-down\/100?cb=20180220205924","caption":""}]},{"title":"Larisa Halpert","level":3,"content":[{"type":"paragraph","text":"Larisa Halpert (often misspelled \"Larissa\") is a female relative, given in the episode \"'The Fight'\" as Jim's emergency contact. In Niagara, she is identified in the wedding program as Jim's sister. She also left a message for the couple in their online guest book. Prior to the episode Niagara, she was widely believed by fans to be Jim's mother."}],"images":[]},{"title":"Pam Beesly","level":2,"content":[],"images":[]},{"title":"Jim Halpert","level":3,"content":[{"type":"paragraph","text":"Jim Halpert is Pam's husband."}],"images":[]},{"title":"Roy Anderson","level":3,"content":[{"type":"paragraph","text":"Roy Anderson is Pam's former fiancé."}],"images":[]},{"title":"Helene Beesley","level":3,"content":[{"type":"paragraph","text":"Pam's Mom was seen in the episode Sexual Harassment. She visits Pam at the office and inquires about who Jim is. It is later revealed in Stress Relief that she and Pam's father are having marriage troubles and are getting separated."},{"type":"paragraph","text":"In the episode Sexual Harassment, she was played by Shannon Cochran. She is played by Linda Purl in the episode Niagara because Shannon Cochran was unavailable (on tour performing August: Osage County)."}],"images":[]},{"title":"William Beesly","level":3,"content":[{"type":"paragraph","text":"Main article: William Beesly"},{"type":"paragraph","text":"Pam's Dad was seen in Stress Relief when it is revealed that he and Pam's mother are having marriage troubles and are getting separated. He is also seen in Niagara with a girlfriend that Jim mistakes as Mr. Beesly's niece."},{"type":"paragraph","text":"He is played by Rick Overton."}],"images":[]},{"title":"Penny Beesly","level":3,"content":[{"type":"paragraph","text":"Main article: Penny"},{"type":"paragraph","text":"Penny is Pam's sister. At Pam's wedding (Niagara), she mistook Kevin for Gil, Oscar's ex-boyfriend. Kevin tried to hit on Penny, but Pam quickly shut that down. Unlike her sister, Penny has blonde hair and wears hair extensions."}],"images":[]},{"title":"Danny Cordray","level":3,"content":[{"type":"paragraph","text":"Danny Cordray is Pam's ex-boyfriend"}],"images":[]},{"title":"Grandma Sylvia (\"Meemaw\")","level":3,"content":[{"type":"paragraph","text":"aain article: Sylvia"},{"type":"paragraph","text":"Pam and Penny's grandmother Sylvia (called \"Meemaw\" by family members) attended Pam's wedding (Niagara). She is very conservative, and Pam's pregnancy was accidentally revealed to her by Jim during the rehearsal dinner."}],"images":[]},{"title":"Isabel Poreba","level":3,"content":[{"type":"paragraph","text":"Isabel is Pam's best friend."}],"images":[]},{"title":"Cecelia Halpert (Cece)","level":3,"content":[{"type":"paragraph","text":"Jim and Pam's daughter."}],"images":[]},{"title":"Phillip Halpert","level":3,"content":[{"type":"paragraph","text":"Jim and Pam's son."}],"images":[]},{"title":"Ryan Howard","level":2,"content":[],"images":[]},{"title":"Kelly Kapoor","level":3,"content":[{"type":"paragraph","text":"In \"Test the Store \", Ryan calls his uncle while he is in Florida, asking for a prescription of Ritalin."},{"type":"paragraph","text":"During that phone call, his Aunt is also mentioned."}],"images":[]},{"title":"Angela Martin","level":2,"content":[],"images":[]},{"title":"Nana and Mimi","level":3,"content":[{"type":"paragraph","text":"Angela has a Nana and a Mimi."}],"images":[]},{"title":"Estranged sister","level":3,"content":[{"type":"paragraph","text":"Angela has an estranged sister with whom she hasn't spoken to in over 16 years, stemming from a disagreement Angela doesn't even remember any more (A Benihana Christmas). This may be the sister seen prior to and during Angela's wedding (Finale)."}],"images":[]},{"title":"Robert Lipton","level":3,"content":[{"type":"paragraph","text":"Robert is Angela's ex-husband. Angela frequently refers to him as \"the Senator.\" He had an affair with Oscar Martinez, ending their marriage."}],"images":[]},{"title":"Phillip Schrute","level":3,"content":[{"type":"paragraph","text":"Angela and Dwight's child."}],"images":[]},{"title":"Stanley Hudson","level":2,"content":[],"images":[]},{"title":"Teri Hudson","level":3,"content":[{"type":"paragraph","text":"Teri is Stanley's second wife."},{"type":"paragraph","text":"In her first (uncredited) appearance at The Dundies, Michael didn't realize that she was Stanley's wife for the simple fact that she was white. Teri has also appeared in Booze Cruise, Phyllis' Wedding, and Stress Relief."},{"type":"paragraph","text":"Teri is an interior decorator (Gossip)."},{"type":"paragraph","text":"She is played by Joanne Carlsen."}],"images":[]},{"title":"Melissa Hudson","level":3,"content":[{"type":"paragraph","text":"Melissa is Stanley's daughter. She appeared in Take Your Daughter to Work Day. She had a crush on Ryan. Melissa asked Ryan about him going to the coffee shop \"Jitterz\" making Kelly jealous. Kelly then pointed the pair out to Stanley noting that something \"fishy\" was going on which instigated Stanley's chewing out of Ryan. She also appeared in a deleted scene in the episode Cocktails."},{"type":"paragraph","text":"She is played by Jazz Raycole."}],"images":[]},{"title":"Cynthia","level":3,"content":[{"type":"paragraph","text":"Cynthia is Stanley's mistress. She was Stanley's nurse during his recovery from the heart attack he suffered in Stress Relief. Their relationship was exposed in Gossip. Stanley intended to break things off with her, but Cynthia (also married) could not accept it. Stanley brought Cynthia as his guest to Pam and Jim's wedding (Niagara). Lydia is another one of Stanley's mistresses, she is mentioned only once at the end of season 9. \"Stanley, I thought Teri knew about Cynthia\" \"she does but neither of them know about Lydia\""}],"images":[]},{"title":"Phyllis Lapin","level":2,"content":[],"images":[]},{"title":"Elbert Lapin","level":3,"content":[{"type":"paragraph","text":"Elbert Lapin is Phyllis' father. He is confined to a wheelchair, but during Phyllis' Wedding ceremony, he built up the strength to walk Phyllis down the aisle. It is also assumed that he wears a hearing aid as Michael confronts him after the wedding stating that he bets Albert could hear him also."},{"type":"paragraph","text":"He is played by Hansford Rowe."}],"images":[]},{"title":"Uncle Al","level":3,"content":[{"type":"paragraph","text":"Uncle Al is Phyllis' uncle. He appeared at Phyllis' Wedding. He suffers from dementia."},{"type":"paragraph","text":"He is played by George Ives."}],"images":[]},{"title":"Phyllis' Sister","level":3,"content":[{"type":"paragraph","text":"She was played by Maile Flanagan."}],"images":[]},{"title":"Kevin Malone","level":2,"content":[],"images":[]},{"title":"Stacy","level":3,"content":[{"type":"paragraph","text":"Stacy was Kevin's fiancée and is the mother of Abby. She appeared alongside Kevin at The Dundies (uncredited), at Jim's party in Email Surveillance, and at Phyllis' Wedding."},{"type":"paragraph","text":"Kevin had previously indicated that things weren't working out between he and Stacy when in the episode Valentine's Day, he admits that she sometimes leaves town without letting him know where she is going."},{"type":"paragraph","text":"Later, in the episode Cocktails, Kevin claims that they had set a wedding date, but when asked for details, he explained \"It's complicated\" and became very defensive."},{"type":"paragraph","text":"In Chair Model, Kevin reveals that Stacy broke up with him."},{"type":"paragraph","text":"Stacy is played by Trish Gates. In addition to acting, Gates works as a flight attendant and does have to leave town often in real life."}],"images":[]},{"title":"Abby","level":3,"content":[{"type":"paragraph","text":"Abby is the daughter of Kevin's ex-fianceé Stacy. In Take Your Daughter to Work Day, Pam asks Abby if she would like to shred papers with her. Abby politely declines. When Jim sees Abby reading a book, he immediately connects with the girl. Jim asks Abby if she would like to help him with his sales and claims they would sell paper to Abby's mom first."},{"type":"paragraph","text":"She is played by Haley Daniels, the daughter of showrunner Greg Daniels."}],"images":[]},{"title":"Lynn","level":3,"content":[{"type":"paragraph","text":"Lynn is Kevin's ex-girlfriend."}],"images":[]},{"title":"Meredith Palmer","level":2,"content":[],"images":[]},{"title":"Jake Palmer","level":3,"content":[{"type":"paragraph","text":"Jake is Meredith's son. She brings him to work on Take Your Daughter to Work Day. He frequently misbehaves and while in the office, does his best to annoy Dwight. Meredith reveals that he was suspended from school so she brings him to the office to avoid paying for a babysitter."},{"type":"paragraph","text":"He reappears as a stripper in his early twenties at Angela's bachelorette party (with Meredith in attendance)."},{"type":"paragraph","text":"He is played by Spencer Daniels, showrunner Greg Daniels's son."}],"images":[]},{"title":"Wendy","level":3,"content":[{"type":"paragraph","text":"Wendy is Meredith's daughter, whom she calls \"the good one.\" She lives with her father."}],"images":[]},{"title":"Meredith's ex-husband","level":3,"content":[{"type":"paragraph","text":"Meredith has an ex-husband."}],"images":[]},{"title":"Toby Flenderson","level":2,"content":[],"images":[]},{"title":"Sasha Flenderson","level":3,"content":[{"type":"paragraph","text":"Sasha is Toby's daughter. He takes her to work on Take Your Daughter to Work Day. She makes friends with Michael. Jim occasionally babysits for her."},{"type":"paragraph","text":"She is played by Delaney Ruth Farrell."}],"images":[]},{"title":"Kathy Flenderson-Becker","level":3,"content":[{"type":"paragraph","text":"Toby has an ex-wife."}],"images":[]},{"title":"Rory Flenderson","level":3,"content":[{"type":"paragraph","text":"Toby's brother Rory lives in Colorado and was featured on a video chat call in Goodbye, Michael. Rory was portrayed by Paul Lieberstein's real brother, Warren Lieberstein."}],"images":[]},{"title":"Kelly Kapoor","level":2,"content":[],"images":[]},{"title":"Kelly's Parents","level":3,"content":[{"type":"paragraph","text":"Mr. and Mrs. Kapoor are Kelly's parents. They appear in the episode Diwali and were played by actress Mindy Kaling's actual parents, Avu and Swati Chokalingam."},{"type":"paragraph","text":"Kelly's parents (unlike Kaling's actual parents[1]) were matched in an arranged marriage, having met only once before their wedding. They have been married for thirty years."}],"images":[]},{"title":"Kelly's Sisters","level":3,"content":[{"type":"paragraph","text":"Rupa, Neepa, and Tiffany Kapoor are Kelly's three sisters. In Hindi, the girls gossip about Ryan looking like actor Zack Braff. They appear in Diwali and were played by Tanveer Atwal, Jaysha Patel and Ananya Kepper. It is revealed that Rupa was the prom queen, angering Kelly."}],"images":[]},{"title":"Kelly's dead sister","level":3,"content":[{"type":"paragraph","text":"In Michael's Birthday, Kelly mentions that she had a sister who had died."}],"images":[]},{"title":"Ravi","level":3,"content":[{"type":"paragraph","text":"Ravi is Kelly's ex-fiancee"}],"images":[]},{"title":"Andy Bernard","level":2,"content":[],"images":[]},{"title":"Andy's parents","level":3,"content":[{"type":"paragraph","text":"Walter and Ellen Bernard appeared in the episode Goodbye, Toby and are present when Andy proposes to Angela."},{"type":"paragraph","text":"In the episode \"Garden Party\" Andy Bernard's parents are played by different actors than in previous episodes. Walter Bernard, Sr., is played by Steven Collins, Ellen Bernard is played by Dee Wallace, and Andy's brother, Walter, Jr., is played by Josh Groban. "}],"images":[{"src":"https:\/\/vignette.wikia.nocookie.net\/theoffice\/images\/e\/e9\/F71514CE-4C2E-47CB-AA0E-D1120C85E7D5.jpeg\/revision\/latest\/scale-to-width-down\/180?cb=20200128074116","caption":"Andy’s parents in LGarden Party”"},{"src":"https:\/\/vignette.wikia.nocookie.net\/theoffice\/images\/4\/47\/943E9A03-C9C9-4019-A85B-09FE9B485FE9.png\/revision\/latest\/scale-to-width-down\/180?cb=20200128073935","caption":"Walter Jr sings a duet with Walter Sr. In “Garden PartyL"}]},{"title":"Jamie","level":3,"content":[{"type":"paragraph","text":"Jamie is Andy's ex-girlfriend. She is a high school student and works at a frozen yogurt stand."},{"type":"paragraph","text":"In the episode Product Recall, when Jim and Andy go to Dunmore High School to apologize for the obscene watermark, Andy notices his girlfriend Jamie is there. He is confused at first, but after approaching her, realizes that she was a high school student. He was shocked and Jim was perturbed."},{"type":"paragraph","text":"She is played by Shira Scott Astrof"}],"images":[]},{"title":"Andy's cousin","level":3,"content":[{"type":"paragraph","text":"Andy has a cousin with whom he has a \"weird, flirty, nebulous thing.\" (The Meeting)"}],"images":[]},{"title":"Oscar Martinez","level":2,"content":[],"images":[]},{"title":"Gil","level":3,"content":[{"type":"paragraph","text":"Gil is Oscar's ex-boyfriend."},{"type":"paragraph","text":"In the episode The Secret, it is revealed that Oscar didn't miss work due to illness, but that he was out ice skating and shopping with Gil all day. This is the first time the audience becomes aware that Oscar is a homosexual."},{"type":"paragraph","text":"In the episode Gay Witch Hunt, Gil is seen picking Oscar up from work. Together Oscar and Gil go on vacation together. Gil appears alongside Oscar when he returns from his vacation in A Benihana Christmas. He also attends Pam's art show with Oscar in the episode Business School, criticizing her harshly."},{"type":"paragraph","text":"In the episode Beach Games, Oscar informs the documentary crew that he and Gil have broken up."},{"type":"paragraph","text":"Gil is played by Tom W. Chick."}],"images":[]},{"title":"Jan Levinson","level":2,"content":[],"images":[]},{"title":"Astrid Levinson","level":3,"content":[{"type":"paragraph","text":"Astrid is Jan's baby daughter. She was introduced in the episode Baby Shower."}],"images":[]},{"title":"R. Gould","level":3,"content":[{"type":"paragraph","text":"R. Gould is Jan's ex-husband."},{"type":"paragraph","text":"In Season 1, Gould is still married to Jan."},{"type":"paragraph","text":"It is revealed in The Client that Jan and Gould divorced because she wanted to have children, and he didn't. In a deleted scene from Performance Review, Michael calls Gould for advice with Jan. He is moderately offended."}],"images":[]},{"title":"David Wallace","level":2,"content":[],"images":[]},{"title":"Rachel Wallace","level":3,"content":[{"type":"paragraph","text":"Rachel is David's wife. In the episode Cocktails, Rachel must unfortunately deal with Michael and Dwight's uncouth behavior."},{"type":"paragraph","text":"She is played by Jean Villepique"}],"images":[]},{"title":"Hannah Smoterich-Barr","level":2,"content":[],"images":[]},{"title":"Hannah's Son","level":3,"content":[{"type":"paragraph","text":"Hannah brought her baby in to work in the episode The Convict. She dresses him in pink because it's \"his favorite color.\" Michael attempted to recreate a scene from Look Who's Talking using the baby as a prop."}],"images":[]}]}