{"sections":[{"title":"Dwight Schrute","level":1,"content":[{"type":"paragraph","text":"Dwight Kurt Schrute III (born January 20,1966) is a character on NBC's The Office portrayed by Rainn Wilson. He was originally based on Gareth Keenan from the original UK version of The Office. Dwight is the \"Assistant to the Regional Manager\" in selling paper, despite lacking social skills and common sense. He is also the best salesman at Dunder Mifflin. Despite his initial personal dislike of Jim Halpert, the two are a very effective sales team. He is one of the two deuteragonists of seasons 1-7, as well as one of the two main characters of seasons 8 and 9, alongside Jim Halpert. "},{"type":"paragraph","text":"In an episode commentary on the season-one DVD, Wilson refers to Dwight as a \"fascist nerd\". In a featurette on the season-three DVD, Wilson describes Dwight as \"someone who does not hate the system, but has a deep and abiding love for it\"."},{"type":"paragraph","text":"Dwight was a former volunteer sheriff's deputy, and has been trained in surveillance. He has also displayed expert levels of knowledge and training in hospitality management, seduction, social dynamics, agriculture, espionage, and economics. Dwight also speaks German, though he says it is \"pre-industrial and mostly religious\". Dwight's vast compendium of other talents and skills include, but are not limited to: military strategist & weapons expert, martial arts & other modes of self-defense, he is an avid survivalist and successful entrepreneur. He enjoys Smallville, Battlestar Galactica, the Harry Potter franchise, Star Wars, The Crow, The Apprentice, Lost, Survivor, The Amazing Race, HBO's Game of Thrones, and 24. Dwight lives on his family's 60-acre (240,000 m) beet farm, in a nine-bedroom farmhouse (with one outhouse, under the porch), with his cousin Mose, where they grow table beets. Dwight also likes paintball, survivalism, Goju Ryu and weapons. He drives a 1987 Pontiac Trans Am."},{"type":"paragraph","text":"Not much is revealed about Dwight's parents except that his father used to take him hunting, cheated in games, and that he battled obesity, high blood pressure, and cancer. It was also said (S6:E19 \"St. Patrick's Day\") that he did not see his father for the first 2 years of his life. It was revealed in deleted scenes of \"The Convict\" that Dwight was born thirteen pounds and five ounces, and that because of this, his mother could not walk for three months. Dwight once mentioned that his grandfather fought in WWII and ended up in an Allied prison camp, implying he was a soldier in the German army. This is later confirmed while Dwight is explaining his reasoning for his living to a long age. He tells the cameras that his grandfather is still \"puttering around Argentina somewhere,\" implying that his grandfather was one of the members of the SS who fled into South America. Later, in Andy's Ancestry Dwight clarifies that his grandfather was a member of the German American Bund, which he states is \"not technically the same thing as the Nazi Party.\" His father and grandfather are also named Dwight Schrute, however, his great-grandfather was named Dwide Schrude."}],"images":[]},{"title":"Casting","level":2,"content":[{"type":"paragraph","text":"Dwight Schrute is portrayed by American actor Rainn Wilson. The character is based on Gareth Keenan of the original British version of the show, who was played by actor Mackenzie Crook."},{"type":"paragraph","text":"All original series characters were adapted for the U.S. version. Unlike Carell, Wilson watched every episode of the original British series and was a fan before he auditioned for the US version. Wilson originally auditioned for Michael, a performance he described as a \"terrible Gervais impersonation\"; however, the casting directors liked his audition as Dwight much more and hired him for the role. Wilson based Dwight's hairstyle on his own style he had when he was sixteen. In an interview, he said that he went to a barber to get \"the worst haircut possible.\""}],"images":[]},{"title":"Character information","level":2,"content":[{"type":"paragraph","text":"When the series begins, Dwight Schrute is a competent salesman at the Scranton branch of the paper-goods distribution company Dunder Mifflin.  Dwight craves authority over others and relishes any minor task that Michael or anyone else gives him. Though Dwight acts like a know-it-all, he is actually quite gullible and naïve. For this reason, he is easily tricked and pranked by his desk-mate and fellow salesman Jim Halpert. Dwight speaks in a halting, intense manner, even in casual conversations.   Dwight almost always wears a mustard-colored short-sleeved dress shirt (he buys them in crates from his \"shirt guy\") with a dark tie, often with a brown suit jacket, and sports a Casio calculator wristwatch. He often uses one-upmanship to better himself over his peers, such as boasting about how he trains specific parts of his body or how he can outrun Toby Flenderson on a skateboard. Though he has little, if any, sense of humor, Dwight often engages in-jokes and games to appease Michael but fails because of Michael's perception of himself as the jokester. After Dwight temporarily leaves Dunder Mifflin, it is shown that he watered the office plant and arranged the toys on Michael's desk in a manner that made Michael happy. Dwight also has a preference for the driver's side back seat of cars because \"in the event of an accident, the driver always protects their side\". He is also allegedly a cholera survivor, as stated in the episode \"Body Language.\""}],"images":[{"src":"https:\/\/vignette.wikia.nocookie.net\/theoffice\/images\/9\/92\/Giphy.gif\/revision\/latest\/scale-to-width-down\/220?cb=20150120231820","caption":""}]},{"title":"Family and Childhood","level":3,"content":[{"type":"paragraph","text":"Dwight claims to remember his own birth including his father delivering him and his mother biting the umbilical cord. Dwight was a twin, but he \"resorbed\" his twin while still in his mother's womb. He believes that he now has \"the strength of a grown man and a little baby\". He claims to have been born weighing 13 lbs 5 oz (6.0 kg), rendering his mother, Hedda, incapable of walking for three months and two days. In \"Baby Shower\", Dwight claims to have performed his own circumcision. Dwight was shunned by his family between the ages of four and six for forgetting to save the excess oil from a can of tuna. He lost a grade school spelling bee to Raj Patel by misspelling the word \"failure\" in front of the entire school. In seventh grade, Dwight played the invented role of \"Mutey the Mailman\" in a production of Oklahoma! He explains that there were not enough roles for all of the children, so they made up roles. Dwight's father — also named Dwight Schrute — battled high blood pressure and obesity all his life, but often went hunting with his son. In the deleted scenes of the Season 5 episode, \"The Duel\", Dwight also reveals that his great-uncle Helmuth was locally renowned for building a makeshift flying machine in four years; but he was promptly killed when said machine landed on a small girl. In this episode, he tells us that there are 40 rules all Schrute boys must learn by the age of five. --\"Learn your rules, you better learn your rules, if you don't you'll be eaten in your sleep\". Rule 17- \"Don't turn your back on bears, men you have wronged, or the dominant turkey during mating season.\" In the Season Two DVD bloopers it is revealed that Dwight's father would take him and his brothers to a swimming hole on hot summer days as a child until 10:00 AM, then they would work the beet fields until well after midnight."},{"type":"paragraph","text":"Dwight's paternal great-grandfather, Dweide Schrude, was Amish and apparently others in his family have been as well since Dwight's cousin and housemate Mose dresses as a practicing member of the Amish. Dwight speaks German, but his knowledge of it is \"pre-industrial and mostly religious\" as might be expected if the language was learned exclusively in an Amish church or context."},{"type":"paragraph","text":"Dwight lives in a nine-bedroom, one-bathroom (which is located under the porch as revealed in \"Office Olympics\"), farmhouse on his family's 60-acre beet farm with Mose, selling beets to local stores, restaurants and roadside beet stands. It is also revealed that Dwight uses part of his farm to grow hemp; in Launch Party, he claims that teens keep stealing it, though a pizza delivery boy under the impression it's marijuana as opposed to hemp claims that it's \"really crappy\". Dwight and Mose have also turned Schrute Farms into a very ramshackle bed & breakfast that was visited during \"Money\" by Jim and Pam. The bed and breakfast had three theme rooms, \"America, Irrigation, and Nighttime\". Schrute Farms was also to be the site of Andy and Angela's wedding before the two broke off their engagement."},{"type":"paragraph","text":"Dwight's maternal grandfather, whose surname is Manheim fought in World War II and killed twenty men before ending up in an Allied prison camp. In \"Take Your Daughter to Work Day\", Michael refers to Dwight's grandmother as a \"Nazi war criminal\". In \"Dunder Mifflin Infinity\", Dwight reveals that he has a grandfather still alive at 103 years old and living in Argentina, but when he went to visit him, his travel visa was protested by the Shoah Foundation. Dwight reveals the day of casino night that he is wearing the suit his grandfather was buried in \"Casino Night\". It is possible that this is the same grandfather that was reburied in an \"old oil drum\" (Grief Counseling). In the deleted scenes for \"The Surplus\" in Season 5, Dwight tells Angela that his family came over on a U-Boat after she tells him that Andy Bernard's ancestors came to the U.S. on the Mayflower."},{"type":"paragraph","text":"According to one of Dwight's weblogs on NBC.com's \"Schrute-Space\", he had an uncle named Gunther, a goat farmer, who fled the Allied invasion of Germany and married a Finnish woman with whom he had 17 children. He also had an Uncle Grit who revealed that the Schrute family has an ongoing hatred of Harry S. Truman because they were staunch supporters of Thomas Dewey. In another blog, he mentions a cousin named Heindl, who received numerous injuries and infections from an attack by a small sheepdog that was working for their family. In The Inner Circle, Dwight told Deangelo that Dwight had 70 cousins."},{"type":"paragraph","text":"At the end of season 9, Angela tells Dwight that Phillip is his son after he makes him choose between a large sum of money or a beet."},{"type":"paragraph","text":"Dwight has 2 uncles who fought in Korea, Jacob who fought with Thomas Novak while they where both with the 3rd Battalion, 5th Marines, and Fritz who fought with the Belgian United Nations Command since he was born in the town of Krinkelt in 1935 to German parents. Jacob was KIA in Battle of Pusan Perimeter by an M1938 Howitzer while riding in an nM3 Half-track."},{"type":"paragraph","text":"Dwight's mother was named by Jim in season 8 episode 6 when they were trying to discover Dwight's password for the accountability booster. Her official name given by Jim is Hedda."}],"images":[]},{"title":"Interests","level":2,"content":[{"type":"paragraph","text":"Dwight is trained in the art of surveillance and is a former Lackawanna County volunteer sheriff's deputy. He is also a black belt in Goju-Ryu karate and was the senpai at his dojo. Dwight is a pop culture and sci-fi buff who has expressed fan-ship of many sci-fi movies and popular TV shows. In the episode \"The Fire\", he referenced the movie The Crow as being his favorite. He hints at belief in fictional creatures such as androids, zombies and vampires (though curiously, despite having claimed in \"Business School\" to have shot a werewolf, he says in one of his blog entries that he does not believe in them; however, he may have simply been denying claims of werewolves at Schrute Farms in order to prevent potential visitors from being frightened away). He enjoys playing table tennis and states that many of his heroes are table tennis players. He is also shown to be very good at the sport. His musical tastes vary, but heavy metal seems to be a recurring theme, Mötley Crüe may be his favorite band to get pumped up by. He also likes obscure metal acts, in \"Initiation\" Ryan and Dwight are listening to Life of Agony on the way to the beet farm in the Trans Am. His personal musical talents are not lacking, as he plays guitar and recorder, and sings. He has a fascination with cars; he usually checks a car's suspension, especially muscle cars. He drives a 1987 Pontiac Trans Am. He is technologically talented and shows a passion for the online role-playing game, Second Life, in which the only difference between himself and his avatar is that his avatar can fly. He also shows an interest in trains as he's restoring a life-size train in his slaughterhouse during \"The Meeting\", which has him bonding with Toby as they share the same interest. Dwight expresses his interests in weaponry and surveillance. Dwight owns an impressive array of weaponry. In addition to Laser Tag and paintball equipment, he has a crossbow range at his farm (\"Office Olympics\") and, when he was named official security supervisor of the Scranton branch, hinted that he might bring a bow staff to work. He maintained a hidden arsenal of weapons around the office seen in The Negotiation, including pepper spray, nun-chucks, throwing stars, a stun gun, a boomerang, handcuffs, a nightstick, a pair of brass knuckles and a Chinese Sword, all of which were confiscated by Toby. Dwight also claimed to have sat at his desk for an entire day with a Spud Gun without any trouble from security. Dwight also uses a real gun, a Colt Anaconda, fired within city limits, to start off the race in Fun Run. He also produced a disturbing number of Molotov cocktails for a panty raid on Utica in \"Branch Wars\". In \"Survivor Man\", it is revealed that Dwight still has many knives (and other weapons) hidden on himself (as in \"Stress Relief\" there is a knife strapped to his leg) or strategically positioned throughout the office ('Mr. A Knife' in a filing cabinet and water cooler, sword in ceiling tile, blow dart in a toilet, a compound bow under a couch) and he owns a .22 rifle with scope. Also in this episode, it is shown that Dwight has extensive knowledge of how to look after himself in the wild, being able to provide himself with food, and observes Michael from a distance through the scope of a bolt-action centerfire rifle and stops Michael from poisoning himself.  Dwight is vocal about his views on justice, which is reflected in his television viewing habits as he enjoys watching and has great admiration for Judge Judy. In \"The Negotiation\", Roy attacks Jim because he kissed Roy's fiancee, Pam, but Dwight intercepts the attack with pepper spray. Jim wants to show his appreciation, but Dwight refuses to accept his gifts: \"Citizens do not accept gifts for being citizens\". (At the end of the episode, Jim sees Dwight kissing Angela and declares that, by keeping his silence on the relationship, his debt is repaid.) In \"Drug Testing\", Dwight finds half of a joint in the parking lot, which incites him to carry out a full-out investigation. When he discovers that Michael might have been exposed to drugs at a concert he substitutes his own urine during the drug test. Dwight then resigns from his volunteer position at the Sheriff's Department because he feels he is no longer worthy of working there. In \"Frame Toby\", Dwight states that he is good at framing people and animals, saying that he once framed a raccoon for opening a Christmas present and a bear for eating out of the garbage. In the episode \"Women's Appreciation\", he is quoted as saying \"Better a thousand innocent men are locked up than one guilty man roam free.\""},{"type":"paragraph","text":"In Stress Relief and Happy Hour, it is hinted that Dwight is against vegetarianism. When asked what charity he dislikes he says PETA and says he likes the fact that Isabel is not a vegetarian. Despite his indifference to animals, on rare occasions he has shown affection for them, such as in Whistleblower, he expresses enjoyment at seeing a video of a cute baby otter."},{"type":"paragraph","text":"Dwight also seems to like the band Mötley Crüe when he is seen in Performance Review and Traveling Salesmen dancing to their music."}],"images":[{"src":"https:\/\/vignette.wikia.nocookie.net\/theoffice\/images\/4\/44\/Dwights_blowgun.png\/revision\/latest\/scale-to-width-down\/192?cb=20180607192911","caption":"Dwight's Blowgun kept in toilet."},{"src":"https:\/\/vignette.wikia.nocookie.net\/theoffice\/images\/3\/30\/Dwights_sword.jpg\/revision\/latest\/scale-to-width-down\/200?cb=20180607192954","caption":"The Sword kept in the ceiling"}]},{"title":"Coworker relations","level":2,"content":[{"type":"paragraph","text":"In \"Drug Testing\", Dwight says that he likes the people he works with, \"with four exceptions\". It is up to the audience to make educated guesses about whom these four exceptions are."}],"images":[]},{"title":"Jim","level":3,"content":[{"type":"paragraph","text":"Since the start of the series, Dwight has been annoyed by Jim as he is continuously pulling fairly annoying pranks on him, resulting in feuds between the two multiple times and causing problems in the office. In Christmas Wishes, Dwight and Jim keep pranking themselves in order to get the other one's Christmas bonus. Jim eventually learns that Andy withdrew the idea as it was causing more problems and asked Jim to tell Dwight. Jim, however, does not and allows Dwight to keep pranking himself, resulting in Dwight vandalizing his own car."},{"type":"paragraph","text":"He is also frequently the target of practical jokes by both Jim and Pam Halpert, though he remains oblivious to Pam's involvement. As a result, Dwight and Jim have an ongoing feud that reaches a head in \"Conflict Resolution\", when Dwight threatens to quit unless Jim is transferred. Professionally, Dwight wins the 2005 Salesman of the Year Award, though this is likely due, at least in part, to his stealing Jim's largest client."},{"type":"paragraph","text":"Dwight's relationship with Jim mellows somewhat in later seasons, and they sometimes cooperate effectively on sales calls or running the office in Michael's absence. However, when Jim is promoted to co-manager, Dwight's enmity returns full force and he conducts an ongoing campaign to depose Jim, who eventually resumes his old job as a sales representative, pleasing Dwight who (wrongly) believes that his \"diabolical plan\" forced Jim to resign."},{"type":"paragraph","text":"Somewhat surprisingly, Dwight was regretful during \"Initiation\" as he told Ryan he and Jim never got along, and since that point and Jim's return from Stamford they have generally gotten along better. Jim is annoyed when Andy replaces Dwight in the brief time Dwight has quit. Jim even consoled Dwight during the painful aftermath of his break up with Angela, although Dwight maintains a supercilious attitude towards Jim. Dwight did plan to demote Jim from the Assistant Regional Manager spot and make his life a living hell during \"The Job\" but Jim mocked his plans and they did not produce any concrete impact on Jim."},{"type":"paragraph","text":"The two become closer after Jim saves Dwight from losing his job in the episode Last Day in Florida. This new respect grows and blooms into outright friendship by the end of season 9. Dwight makes Jim his Assistant to the Regional Manager and helps Dwight with his relationship problem about whether to ask Angela or his current girlfriend to marry him. In Finale, Dwight makes Jim his best man for the wedding and Jim plans his bachelor party, surprising him by getting him to make up with Kevin and getting Michael to come to the wedding. After Jim and Pam tell Dwight they plan to move to Texas so Jim can work at Athleap, Dwight fires them--but only so they could receive severance. Also, Dwight tells them that if they ever visit Scranton, they are always welcome to stay with him. In his barn."}],"images":[]},{"title":"Angela","level":3,"content":[{"type":"paragraph","text":"Towards the middle of Season Two, Dwight develops a secret relationship with Angela Martin. Pam begins to suspect a relationship between Dwight and Angela in the episode \"E-mail Surveillance\" by observing their interactions, suspicions which are strengthened in \"The Injury\" and \"Conflict Resolution \" and confirmed by \"Traveling Salesmen \", where Angela confides in Pam about her relationship, using code names (Kurt and Noelle, their corresponding middle names). Ryan discovers the relationship between the two when he overhears a coded conversation between the two in the kitchen. Jim discovers the relationship while coming out of the office bathroom after quitting time to find Dwight and Angela kissing, although on an earlier occasion (The Convention) he unwittingly glimpsed Angela lying in Dwight's hotel room dressed in lingerie, but mistook her for a prostitute. On most occasions, Dwight and Angela will only talk at work in the kitchen, and when facing opposite directions."},{"type":"paragraph","text":"In the episode \"Fun Run\", Angela asks Dwight to care for her sick cat, Sprinkles. Instead of caring for the cat, Dwight feels he should put Sprinkles out of its misery and feeds it antihistamines until it falls asleep and then places the sleeping, but not dead, cat in Angela's freezer. This backfires, and Angela breaks up with him. Jim, on a visit to Dwight's beet farm, finds Dwight sitting alone at night, contemplating Angela's cherub figurine and moaning in anguish."},{"type":"paragraph","text":"In the fourth season finale \"Goodbye, Toby\", Dwight is obviously hurt when Angela's boyfriend, Andrew Bernard, proposes to her. However, in the final scene of the episode (and the season), coworker Phyllis Vance comes back into the office following Toby's farewell party and catches Dwight having sex with Angela, strongly indicating a reconciliation between the two is very much in the cards."},{"type":"paragraph","text":"During the episode \"The Surplus \", Dwight takes Andy and Angela through a supposedly pretend marriage ceremony. Dwight acts as groom and Angela as a bride so that Andy can get an idea of what it will look like. After the \"pretend\" ceremony, Angela confesses to Dwight that she made a mistake choosing Andy. Dwight takes delight in this and tells her he has taken care of it and that the German Mennonite minister had in fact actually married the two, just minutes prior. Angela is enraged by this and later draws up divorce papers for the two of them."},{"type":"paragraph","text":"In the fifth season Premiere, \"Weight Loss\", Dwight and Angela have resumed a covert relationship, using a storage room in the warehouse to have sex whenever Angela finds Andy too unbearable. In \"Business Ethics\", it is revealed that it takes Dwight nineteen minutes and forty-eight seconds to make love to Angela. In \"Crime Aid\", Dwight once again becomes depressed when Andy and Angela have set a date for their wedding. Dwight gives Angela an ultimatum: call off the engagement or lose out on him. She ultimately says no to him."},{"type":"paragraph","text":"After Phyllis tells everyone about the affair, Angela was under pressure to tell Andy but when she failed to do so, Michael stepped in and told him. A duel between Dwight and Andy took place where both realized Angela had been lying to them. Angela was left with no one by the end of the episode. Since then, Dwight and Angela have avoided each other but later episodes have hinted at a possible reconciliation. In the season 6 episode \"The Delivery\", Dwight, witnessing Jim and Pam talk to customers about their unborn child, begins to want a child and asks Angela to be the mother. While Angela seems excited by the reconciliation, Dwight doesn't appear to share those feelings. Dwight's interest in Pam's sister Isabel leads him to tell Angela they can forget about the contract, which infuriates Angela and leads her to sue Dwight in small-claims court. When an arbitrator tells them that the contract is valid and would involve a $30,000 settlement (because it would be illegal to force Dwight and Angela to procreate), Dwight cuts a deal with Angela for five sessions of sex. He then proceeds to abuse his genitals in an effort to sterilize himself and curtly fends off Angela's efforts to be romantic during Season 6 in The Chump."},{"type":"paragraph","text":"In season 8, Angela gives birth to Phillip Lipton \"prematurely\". However, this is found to be a lie and she was pregnant for 9 months. This means that Phillip was conceived one month before Angela and Senator Lipton married. During that time, Dwight had slept with Angela because the Senator was not satisfying her. Inevitably, Dwight finds this out and suspects that he was the father in the episode (\"Jury Duty\"). "},{"type":"paragraph","text":"In season 9's episode (\"A.A.R.M.\") Angela brings Phillip to the office because the daycare had turned him down. Dwight watches his actions and that reignites his suspicions about him being the father. He then confronts Angela about this and offers her a marriage and Phillip's true inheritance, but she turns him down."},{"type":"paragraph","text":"In season 9, Dwight realizes that he loves Angela. He talks to Jim about this and makes the decision to propose to her. Angela says yes, and reveals that Phillip is actually his son, but she wanted Dwight to propose for love and not for the baby. After a year-long engagement, they get married in the season finale of Season 9, which is also the finale of the show. (\"Finale\")"}],"images":[]},{"title":"Michael","level":3,"content":[{"type":"paragraph","text":"Because of his authoritarian personality, Dwight generally worships his boss, viewing him as a model for success, and often jumps in on Michael's ill-conceived schemes. He craves authority and is thrilled when asked to handle any task given to him. He has also been known to assume authority even when it is not handed to him. Dwight does seem to understand sometimes that Michael views him with a large dose of contempt, and has begun to return the favor in recent years, from siding with Charles Miner during the Michael Scott Paper Company arc to telling Michael he would have had a much stronger career path if he'd taken a job at Home Depot. But, with the enormous exception of going over Michael's head to vie for the manager's job in The Coup, his loyalty to his boss rarely flags. His ruthlessness also shows, given that Dwight isn't afraid to change jobs if it means more money, stating he'll go \"where they value loyalty to the most\". He also shows a drive to help Dunder Mifflin compete, going so far as to help destroy a friendly family that runs a rival company in \"Prince Family Paper\", by chasing after Michael over their business leads when Michael chooses not to give the information to corporate because of his conscience. During Michael's meetings in the conference room, Dwight is sometimes seen taking notes."},{"type":"paragraph","text":"When Michael's replacement, Deangelo Vickers, starts working at Dunder Mifflin, Dwight and Michael start to have a strain on their relationship. Dwight becomes very offended that Michael did not recommend him for the position of regional manager. After giving Michael bull testicles as a sign of hostility, Dwight learns that the regional manager position was not Michael's to give away. However, this does not fully fix their relationship. It is truly fixed when Michael gives Dwight a letter of recommendation that says that Dwight is hard working, and one of a kind. With this letter came a note from Michael inviting Dwight to a game of paintball. Here, their relationship seemed to be fully repaired."},{"type":"paragraph","text":"There is no evidence that Michael and Dwight continue their relationship after Michael moves to Colorado, however, Michael comes to Dwight's wedding and becomes Dwight's best man. During the table read for the final episode, a scene which eventually was cut from the episode has Dwight telling the crew that Michael sent him his \"World's Best Boss\" mug after he became a manager."}],"images":[]},{"title":"Pam","level":3,"content":[{"type":"paragraph","text":"Dwight's relationship with Pam is at times confusing. Pam often aids Jim in pranks against Dwight, and even at times pulls her own pranks on him. However, Dwight often is very kind to Pam. In The Injury, Pam becomes very friendly with a concussed Dwight. Although Dwight has a serious concussion and is not acting normal, Dwight's kindness is perhaps his true feelings for Pam. In China, Dwight, after seeing a depressed and defeated Pam, lets Pam win the tenant-owner war, thus allowing Pam to feel good about herself. Other people in the office have also said that 'Dwight likes Pam' as seen in Doomsday. In Back From Vacation, Dwight gently tries to comfort a crying and lovesick Pam, the first thing he says to her being \"Who did this to you? Where is he?\" in a manner that suggests he was going to go and fight to make her happy, although he then mistakes her sorrow over Jim's relationship with Karen for premenstrual syndrome after she asserts that it was 'nothing'. In Livin' the Dream he tells Clark that Pam is \"really cool\". In the final episode, he refers to her as his best friend."}],"images":[]},{"title":"Ryan","level":3,"content":[{"type":"paragraph","text":"Dwight feels threatened by Ryan, to whom Michael often assigns personal tasks, and he continues to resent Ryan, a temp, throughout the second season, often addressing him as \"Temp,\" even after Ryan took Jim's job. At the beginning of season 2, Dwight's friendship with Michael was slightly torn during one of the episodes when Michael must evaluate Ryan. Dwight remained cautious. Dwight takes Ryan under his wing for his first sales call, although they get off to a rough start when Dwight has him undergo a series of bizarre initiation rituals, including abandoning Ryan in a beet field. But soon after, Dwight takes Ryan on his first meeting, which ends in disaster and the two later egg the potential customer's building out of spite. During season 4, Dwight along with Michael, comes to Ryan's rescue when they visit him in New York City when he gets into a scuffle. The two later team up in season 6 when Dwight plans to take Jim down as branch co-manager."}],"images":[]},{"title":"Andy","level":3,"content":[{"type":"paragraph","text":"As a result of the Scranton-Stamford merger, Dwight loses his number two position to Jim and engages in an ongoing battle with new salesman Andy Bernard to gain Michael's favor for \"third-in-command\". The struggle comes to a head in \"Traveling Salesmen\". In Season 4, Andy and Dwight work well together as a sales team, but Andy's successful pursuit of Angela after she broke up with Dwight was annoying to him. When Andy gets engaged to Angela, Dwight is greatly upset and embarks on an affair with Angela. This affair culminates in a short-lived fight between Andy and Dwight when they find out Angela has lied to both about sleeping with them. However, by season 5, Andy and Dwight become friends and discover they both share a mutual interest in music and hunting."}],"images":[]},{"title":"Other relationships","level":3,"content":[{"type":"paragraph","text":"A subtle running joke throughout the series is Dwight's surprising success with attractive women, with Michael often failing to \"hook up\" at the same time. Despite Dwight's unusual appearance and mannerisms, he manages to attract women who usually develop stronger feelings for him than vice versa. Michael Scott has even pointed out how socially weird Dwight is being, only for the woman to brush it off. In \"Night Out\", Dwight hooks up with a women's basketball player, while Michael fails in his attempts with a couple of women. As Michael and Dwight leave the club, the woman calls out for Dwight to call her, which he says to Michael that he will not do. In \"Niagara\", Michael and Dwight compete for the attention of Pam's friend and bridesmaid, Isabel. When Dwight starts talking about his farm, Michael tries to explain that no one can connect with his experiences as a farmer, only for Isabel to become interested in Dwight's horses. Dwight ultimately manages to sleep with her, and she even begins to develop deeper feelings for him which he does not return, although it is finally hinted in \"The Delivery\" that Dwight might have more intimate feelings for her than he originally let on. They meet again at the bar in \"Happy Hour\", and bond further, kissing at the end of the episode. In a chat at OfficeTally.com, Mindy Kaling noted that Dwight is not a typical \"nerd\" character, that he is a \"farmer and kind of strapping and tall\", and it generally makes sense that he does well with the opposite sex."},{"type":"paragraph","text":"Dwight also interacts with Creed when he suspects Jim Halpert to be a vampire. He asks Creed if he could make a wooden stake for him in less than an hour."}],"images":[]},{"title":"Character reception","level":2,"content":[{"type":"paragraph","text":"The Dwight Schrute character has had a very positive reception and is often cited as one of the most popular characters on the show. According to Entertainment Weekly, he is one of the \"greatest sidekicks.\" In TV Guide's list of the top 100 characters in television history, Dwight was ranked 85th. In an ABC News interview with Rainn Wilson, the interviewer commented that \"Words barely describe Dwight Schrute, the suck-up salesman and assistant to the regional manager of the Scranton branch for the Dunder Mifflin Paper Company...\" and \"Dwight, as played by the 41-year-old Wilson, has become one of the breakout characters in television comedy. Dwight is a survivalist geek, a student of karate who likes to shoot a crossbow and watch Battlestar Galactica on television. And he takes himself very, very seriously...\" E! News commented that Rainn Wilson should be nominated for an Emmy Award for his performance of Dwight, commenting: \"...Who's laughing now? Who's laughing now, Dwight Schrute? Oh, only the ten million-plus people who watched as you pepper sprayed the living daylights out of Roy for trying to pop Jim in the face last night. My God, have I missed you, man. Mr. Schrute, you are the reason I love my job, my friend. It is the selflessly heroic actions of a man such as you that make television a nice place to be on a Thursday night. You may just be an everyday citizen who does not accept prizes for being a citizen, but you'd best be accepting a supporting actor Emmy nod this year, because, hot damn if you don't deserve it.\""},{"type":"paragraph","text":"Another positive review of the character was given by PopMatters, an online entertainment news site. The review stated: \"One of the show’s ironies is that Michael and Dwight, hapless though they might be within the office or in most social settings, are actually top salesmen...Undeterred, or unaware of any of this, Dwight carries on with his dreams of grandeur, even instituting a reward system called Schrute Bucks for employees who please him during a brief but tyrannical reign as branch manager...Dwight approaches sales with the same militaristic fervor as everything else in his life, and it pays off for him (maybe that’s one of the reasons why, when Jim gives Dwight one of Benito Mussolini’s speeches to deliver when he accepts a sales award in Season Two, Dwight delivers it so enthusiastically that he gets a standing ovation)...\" The Devil Wears Prada has a song titled \"Assistant to the Regional Manager\" which they indirectly associate with Dwight by way of a T-shirt designs which strongly resembles him. It is named \"Guy Wearing Tie.\""}],"images":[]},{"title":"Outside of The Office","level":2,"content":[],"images":[]},{"title":"Bobblehead Doll","level":3,"content":[{"type":"paragraph","text":"In the episode Valentine's Day, Dwight is given a bobblehead doll as a Valentine's gift from Angela. Following the episode, fans of the show petitioned NBC to make the bobblehead doll available for purchase on their online store. NBC responded by creating an initial run of 4,000 bobblehead dolls, which sold out almost immediately. The creator of the show, Greg Daniels, joked about the bobbleheads, saying \"Yes, they are fun, but they also serve a business purpose. People who want to manage by consensus can buy six and keep them nodding all the time to whatever they say.\" The item is currently sold on Amazon and the NBC store."}],"images":[]},{"title":"Résumé","level":3,"content":[{"type":"paragraph","text":"In \"Halloween\", Jim and Pam uploaded Dwight's resume to \"Monster.com, Craigslist, and Google.\" A producer actually did create a Monster account for Dwight and uploaded his résumé a month before the episode aired. It can be found by employers with resume database access who search for salesmen in Scranton, Pennsylvania. The résumé stated that he was willing to relocate to another state, wanted a salary close to $250,000, desired the job title of regional manager, was currently \"Assistant to the regional manager\", and had a Bachelor's Degree. The posted résumé also stated: \"My time spent at Dunder Mifflin was very enjoying. I had the opportunity to learn from an experienced and talented boss. My branch consistently was one of the top sellers of the company...\""}],"images":[]},{"title":"Schrute Farms","level":3,"content":[{"type":"paragraph","text":"In \"Money\", Jim refers to a TripAdvisor page for Dwight's bed and breakfast. This can be found by searching for Schrute Farms. Jim and Pam discover that Dwight is running the Schrute Farm as an \"agrotourism\" bed and breakfast. They spend the night there, taking part in table-making demonstrations, beet wine-making, and distributing manure. That night, however, Jim finds Dwight moaning in depression over Angela. The TripAdvisor page said:"},{"type":"paragraph","text":"\"Schrute Farms is the number one beet-related agrotourism destination in Northeastern Pennsylvania. We offer the finest accommodations for the casual traveler and\/or beet enthusiast. Come to join us and experience majestic Schrute Farms.\""},{"type":"paragraph","text":"Jim and Pam (\"JandP2\") also posted a review, which can be seen on the reviews page. It read: \"The architecture reminds one of a quaint Tuscan beet farm, and the natural aroma of the beets drifts into the bedrooms and makes you dream of simpler times. You will never want to leave your room. The informative lecture will satisfy all your beet curiosity, and the dawn goose walk will tug at your heartstrings. Table making never seemed so possible. Great story to tell your friends. Plenty of parking! The staff’s attention to detail and devotion to cleanliness was limitless. From their enthusiastic welcome to the last wave good-bye, Schrute Farms delivers.\""},{"type":"paragraph","text":"An angry Angela also put a review up and mentioned the death of her cat as a main cause for the review. It said: \"I have to warn people about the proprietor of Schrute Farms – he may portray himself as a gentleman farmer, but he is not what he seems! He killed my cat, Sprinkles! Who knows what he might do to you or your loved ones...\""}],"images":[]},{"title":"Vice Presidential Bid Joke","level":3,"content":[{"type":"paragraph","text":"On the May 7, 2008, episode of The Daily Show with Jon Stewart, US Senator and Republican Party presidential nominee John McCain joked that Dwight Schrute would be his vice presidential candidate choice. Rainn Wilson appeared on The Tonight Show on May 14, 2008, and read to Jay Leno a list of demands from Dwight in exchange for being vice president. Included in this list was being able to pilot Air Force One at any time, and only to be addressed as \"Iceman\" while piloting. He also demanded that Jack Bauer be immediately promoted to United States Secretary of Defense, his bunker to include a foosball table and be zombie proof and that the Secret Service members be armed with nunchucks, throwing stars, and flamethrowers. Finally, he demanded a flamethrower, an Iron Man suit, and that fellow character Michael Scott be an \"ambassador to Hawaii.\""}],"images":[]},{"title":"Dwight in Academic Research","level":3,"content":[{"type":"paragraph","text":"Researchers at Brigham Young University, Stanford and Northwestern University demonstrated that social outsiders, similar to Dwight's character, lead to better group decision making. Media accounts of their published study reported that having a Dwight Schrute around is good for business. Dwight was included in articles about the research by Time magazine, Toronto Globe and Mail, The Salt Lake Tribune and Brigham Young University."}],"images":[]},{"title":"Official Account","level":2,"content":[{"type":"list","elements":[{"text":"Dwight Schrute on Facebook","elements":[]},{"text":"Dwight Schrute on Insstar.com","elements":[]},{"text":"Dwight Schrute on Instagweb.com","elements":[]},{"text":"Dwight Schrute on Buzzcent.com","elements":[]},{"text":"Dwight Schrute on Insstars.com","elements":[]},{"text":"Dwight Schrute on Photostags.com","elements":[]}]}],"images":[]},{"title":"Trivia","level":2,"content":[{"type":"list","elements":[{"text":"Rainn Wilson reprised his role as Dwight in the Family Guy episode \"Excellence In Broadcasting\", when Brian and Stewie Griffin watched The Office.","elements":[]},{"text":"Dwight is the only character in the entirety of The Office who appeared and had lines in every episode.","elements":[]},{"text":"Dwight is banned from five different restaurants.","elements":[]},{"text":"Dwight loves the children's show Sesame Street. (\"Secretary's Day\").","elements":[]},{"text":"Dwight has a porcupine called Henrietta. (\"Christmas Wishes\")","elements":[]},{"text":"Dwight used to own an Arctic wolf. (\"Special Project\")","elements":[]},{"text":"Dwight plays (or at least played) World of Warcraft. (\"Get the Girl\")","elements":[]},{"text":"Dwight had appendicitis during his trip to Florida.","elements":[]},{"text":"Dwight's favorite show is Battlestar Galactica.","elements":[]},{"text":"Esther, his ex-girlfriend was revealed to be his third cousin(\"A.A.R.M\")","elements":[]}]}],"images":[]},{"title":"Quotes","level":2,"content":[{"type":"list","elements":[{"text":"\"Before I do anything I ask myself, 'Would an idiot do that?' And if they would, I do not do that thing. Changed my life.\"","elements":[]}]},{"type":"list","elements":[{"text":"\"MICHAEL!\"","elements":[]}]},{"type":"list","elements":[{"text":"\"Through concentration, I can raise and lower my cholesterol at will.\"","elements":[]}]},{"type":"list","elements":[{"text":"\"False. I do not miss him.\"","elements":[]}]},{"type":"list","elements":[{"text":"\"You couldn't handle my undivided attention.\"","elements":[]}]},{"type":"list","elements":[{"text":"\"Today, smoking is going to save lives.\"","elements":[]}]},{"type":"list","elements":[{"text":"\"I am not a security threat. And, my middle name is 'Kurt', not 'Fart'.\"","elements":[]}]},{"type":"list","elements":[{"text":"\"What are you doing clumped around accounting, break it up, you CLIQUE\"","elements":[]}]},{"type":"list","elements":[{"text":"\"I am ready to face any challenge that might be foolish enough to face me.\"","elements":[]}]},{"type":"list","elements":[{"text":"\"Protein powder, huh? Do you cut it with water? Why don't you just take estrogen?\"","elements":[]}]},{"type":"list","elements":[{"text":"\"There are too many people in this world. We need a new plague.\"","elements":[]}]},{"type":"list","elements":[{"text":"\"You will lead millions! Willingly...or as slaves.\"","elements":[]}]},{"type":"list","elements":[{"text":"\"Identity theft is not a joke, Jim! Millions of families suffer every year!\"","elements":[]}]},{"type":"list","elements":[{"text":"\"Dammit, Phyllis!\"","elements":[]},{"text":"\"Hey, did you SMS text message me?\"","elements":[]}]},{"type":"list","elements":[{"text":"Buttlicker, our prices have never been lower!","elements":[]},{"text":"\"Question.\"","elements":[]}]},{"type":"list","elements":[{"text":"In the wild, there is no health care. In the wild health care is: ow, I hurt my leg, I can’t run, a lion eats me, and I'm dead. Well, I'm not dead. I'm the lion. You’re dead.”","elements":[]}]},{"type":"list","elements":[{"text":"I am fast. To give you a reference point, I’m somewhere between a Snake and a Mongoose..... and a Panther.”","elements":[]}]}],"images":[]},{"title":"See Also","level":2,"content":[{"type":"list","elements":[{"text":"The Schrute Family","elements":[]},{"text":"Schrute family traditions and characteristics","elements":[]}]}],"images":[]}]}