{"sections":[{"title":"Ed Truck","level":1,"content":[{"type":"paragraph","text":"Ed Truck is a fictional character played by Ken Howard in the television series The Office. He is known for having been Michael's boss. "}],"images":[]},{"title":"Season 2","level":2,"content":[{"type":"paragraph","text":"In the episode \"The Carpet\", Michael Scott asks Ed for advice when he feels the employees don't see him as a friend. Ed explains to Michael that as the boss, he will never be his employees' friend, a claim that Michael refuses to accept. Ed's advice is to let \"your workers be your workers, your family be your family, your friends be your friends.\""},{"type":"paragraph","text":"Before their conversation, it is suggested that Michael has lured Ed to the office by telling him that there has been a problem with his pension. When Ed inquires about it, however, Michael simply says it was a clerical error that was cleared up before his arrival."},{"type":"paragraph","text":"Michael claims that Ed Truck (his old boss) was the opposite of fun and that when he walked by people, they pretended that they were working. Michael never wanted to end up like Ed Truck and be the boring boss."}],"images":[]},{"title":"Season 3","level":2,"content":[{"type":"paragraph","text":"In the episode \"Grief Counseling,\" it is revealed that Ed Truck had died. Creed Bratton claims that Ed was decapitated in a truck accident, but this may be untrue, given Creed's history of outlandish and inaccurate storytelling (such as a story about Dwight being decapitated), and that Ed's last name is Truck. According to Michael, Ed was almost 70 years old, which makes death of old age more likely. Michael doesn't take his death well, leading to his staging grief counseling with his employees."}],"images":[]},{"title":"Season 4","level":2,"content":[{"type":"paragraph","text":"In \"Dunder Mifflin Infinity,\" Jan Levinson mentions that the company tried to force out older managers by instituting a mandatory retirement age. They were forced to back off because Ed Truck filed an age discrimination lawsuit."}],"images":[]},{"title":"Mentioned in","level":2,"content":[{"type":"list","elements":[{"text":"\"Grief Counseling\"","elements":[]},{"text":"\"Dunder Mifflin Infinity\"","elements":[]},{"text":"\"Costume Contest\"","elements":[]},{"text":"\"Viewing Party\"","elements":[]}]}],"images":[]},{"title":"Trivia","level":2,"content":[{"type":"list","elements":[{"text":"It is mentioned at various times that Ed hired Todd Packer, Michael Scott, Creed Bratton, Darryl Philbin, Stanley Hudson and Phyllis Lapin.","elements":[]},{"text":"He did not hire Dwight Schrute, Kevin Malone or Angela Martin, because their job interviews have been mentioned by Michael.","elements":[]},{"text":"Due to Kelly celebrating her birthday in Season 5, Ed would not have hired her because she would not have been 18.","elements":[]},{"text":"He was born on D-Day.","elements":[]},{"text":"The Carpet is his only physical appearance as he dies in Grief Counseling he does have a physical appearance in that episode however but his face is partially covered so The Carpet is the only time his face is shown unobostructed","elements":[]},{"text":"He was mentioned in the Series Finale when Phyllis notes, \"Remember when Ed Truck got his head cut off?\"","elements":[]}]}],"images":[{"src":"https:\/\/vignette.wikia.nocookie.net\/theoffice\/images\/f\/f9\/Edtruck.png\/revision\/latest\/scale-to-width-down\/318?cb=20190524125617","caption":"Ed Truck talking to Michael in \"The Carpet\", Season 2, Episode 14."}]}]}