{"sections":[{"title":"Erin Hannon","level":1,"content":[{"type":"paragraph","text":"Kelly Erin Hannon is a character in The Office and is played by Ellie Kemper. She is the receptionist at Dunder Mifflin Scranton branch."}],"images":[]},{"title":"Biography","level":2,"content":[{"type":"paragraph","text":"She first appears in \"Michael Scott Paper Company\", and is referred to by her middle name, Erin, so it doesn't complicate things with having the same first name as Kelly Kapoor."},{"type":"paragraph","text":"Erin brings cheer and enthusiasm to her job as a receptionist, unlike Pam who at the time the series started had already become jaded and bored. Erin is perhaps the only employee who enjoys Michael Scott's company, cheerfully indulging his every whim and quirk. Even after Michael resigned as Regional Manager to become a salesman, Erin helped him arrange his toys on his desk, knowing that technically her job was to be Jim's assistant, not Michael's."},{"type":"paragraph","text":"Erin is very naive and is easily impressed. For example, she joins Michael's \"I've got a big box\" chant without realizing the double-entendre (\"Sabre\"), and she looks to Kelly for advice on everything because \"she gets all her clothes at the mall.\""},{"type":"paragraph","text":"Erin was born four months premature and could not eat hard food until the age of six. She believed that she was an orphan  and was raised in a foster home, with her foster brother, Reed. She was in the hospital from ages three to six but remains upbeat and kind ."}],"images":[]},{"title":"Relationships","level":2,"content":[],"images":[]},{"title":"Andy Bernard","level":3,"content":[{"type":"paragraph","text":"Erin dates Andy on and off throughout Erin's time working at Dunder Mifflin. She initially breaks up with Andy in Secretary's Day after learning that he was once engaged and had relations with Angela, but later begins dating him again after her trip to Florida in Get the Girl. They break up once again after Andy's three-month boat trip."}],"images":[]},{"title":"Gabe Lewis","level":3,"content":[{"type":"paragraph","text":"Between Erin's first and second times dating Andy, she begins to date Gabe between season 6 and season 7, much to the chagrin of Andy. They later break up in Michael's Last Dundies. After this point, Gabe begins to display an unhealthy obsession with Erin."}],"images":[]},{"title":"Pete Miller","level":3,"content":[{"type":"paragraph","text":"Erin develops a romantic interest in Pete in season 9 as she becomes disenchanted with Andy during his three-month boat trip. When Andy returns from his trip, she breaks up with him and starts dating Pete in Couples Discount. They continue dating through the rest of the series; they end up together."}],"images":[]},{"title":"Season 5","level":2,"content":[{"type":"paragraph","text":"After Kevin fails miserably as a receptionist, Charles Miner hires Erin at Dunder Mifflin Scranton as the new receptionist. To avoid confusion with Kelly Kapoor, she goes by her middle name Erin . She is looking up to become friends with Kelly. The two of them eventually became closer, which make them decided to restart Cafe Disco."},{"type":"paragraph","text":"Initially, Dwight and Andy compete for her attention, but Dwight withdraws in acknowledgment of his new friendship with Andy. For the remainder of the season, Andy flirts with Erin in his awkward way."}],"images":[]},{"title":"Season 6","level":2,"content":[{"type":"paragraph","text":"Erin is in the girl group \"Subtle Sexuality\" where she and Kelly are the founders and members. In a deleted scene, Erin ruins Pam's painting and asks Kelly for help, after Creed distracts her. Erin is very obedient and asks Michael about everything, including if Pam's candy is allowed to be on the reception desk.  She seems to show interest in Andy when Pam talks to her.  Ryan shows Erin his photos, to her disgust.  Andy asks Erin out on a date, but since the office is playing a game, they are both unsure if they asked or were asked by their characters or each other. Andy meant it, but Erin is unsure. When Erin says that she didn't think it was a real date, Andy says he didn't mean it. In a talking head, Erin reveals she thought it was for real, but she thought Andy meant otherwise.  Erin goes with Michael to the school where he made a promise to a group of kids that he would pay their tuition. Although Michael shows cruel and open disdain for Erin at first, they bond on the way back when Erin cheers him up."},{"type":"paragraph","text":"Later, she waits for Andy to ask her out and practices a song for the new company.  Andy and Erin continue their awkward relationship and Andy tries to ask out Erin but she continues to be oblivious. However, she becomes aware when Andy tells Kelly he likes someone else in the office rather than her.  Andy asks her on a date  and they go on their first date at Erin's house, because she is sick with the flu, but Andy feels awkward because her foster-brother, Reed seems interested in her.  They kiss for the first time at the dump.  They try to keep their relationship under wraps, so as not to create more drama but end up doing what they tried to avoid, and Andy announces that they are together, which Kevin suspected.  Erin later breaks up with Andy due to her finding out about Andy's previous engagement to Angela. (\"Secretary's Day\")"}],"images":[]},{"title":"Season 7","level":2,"content":[{"type":"paragraph","text":"In the Seventh Season, Erin admits that she has been dating Gabe over the summer, much to Andy's discontent (\"Nepotism\"). In the episode Andy's Play, Andy tries to steal her back but is interrupted she gets a call from Gabe and leaves Andy in the theater. In Viewing Party, she attempts to get Michael to bond with Gabe, whose position above him makes Michael insecure, leading him to sabotage the party. After Erin confronts Michael over his hostile feelings for Gabe, Michael angrily questions why she needs his approval as he is not her father. Erin is silent and Michael has an insightful moment, realizing Erin admires him and views him as a father figure. The two share a joke as they pointedly make fun of their developing father-daughter relationship. As he leaves the party, Michael warns Gabe that he will, both figuratively and literally, kill Gabe if he breaks Erin's heart."},{"type":"paragraph","text":"When Holly comes back to replace Toby, Erin shows some dislike towards her for breaking Michael's heart."},{"type":"paragraph","text":"During the annual Dundies Awards (\"Michael's last Dundies\"), Erin breaks up with Gabe, stating that she isn't attracted to him. He responds by coming up on stage, and then leaving immediately afterwards."},{"type":"paragraph","text":"As a baby, Erin was given up for adoption around the same time and area as Phyllis gave her baby up in high school, resulting in the two believing that they could be mother and daughter. They bonded over this possibility and seem to have a close relationship while awaiting the results of a maternity test. The test results showed that they are not related, but Phyllis holds off telling her immediately, saying \"I'll tell her later.\" (\"Search Committee\")"}],"images":[]},{"title":"Season 8","level":2,"content":[{"type":"paragraph","text":"Erin is seen planking in the parking lot which annoys Oscar who disapproves of planking. Erin later tells the cameras that she doesn't get planking, but she does it to fit in. When Robert California leaves the conference room to zero in on an employee, he picks Erin and asks her to describe her day. (\"The List\")"},{"type":"paragraph","text":"Erin continues to have feelings for Andy throughout the season, which are not reciprocated due to his steady relationship with Jessica. She eventually decides to stay in Tallahassee when brought along as part of Dwight's special project. Upon learning her plans, Andy  realizes he still loves her and leaves work to drive to Florida and win her back. (\"Get the Girl\")"}],"images":[]},{"title":"Season 9","level":2,"content":[{"type":"paragraph","text":"During the episode \"Here Comes Treble\" Erin dresses like a puppy for Halloween but is concerned that people will mistake her for a dog, and not a puppy. "},{"type":"paragraph","text":"While Andy is on an extended boat trip with his brother Walter, Erin watches \"Die Hard\" in the breakroom with new employee Pete. (\"Dwight Christmas\")  "},{"type":"paragraph","text":"In \"Couples Discount\", Erin says \"Technically, I'm still dating my first-grade boyfriend. I mean, we just had our 20th anniversary. And, I forgot to get him something.\", This further confirms Erin's age to be 27, as the original air date of the episode was February 7, 2013. This confirms Erin's date of birth to be 1986. Also in this episode, after Andy returns, she finally breaks up with him and dates Pete."},{"type":"paragraph","text":"In the Season 9 episode \"Finale\" an audience member at a \"where-are-they-now\" convention for the mockumentary \"The Office: An American Workplace\" asks Erin what she would do if she met her birth mother. After Erin responds, the audience member reveals she is, in fact, Erin's mother. Erin's father follows suit and Erin hugs them both and cries happily. The three of them later attend Dwight Schrute and Angela Martin's wedding together. "}],"images":[{"src":"https:\/\/vignette.wikia.nocookie.net\/theoffice\/images\/9\/90\/Tumblr_mcixkdPKKY1rdh9g0o1_400.jpg\/revision\/latest\/scale-to-width-down\/180?cb=20130513023950","caption":"Erin dressed for Halloween in the episode \"Here Comes Treble\""}]},{"title":"Trivia","level":2,"content":[{"type":"list","elements":[{"text":"Erin's full name is Kelly Erin Hannon, she goes by Erin to avoid confusion with Kelly Kapoor.","elements":[]},{"text":"Erin attended Keystone College as a flag for the school is seen on her desk in (The Chump)","elements":[]},{"text":"Erin's favorite month was April when she was 7 (Secretary's Day).","elements":[]},{"text":"Erin has had a number of medical issues","elements":[{"text":"Erin has epilepsy (Mafia).","elements":[]},{"text":"Erin has scoliosis and had to wear a back brace for three years (Christmas Wishes ).","elements":[]},{"text":"Erin was born four months premature and as a result, could not eat hard foods until she was six (Niagara).","elements":[]},{"text":"She once spent three years in the hospital (age three to six) for unspecified reasons {possible Scarlett Fever} (St. Patrick's Day).","elements":[]}]},{"text":"Erin weighs 115 pounds according to Andy (Secretary's Day).","elements":[]},{"text":"Shown in Company Picnic, Erin is shown to be poor at athletics.","elements":[]},{"text":"Erin has extensive knowledge of Horse Racing (The Delivery).","elements":[]},{"text":"Erin is an orphan and as a result, spent her childhood in and out of foster homes. She has stated that in the foster home her hair was her room. (Secretary's Day)","elements":[]},{"text":"She once worked at a Taco Bell Express but quit after it became a regular Taco Bell, stating it was too much to work with. (Secretary's Day)","elements":[]},{"text":"In Counseling, Erin shows a misunderstanding of how disposable cameras work, thinking they are meant to be disposed of (thrown in the trash) after the pictures are taken. She recommends using a \"real\" camera for important photos.","elements":[]},{"text":"In Angry Andy, it is revealed Erin has had sex with Andy when she asks Dwight if losing the manager position made him impotent.","elements":[]},{"text":"Erin is really competitive. She discusses how competitive she had to be in the orphanage. She gets angry when she loses. (Paper Airplane)","elements":[]},{"text":"Erin is very bad at breaking up with people. She is still technically dating her first boyfriend and had her twentieth anniversary recently. (Couples Discount)","elements":[]},{"text":"Her possible dad, Robert Campbell was the star QB for The University of Tulsa for 1970-1974 and Backup QB for the Washington Redskins for 1974-1992","elements":[]}]}],"images":[]},{"title":"Quotes","level":2,"content":[{"type":"list","elements":[{"text":"(whispering) \"Dunder Mifflin, this is Erin... He's not available right now... Uh-huh... Yes... Sure, I'll give him the message when he gets up-- gets back.\" (\"Company Picnic\" Season 5 Episode 28)","elements":[]},{"text":"\"Butts, are for poopin,\" (\"Here Comes Treble\" Season 9 Episode 5)","elements":[]},{"text":"\"I guess Andy isn't totally over his current girlfriend, but if he was jealous once before maybe I can make him jealous again. Just not with Robert. He told me he was a ride I'd never survive and I believe him,\" (\"Pool Party\" Season 8 Episode 12)","elements":[]}]}],"images":[]},{"title":"Appearances","level":2,"content":[{"type":"paragraph","text":"Starting with the episode, Michael Scott Paper Company, Erin appears and has lines in every episode, with the following exceptions:"},{"type":"list","elements":[{"text":"Heavy Competition – has no lines","elements":[]}]}],"images":[]}]}