{"sections":[{"title":"Glenn","level":1,"content":[{"type":"paragraph","text":"Glenn is a fictional character played by Calvin Tenner in the television series The Office. Glenn is a warehouse worker."}],"images":[]},{"title":"Season 3","level":2,"content":[{"type":"paragraph","text":"After Michael holds a funeral for a dead bird, Dwight tells Glenn and Philip to clean up the burned ashes."}],"images":[]},{"title":"Season 4","level":2,"content":[{"type":"paragraph","text":"Glenn participated in the Fun Run and appears to have gotten second place."}],"images":[]},{"title":"Season 5","level":2,"content":[{"type":"paragraph","text":"When the rest of the office staff are getting ready to weigh themselves for the weight loss contest, Andy spits hoping that it would cause him to lose some weight. It almost hits Glenn's shoes causing him to stop and stare at Andy with a very surprised look on his face."}],"images":[]},{"title":"Season 6","level":2,"content":[{"type":"paragraph","text":"Glenn and Hide were seen on the lifts while Dwight and Toby investigated Darryl's injury. He was later seen using it as an elevator in The Meeting. Glenn was at the office Christmas Party in the episode, Secret Santa. He was also in the episode St. Patrick's Day telling Darryl to go back to his office in the warehouse. And most recently, he was also in The Cover Up, where he was seen talking to Darryl in his office, where Darryl tells him \"Look I'm not down there anymore, so if the guys start making fun of you, you gotta' start standing up for yourself.\" He was seen talking with Matt in the morning when Oscar arrived. When Matt asked why he was here so early, Oscar pretended that he always got here that early. Glenn then remarked \"No, you don't!\""}],"images":[]},{"title":"Season 7","level":2,"content":[{"type":"paragraph","text":"Glenn is shown to have more sales than Andy, along with Madge and Hidetoshi."}],"images":[]},{"title":"Season 8","level":2,"content":[{"type":"paragraph","text":"When the warehouse staff wins the lottery, they all quit. Glenn and Hide decide to go into business together and invest in an energy drink for asian homosexuals. Glenn can be seen dancing around the office upon him and the staff learning they had won. Darryl's ex-wife Justine later called Darryl and while Darryl was initially excited, he soon learned she just wanted Glenn's phone number. Andy later revealed when he was listing reasons why Darryl did not get the Regional Manager's job that Darryl had chosen Glenn to replace him after he left and that Glenn was very underqualified to be foreman and that people noticed."},{"type":"paragraph","text":"Glenn and Hide later return to beg Darryl for their job back upon losing all their money in the investment. Darryl mocks them at first for the idea but ultimately hires them back. He introduces them to Val and they supposedly become warehouse workers again. This is also the episode where his name is changed for a third time from Calvin to Glenn."}],"images":[]},{"title":"Season 9","level":2,"content":[{"type":"paragraph","text":"When Kevin is stuffing the baler with wrapping paper, Glenn stops and stares at him. Kevin tells him that he is allowed to do this and Glenn keeps walking looking unconvinced."},{"type":"paragraph","text":"Glenn found a chalice that Jim had planted in the warehouse years earlier as part of a \"Dunder Code\" prank to be used against Dwight. He is seen using it as a coffee mug and dipping a doughnut into it."}],"images":[]},{"title":"Notes and Trivia","level":2,"content":[{"type":"list","elements":[{"text":"In his earlier appearances, his name tag read Lester and later changed to Calvin however his name tag has since been changed to Glenn.","elements":[]},{"text":"In a blooper scene from season 9, Pam and Jim says Glenn has a twin-brother named Ben. This was presumably cut because they couldn't finish the scene without laughing.","elements":[]}]}],"images":[]}]}