{"sections":[{"title":"Hank Tate","level":1,"content":[{"type":"paragraph","text":"Hank Tate is the security guard at Scranton Business Park. He is played by Hugh Dane. "}],"images":[]},{"title":"Season 2","level":2,"content":[{"type":"paragraph","text":"Michael first tries to fire Hank, but he can't since Hank works for the building and not for Dunder Mifflin. Michael then asks Hank if he can help subdue a fired employee should he or she \"go postal.\" Hank tells Michael, \"You're on your own.\""},{"type":"paragraph","text":"After Dwight resigns from his job as volunteer sheriff's deputy, Hank is called upon to deputize Dwight as an honorary member of the security team. Hank does not carry a gun."},{"type":"paragraph","text":"Hank stops Dwight to check his ID badge before allowing him to enter the building, while simultaneously waving in all the other employees."}],"images":[]},{"title":"Season 4","level":2,"content":[{"type":"paragraph","text":"After the employees of Dunder Mifflin Scranton are accidentally locked in the business park, Hank is called to come get them out. No one can remember his name except for Creed, who is dismissed as incorrect by the other characters. He takes a significant amount of time and by the time he arrives, the cleaning crew has already let them out."},{"type":"paragraph","text":"Michael requests that Hank be present to escort Toby from the building at the end of his last day at work."}],"images":[]},{"title":"Season 5","level":2,"content":[{"type":"paragraph","text":"Hank plays blues guitar as part of the Crime Aid fundraiser. The title of his CD is Hank Doyle Is the Blues."},{"type":"paragraph","text":"Michael brings Hank into the office to settle the debate between what to purchase with the office surplus, a new copier or new chairs. Hank is indecisive (possibly intentionally), prompting Michael to kick him out."},{"type":"paragraph","text":"Hank donates blood on the same bed where Michael's mystery woman had given blood. After Michael passes out from not eating for three days, he wakes up to see Hank instead."}],"images":[{"src":"https:\/\/vignette.wikia.nocookie.net\/theoffice\/images\/5\/5c\/HankTate.jpg\/revision\/latest\/scale-to-width-down\/200?cb=20100202190136","caption":"Hank Doyle Is the Blues"}]},{"title":"Season 6","level":2,"content":[{"type":"paragraph","text":"When Dwight tells Hank that he is buying the building Hank remarks that he owns 1\/8th of a piece of property in Pittston. However, Dwight replies with \"Well, I'm 1\/8ths proud of you.\" He also tells Hank to enjoy the chair he is sitting in while he can for soon he will have Hank standing like a guard in Buckingham Palace. Hank seems slightly worried by this comment (Whistleblower)."}],"images":[]},{"title":"Season 7","level":2,"content":[{"type":"paragraph","text":"When Michael is checking people off his list of people he wants to say goodbye to before moving to Colorado, Hank's name can be seen still unchecked. Although Michael is never seen saying goodbye to Hank in the actual episode, the final interaction between the two was recorded. In this deleted scene, Michael tries to give an emotional and meaningful goodbye, but Hank just argues with him over his tip. Michael sighs and checks Hank off his list (Goodbye Michael)."}],"images":[]},{"title":"Season 8","level":2,"content":[{"type":"paragraph","text":"Jim and Dwight take a break from loading paper shipments onto the warehouse trucks and go to \"Dwight's Caffiene Corner\". Dwight orders for Erin and asks for a \"hot chocolate tea\". In a deleted scene Hank tells Dwight that its not a real drink however Jim comes up with an idea for what it could be that sounds pretty good. Pam then asks about it and Hank pretends that he thought of it and that its his recipe (Lotto)."},{"type":"paragraph","text":"Jim and Pam try to cancel the prank of hiring a magician to scare Nellie after they learn her ex-boyfriend was one. Pam asks Hank to keep him out. They later confront him over the fact he came and left. Hank then sarcastically suggests that perhaps he used magic to do it (Welcome Party)."}],"images":[]},{"title":"Season 9","level":2,"content":[{"type":"paragraph","text":"When Jim is trying to find a quiet place to have his phone conversation with his fellow investors, he tries the area near Meredith's van. He leans against it causing the car alarm to go off. Hank suddenly comes out of the building believing the sound heralds that the local skating hooligans have returned. As Jim runs away to a quiet spot, Hank stands in the middle of the parking lot shouting at the non-existent skaters to stop cowering and fight and that their misdeeds end now (The Whale)."},{"type":"paragraph","text":"Hank (while presumably on break) watches as Dwight and Clark move an unconscious Stanley wrapped in plastic wrap and tape into a car and drive off. He waves at Dwight while drinking coffee. (Stairmageddon)"}],"images":[]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":"Halloween *","elements":[]},{"text":"Drug Testing","elements":[]},{"text":"Conflict Resolution *","elements":[]},{"text":"Night Out","elements":[]},{"text":"Goodbye, Toby","elements":[]},{"text":"Crime Aid","elements":[]},{"text":"The Surplus","elements":[]},{"text":"Blood Drive","elements":[]},{"text":"Golden Ticket *","elements":[]},{"text":"Two Weeks","elements":[]},{"text":"The Cover-Up","elements":[]},{"text":"Whistleblower","elements":[]},{"text":"Nepotism","elements":[]},{"text":"China","elements":[]},{"text":"The Seminar","elements":[]},{"text":"PDA","elements":[]},{"text":"Todd Packer (episode)","elements":[]},{"text":"Garage Sale","elements":[]},{"text":"Goodbye, Michael *","elements":[]},{"text":"Search Committee","elements":[]},{"text":"Lotto","elements":[]},{"text":"Welcome Party","elements":[]},{"text":"The Whale","elements":[]}]},{"type":"paragraph","text":"* Deleted Scenes"}],"images":[]}]}