{"sections":[{"title":"Helene Beesly","level":1,"content":[{"type":"paragraph","text":"Helene Beesly is Pam's mom, played by Shannon Cochran in \"Sexual Harassment\" and subsequently played by Linda Purl in episodes starting with \"Niagara.\""}],"images":[]},{"title":"Season 2","level":2,"content":[{"type":"paragraph","text":"Helene is upbeat, kind, and is interested in Jim. She, Pam, and Roy go to dinner.  Later, she and Pam talk to each other after Jim tells Pam that he loves her."},{"type":"paragraph","text":"Helene talks to Pam over the phone about Pam and Roy's Wedding"}],"images":[{"src":"https:\/\/vignette.wikia.nocookie.net\/theoffice\/images\/f\/fa\/HeleneBeesly1.jpg\/revision\/latest?cb=20091220143234","caption":"Helene in \"Sexual Harassment\""}]},{"title":"Season 5","level":2,"content":[{"type":"paragraph","text":"Helene and William Beesly separate to the dismay of Pam."}],"images":[]},{"title":"Season 6","level":2,"content":[{"type":"paragraph","text":"Hurt by the divorce, Helene shows a bit of bitterness when comedically telling Pam that its not too late to back out of the wedding. She is not upbeat and is not as fun as she was during season two. Still she is as always supportive and inclusive with her daughter."},{"type":"paragraph","text":"Later, she starts to date Michael Scott, making Pam angry and Pam begins to dislike them both.  However, Pam warms up to the idea and goes on a double date with them. During the date, Michael learns Helene's age and breaks up with her on her birthday.  Pam then slaps Michael after Michael says that, \"she came on to me [him].\""},{"type":"paragraph","text":"Helene visits Pam in the hospital after their baby is born. There she has a brief, awkward encounter with Michael."}],"images":[]},{"title":"Season 7","level":2,"content":[{"type":"paragraph","text":"Upon speculating that a cold sore might be a sign he has herpes, Michael goes on a field trip to visit all of his former lovers. He mistakes her for an old lady at the park however finally finds her. Michael tries to analyze their relationship but Helene reminds Michael that he romanticizes and rejects that they ever had a good relationship. Michael gets upset and leaves calling her a \"jerk\". He never gets the chance to tell her he might have herpes."},{"type":"paragraph","text":"Helene, who watches Jim and Pam's daughter Cece when they are at work, takes Cece to a doctor when she gets a fever. She accidentally locks her in her car and calls Jim to tell him. Jim panics and drives off to go help and accidentally leaves Michael behind at the gas station they were at."},{"type":"paragraph","text":"Helene plays a sexy nurse in Michael's movie. It clearly shocks Pam however she lies and says the movie is really good."}],"images":[]},{"title":"Season 9","level":2,"content":[{"type":"paragraph","text":"When Jim and Pam are getting ready to attend Roy's wedding, Jim tells Cece to go inside who was playing in the yard, telling her \"grandma almost has breakfast ready\". Pam yells \"Thanks Mom!\" through the front door as she leaves implying that Helene is inside and is going to look after Cece and Philip while Jim and Pam are gone."},{"type":"paragraph","text":"Months later, Helene called Pam at work to inform her that Cece had been infected with head lice, unwittingly revealing to the entire office that Pam had infected them with lice."}],"images":[]},{"title":"Mentioned in","level":2,"content":[{"type":"list","elements":[{"text":"Chair Model","elements":[]},{"text":"Casino Night","elements":[]},{"text":"Stress Relief","elements":[]},{"text":"The Lover","elements":[]}]}],"images":[]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":"Sexual Harassment","elements":[]},{"text":"Niagara","elements":[]},{"text":"Double Date","elements":[]},{"text":"The Delivery","elements":[]},{"text":"Sex Ed","elements":[]},{"text":"Christening","elements":[]},{"text":"The Search (voice only)","elements":[]},{"text":"Threat Level Midnight","elements":[]},{"text":"Roy's Wedding (not seen)","elements":[]},{"text":"Lice (voice only)","elements":[]}]}],"images":[]}]}