{"sections":[{"title":"Hidetoshi Hasagawa","level":1,"content":[{"type":"paragraph","text":"Hidetoshi Hasagawa, also known as simply Hide (pronounced hee-day), is a warehouse worker at the Dunder Mifflin Scranton warehouse."}],"images":[]},{"title":"Season 3","level":2,"content":[{"type":"paragraph","text":"Hide appears in several episodes, but does not speak."}],"images":[]},{"title":"Season 5","level":2,"content":[{"type":"paragraph","text":"Hide sits with his wife during Michael's roast.  He appears in several other episodes, but never talks."}],"images":[]},{"title":"Season 6","level":2,"content":[{"type":"paragraph","text":"In his first speaking role, we find that he speaks English poorly. He explains that he was a surgeon in Japan. One day while performing surgery on a Yakuza mob boss, the man died. As a result of this, he fled the country and went to America to start a new life. He credits Darryl for saving his life, and shares a secret with the documentary crew: He actually killed the boss of the Yakuza on purpose."},{"type":"paragraph","text":"Dwight recruits Hide to apply for the \"Print in All Colors\" executive training program because he wants to undermine Kelly's application. Hide begins the interview by describing his former career as a surgeon, and obviously doesn't end up qualifying for the program."}],"images":[]},{"title":"Season 7","level":2,"content":[{"type":"paragraph","text":"After Sabre allows the warehouse workers to sell on the go, \"The Seminar\", we do get some numbers on his sales. His sales were November $8,460, December $7,208, January $2,691."}],"images":[]},{"title":"Season 8","level":2,"content":[{"type":"paragraph","text":"Hide quits after he and the other warehouse workers won the lottery (\"Lotto\"). Darryl later mentions that he is using his money to invest in an energy drink for Asian homosexuals. Later, he and Glenn return after blowing all their money on investing in the energy drink. Darryl hires both of them back (\"Free Family Portrait Studio\")."}],"images":[]},{"title":"Season 9","level":2,"content":[{"type":"list","elements":[{"text":"\"The Target\"","elements":[]},{"text":"\"Junior Salesman\"","elements":[]}]}],"images":[]}]}