{"sections":[{"title":"Irene","level":1,"content":[{"type":"paragraph","text":"Irene is an elderly lady living in Tallahassee, Florida that Erin worked for while she lived down there. She is portrayed by Georgia Engel."}],"images":[]},{"title":"Season 8","level":2,"content":[{"type":"paragraph","text":"Irene and Erin meet at the launch of Sabre's first official retail store. Erin tells her about how she ran away to Tallahassee because she has no future in Scranton with Andy going to marry his girlfriend. Irene comforts Erin and decides to take Erin in as her maid. As they go to her house, Irene tells Erin to forget about Andy. Erin tells her to forget about her deceased husband however Irene points out that that's a little different. In a deleted scene, Irene told Erin her roommate moved with her boyfriend. Her roommate's rent was $80 a month (Test the Store)."},{"type":"paragraph","text":"Erin is unable to figure out how to work a video call and gets Irene to do it for her. She tells Andy that she isn't going to return to Scranton and how she now works for Irene, introducing her as an old lady (Last Day in Florida)."},{"type":"paragraph","text":"Irene's grandson Glenn comes to visit. She brags to Erin about what a great swimmer he is however Glenn reminds her that he hasn't swam in years hinting that Irene might have alzheimers or another memory disorder. Andy meanwhile has run away to Florida and has packaged himself up in a box to surprise Erin. When he pops out of the box and begins singing to her, Irene holds her cane up as if to defend herself. She expresses distaste for Andy reminding him that he has a girlfriend and yet he is down in Florida courting Erin. Irene also appears worried when Erin comments that she is reusing the water to boil hotdogs. Irene later comes to respect Andy upon learning that he is willing to accept the fact he might lose his job and how he isn't returning to Scranton until he gets Erin. Irene tells Erin she should probably go with Andy as he seems he truly likes her. She promises Erin that she will be fine as Glenn is suing Home Depot (Get the Girl)."}],"images":[]},{"title":"Trivia","level":2,"content":[{"type":"list","elements":[{"text":"The voice her Georgia Engel uses for this character is the same voice she uses for Bobbie from the Open Season franchise.","elements":[]}]}],"images":[]}]}