{"sections":[{"title":"Isabel Poreba","level":1,"content":[{"type":"paragraph","text":"Isabel Poreba is a minor character and Pam's Cousin on NBC's hit show, \"The Office.\" She is played by Kelen Coleman."}],"images":[]},{"title":"Personality","level":2,"content":[{"type":"paragraph","text":"Isabel has a distinct personality, and seems to know her way around people. She is supportive of Pam during her wedding, and appears to be kind. Isabel is also very resourceful, helping her get along with Dwight Schrute, a friend and lover for a short time. She is quirky and Dwight calls her a bumpkin. Coming from Dwight, this really means something. Isabel works as a Dental Hygienist, and Dwight notes that she “makes love like one.” Overall, a kind character with a little strange side."}],"images":[]},{"title":"Season 6","level":2,"content":[{"type":"paragraph","text":"Isabel joins Pam and Jim at their wedding. She meets Dwight Schrute and has sex with him, however, Dwight doesn't want to continue. She tells Pam that she is seeing Dwight, to which Pam is shocked, and accidentally tears her veil. She is considered attractive and kind, and Michael is shocked when Dwight doesn’t care for her. Isabel is later seen dancing in the procession alongside an unknown wedding guest and again with Dwight, before promptly being kicked in the face."},{"type":"paragraph","text":"She visits the hospital to see Pam and the newborn baby. She also visits the Halpert home and encounters Dwight.  When Pam, who has been on maternity leave, invites Isabel to happy hour, she and Dwight make out despite his pre-natal contract with Angela Martin, who follows them. When Angela tells Isabel that they are having a baby, she doesn't care, taps Angela on the forehead and says \"whack\", as in \"whack-a-mole\", and leaves with Dwight. Angela decides to take Dwight to court."}],"images":[]},{"title":"Trivia","level":2,"content":[{"type":"list","elements":[{"text":"She is possibly named after Paul Lieberstein's (who plays Toby and is the former show-runner) wife, Janine Poreba.","elements":[]},{"text":"She seems to be culturally different from the rest of her family, as she seems to have a more rural mentality.","elements":[]}]}],"images":[]},{"title":"Appearances","level":2,"content":[{"type":"paragraph","text":"Season Six:"},{"type":"list","elements":[{"text":"Niagara","elements":[]},{"text":"The Delivery","elements":[]},{"text":"Happy Hour","elements":[]}]}],"images":[]}]}