{"sections":[{"title":"Jake Palmer","level":1,"content":[{"type":"paragraph","text":"Jake Palmer is a fictional character played by Spencer Daniels in the television series The Office."}],"images":[]},{"title":"Season 2","level":2,"content":[{"type":"paragraph","text":"Jake is one of Meredith Palmer's two children. Unlike \"the good one\" (Wendy), Jake lives with his mother."},{"type":"paragraph","text":"Meredith takes Jake with her to work on Take Your Daughter to Work Day because he had been suspended from school. Jake is an undisciplined child who shows little respect for others. He demonstrates this by tormenting Dwight all day (by calling him \"Mr. Poop\"). He refers to Meredith by her first name, which Dwight finds disrespectful."}],"images":[]},{"title":"Season 5","level":2,"content":[{"type":"paragraph","text":"In a deleted scene from Company Picnic, Meredith brings Jake to the picnic, but when he talks back to her, she punishes him by confining him to the car for the entire day."}],"images":[]},{"title":"Season 8","level":2,"content":[{"type":"paragraph","text":"According to Meredith in the episode Get the Girl, Jake has, at some point between the 5th and 8th seasons, gotten a face tattoo. Meredith is notably upset by this, referencing it as a negative event, implying that it was done against her will. Jake is seen very briefly in Free Family Portrait Studio, where he and Meredith are about to take a family photo. Jake keeps telling her to smile, and Meredith yells at him that she doesn't want to smile. "}],"images":[]},{"title":"Season 9","level":2,"content":[{"type":"paragraph","text":"In the series finale, it's revealed that Jake has become a male stripper and performs at Angela's bachelorette party, which everyone but Meredith finds awkward. "}],"images":[{"src":"https:\/\/vignette.wikia.nocookie.net\/theoffice\/images\/b\/b3\/Jake.png\/revision\/latest\/scale-to-width-down\/180?cb=20190826143303","caption":"jake in the finale as a stripper"}]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":"Take Your Daughter to Work Day","elements":[]},{"text":"Company Picnic (deleted scene)","elements":[]},{"text":"Free Family Portrait Studio","elements":[]},{"text":"Finale","elements":[]}]}],"images":[{"src":"https:\/\/vignette.wikia.nocookie.net\/theoffice\/images\/5\/54\/MOM0f85uAsdgU8ya1sCWGPCqVol-JZw2YAEU9fm1c2M.jpg\/revision\/latest\/scale-to-width-down\/180?cb=20190826143445","caption":""}]}]}