{"sections":[{"title":"Jan Levinson","level":1,"content":[{"type":"paragraph","text":"Janet \"Jan\" Levinson (formerly Levinson-Gould) is a fictional character played by Melora Hardin in the television series The Office. She was the Vice President of Northeastern Sales and was later the director of office purchasing for the Scranton area hospital. She is currently the CEO of Scranton White Pages. Her UK counterpart is Jennifer Taylor-Clarke."}],"images":[]},{"title":"Season 1","level":2,"content":[{"type":"paragraph","text":"During the first season, Jan and Michael have a traditional boss-employee relationship. Jan shows contempt for Michael as the Scranton branch of Dunder Mifflin is failing. Michael in return dislikes Jan because she is demanding and humorless."},{"type":"paragraph","text":"Michael refers to her as \"Hillary Rodham Clinton\". However, this is not said to her face, regardless of Michael stating that he is not afraid of her. During their meeting in \"Pilot\", a phone call from Todd Packer reveals another nickname - \"Godzillary\"."},{"type":"paragraph","text":"Jan appears in \"Health Care\" where she tells Michael to choose a health care plan for the office and later berates him for putting Dwight in charge."}],"images":[]},{"title":"Season 2","level":2,"content":[{"type":"paragraph","text":"Michael calls Jan to attend the Dundies, however, Jan tells him that she is not coming as she does not want to give the impression that corporate supports this. She tells Michael that they simply do not have the funds to afford all of Michael's parties (The Dundies)."},{"type":"paragraph","text":"Jan shows up to talk to Michael about the recent allegations of the company's CFO has had inappropriate relations with his secretary. She shows up just as Michael comes out of the conference room and announces to the office that one of the girls in the video on sexual harassment he had to watch had slept with Darryl. During their meeting, Michael becomes angry that he can no longer make inappropriate jokes and announces to the office that he must \"retire\" from comedy. Jan becomes annoyed when Jim tricks Michael into saying \"that's what she said!\" (Sexual Harassment)."},{"type":"paragraph","text":"Jan had told Michael to fire someone by the end of the month, which Michael procrastinated. When Pam asked Michael why he had put this off until Halloween, Michael replied: \"because its very scary stuff\" (Halloween)."},{"type":"paragraph","text":"Jan arrives to help Michael land a very important client. Michael finds the various charts and graphs she has impressive. Jan becomes irritated upon learning that Michael had changed the location of the meeting place to Chili's, as he believed the Radisson was too snooty. When Michael learns that Jan is divorced, he is shocked and keeps barraging her with questions. Jan attempts to convince Christian to buy from them. However, Michael keeps distracting him with jokes which he positively responds to. Jan becomes bored and starts drinking heavily being stuck with the two men. When Michael finally lands him, Jan becomes impressed and starts viewing Michael in a different light. In the parking lot, a slightly drunk Jan kisses Michael and coaxes him to go to a hotel with her. Jan is later spotted the next day by Dwight and the cameras getting into her car, which still in the Dunder-Mifflin parking lot. Jim learns about this and finds it amusing and shares it with Pam. Jan calls later and wants to know if Michael had put something in her drink (The Client)."},{"type":"paragraph","text":"Jan comes over to give Michael his performance review and finds him to be irritating as he can only focus on romancing her. Jan later sits in on a meeting of staff giving advice on how to improve the office and Michael ends up insulting the staff. Jan becomes angry with learning that Michael told the entire office of their one-night stand. She leaves saying she will just conduct the review over the phone (Performance Review)."},{"type":"paragraph","text":"Jan comes to conduct women in the workplace seminar and tries to find someone who is corporate material. She becomes annoyed when Michael bothers them. Jan's authority becomes undermined when the staff keeps bringing up how Jan had slept with Michael. Upon learning that Michael had accidentally inspired the warehouse to form a union she goes to the warehouse and advises them not to unless they want the branch to be shut down. She advises Pam to take a design class as well. She leaves the office looking quite depressed (Boys and Girls)."},{"type":"paragraph","text":"When Michael learns that Jim had a crush on Pam he tries to compare himself by telling Jim, \"You know, I made out with Jan\" to which Jim replies, \"Yeah, I know\" (Booze Cruise)."}],"images":[]},{"title":"Season 3","level":2,"content":[{"type":"paragraph","text":"At the beginning of the third season, Jan often gets angry at Michael, such as when she yells at Michael for holding Movie Monday (The Coup). As Dwight puts it, 'ever since Michael dumped Jan, she's been bitching out on him.' After Carol breaks up with Michael in A Benihana Christmas, he invites Jan to go with him to Sandals, Jamaica, and she agrees. In Back From Vacation, it is revealed that the two had sex several times. In Cocktails, the two become an official couple. However, the two break up in Women's Appreciation, after the women of the office discover that he is unhappy when he is with her. It is also revealed that she records the two of them while having sex, and discusses it with her therapist. In The Job, Jan convinces Michael to get back together with her, after displaying her newly enhanced set of sweater puppies. Her new rack is enough to change Michael's mind, in spite of the fact that the women were urging Michael not to get back together with Jan. She was fired for being extremely unstable. David Wallace revealed she would smoke in her office all day, shopped online while at work, took too many supposed trips to \"Scottsdale\" to visit her sister, and visited Michael more times than necessary. After Michael told her they were going to fire her, she cursed at her boss on the way out the door. She subsequently moved in with Michael. "}],"images":[{"src":"https:\/\/vignette.wikia.nocookie.net\/theoffice\/images\/b\/b6\/111423.jpg\/revision\/latest\/scale-to-width-down\/180?cb=20101116030321","caption":""}]},{"title":"Season 4","level":2,"content":[{"type":"paragraph","text":"Jan has moved in with Michael. Her insanity has grown, as she recklessly spends his money and sleeps at home all day. She has, however, started her own company, a candle business called Serenity by Jan. Michael and Jan break up in Dinner Party after a large argument culminating with Jan throwing one of Michael's Dundies at his television. Jan then presumably moves out of Michael's house, living somewhere else. It is implied in this episode, that Jan possibly has a thing for Jim. She tries to dance with him during a song called That One Night, sung by her former assistant Hunter (a song about losing your virginity.) In Chair Model, Michael accidentally calls Jan when trying to show a picture of her to his date. In Goodbye Toby, Jan reveals to Michael that she is pregnant, but Michael is not the father: She got inseminated at a local sperm bank."}],"images":[{"src":"https:\/\/vignette.wikia.nocookie.net\/theoffice\/images\/e\/ef\/1616464.jpg\/revision\/latest\/scale-to-width-down\/180?cb=20101116030446","caption":""},{"src":"https:\/\/vignette.wikia.nocookie.net\/theoffice\/images\/b\/b9\/151564.jpg\/revision\/latest\/scale-to-width-down\/180?cb=20170724042647","caption":""}]},{"title":"Season 5","level":2,"content":[{"type":"paragraph","text":"Jan appears in Season 5 during episodes, \"Weight Loss\" and \"Baby Shower\". In the latter, she makes a trip into the office for her new baby Astrid's baby shower. Michael and all the other office employees are surprised that Jan has already had the baby without anyone knowing. Most of the baby shower's games are based around the idea that Astrid was not born yet. She says to Kevin that her candle company is 'kicking ass and taking names', although this statement is debatable due to the apparently terrible smell of her candles (Dinner Party). In a deleted scene in Stress Relief, she tells Michael that he ruined her life and goes on to belittle him (in a pretty cruel manner) over a phone, but it is still not known where she \"is.\" Also, in Employee Transfer, Michael tells Holly that he hates Jan."}],"images":[]},{"title":"Season 7","level":2,"content":[{"type":"paragraph","text":"While visiting all his ex-girlfriends, Michael visits Jan, who now works as supply shopper for a hospital. She thinks that Michael is there to learn why their relationship didn't work. Michael then blurts out that he has herpes while Jan is with her daughter, Astrid (Sex Ed)."},{"type":"paragraph","text":"While watching a home movie from years ago, Jan appears as a singer named Jasmine Windsong. The cameras later interview Jan about it, who doesn't seem to care as she struggles to unlock her locked car (Threat Level Midnight)."}],"images":[]},{"title":"Season 9","level":2,"content":[{"type":"paragraph","text":"Jan at some point becomes the CEO of White Pages. She later learns of David Wallace's return as CEO of Dunder-Mifflin and plots her revenge by offering the company her business. She plans to make David Wallace realize how powerful she has become, but is disappointed when Pam and Dwight show up instead. She reveals she really wasn't going to sell to them. However, Dwight has an idea and runs off. Pam comments on Astrid when she notices a picture of her on Jan's desk and Jan forces her to watch a slideshow on her. Dwight brings in Clark, knowing that Jan is attracted to young men. She has Clark spin around, becomes attracted to him and promises to give Dwight her business. She then asks Clark when they leave if he has a passport (The Whale)."},{"type":"paragraph","text":"When Andy returns and learns that Dwight offered a discount to Jan that he was not authorized to, he calls Jan to tell her. Jan becomes annoyed when she learns that Andy is asking for more money and she tells Andy that a part of their contract says that she can back out within 30 days, which she plans to do. She then hangs up much to Dwight's anger as Andy had just lost the company's biggest client (Couples Discount)."}],"images":[]},{"title":"Family","level":2,"content":[{"type":"paragraph","text":"Jan has a sister in Scottsdale, Arizona. She often uses her as an excuse for her various unexplained absences such as going to Jamaica with Michael (Back From Vacation*)."},{"type":"paragraph","text":"Jan admits (Cocktails*) to being overly litigious with her family. Her family will not talk to her \"on the advice of counsel.\" (Money)."},{"type":"paragraph","text":"Jan delivered a baby girl, Astrid, shortly before the season five episode \"Baby Shower.\" Astrid's father is an unknown sperm donor. (A deleted scene implies that, to Jan's horror, the donor might well be Kevin.) Later in the deleted scenes for episode \"The Whale\" Jan reveals to Pam Halpert the sperm donor was a \"Caltech physicist\" - possibly a reference to \"The Big Bang Theory\" episode where Sheldon Cooper and Leonard Hofstadter visit the sperm bank. Jan's nickname for her daughter is \"Assy\"."}],"images":[]},{"title":"Relationship status","level":2,"content":[{"type":"list","elements":[{"text":"Married (Pilot - The Client) 13 Episodes","elements":[]},{"text":"Divorced\/Single (The Client - A Benihana Christmas) 26 Episodes","elements":[]},{"text":"Dating Michael (A Benihana Christmas - Women's Appreciation) 11 Episodes","elements":[]},{"text":"Single (Women's Appreciation - The Job) 3 Episodes","elements":[]},{"text":"Dating Michael again (The Job - Dinner Party) 9 Episodes","elements":[]},{"text":"Single (Dinner Party - Present)","elements":[]},{"text":"See also: Michael-Jan Relationship","elements":[]}]}],"images":[]},{"title":"Trivia","level":2,"content":[{"type":"list","elements":[{"text":"After leaving Dunder-Mifflin, Jan took up candlemaking and launched a line of homemade candles called \"Serenity by Jan\", which reportedly smell awful.","elements":[]},{"text":"Pam Beesly tells Dwight that she thinks Jan isn't normal in The Whale.","elements":[]},{"text":"In the episode, \"Dinner Party\" Pam finds out that Michael lied to Jan and said they used to date. Angela remarks that she's seen the way Pam looks at Micheal much to Pam's dismay which seemingly validated Jan's claim.","elements":[]}]}],"images":[]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":"Pilot","elements":[]},{"text":"Health Care","elements":[]},{"text":"Hot Girl (voice only)","elements":[]},{"text":"The Dundies (voice only)","elements":[]},{"text":"Sexual Harassment","elements":[]},{"text":"Halloween (voice only, deleted scene)","elements":[]},{"text":"The Client","elements":[]},{"text":"Performance Review","elements":[]},{"text":"Booze Cruise (deleted scene)","elements":[]},{"text":"Boys and Girls","elements":[]},{"text":"Valentine's Day","elements":[]},{"text":"Drug Testing (voice only, deleted scene)","elements":[]},{"text":"Casino Night","elements":[]},{"text":"Gay Witch Hunt","elements":[]},{"text":"The Convention","elements":[]},{"text":"The Coup","elements":[]},{"text":"Grief Counseling (voice only)","elements":[]},{"text":"Initiation","elements":[]},{"text":"Diwali (voice only, deleted scene)","elements":[]},{"text":"Branch Closing","elements":[]},{"text":"The Merger (voice only)","elements":[]},{"text":"The Convict (voice only)","elements":[]},{"text":"Back From Vacation","elements":[]},{"text":"Traveling Salesmen (voice only)","elements":[]},{"text":"Ben Franklin (voice only)","elements":[]},{"text":"Cocktails","elements":[]},{"text":"The Negotiation","elements":[]},{"text":"Women's Appreciation","elements":[]},{"text":"The Job","elements":[]},{"text":"Fun Run","elements":[]},{"text":"Dunder Mifflin Infinity","elements":[]},{"text":"Launch Party (voice only)","elements":[]},{"text":"Money","elements":[]},{"text":"The Deposition","elements":[]},{"text":"Dinner Party","elements":[]},{"text":"Chair Model (voice only)","elements":[]},{"text":"Goodbye, Toby","elements":[]},{"text":"Weight Loss","elements":[]},{"text":"Baby Shower","elements":[]},{"text":"Stress Relief (voice only, deleted scene)","elements":[]},{"text":"Sex Ed","elements":[]},{"text":"Threat Level Midnight","elements":[]},{"text":"Threat Level Midnight: The Movie (as Jasmine Windsong)","elements":[]},{"text":"The Whale","elements":[]},{"text":"Couples Discount (voice only)","elements":[]}]}],"images":[]}]}