{"sections":[{"title":"Jim Halpert","level":1,"content":[{"type":"paragraph","text":"James Duncan \"Jim\" Halpert (born October 1, 1978) is a fictional character played by John Krasinski in the television series The Office and was originally based on Tim Canterbury in the UK version of The Office. He was a salesman at Dunder Mifflin Scranton and Dunder Mifflin-Sabre until he was “fired” by Dwight. Jim founded his own company; Athleap. He is Pam Beesly's husband and they have two children together."}],"images":[]},{"title":"Season 1","level":2,"content":[{"type":"paragraph","text":"In the Pilot episode, the character of Jim is introduced, as is his crush on Pam. He and Roy sidestep around each other, as well as have a loud and somewhat frightening encounter in The Alliance. It is also revealed that Jim pranks Dwight Schrute regularly. It is first shown in Pilot where Jim puts Dwight's stapler in Jell-O."}],"images":[]},{"title":"Season 2","level":2,"content":[{"type":"paragraph","text":"Season 2 starts off with The Dundies, where a drunken Pam kisses Jim at the end of the night. It's clearly obvious to everyone in the office and the viewers that Jim still has a crush on Pam, yet he is dating Katy, from Hot Girl in Season 1. Jim continues to slack off in Office Olympics. In Email Surveillance, Jim hosts a BBQ at his apartment to show his roommate, Mark, that Dwight is real. Booze Cruise is the episode where Jim breaks up with Katy, because he still has feelings for Pam, but she's engaged to Roy, a warehouse employee. At the end of the night Jim, drunk, tells Michael that he's had feelings for Pam."},{"type":"paragraph","text":"Then in The Secret, Michael mimics Jim and tells a few people in the annex about Jim's secret. Jim tries his best to keep Pam from finding out that he's had feelings for her. He says these feelings are from when he first started working there, but they are really current. Michael tells her this at the end of the episode. Jim continues to mess with Dwight in Dwight's Speech. Dwight is receiving an award for #1 salesman and Jim gives him sample speeches from dictators such as Mussolini, to use in his acceptance speech at a conference. He wins a little cash and Jim wins 9th along with a coupon to a pizza place. When Pam and Roy set a date for their wedding, Jim decides to go on a trip to Australia. He just can't take it anymore, and in Casino Night he talks to Jan about transferring to Stamford so he won't have to see Pam and Roy together."}],"images":[]},{"title":"Season 3","level":2,"content":[{"type":"paragraph","text":"At the start of season three, Jim has already transferred to the Stamford branch and received a promotion in the process. (In the episode Diwali, the title on his nameplate reads Asst. Regional Manager.) Andy Bernard also started calling him \"Big Tuna\" in reference to Jim eating a tuna sandwich on his first day. Jim has trouble fitting in — a few months into his tenure at Stamford, and he admits he doesn't think the other employees even know his name. Even their favorite recreational activity (playing Call of Duty during work hours) frustrates Jim, as he proves to be spectacularly inept at the game."},{"type":"paragraph","text":"When Jim meets up with Michael at a paper distributors' convention, he tells Michael that he considers him a \"great boss\" and admits that he only transferred because Pam rejected him. Jim has learned that Pam called off her wedding, but chooses to remain in Stamford. Things begin to look up for Jim as he befriends salesperson Karen Filippelli, and when the company board of directors decides to close the Scranton branch, Jim is appointed to the number two position at the newly created Dunder Mifflin Northeast. However the company's plans change when Stamford regional manager Josh Porter accepts an upper management position at Staples. The Stamford branch closes, with a few employees being offered a transfer to Scranton. The offer to Jim to be Assistant Regional Manager stands, though now he must relocate back to Scranton. Jim is disgusted by Josh's disloyalty, saying an interview: \"Say what you will about Michael Scott, but he would never do that.\" Jim is at first unwilling to return to Scranton because of Pam but eventually decides to do so. Karen, who has grown fond of Jim and wishes to pursue a relationship with him, also transfers to Scranton."},{"type":"paragraph","text":"In Scranton, Jim and Pam's reunion is awkward. Pam is overjoyed, but Jim, clearly uncomfortable, lets Pam know that he is seeing someone, and gradually Karen is introduced as his girlfriend."},{"type":"paragraph","text":"Jim settles back in at Scranton but uses his promotion as an excuse to avoid his old interactions and pranks with Pam claiming that pulling pranks again would send him back to his old slacker lifestyle. However, Jim does return to his old ways in time by focusing a few pranks on Andy Bernard, his ex-Stamford coworker, as well as on Dwight. However, the relationship between Jim and Dwight seems to improve slightly."},{"type":"paragraph","text":"Toward the middle of the season, it becomes clear that Jim's unresolved feelings toward Pam are affecting his relationship with Karen. Jim resists the idea of Karen moving out of the hotel in Scranton where she has been living since the merger and moving into a house two blocks away from his own because as he says, \"it would be like we were living together.\" Jim only relents when Pam herself tells him he's being unreasonable (Pam is later seen by Dwight sobbing in the stairwell, distraught that her actions just pushed Jim closer to Karen). Karen, who had previously been oblivious to Jim and Pam's history, accidentally learns of Jim's feelings for Pam during a sales call with Phyllis. Karen then confronts Jim about it over coffee. Jim admits to having had a crush on Pam previously but emphasizes to Karen that he is \"really glad\" that he's seeing her."},{"type":"paragraph","text":"During a busy day, Jim decides to pull a prank on Andy, however, Karen and Ryan are unwilling to aid him, so he turns to Pam, who becomes his accomplice. Their interaction during the prank causes Karen to feel threatened. She again confronts Jim, and this time he admits to still having feelings for Pam. Karen and Jim struggle to maintain their relationship, and although in Phyllis' Wedding, Jim hints that he would be interested if, hypothetically, Pam were interested in him, Jim then sees Pam leave the reception hand in hand with Roy, and declares, \"Here's a non-hypothetical. I'm really happy I'm with Karen.\""},{"type":"paragraph","text":"In Cocktails, Roy reacts violently when Pam tells him she kissed Jim during Casino Night. Roy then attempts to attack Jim at work in The Negotiation. Jim, who was talking to Karen, grabs her and pushes her out of Roy's way, but the attack is thwarted by Dwight when he sprays pepper spray in Roy's face. Roy is fired, but when Pam assures Jim that it's over between her and Roy for good, Jim doesn't believe this and tells her so."},{"type":"paragraph","text":"Jim and Pam's relationship becomes tense again in Beach Games when on a company outing at the beach, Pam confesses to Jim in front of the entire staff that he was the reason she broke off her wedding to Roy. She also states that she has missed their friendship since he left Scranton for Stamford. Later that night, Jim tells Pam that he feels as if he never really came back from Stamford, tacitly admitting that he has actively been fighting his feelings for her all year. However Jim's relationship with Karen and pending interview for a corporate position that would require his relocation to New York City still obstruct a potential romance."},{"type":"paragraph","text":"In The Job, Jim, Karen, and Michael (and secretly, Ryan), each interview for the corporate position. Jim is also a Philadelphia 76ers fan because David Wallace says he doesn't know if he can hire him for being one. During the interview, he notices an affectionate note from Pam. After the interview he drives back to Scranton, leaving Karen in the city. Jim interrupts an interview with Pam to ask her for dinner, and after she accepts, he says \"All right. Then... it's a date.\" In a webisode titled Office Summer Vacation, found on NBC's website, Karen states that Jim dumped her and left her crying at a fountain."}],"images":[{"src":"https:\/\/vignette.wikia.nocookie.net\/theoffice\/images\/4\/4e\/JS3.png\/revision\/latest\/scale-to-width-down\/356?cb=20131126034011","caption":"Jim in season 3"},{"src":"https:\/\/vignette.wikia.nocookie.net\/theoffice\/images\/5\/55\/ImagesCA1Y1M0N.jpg\/revision\/latest\/scale-to-width-down\/180?cb=20120216120906","caption":""}]},{"title":"Season 4","level":2,"content":[{"type":"paragraph","text":"Season 4 shows a more relaxed Jim, owing to the fact that he has finally gotten together with Pam. Karen comes back to the office to confront him, but after initially asserting that she will stay in Scranton (Fun Run), she abruptly leaves the next day and becomes the regional manager of Dunder Mifflin Utica (Branch Wars)."},{"type":"paragraph","text":"Pam and Jim initially attempt to keep their relationship status a secret from the documentary camera crew as well as their co-workers (though some of the latter suspect they're together, notably Kevin), but when the camera crew catch them together sharing a quick kiss while parked on the side of the street, they admit that they have been dating for a few months and are deliriously happy (Fun Run). In the episode Dunder Mifflin Infinity, Toby reveals that Jim and Pam are dating to the office when he sees Pam kiss Jim on the cheek. The pair's union is welcomed by most people in the office, except Dwight who says both \"could do better.\""},{"type":"paragraph","text":"Michael takes interest in the relationship and repeatedly invites the couple for dinner with him and Jan, but Jim finds reasons to avoid accepting the invite, though he and Pam avoid suspicion of their disinterest by asking to have dinner on nights when Michael is busy. They eventually are forced to join Michael and Jan for a dinner party when Michael feigns an assignment from corporate to get them out of any original plans they might have had. At the dinner party, Jim and Pam are forced to witness various aspects of Michael and Jan's deteriorating relationship to the point where they make a desperate but failed attempt to escape. Jim even attempts to escape without Pam after he couldn't get her out with him, but Pam gets him to stay. After witnessing the break up of Michael and Jan, Jim and Pam enjoy burgers in his car and they appear to be the happiest and most stable of the three couples that attended the party, the third couple being Andy and Angela (Dinner Party)."},{"type":"paragraph","text":"Jim and Pam feel sorry for Dwight, whom Angela dumped because he killed her cat. To cheer him up, they spend a night together at Schrute Farms, which doubles as an agricultural bed and breakfast. Jim realizes that the trip is his and Pam's first night away together and comments that he had always imagined it in his head but that he always thought it would be different (it certainly hadn't involved Dwight). They write a glowing review on TripAdvisor about their stay, however, to help bring Dwight out of his depression, but are unsuccessful. Jim comforts Dwight in the stairwell, explaining how he used to pine for Pam and how distraught he was in Season 2 when Pam decided to stay with Roy, revealing far deeper anguish over the situation than he had ever let on, something he would never wish on the worst of his enemies. After remembering how terrible he had felt before he was with Pam, Jim kisses her publicly. Pam attributes this to a passion for Italian food, which Jim confirms and says that he is \"in love with Italian food\", implying he is in love with Pam. Afterward, when Dwight returns from the stairwell, he returns to his normal self, which pleases both Jim and Pam."},{"type":"paragraph","text":"Jim has a Second Life avatar that resembles him (Local Ad), but there are some differences, as Pam teasingly points out that his online alter-ego is a Philadelphia sportswriter. In the episode Survivor Man, we see Jim in a manager role while Michael is out of the office. Jim attempts to combine all of the birthday parties into one big party, to save time. After being accidentally called 'Michael' instead of 'Jim', Jim realizes that he has done something Michael would have normally done. In a conversation with Michael at the end of the episode, Michael reveals that he did, in fact, try to combine all the birthday parties earlier in his time as a regional manager. We see Jim in a manager role again in Night Out when he plans to save everyone else from coming into work on Saturday to help with Ryan's website by staying late to do the work, a plan that is met with success until they find the gate locked with them still inside."},{"type":"paragraph","text":"Although Jim suggests to Pam that they live together in the episode Chair Model, he assures her that a proposal is imminent. He reveals to the camera crew that he is indeed planning to propose, displaying a box with a diamond ring inside. He states that \"[he] got it the week after [they] started dating\". As he and Pam are leaving work, he gets down on one knee and looks at her expectantly. After their earlier conversation, she is under the impression that Jim is starting to propose, but instead, he asks her to wait while he ties his shoe. In the episode, Did I Stutter? Jim pulls another faux proposal on Pam by \"proposing\" during a meeting in the conference room that Pam gets him a coffee."},{"type":"paragraph","text":"In Job Fair, Jim decides to meet up with a potential client after Ryan gave him his formal warning, as he wishes to keep his job to secure \"pretty big long-term plans\" with Pam. He goes with Andy and Kevin to meet the client on the golf course. Jim is made uncomfortable with Andy making jokes in front of the client and Kevin trying to force him into a wager. Jim tries to talk business with the client, but the client only accepted Jim's invitation just to get out of the office. After several unsuccessful attempts to get the client to sign with him, Jim holds him in the parking lot for fifteen minutes until the client finally gives in. Back at the office, when Pam returns from the job fair, Jim gives her the news and they share a congratulatory kiss in front of Michael, Andy, and Kevin. Once they realize Michael, Andy, Kevin, and the cameras are watching, Pam stops and shakes Jim's hand. Jim responds \"You know what? Screw this.\" and passionately kisses her again."},{"type":"paragraph","text":"In the season four finale, Goodbye Toby, Jim plans to propose to Pam at the goodbye party for Toby, who is moving to Costa Rica. He buys fireworks and plans for the proposal to be very romantic but is eventually upstaged by his co-worker Andy proposing to his other co-worker Angela."}],"images":[]},{"title":"Season 5","level":2,"content":[{"type":"paragraph","text":"In the season 5 premiere, Weight Loss, Pam goes to New York to attend art school, and the couple mutually decides they wouldn't want to spend the first three months of their engagement apart. However, Jim, missing her desperately and unable to wait, meets Pam at a rest stop halfway between New York and Scranton and finally proposes, to which she says yes. In Business Ethics, Jim announces the engagement to the office, most of whom are indifferent, except for Michael who is ecstatic."},{"type":"paragraph","text":"While Jim is supportive of Pam taking art classes, the distance starts to put a strain on their relationship, and it becomes evident in Baby Shower. Throughout the episode, they attempt to communicate by calling on the phone but have bad reception or are interrupted by things going on around them. At the end of the episode, they leave voicemails for each other at exactly the same time, saying the same things, showing how despite how off one of their days may be, it doesn't change how in love they really are."},{"type":"paragraph","text":"In Crime Aid, Jim finds a voicemail left to him by a drunken Pam, who was out with her art school friends, and jokingly remarks that she is \"the future mother of [his] children.\" Jim later goes to a bar with the warehouse workers, where he encounters Roy. Jim tells Roy he and Pam are engaged, to which Roy congratulates him. Jim also tells him she's going to art school in New York and was out with her friends just the night before, to which Roy comments \"I thought you were her friend,\" visibly bothering him. Towards the end of the episode he decides to visit Pam in New York, before taking a U-turn back to Scranton, ultimately deciding that he is not \"that guy, and [they're] not that couple.\""},{"type":"paragraph","text":"In Employee Transfer, Jim and Pam meet in New York to have dinner with his brothers, Tom and Pete. Pam, Tom, and Pete arrive early and plan a prank on Jim. Pam initially suggests she pretends to have lost her ring, but the brothers veto that and instead decide to pretend to mock her about how little money artists make. When Jim arrives, they start mocking Pam, and Jim continually comes to her defense, growing angrier and angrier as they continue to taunt her. When Jim finally raises his voice at his brothers, they crack up laughing, revealing it was only a joke, but Jim didn't seem to find it very funny (and Pam appears to be mildly upset). As Jim and Pam leave lunch later, she tells him about her original idea, which he appreciates much more."},{"type":"paragraph","text":"In Customer Survey, Jim and Pam stay in touch through the world's tiniest Bluetooth, so they can talk throughout the day without getting caught and accused of wasting company time. Dwight suspects Jim of talking to himself, which doesn't seem to bother Jim. Jim learns that he has been getting bad customer reviews, which baffles him. He and Dwight later discover that Kelly had sabotaged their reviews because they didn't go to her party. Later in the day, a friend of Pam's, Alex, arrives at her work and tries to convince her to stay in New York, with Jim still listening in. While at first, he teases Pam, saying he \"wants to talk to his guy\" and insists she \"put [him] in his ear\" and says Alex is into her. But, as the conversation between Pam and Alex continues, Alex telling her that if she really wants to be an artist, she needs to stay in New York, Jim quiets, realizing sadly that he's right."},{"type":"paragraph","text":"In Business Trip, Jim (and the rest of the office) counts down the days until Pam returns from New York. The rest of the office makes Jim incredibly uncomfortable with their intrusion on his relationship. Pam later calls Jim and tells him she's failed a class and needs to stay another three months to take it again. He is visibly upset she will not be coming home, but fully supports her, saying she needs to come home \"the right way.\" At the end of the day, however, Jim finds Pam waiting in the parking lot, saying she came home \"the wrong way.\" She insists that she left New York merely because she hated graphic design, unconvincingly saying it wasn't because she missed Jim. But, when Jim comes closer to her and mutters \"I missed you,\" she admits \"I missed you too.\" They share a sweet kiss, though the moment is ruined by Dwight, who asks Pam to make him copies."},{"type":"paragraph","text":"In Frame Toby, Jim buys his parents' house for Pam without telling her, wanting it to be a surprise. At the end of the day, he takes Pam to the house to show it to her and gives her a tour, ending in the garage, which he's turned into an art studio for her. After noticing a seemingly disappointed look on Pam's face (and the fact she's been speechless the entire tour), Jim tells her he knows the house isn't perfect and says it's okay if she doesn't like it, but she says excitedly that she loves it, gushing over how he \"bought her a house\"."},{"type":"paragraph","text":"In The Surplus, Pam and Jim take opposite sides in a debate over whether the office needs new chairs or a new copier. Throughout the day they try to change each other's minds. In the break room they discuss it, Pam leaning in to kiss Jim. She stops right before their lips touch, whispering dangerously that he's treading on \"very dangerous ground.\" Jim shudders in a talking head interview immediately afterward. At the end of the episode, Jim gets back at Pam by asking her to make three copies of a paper. She gives him a shocked look, and he tells her he's kidding. In a similar way to Pam earlier, he leans in to kiss her and whispers he's \"going to need four.\""},{"type":"paragraph","text":"In The Duel, Andy has yet to learn about Dwight's affair with his (Andy's) fiancé Angela. Michael wants to tell him, which Jim immediately vetoes, pointing out that not only should Angela tell Andy herself but that Andy has an anger management problem that should be taken into consideration. Once Andy learns, he challenges Dwight to a weapon-less duel, which Jim tries to stop but is unsuccessful because, as acting manager, he cannot do anything to stop a fight that happens off company ground as Dwight and Andy have decided to have it in the parking lot."},{"type":"paragraph","text":"In Prince Family Paper, Jim runs 500 feet of red wire from Dwight's computer up a telephone pole in the parking lot outside, and Dwight follows it all the way up the pole. Jim insists in a talking head interview that he'll be fine, saying that \"[he] got up there.\" Throughout the rest of the episode, he's involved in a debate with the rest of the office over whether or not Hilary Swank is hot. Jim had decided that she is."},{"type":"paragraph","text":"In Stress Relief, Pam's parents are going through a rough patch in their marriage and Jim tries to console her. Pam asks Jim to talk sense into her father, who is thinking about leaving her mother, and Jim agrees. However, after Jim speaks with Pam's father, the conversation leads Pam's father to seek a separation from her mother and look for apartments. This creates tension between Jim and Pam, and Jim feels terrible about his apparent role in Pam's parents' split. Pam confronts her father in the parking lot while Jim watches through the window. Pam returns to the office and Jim asks if it was his fault. Pam nods, and Jim asks what her father said. Pam says that her father left her mother because Jim told him how much he (Jim) loves Pam, and how he (Jim) never doubted for a second that she (Pam) was the woman he wanted to spend the rest of his life with. As it turned out, her father had never felt that way with her mother. When Jim asks if Pam's okay, she nods furiously, embracing Jim in a tearful hug. In a talking head interview, Pam says that she and Jim are true soul mates."},{"type":"paragraph","text":"In Lecture Circuit, Jim and Dwight attempt to plan a party for high maintenance Kelly when they forget her birthday. Jim gets her a cake, which she hates, insisting that there's \"no theme.\" At the end of the episode, Jim and Dwight agree the theme to be either one hour of napping or watching TV. Kelly loves the theme, choosing to take a nap under the table in the conference room."},{"type":"paragraph","text":"In Blood Drive, Jim and Pam are sharing their first Valentine's Day together. However, Michael threatens to banish them from the office if they can't tone down the PDA, despite the fact they've only been smiling fondly at each other from across the room. Phyllis then invites them to lunch with her husband Bob Vance of Vance Refrigeration, and they happily agree. The meal goes well initially, but Phyllis and Bob disappear for a while after their food arrives. Jim and Pam don't want to be rude by eating before they get back, but they're hungry and suspect they may have left. They check the bathrooms in the back of the restaurant before hearing Phyllis and Bob having sex in the disabled bathroom, causing them to dart back to their table immediately. When Phyllis and Bob return to the table, Jim and Pam have lost their appetite."},{"type":"paragraph","text":"In Golden Ticket, an idea by Michael leads Jim to lose 50% of his profits. Meanwhile, he and Pam attempt to give advice to Kevin about asking out a girl he likes, though they give him conflicting tips. Pam suggests he be flirty to show his interest, but Jim insists he should remain respectful and take things slow."},{"type":"paragraph","text":"In New Boss, Jim arrives to work in a tuxedo as a response to memo Dwight sent out on the dress code, leading to an awkward encounter with the new company vice-president, Charles Miner. Throughout the day Jim attempts to get on Charles' good side, failing each time he tries. At the end of the day, he loudly says goodbye to Charles as he leaves, getting no response. He jokes that \"for [his] next trick, [he] will make [his] career disappear.\""},{"type":"paragraph","text":"In Dream Team, it's revealed that Charles has an obsession with soccer. All the other employees pretend to agree, attempting to get on his good side. Jim initially refuses to play along, but then tells Charles that he plays soccer in his free time, which is a lie. Dwight, seeing through him, suggests they play a quick game in the parking lot after work, which Charles thinks to be a great idea and forces Jim along. During the game, Charles forcefully kicks the ball towards Jim. On instinct, Jim ducks, and the ball hits Phyllis in the face. The employees, including Charles and especially Dwight, berate Jim for ducking."},{"type":"paragraph","text":"During Michael Scott Paper Company, Charles asks Jim for a \"rundown\" of his clients. Jim has no clue what he means, but is too scared to ask him upfront and make an even worse impression on the new boss. He spends his entire day attempting to figure out what Charles means, by hinting at it with Charles, who's blatantly unhelpful, and asking other employees. By the end of the day, it seems he's somehow figured out what it is and attempts to hand it over to Charles, who doesn't even look at it and just asks him to fax it to everyone on the distribution list. Jim doesn't know what this means either, and instead of asking Charles what he means, simply faxes the rundown to his father."},{"type":"paragraph","text":"In Heavy Competition, Jim and Pam attempt to get bargain deals on their wedding through Andy. When Pam turns down his ideas, Andy thinks that Pam is being controlling and acting cruelly towards Jim, and warns Jim. Jim insists that he and Pam are very happy together, but Andy remains unconvinced, believing Pam will do to Jim what Angela did to him. So, as a prank, Jim pretends to break down in front of Andy, crying on his shoulder and kicking his sack lunch. Andy blames the whole office for Jim's emotional distress, taking the whole situation very seriously. Phyllis, smiling, then tells Andy she thinks Jim is messing with him. Andy initially doesn't believe her until he sees Jim grinning through the kitchen window. Andy confronts Jim, and Jim tells him he and Pam are incredibly happy together and that he will find someone else someday."},{"type":"paragraph","text":"In Broke, Jim discovers that Charles himself is a suck-up when David Wallace, the company's president, comes to the Scranton branch to discuss the fact that they're losing clients to Michael's new paper company. David calls a meeting with Charles and Jim, but Charles insists Dwight be a part of the meeting too, believing Dwight to be a stronger employee than Jim. During the meeting, however, while Jim comes across as professional and intelligent, Dwight embarrasses Charles by suggesting dangerous and outlandish solutions, like putting a bee hive in his car. When Charles tries to suck up to David once more, Jim makes a snide remark regarding this that makes Charles look foolish."},{"type":"paragraph","text":"In Casual Friday, Pam and Ryan return from the Michael Scott Paper Company, and the other employees believe that they are being given special treatment from Michael, including retaining all the clients that their company originally stole from Dunder Mifflin. Dwight holds a meeting in the warehouse with all the salesmen, with the exception of Pam and Ryan, to try and think of a way to get their clients back. Jim attempts to remain impartial and comes back up from the warehouse to inform Michael that \"there may or may not be, but definitely is a mutiny forming in the warehouse.\" He then heads to the break room and plays board games with Creed until the conflict is resolved. Eventually, Michael gives the clients back to the original salesmen, which then presents the problem of there not being enough clients for two salesmen. Jim tells Michael that Pam would be better suited for the job, and Michael eventually decides to give it to Pam after fake-firing her."},{"type":"paragraph","text":"In Cafe Disco, Jim and Pam decide that a wedding would be too stressful and expensive and plan to get married in a courthouse in Ohio. In a talking head interview, Pam insists Jim tell the cameras how it happened. He explained that that morning, while they were eating their cereal, he looked up at her and said \"Y'know what I wanna do today? I wanna marry you.\" Pam adds that she had just woken up and didn't look cute, which is how she knew he meant it. While she speaks, Jim beams at her. About halfway through the workday, Jim goes out into the parking lot and picks flowers for Pam's bouquet. While the rest of the employees go down to the storage-closet-turned-cafe-disco to dance, they begin to leave to get married before deciding to stop by. They have a lot of fun dancing with each other and their fellow employees, and ultimately decide they want a real wedding. They smile at each other and embrace.  In the season 5 finale, Company Picnic, Jim and Pam attend the company picnic and face various branches of Dunder Mifflin in incredibly competitive games of volleyball. We learn that Pam is exceptionally skilled at playing volleyball and is the main reason the branch advances to playing Corporate. Towards their last game, however, she twists her ankle and Jim takes her bridal-style to the hospital, with Dwight promising to stall while they're gone so they don't have to bring in the substitute players and lose the game. In the last scene of the episode, Jim enters a hospital room to get an update on Pam's ankle. There's no sound as the doctor speaks to Jim, a shocked Pam sitting on the hospital bed. Jim's face morphs in shock as well, and Jim hugs her tightly. He emerges from the room, his face bright red, and with a cracking voice he calls to tell Dwight to bring in the subs, his eyes watery from perhaps over-enjoyment. It's implied that Pam is pregnant as he runs back into the room to hug her once more."}],"images":[{"src":"https:\/\/vignette.wikia.nocookie.net\/theoffice\/images\/9\/98\/The-office-baby-blog-pam-jim-cecilia.jpeg\/revision\/latest\/scale-to-width-down\/180?cb=20120323020134","caption":"Jim and Pam with brand-new baby Cece."}]},{"title":"Season 8","level":2,"content":[{"type":"paragraph","text":"Jim tells the cameras that the Search Committee finally decided on hiring Robert California. He also tells the cameras how Robert was not content with the position of Regional Manager and drove down to Tallahassee and manipulated Jo Bennett out of her job and bestowed it on him. He and Pam also talk about how Pam is once again pregnant to the cameras. Jim tries to cheer Pam up as during her pregnancy she gets very emotional and constantly watches a commercial over and over again that always makes her cry. Jim, Dwight and Darryl also attempt to haul a planking Kevin off of Jim's desk however they all laugh and drop him as Stanley tells a joke in the process. Jim also talks about how intense and mystifying Robert can be when you have a discussion with him. Later on in the episode, Pam and Erin show Jim a list of names found in Robert California's notebook. Jim asks Dwight for his phone so he can take a picture of it but Dwight breaks it in the process of throwing it to him. Jim later takes part in the discussion of what the list of names could mean in Andy's office and Dwight is called in to compare Robert's list to his list of office members in impossible hypothetical situations (According to Dwight's list of people to put in lifeboats in case of a flood, Dwight would put him with Roy, Stanley and several warehouse workers). When Dwight later convinces both sides on the list to attack one another Jim tries to put a stop to it. He also adamantly rejects Meredith's theory of both sides needing to have intercourse with one another. Jim is invited to lunch with all the other people on the left side of the group and learns that he and the others were there because Robert believes them all to be winners and the right sider's- losers. When Andy later confronts Robert about this, Jim appears to be very uncomfortable when Robert reveals this to the entire office. At the end of the episode, Jim makes a similar list for Pam in which he believes that she, Cece, and the new baby are winners and everything else isn't important (The List)."},{"type":"paragraph","text":"Jim becomes concerned when Kevin starts to talk in a very primitive fashion. He and Pam plan to take him to the hospital but they later learn from Oscar that he is doing it on purpose. They take him to see Andy and Jim later convinces Kevin to stop talking like that."}],"images":[]},{"title":"Season 9","level":2,"content":[{"type":"paragraph","text":"Jim founds and begins working part-time at Athlead. He and Pam begin drifting apart, though they have tried their best to keep their relationship healthy. They seem to have trouble communicating to each other their frustrations with each other and outside situations, resulting in them going to couple's counseling for their issues. Since Jim is working at Athlead, it seems he is growing up, trying to pave a future for his family, while Pam remains in Scranton, becoming sole parent to their family. After Jim is firmly established in his new company, Pam reveals she would rather live in Scranton, while Jim points out they should move to Philadelphia, where he's started the company. By the end of the series, Jim realizes he could lose Pam, and stays in Scranton to be with her. He assures her that she did not make him stay, that he is where he wants to be, because she and their family are the most important thing, they are everything to him. After the documentary airs, Pam surprises Jim by selling the house so they can move to Austin, Texas, to allow Jim to start working again with his company now called Athleap, a name change he did not approve of, which was bought by Converse."}],"images":[]},{"title":"Quotes","level":2,"content":[{"type":"list","elements":[{"text":"\"Right now this is just a job. If I advance any higher in this company, then this would be my career. And well, if this were my career I'd have to throw myself in front of a train\" (Health Care).","elements":[]}]},{"type":"list","elements":[{"text":"\"Well we’re all getting excited to see this fight. The Albany branch is working right through lunch to prevent downsizing. But Michael, he decided to extend lunch by an hour so we can all go down to the dojo and watch him fight Dwight\" (The Fight).","elements":[]}]},{"type":"list","elements":[{"text":"\"Today is Thursday. But Dwight thinks that it’s Friday…and that’s what I will be working on this afternoon (Performance Review).","elements":[]}]},{"type":"list","elements":[{"text":"\"I'm having a party. I've got three cases of imported beer, a karaoke machine, and I didn't invite Michael...so, three ingredients for a great party. And it's nothing personal - I just think that, if he were there, people wouldn't be able to relax, you know, have fun - and my roommate wants to meet everybody, because I'm...pretty sure he thinks I'm making Dwight up...He is very real!\" (Email Surveillance).","elements":[]}]},{"type":"list","elements":[{"text":"(on the phone with Michael & Dwight) \"What’s gaydar. Oh, gaydar…yes! I think they have it at Sharper Image\" (Gay Witch Hunt).","elements":[]}]},{"type":"list","elements":[{"text":"\"You know, when I saw Dwight, I realized how stupid and petty all those pranks I pulled on him were...and then he spoke\" (The Convention).","elements":[]}]},{"type":"list","elements":[{"text":"\"...From time to time, I send Dwight faxes... from himself... from the future\" (Branch Closing).","elements":[]}]},{"type":"list","elements":[{"text":"\"Say what you will about Michael Scott, but he would never do that\" (Branch Closing).","elements":[]}]},{"type":"list","elements":[{"text":"\"I miss Dwight. Congratulations Universe, you win\" (The Return).","elements":[]}]},{"type":"list","elements":[{"text":"\"One day Michael came in complaining about a speed bump on the highway…I wonder who he ran over then?\" (Fun Run).","elements":[]}]},{"type":"list","elements":[{"text":"\"Michael has asked Pam and me to dinner at least...nine times, and every time, we've been able to get out of it. But, I gotta give him credit...he got me...because I'm starting to suspect that there was no assignment from Corporate\" (Dinner Party).","elements":[]}]},{"type":"list","elements":[{"text":"\"I bought those boat tickets the day I saw that YouTube video. I knew we'd need a back-up plan. The boat was actually Plan C. The church was Plan B and Plan A was marrying her a long, long time ago. Pretty much the day I met her\" (Niagara).","elements":[]}]},{"type":"list","elements":[{"text":"\"Not enough for me? You are everything\" (A.A.R.M.).","elements":[]}]}],"images":[]},{"title":"Nicknames for Jim","level":2,"content":[{"type":"paragraph","text":"All ongoing tuna related nicknames such as but not limited to \"Big Tuna\" or just \"Tuna\" were coined by Andy because of the mere fact Jim had a tuna fish sandwich for lunch on his first day at the Stamford branch."}],"images":[]},{"title":"Trivia","level":2,"content":[{"type":"list","elements":[{"text":"Jim never realized that there are no windows in the office until Pam pranked him.","elements":[]},{"text":"Jim revealed that his best first date was with Pam until he found out that Pam was already engaged to Roy  ","elements":[]},{"text":"Jim has a couple of skills at engineering, describing them as \"handy\"","elements":[]},{"text":"In high school, he dated a girl that wanted to be an artist, similar to his future wife Pam.","elements":[]},{"text":"In Launch Party when signing Meredith's cast, he signs real name John Krasinski rather then his character's name.","elements":[]}]}],"images":[]},{"title":"Behind the scenes","level":2,"content":[{"type":"list","elements":[{"text":"Jim wears flannel ties because the production staff wants it to appear as if he doesn't care much about shopping for clothes. The ties are hand-me-downs from his father. (Flannel ties have a '70s look.) Flannel ties are rare nowadays, and the staff had to make many of them by hand. [1]","elements":[]}]}],"images":[]},{"title":"Appearances","level":2,"content":[{"type":"paragraph","text":"Jim appears and has lines in every episode, with the following exceptions:"},{"type":"list","elements":[{"text":"Mafia - voice only","elements":[]},{"text":"The Banker - has no lines","elements":[]},{"text":"The Ultimatum - seen only in cold open","elements":[]}]}],"images":[]},{"title":"Relationship Status","level":2,"content":[{"type":"paragraph","text":"Single Pilot - Hot Girl"},{"type":"paragraph","text":"Dating Katy The Dundies - Booze Cruise"},{"type":"paragraph","text":"Single Booze Cruise - The Merger"},{"type":"paragraph","text":"Dating Karen The Merger - The Job"},{"type":"paragraph","text":"Dating Pam Fun Run - Weight Loss"},{"type":"paragraph","text":"Engaged to Pam Weight Loss - Niagara"},{"type":"paragraph","text":"Married to Pam Niagara - Present"}],"images":[]},{"title":"Relationship with Pam","level":2,"content":[{"type":"paragraph","text":"Jim's relationship with Pam is occasionally the subject of office interest, which was particularly uncomfortable when Pam was engaged to Roy Anderson, a Dunder Mifflin warehouse worker, or as described by Michael, \"an animal.\" It is revealed (in a deleted scene) that Jim and Pam went out for the lunch together when they first met and had an amazing time until Jim found out that she was already engaged to Roy. In the Dundies episode, Pam kisses Jim in front of everyone during the awards ceremony when she is drunk. (Jim never mentions this to anyone again.) Jim eventually reveals his feelings for Pam to his boss, Michael Scott, who, in an uncharacteristically serious moment encourages Jim to \"Never, ever, ever give up.\""},{"type":"paragraph","text":"When Pam and Roy, three years engaged, finally set a wedding the date in the episode Booze Cruise, Jim finds himself with an uneasy attitude towards Pam’s wedding planning and date. Broken-hearted by Pam and Roy's decision to finally get married, Jim breaks up with his girlfriend Katy. He begins to become unsteady around certain conversation topics that are brought up. He lashes out at Kelly when she is complaining about her crush saying \"that if they do not like her then she should move on and forget about them\", hinting that he has done this with Pam. Now that Pam and Roy’s relationship is the strongest it has ever been, Jim decides that he needs to get away for a short time. He plans a trip to Australia during the time of the Pam’s the wedding so he will not have to attend it. He later realizes that once the wedding is over, he doesn't know how he will be able to work with Pam, so he talks to Jan (Michael's boss) about transferring to the Stamford branch in Connecticut."},{"type":"paragraph","text":"He applies for the job and after receiving confirmation from Jan, he confronts Pam. He tells her that he has always loved her and that he cannot see her get married to Roy. Pam, who is only weeks away from getting married to her fiancé, shows a desire to be with Jim but turns him down. Jim then leaves (walking out into the middle of the road about to get hit by a car) but comes back moments later and kisses the Pam. After the kiss, Jim transfers to the Stamford branch. At the beginning of season three, we find that both Jim and Pam had wanted to confess to one another that they loved each other."},{"type":"paragraph","text":"Once Jim is in the Stamford, Pam gets cold feet and cancels the wedding. Jim doesn't know this until Michael and Dwight travel to Philadelphia for a conference meeting with Jan and Josh. Michael then tells Jim that Pam is single again, though Michael thinks that Jim transferred because of his management style. "},{"type":"paragraph","text":"Once Jim is home in Scranton after the Stamford branch got shut down, Pam starts to date Roy again. Karen Filippelli, from Stamford, begins to date Jim around the same time. But, after a fight over the job at corporate, she breaks up with him and takes a job as regional manager of Dunder Mifflin Utica. When the Roy finds out that Jim and Pam had kissed in the episode, \"Casino Night,\" he gets thrown out of a bar due to public vandalism. Roy and Pam are over. Jim is shown to be conflicted between his feelings for Pam during his relationship with Karen, and begins making himself distant from her."},{"type":"paragraph","text":"After Jim's interview for the corporate job, he goes back to work and asks Pam out on a date. A few episodes later, we learn that they are dating. When Pam starts art school in New York, Jim suggests that they meet halfway for lunch. Even though it was thunderstorming, he gets down on one knee and proposes to Pam. Later, in the episode, \"Company Picnic,\" we find out that Pam is pregnant before the wedding. When the wedding day comes, Jim accidentally tells everyone at the reception that Pam is pregnant. Her grandmother decides to leave the morning before the wedding. "}],"images":[]},{"title":"See also","level":2,"content":[{"type":"list","elements":[{"text":"List of Jim's Pranks","elements":[]}]}],"images":[]},{"title":"References","level":2,"content":[{"type":"list","elements":[{"text":"↑  The Client","elements":[]}]}],"images":[]}]}