{"sections":[{"title":"Jo Bennett","level":1,"content":[{"type":"paragraph","text":"Jolene \"Jo\" Bennett (February 28, 1949), played by Kathy Bates is a former Chief Executive Officer (CEO) of Sabre, having served until vacating the position in favor of Robert California in the first episode of Season 8, The List. Bennett remains a stakeholder in the company until its liquidation in the Season 8 finale, Free Family Portrait Studio."}],"images":[]},{"title":"Character overview","level":2,"content":[{"type":"paragraph","text":"Jo Bennett was the CEO of Sabre, a printer company based in Tallahassee, Florida, until succeeded by Robert California at the beginning of Season 8. Bennett is viewed positively by the workers of the Scranton branch, given her business success and forthright speaking style. While the people of the Scranton branch are initially intimidated by her arrival, her role in orchestrating Sabre's buyout of the insolvent Dunder Mifflin lends her a positive reputation. Objections to her style may surround her unwillingness to admit her wrongdoing, and how her headstrong spirit may sacrifice honest decision-making."}],"images":[]},{"title":"Season 6","level":2,"content":[{"type":"paragraph","text":"Jo Bennett is Sabre's unconventional CEO, and she first meets Michael Scott after he tries to tell Gabe to talk to her. She claims that Dunder Mifflin was the most mismanaged company she has ever seen.  She makes Gabe do everything, including catching her coat, and dotes on her pair of Harlequin Great Danes. Jo Bennett is quite a character: She has survived breast cancer, gotten her pilot's license, close friend of Nancy Pelosi, slept with three of the same men as Truman Capote and, presumably, detailed these exploits in her autobiography. She does display a sense of humor, but is also a hard worker. Her sweet Southern exterior belies a steely toughness and an unwillingness to suffer fools gladly; she tells Jim and Michael that, as \"grown-ass men,\" they should be able to decide who takes the Regional Manager job without involving her every time they change their minds. She doesn't appreciate the significance of St. Patrick's Day to Scranton, and keeps the workers late, preventing them from participating in Scranton's biggest party day of the year. When Michael, after having received a dressing-down from Jo, says that he looks forward to their professional relationship, Jo cuts him a long, steely glance and says that she looks forward to that relationship as well, implying that Michael has, thus far, not demonstrated much professionalism.  In the episode Whistleblower, she is forced to place a recall on all Sabre printers and make a public apology. However, she does not want to out of fear that people would only remember her as someone who made a really bad mistake (an interesting fear, considering her many accomplishments)."}],"images":[]},{"title":"Season 7","level":2,"content":[{"type":"paragraph","text":"After Michael's departure Jo appoints Deangelo Vickers, whom she met when he saved one of her dogs from being stolen, as the new regional manager of Dunder Mifflin Sabre, Scranton Branch. She then calls Jim and asks if he would care to be manager after Deangelo can no longer run the office due to a severe head injury. After Jim turns her down she asks Dwight who accepts. She then meets Dwight for a meet and greet and Dwight reveals that he shot a gun in the office causing Jo to ask him to step down and then appoint Creed due to seniority. She then sets up Toby, Jim and Gabe as a search committee for the new manager, but eventually sent Gabe back to Tallahassee and replaced him with Kelly."}],"images":[]},{"title":"Season 8","level":2,"content":[{"type":"paragraph","text":"Jo leaves Dunder Mifflin shortly after Robert California manipulates her into leaving and giving her title of CEO to him. However due to Robert California's complete destruction of the company, she decides to liquidate Sabre, eventually selling Dunder Mifflin to David Wallace."}],"images":[]},{"title":"Trivia","level":2,"content":[{"type":"list","elements":[{"text":"She wrote an autobiography, titled \"Take a Good Look,\" and gave it to everyone in the office.","elements":[]},{"text":"She is a breast cancer survivor","elements":[]},{"text":"She is close personal friends with Nancy Pelosi.","elements":[]},{"text":"She has multiple dogs, the seen ones named Calle, Jo Jr., Cornelius and BoBo","elements":[]},{"text":"She collects guns.","elements":[]},{"text":"She called Kevin \"Teddy Bear\" in the episode \"Whistleblower\".","elements":[]},{"text":"Her mother, Bessie, once held the occupation of prison guard.","elements":[]},{"text":"She is old friends with Nellie Bertram.","elements":[]},{"text":"Despite being Robert California's predecessor as the CEO of Sabre, Jo and Robert share no scenes together.","elements":[]},{"text":"She attended Vanderbilt and worked at Kodak after graduation.","elements":[]}]}],"images":[]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":"\"Sabre\"","elements":[]},{"text":"\"Manager and Salesman\"","elements":[]},{"text":"\"St. Patrick's Day\"","elements":[]},{"text":"\"The Whistleblower\"","elements":[]},{"text":"\"Nepotism\"","elements":[]},{"text":"\"WUPHF.com (voice only)","elements":[]},{"text":"\"Dwight K. Schrute, (Acting) Manager\"","elements":[]},{"text":"\"Search Committee","elements":[]}]}],"images":[]}]}