{"sections":[{"title":"Karen Filippelli","level":1,"content":[{"type":"paragraph","text":"Karen Filippelli (pronounced fill-uh-pell-ee) is the regional manager of Dunder Mifflin Utica and the ex-girlfriend of Jim Halpert."}],"images":[]},{"title":"History","level":2,"content":[],"images":[]},{"title":"Merger","level":3,"content":[{"type":"paragraph","text":"Karen Filippelli is a sales representative and co-worker of Jim's at the Stamford branch. At first, she doesn't think Jim fits in there and dislikes the way he looks at the camera, but eventually she grows to like him, apparently developing a crush on him. She transfers to the Scranton branch as part of the merger of the Stamford and Scranton branches, and she and Jim begin to date. They also have long talks discussing their problems."}],"images":[]},{"title":"Job Interviews","level":3,"content":[{"type":"paragraph","text":"After their job interviews in New York, Jim breaks up with Karen in New York City and returns to Scranton to ask Pam out for dinner."}],"images":[]},{"title":"Lecture Circuit","level":3,"content":[{"type":"paragraph","text":"When Michael comes to the Utica branch for a lecture, he sees that Karen is now pregnant and he and Pam later learn that she is now happily married. Michael asks if Jim is the father to her baby, which makes both Pam and Karen uncomfortable. Karen asks Pam how Jim is doing and Pam tells her that she and Jim are engaged. Karen seems genuinely happy for her and no longer holds any grudges towards her."}],"images":[]},{"title":"Threat Level Midnight","level":3,"content":[{"type":"paragraph","text":"Karen also appeared in Michael's movie \"Threat Level Midnight\". In it she appeared as a girl at a bachelorette party and flirts with Michael in it. Karen is later interviewed about it and asks the cameras why they are singling her out. In the movie, she also participates in \"The Scarn\", a crazy dance involved in the film with the rest of the people in the scene."}],"images":[]},{"title":"Relationships","level":2,"content":[],"images":[]},{"title":"Romantic","level":3,"content":[],"images":[]},{"title":"Jim Halpert","level":4,"content":[{"type":"paragraph","text":"Karen initially doesn't think Jim fits in there and dislikes the way he looks at the camera, but eventually she grows to like him and develops a crush on him, and they begin to date. They later broke up following job interviews."}],"images":[]},{"title":"Dan","level":4,"content":[{"type":"paragraph","text":"21 months after her breakup with Jim, Karen is appeared in the episode \"Lecture Circuit\". She is happily married to Dan, a dermatologist whom she met at a bar, and is 8 months pregnant with their first child. She is gracious and warm in response to the news of Jim and Pam's engagement."}],"images":[]},{"title":"Ryan Howard","level":4,"content":[{"type":"paragraph","text":"While arguing with Kelly, Ryan claims that Karen asked him out six months prior through email, which he refused. . It was revealed in the episode Women's Appreciation that he was the one to ask Karen out via email and be rejected."}],"images":[]},{"title":"Professional","level":2,"content":[{"type":"paragraph","text":"Karen is the regional manager of Dunder Mifflin's Utica branch. She explains her job as \"an easy gig, when your boss isn't an idiot and your boyfriend isn't in love with someone else\". She is a former sales representative at Dunder Mifflin's Scranton Branch, and formerly its Stamford branch before it closed."},{"type":"paragraph","text":"Karen was twice passed over for promotion in favor of someone from the Scranton branch. She mentions that Jim received the position of Assistant Regional Manager over her. She is interviewed for the position of VP of Northeastern Sales, but the job ultimately goes to Ryan Howard."},{"type":"paragraph","text":"In season four, Karen appears as the regional manager for the Utica branch."}],"images":[]},{"title":"Trivia","level":2,"content":[{"type":"list","elements":[{"text":"Karen was a regular member of the Party Planning Committee during her time at the Scranton branch.","elements":[]},{"text":"Ryan admits to having asked Karen out by email after the Stamford and Scranton branches merged. She turned him down.  Ryan lies about the incident to Kelly, turning the story around and claiming that it was Karen who had asked him out, and he turned her down.","elements":[]},{"text":"Karen dates Jim Halpert throughout the third season. Outside of the Office universe, Rashida Jones and John Krasinski dated for a brief period of time.","elements":[]},{"text":"Karen is the first female manager of a Dunder Mifflin branch seen on the show. The second female manager was Nellie Bertram.","elements":[]},{"text":"Karen was twice passed over for promotion in favor of someone from the Scranton branch. In a deleted scene in \"Gay Witch Hunt\", she mentions that Jim received the position of Assistant Regional Manager over her. In the episode \"The Job\", she is interviewed for the position of VP of Northeastern Sales, but the job ultimately goes to Ryan Howard.","elements":[]},{"text":"It is confirmed from a deleted scene, that Karen had a pet fish named Carrot.","elements":[]},{"text":"Karen's name has a cameo mention in “The List\" inside of a notebook that Dwight once used to divide his fellow employees into lists to plan for various emergency situations. Among them were lists that detailed how to divide into life boats or life rafts as well as a list that Dwight describes as \"who would eat who in an Alive situation.\"","elements":[]}]}],"images":[]}]}