{"sections":[{"title":"Katy","level":1,"content":[{"type":"paragraph","text":"Katy Moore  is a fictional character played by Amy Adams in the television series The Office."}],"images":[]},{"title":"Season 1","level":2,"content":[{"type":"paragraph","text":"Katy debuts as the titular Hot Girl and is a handbag saleswoman. Both Dwight and Michael unsuccessfully attempt to woo Katy, and she ends up catching a ride home with Jim. Dwight is hurt."}],"images":[]},{"title":"Season 2","level":2,"content":[{"type":"paragraph","text":"Katy is revealed to be dating Jim. In The Fire, Katy participates in the Desert Island game with the other Office staff. She chooses Legally Blonde as one of her top movies, which elicits a laugh from Pam (due to the irony of Jim previously mocking Meredith for choosing the same movie). In Email Surveillance, Ryan asks Jim if Katy was coming to the house party, but Jim responds that they hadn't spoken in a while. Ryan then asks if he can call Katy, which Jim rejects. Pam overhears and appears surprised but is secretly happy."},{"type":"paragraph","text":"Katy then attends the Booze Cruise as Jim's date. However she recognizes Pam's fiance Roy as a former cheerleader of his rival school Bishop O'Hara High School, and begins bonding with him. As Roy and Pam announce the date of their wedding a heartbroken Jim dumps Katy when she asks him if that will \"ever be us,\" much to her devastation."}],"images":[]},{"title":"Season 7","level":2,"content":[{"type":"paragraph","text":"In a deleted scene from Dwight K. Schrute, (Acting) Manager, Pam defends Dwight's gun shooting incident from earlier in the episode and reminds Jim that he did save him from getting attacked by Roy. Jim responds that Dwight would be getting a free pass for being less violent than \"the goon you were engaged to\". Pam rolls her eyes and says that Roy was a lot smarter than Katy. Jim's reaction indicates that they had spoken about Katy a few times off camera."}],"images":[]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":"Hot Girl","elements":[]},{"text":"The Fire","elements":[]},{"text":"Booze Cruise","elements":[]},{"text":"Dwight K. Schrute, (Acting) Manager","elements":[]}]}],"images":[]}]}