{"sections":[{"title":"Kelly Kapoor","level":1,"content":[{"type":"paragraph","text":"Kelly Rajnigandha Kapoor (केली रजनीगन्धा कपूर‌, Kelī Rajnīgandhā Kapūr), (born February 5, 1980) is a fictional character on The Office played by one of the show's writers Mindy Kaling. She is the former Customer Service Representative at Dunder Mifflin\/Sabre's Scranton Branch."}],"images":[]},{"title":"Season 1","level":2,"content":[{"type":"paragraph","text":"When Michael uses the stereotype of Indians owning convenience stores during his diversity training seminar in Diversity Day, Kelly slaps him hard for his ignorance of diversity. Michael is then very stunned and then says \"That's what I'm talking about!!\" for showing the appropriate reaction of anger."}],"images":[]},{"title":"Season 2","level":2,"content":[{"type":"paragraph","text":"Kelly gossiped with Pam and Phyllis about Michael and what is written about him in the women's bathroom. She is still targeted by Michael about her race, which is why she reluctantly accepts the \"Spicy Curry\" award at the Dundies (The Dundies)."},{"type":"paragraph","text":"Kelly appears mostly in the background during Toby's sexual harassment meeting in Sexual Harassment."},{"type":"paragraph","text":"Kelly watches Jim and Toby play Dunderball and later participates in the office olympics. She is later seen at the closing ceremonies in the Office Olympics."},{"type":"paragraph","text":"During the fire, she tries to evacuate the building. Dwight grabs her and pulls her to safety, much to her annoyance. She later plays the games with the rest of the staff and agrees on Jim in \"who would you do\" in The Fire."},{"type":"paragraph","text":"Kelly dresses up like Dorothy from the Wizard of Oz for halloween and Michael tells her that she should have wore soccer attire and been the Indian girl who plays soccer from the movie \"Bend it like Beckham\". When Kelly replies that she doesn't really play soccer, Michael responds, \"Well, I don't really have two heads\" referring to the fact his costume is himself with two heads. She is later invited to join Devon at Poor Richard's along with the rest of the office staff and goes in Halloween."},{"type":"paragraph","text":"Dwight starts teaching Karate to everybody in the office and shows Kelly how to fight. She seems uncomfortable when Dwight tells her that he will now attack her from behind. Michael comes in and warns her that Dwight might sucker- punch him, leading the two to start getting angry at each other. She did not attend the fight between Michael and Dwight in The Fight."},{"type":"paragraph","text":"Kelly assumingly goes to the reading of Threat Level: Midnight but has no known part in The Client."},{"type":"paragraph","text":"Kelly attends the meeting on how Michael can better the office however she doesn't say anything in Performance Review."},{"type":"paragraph","text":"Kelly confronts Michael along with the rest of the office on why he is spying on everybody's' emails. She later goes to Jim's party and drinks a lot of the beer with Meredith. She asks Oscar and Stanley to talk about something other than work, however they seem at a loss. When Michael sang karaoke, he offered Kelly to sing the part of the female but she declined in Email Surveillance."},{"type":"paragraph","text":"Kelly got Oscar for Secret Santa and gifted him a shower radio. He is displeased because she got him the same thing last year. Michael decides to turn the game into \"Yankee Swap\" and everyone is forced to trade their gifts. Ryan ends up getting Kelly's gift- a flowery name plate that says \"Kelly\". Kelly later picks Angela's gift, a poster of babies playing jazz instruments. Kelly remarks that its \"the creepiest thing she's ever seen.\" During the party she gets drunk and kisses Dwight, filling Angela with jealousy (Christmas Party)."},{"type":"paragraph","text":"When Michael announces that the years company retreat is a booze cruise, Kelly tells Michael that she bought a bathing suit since Michael instructed people to in order to throw them off. Michael tells her to return it but she says she already cut the tags off. Kelly seems bored during the cruise and is seen sleeping in the background in several scenes (Booze Cruise)."},{"type":"paragraph","text":"When Michael accidentally tells Toby that Jim is in love with someone who is clearly Pam based on his hints, Kelly correctly guesses its her. When Kelly learns about Jim's feelings for Pam she asks him why he didn't tell her making Jim realize that Michael told everyone (The Secret)."},{"type":"paragraph","text":"Kelly attends Jan's seminar for women in the workplace. Kelly says during the questions that she doesn't want to be a \"mom schlepping her kids around in a mini van.\" She then says she would want an SUV with three rows of seats. She and the other women then undermine Jan's authority by bringing up Jan's one night stand with Michael (Boys and Girls)."},{"type":"paragraph","text":"After Kelly goes on a first date with Ryan she becomes bubbly and happy telling Jim she wishes that they could date forever. Jim tries to convince her not to get to excited as Ryan doesn't feel the same way. She appears obsessed with Ryan (Valentine's Day)."}],"images":[]},{"title":"Season 3","level":2,"content":[{"type":"paragraph","text":"Kelly pushes Pam to wear better clothes and helps her shop online. Kelly says Pam looks like a princess and that she is going to cry. She sets up a double date with her, Ryan, Pam and her neighbor, Alan, a cartoonist. It doesn't go well."},{"type":"paragraph","text":"Kelly tells Angela that Dwight is a freak. Angela screams at her.  She gets back to her Indian roots by hosting a Diwali party along with other Indians, however, she doesn't really know what it is. She dances and tries to convince her family that she and Ryan are meant for each other, however, they want to put her in an arranged marriage with a doctor. She hates her sisters.  She is sad when she and Ryan have to break up because of the closing branch, but is thrilled when Jan Levinson announces that Dunder Mifflin Stamford will be closing instead. Ryan is not as happy."},{"type":"paragraph","text":"She hugs Jim when he comes back from Stamford and tells her about how celebrities' lives have changed while he was gone. When Jim asks what's going on with her, Kelly, shocked, says that she told him.  She sings a song for Ryan at the Christmas Party and decides go to Pam and Karen's party in the break room.  Kelly wears white at a wedding because she has an emergency: she looks really good in white."},{"type":"paragraph","text":"Her friendship with Pam is strained when she doesn't go to her art show.  Her relationship with Ryan continues to be horrible, and finally she admits to the girls in the office that her relationship is awful."},{"type":"paragraph","text":"Ryan breaks up with her, to her dismay and shock."}],"images":[]},{"title":"Season 4","level":2,"content":[{"type":"paragraph","text":"Kelly explains that she is not sad about Ryan. However, she still has pictures of him.  Kelly then starts a relationship with Darryl Philbin , mostly to make Ryan jealous. Kelly wears a short dress to make Ryan want her back, and Pam notices. Kelly then tells Ryan that she is pregnant with his child and goes on a date with Ryan to talk it over.  Kelly continues to ask people about Ryan's whereabouts while continuing her half-hearted relationship with Darryl. Darryl begins to defend Kelly after Dwight gets mad at her."},{"type":"paragraph","text":"Kelly continues to berate Ryan. In a meeting, she tells people that Ryan used her as an object. She then makes out with Darryl in front of everyone. Ryan sends Darryl out, while Kelly looks at Ryan.  Kelly begins to make fun of Jim and Pam's relationship and talks smack towards him about Ping-Pong. She kisses Darryl throughout, continuing the relationship.  Kelly tells Ryan that if Darryl was Ryan, she'd kill herself."},{"type":"paragraph","text":"When Ryan is arrested for fraud, Kelly tells the documentary crew that she is planning to wear a cute sweat suit and go to jail to say hello to Ryan. Then she will walk away as the other inmates say, \"Damn.\""}],"images":[]},{"title":"Season 5","level":2,"content":[{"type":"paragraph","text":"Kelly continues her relationship with Darryl, only to make out with him in front of the new receptionist, disgraced Ryan. Kelly becomes obsessed with losing weight and passes out on the ground. She is sent to the hospital for three days with an IV. She is sold a tapeworm by Creed, although Creed explains that it wasn't a tapeworm.  Kelly sells dancing lessons to Ryan just to increase the sexual tension.  She dresses up for Halloween and, when Ryan tells her she looks good, she tells him that it is inappropriate."},{"type":"paragraph","text":"Since Jim and Dwight didn't go to her America's Got Talent Finale party, she makes up bad reviews for them. She then admits it, but tells Michael she was raped, again. Michael decides not to follow her.  Kelly then gets back together with Ryan and breaks up with Darryl, who is relieved.  However, Ryan then breaks up with her, and asks Kelly for sex one more time and money. Ryan leaves for Thailand."},{"type":"paragraph","text":"Kelly is offended by Michael making fun of her ethnicity and saying that this is what it would be like if she hadn't left India.  She points out that Angela is old and doesn't understand why Andy and Dwight would even fight over her.  She cries hysterically when people say that Hilary Swank isn't hot, because she isn't hotter than Hilary Swank.  Kelly participates in the roast for Michael and points out that she would rather kiss Kevin."},{"type":"paragraph","text":"When Jim and Dwight forget Kelly's birthday, she is angry and tells them to screw themselves. She tells them that she wants a cake. Dwight then learns by going into her personal records that she went to juvenile detention.  Kelly later is angry when her cake is not decorated and freaks out, (Jim mentions here that he is not sure whether her name is spelled \"Kelly\" or \"Kelley\", which ends up misspelled at the party anyway) however, she is thrilled that she can take a nap at work as her present. Her odd relationship with Dwight continues when Dwight slaps her butt."},{"type":"paragraph","text":"Kelly begins to be nicer and pushes Michael to keep looking for the blood drive girl. When Michael says they can leave since it's 5 o' clock they stay hours later to help Michael cope. Kelly and everyone else wish Michael goodbye."},{"type":"paragraph","text":"Kelly falls for Charles Miner, the new boss and tries to get him to ask her out. She is jealous when Angela Martin also shows interest.  Kelly continues to pine for Charles and tells him that he is smooth like Jamba Juice smoothies and tells him that she and her sisters are like the Kardashians. When Angela comes into the room to talk to Charles, Kelly tells Charles that Angela is turning 50.  Kelly continues to show interest and when Charles calls Kelly Erin Hannon, the new replacement for Pam Beesly, she comes in and tells him that he wanted her."},{"type":"paragraph","text":"Kelly befriends new receptionist, Erin Hannon when she tells Kelly that she looks like Jennifer Lopez.  They restart Cafe Disco and dance together. Kelly has a dance-off with Andy Bernard and pierces his ear for him."}],"images":[]},{"title":"Season 6","level":2,"content":[{"type":"paragraph","text":"Michael convinces Erin that Kelly is anorexic. Kelly is shocked and thrilled that Pam is pregnant.  She is angry when Jim is put as co-manager because she destroyed Ryan's car and needs the raise.  Kelly goes to Pam's wedding and dances with Ryan. They are in an on-again, off-again relationship. Kelly is very happy when Pam and Jim walk down the aisle as a married couple. "},{"type":"paragraph","text":"Kelly lets Ryan take nude photos of her in the office for a series called, \"Exposure in the Workplace.\"  She talks with Ryan all day long and doesn't get much work done.  She is ecstatic when Jim gives her a Twilight Poster as a secret santa poster and tells Phyllis that she wants Ryan for her Christmas present. Kelly hugs Erin because she was scarred from Andy's presents."},{"type":"paragraph","text":"Kelly misinterprets Andy's Valentine's Day card towards her and kisses him. However, Andy explains that he likes someone else. Kelly says that she likes him harder now, signaling that Ryan and she are broken up."},{"type":"paragraph","text":"In the episode Happy Hour , Kelly is seen playing Dance Dance Revolution with Ryan and near the end of the epsiode, she is seen crying because she spilled her drink and the bar wouldn't give her a refill. "},{"type":"paragraph","text":"At Dwight's prompting, Kelly applies for and is accepted into Sabre's Print in All Colors minority executive training program."},{"type":"paragraph","text":"When news that Sabre's printers can catch fire leaks to the media, Kelly believes she may have been the source, confessing, \"I can't control what I say to people, I spend the whole day talking. I video chat, I Skype, I text, I tweet, I phone...\""}],"images":[]},{"title":"Season 7","level":2,"content":[{"type":"paragraph","text":"Ryan and Kelly announced to the office that they were getting a divorce, having married over a week earlier on the spur of the moment. They said the break-up was mutual, but after getting little reaction to their news, Ryan declared that the split was not amicable. After the divorce Ryan and Kelly continued to date."}],"images":[]},{"title":"Season 8","level":2,"content":[{"type":"paragraph","text":"As Andy is filling in the cameras on placing Dwight as his number two, Kelly, who is planking on a cabinet next to Andy, remarks that it was a smart move. When Andy mutters that \"this has to stop\" regarding to people planking around the office, she says that she can't get down. It is unknown how she eventually gets down."}],"images":[]},{"title":"Season 9","level":2,"content":[{"type":"paragraph","text":"Kelly and Ravi eventually get engaged and Ravi accepts a job at Miami University. Kelly decides to move with him and tosses all her coats to the office staff on her last day of work. However it is revealed that while Kelly believes it's in Florida, it's actually Miami University in Ohio (New Guys). "},{"type":"paragraph","text":"Kelly and Ravi attend Dwight and Angela's wedding and runs into Ryan and his baby. She loves the baby's name, Drake, and believes he is named after the hip hop artist. She and Ryan can be seen looking at each other during Dwight and Angela's wedding. Ryan later gives Drake to Ravi and tells him that he has a rash. Ravi takes Drake inside and Ryan reveals that he had let Drake suck on a strawberry to which he is allergic. While a normal person would be horrified that Ryan did so, Kelly finds it romantic and the two begin to kiss. Ryan and Kelly can later be seen running off into the sunset to start a new life together leaving Ravi and Drake behind (Finale)."}],"images":[]},{"title":"Central Episodes","level":2,"content":[{"type":"list","elements":[{"text":"Diwali","elements":[]},{"text":"Dunder Mifflin Infinity","elements":[]},{"text":"Customer Survey","elements":[]},{"text":"Lecture Circuit Part 1","elements":[]},{"text":"Lecture Circuit Part 2","elements":[]},{"text":"Body Language","elements":[]}]}],"images":[]},{"title":"Trivia","level":2,"content":[{"type":"list","elements":[{"text":"Kelly claims that she cannot stop talking.","elements":[]},{"text":"Toby once sat in the same cubicle as Kelly, but due to her incessant talking, he was prompted to leave.","elements":[]},{"text":"Kelly's Hindi name is given on the Print in All Colors Web site.","elements":[]},{"text":"Although Kelly is Hindu, she knows very little about the religion.","elements":[]},{"text":"Kelly has claimed that she has a sister who is dead.","elements":[]},{"text":"Kelly and Toby decided to have matching Halloween outfits one year and Gabe overheard and decided to dress the same as them.","elements":[]},{"text":"In the episode \"Body Language\", Dwight tries to manipulate Kelly into joining the Ethnic Program so that he could control her and take over the company. Instead, Kelly works with Ryan and in retaliation, Dwight tries to get Oscar and Stanley to run against her. When they refuse, he says that he can protect them from Kelly and Erin snorts in disagreement. At the end of the episode where Kelly had won the Ethnic Program slot, Dwight congratulates her, and Kelly tells Dwight that she will never forget what he had done for her. Then she says very ominously that she \"Never forgets anything.\"","elements":[]},{"text":"In a deleted scene from \"Body Language\" the camera man asked Oscar and Stanley if they are afraid of Kelly. They both laughed at the question and then became very silent and would not look at the camera.","elements":[]},{"text":"In the seventh season when Andy is holding a business conference, she calls one of her professors and asks him to tell the group of people in the room the ten secrets of business. At first, the man on the phone seemed to only want to flirt with her, but after asking him to do it for her, he gave in and told the group ten bullets. Andy says to the camera, \"That brilliant little bitch.\"","elements":[]},{"text":"Kelly has decided to call herself the business bitch, the diet bitch, the shopping bitch, and the etiquette bitch because it is important to brand yourself.","elements":[]},{"text":"Kelly and Ryan Howard had an on and off relationship but get back together in series finale.","elements":[]}]},{"type":"list","elements":[{"text":"Despite often get annoyed with each other, Toby and Kelly are shown to be close friends.","elements":[]},{"text":"In the webisode Blackmail: Kelly, Creed tries to blackmail Kelly by threating to publish a photo of Kelly kissing a girl, but Kelly tells him that it's her MySpace profile picture.","elements":[]}]}],"images":[]},{"title":"Quotes","level":2,"content":[{"type":"list","elements":[{"text":"\"I don't talk trash; I talk smack. They're totally different. Trash talk is all hypothetical, like, 'Your Mama's so fat she could eat the internet', but smack talk is happening like right now, like, 'You're ugly and I know it for a fact 'cause I got the evidence right there.' \"","elements":[]},{"text":"\"This day is BANANAS! B-A-N-A-N-A-S!\"","elements":[]},{"text":"\"Fashion show! Fashion show! Fashion show AT LUNCH!\"","elements":[]},{"text":"\"I talk a lot, so I learn to tune myself out.\"","elements":[]},{"text":"\"I am one of the few people who looks hot eating a cupcake.\"","elements":[]},{"text":"\"I am dating a lot of guys. Black guys, mostly.\"","elements":[]},{"text":"\"Dammit Meredith, Where are your panties!?\"","elements":[]},{"text":"\"I never really thought about death till Princess Diana died. That was the saddest funeral ever. That and my sister's.\"","elements":[]},{"text":"\"I look really good in white\"","elements":[]},{"text":"\"WELL, MY MIDDLE NAME IS RAJANIGANDHA AND I HATE IT!!!!!\"","elements":[]}]}],"images":[]},{"title":"Appearances","level":2,"content":[{"type":"paragraph","text":"Kelly appears and has lines in every episode, with the following exceptions:"},{"type":"list","elements":[{"text":"Pilot - does not appear","elements":[]},{"text":"The Alliance - does not appear","elements":[]},{"text":"Basketball - does not appear","elements":[]},{"text":"Hot Girl - speaks only in a deleted scene","elements":[]},{"text":"Sexual Harassment - has no lines","elements":[]},{"text":"Office Olympics - has no lines","elements":[]},{"text":"The Convict - does not appear, speaks in a deleted scene","elements":[]},{"text":"Back From Vacation - speaks only in a deleted scene","elements":[]},{"text":"The Return - has no lines","elements":[]},{"text":"Local Ad - has no lines","elements":[]},{"text":"Branch Wars - does not appear","elements":[]},{"text":"Dinner Party - has no lines","elements":[]},{"text":"Chair Model - speaks only in a deleted scene","elements":[]},{"text":"Company Picnic - has no lines","elements":[]},{"text":"Michael's Last Dundies - sings with Erin but speaks only in a deleted scene","elements":[]},{"text":"Roy's Wedding through A.A.R.M. - does not appear","elements":[]}]}],"images":[]}]}