{"sections":[{"title":"Kevin Malone","level":1,"content":[{"type":"paragraph","text":"Kevin Malone is a fictional character on The Office, played by Brian Baumgartner. His character is based on Keith Bishop from The Office UK. He was an accountant at Dunder Mifflin: Scranton Branch."}],"images":[{"src":"https:\/\/vignette.wikia.nocookie.net\/theoffice\/images\/b\/b2\/Kevin5.jpg\/revision\/latest?cb=20140726053224","caption":""},{"src":"https:\/\/vignette.wikia.nocookie.net\/theoffice\/images\/1\/12\/Kevin4.jpg\/revision\/latest?cb=20140726053223","caption":""},{"src":"https:\/\/vignette.wikia.nocookie.net\/theoffice\/images\/e\/ec\/Kevin3.jpg\/revision\/latest\/scale-to-width-down\/220?cb=20140726053223","caption":""},{"src":"https:\/\/vignette.wikia.nocookie.net\/theoffice\/images\/5\/53\/Kevin2.jpg\/revision\/latest?cb=20140726053223","caption":""},{"src":"https:\/\/vignette.wikia.nocookie.net\/theoffice\/images\/7\/7a\/Kevin1.jpg\/revision\/latest\/scale-to-width-down\/220?cb=20140726053223","caption":""}]},{"title":"Biography","level":2,"content":[{"type":"paragraph","text":"Kevin is typically quite subdued with his hangdog face, although he is known for making blunt or offensive comments regarding the other employees. He hints toward unbecoming Internet habits, most likely pornography, as alluded to in the episodes \"E-mail Surveillance\" and \"Take Your Daughter to Work Day\". He is very concerned about the e-mail surveillance uncovering the contents of his hard drive and actually flees an interview with the cameras to ensure that his fiancee's daughter had not found the same content."},{"type":"paragraph","text":"Kevin was engaged to a woman named Stacy, who has a daughter named Abby. Stacy was the fourth woman to whom Kevin proposed, but the first to say yes, and he was very happy, though he secretly considered her a second choice to one of the other women, Melissa Riley. Little is known about Stacy, and it is hinted that their relationship is somewhat peculiar. Kevin plays drums and is also the lead singer in a local tribute band. The group initially was a Steve Miller Band tribute called \"Jokers and Tokers\", but recently refocused on the music of The Police, and rebranded accordingly as \"Scrantonicity\", a homage to their album Synchronicity. However, after getting into a fight with his bandmates, Kevin breaks off and forms a new band, \"Scrantonicity II\", another homage to a Police song of the same name. Kevin is a fan of the Detroit Pistons, his favorite foods are Cup Noodles and M&M's, and his favorite movie is American Pie 2. He also likes Weekend at Bernie's and The Cannonball Run. His favorite number, not surprisingly, is 69, after the sexual position. According to Jim in a deleted scene from \"The Dundies\", Kevin is interested in naval history and enjoys bowling."},{"type":"paragraph","text":"Kevin is not given much responsibility by his supervisor, Angela Martin, but he is allowed to shred company documents and says that is all he really needs. In \"Health Care\", it was revealed that he suffers from anal fissures. In \"Casino Night\", he reveals that he won a World Series of Poker bracelet in 2002, but he nonetheless suffers defeat at the hands of an unwitting Phyllis Lapin. As seen in the \"Kevin Cooks Stuff in The Office\" short, Kevin is currently brewing beer in the cabinet beside his desk, much to the disgust of his coworker Oscar Martinez. Kevin states that, \"rules say I can't bring beer into the office, but they don't say anything about making beer in the office.\" He also has recipes for office-made quesadillas and creme brulee."},{"type":"paragraph","text":"Kevin suffers from plantar hyperhidrosis (\"Grief Counseling\" deleted scene). Angela is regularly disgusted by Kevin's feet and he protests that she knows about his medical condition."},{"type":"paragraph","text":"Kevin is the only minor character in The Office to be directly based on a character from the British original version. He is based on Keith Bishop, who shares Kevin's lack of communication skills, and became particularly popular after an episode where boss David Brent conducts a staff appraisal, to which Keith stoically fails to respond to questions. Keith shares Kevin's musical interest (as a disc jockey, not a musician), but not Kevin's childish sense of humor."},{"type":"paragraph","text":"Personal information:"},{"type":"paragraph","text":"According to NBC a loan application released in conjunction with the webisode Taste the Ice Cream, Kevin's birthday is 06\/01\/1968. He lives at 24 Stanford Ave, Scranton, PA 18505 and his telephone number is 570-555-0137."},{"type":"paragraph","text":"According to a diploma hanging in his workspace, Kevin received an Associate of Science degree in Accounting from Penn Foster College."}],"images":[]},{"title":"Season 1","level":2,"content":[{"type":"paragraph","text":"Kevin is one of the more featured supporting characters and has many comic moments. While making a basketball team for a game against the warehouse employees, Michael ignores Kevin's plea to join the team, but it later turns out that Kevin is in fact an excellent player, as opposed to Stanley Hudson, whom he assumed to be talented based merely on the fact that he is African-American, though he was actually clumsy and slow. He often tells people that Pam is \"hot\", though when Katy, a purse saleswoman, comes to the office, he tells Pam that Katy is prettier than her. On \"Diversity Day\", when the employees are given a card with a specific race written on it, Kevin is given \"Italian\". In the same episode, he attempts to reenact for his coworkers a race-themed Chris Rock routine without offending anyone; Michael complains that Kevin has butchered the routine."}],"images":[]},{"title":"Season 2","level":2,"content":[{"type":"paragraph","text":"When Michael is telling the cameras that more food will be needed for the Dundies this year he tells a story about how by the time he got off stage, someone had eaten all the appetizers. The cameras then pan onto a guilty-looking Kevin. Kevin mostly appears in the background for the remainder of the episode. During the Dundie awards, Kevin is given the \"Don't Go In After Me Award\" for the time he stunk up the bathroom (The Dundies)."},{"type":"paragraph","text":"Kevin mostly appears in the background and later listens to a joke told by Todd Packer. When Packer makes a crude joke about Phyllis, Michael confronts him about it, but chickens out about standing up to Packer and instead said that he was lecturing Kevin. He then puts Kevin in \"time-out\" by telling him to go to his desk (Sexual Harassment)."},{"type":"paragraph","text":"When Jim realizes that everyone plays a game in the office to fight off boredom, he plays a paper football game that Kevin and Oscar invented. Kevin remarks that its called \"Hateball\" because of how much Angela hates it. Kevin later participates in the office Olympics and challenges Phyllis in a race where paper boxes are strapped to your feet. He also receives a gold medal for who can put the most M&Ms in their mouth by default, as no one else wants to try to beat his record. Kevin is later present at the closing ceremonies (Office Olympics)."},{"type":"paragraph","text":"During the fire, the office staff wait around in the parking lot. In \"who would you do\" Jim jokes that he would pick Kevin as he has that whole \"teddy bear look\" going for him. While Pam, Meredith and Phyllis are playing they name several men before wondering if they left anyone else out while Kevin stands nearby trying to be noticed (The Fire)."},{"type":"paragraph","text":"Kevin dresses as a superhero during Halloween and becomes nervous when he learns that Michael must fire someone and the accounting department already has too many people. Kevin is later invited to join Devon at Poor Richards along with the rest of the staff and he goes. (Halloween)."},{"type":"paragraph","text":"Dwight is forced to work in the bathroom when Jim moves his desk in there as a prank. Kevin comes out of one of the stalls and leaves without washing his hands. Kevin gets really happy upon going to watch the fight between Michael and Dwight. During the fight he yells to \"sweep the leg!\" (The Fight)"},{"type":"paragraph","text":"Kevin attends the reading of Michael's screenplay, \"Threat Level Midnight\". He is later seen playing with fireworks with Dwight from Jim and Pam on top of the office's rooftop on their moonlit date (The Client)."},{"type":"paragraph","text":"Kevin attends the meeting on how Michael can improve the office. He appears mostly in the background for the rest of the episode (Performance Review)."},{"type":"paragraph","text":"Kevin confronts Michael on why he is suddenly spying on their computers. Kevin tells the cameras in a talking head interview that he has to delete a lot of stuff. He is later seen in a clip of Michael with a puppet punching his M&M jar. He is also seen having lunch in the kitchen with Jim, Pam and Oscar. When Michael asks Kevin where he is going after work, Kevin claims that he is going to meet his brother to go to the Alaskan Film Festival, though this is just an excuse. He is later invited to a party at Jim's house, which he attends. He cooks a lot of the food on the grill, and when Ryan takes over, Kevin says, \"Not so fast... fire guy!\" (E-Mail Surveillance)."},{"type":"paragraph","text":"Michael and Dwight get a Christmas tree for the office which ends up being too tall, so Kevin cuts the top part off. When asked what to do with it, Michael says they will \"sell it to charity as a mini tree.\" Kevin later reveals to the cameras that he got himself for Secret Santa and bought himself a foot bath. During Yankee Swap he loses the foot bath to Pam but later gets it back. In an interview he seems happy, but then realizes he could've gotten an iPod instead. During the party, he stands in his foot bath, smiling (Christmas Party)."},{"type":"paragraph","text":"Kevin is present for Michael's meeting on motivational speaking and later goes on the booze cruise. He sits at a table and looks around for most of the episode. When Michael announces that the ship is sinking in his speech, a man takes him literally and jumps off the ship. Kevin tries to tell the man it isn't true but the man doesn't listen (Booze Cruise)."},{"type":"paragraph","text":"During Michael's January spring cleaning day, Kevin is seen throwing a file into the trash but it falls short and spreads papers everywhere, much to Angela's annoyance. When word gets out that Jim has a crush on Pam, Kevin spreads the rumor to Creed, but Creed forgets who Pam is (The Secret)."},{"type":"paragraph","text":"Michael tries to pull a joke on Kevin, but it doesn't quite work out. He goes with the rest of the male office staff to the warehouse. Kevin tells Jim that he bets that Roy will try to beat him up for liking Pam. He assures Jim that he has his back, but suddenly seems not so sure. He helps unload delivery trucks (Boys and Girls)."},{"type":"paragraph","text":"Kevin is at the reception desk when Phyllis is delivered a giant teddy bear. When Kevin remarks that it's bigger than him, the delivery man replies, \"no it's not,\" to which Kevin responds, \"Oh, shut it.\" (Valentine's Day)"},{"type":"paragraph","text":"After a visit to the Doctor, Kevin was diagnosed with skin cancer. Much of the events planned for Michael's birthday are instead dedicated to comforting Kevin. Fortunately, a second opinion proves it was a misdiagnosis. (Michael's Birthday)"}],"images":[]},{"title":"Season 3","level":2,"content":[{"type":"paragraph","text":"Generally, he doesn't get much responsibility, so in \"The Merger\", he is delighted that he gets to shred company documents. However, in the excitement of showing everything that it can shred, he puts in his own credit card. He later uses the shredder to make a salad. After some deliberation, Kevin joins Angela's party in \"A Benihana Christmas\", but only because of the double-fudge brownies. Scrantonicity got to perform at \"Phyllis' Wedding\". It was the third wedding they performed at, having also played at their bassist's wedding and their guitarist's wedding."},{"type":"paragraph","text":"During \"Cocktails\", Malone is asked if he and Stacy have set a date for their wedding. Kevin says they have, but it is very complicated, hinting that they may have separated. During \"The Merger\" (deleted scene), he hides his M&M's under his desk so \"they\" (the new employees from Stamford) won't get to them, but is willing to share with Jim. In \"The Convict\", Kevin implies that he is involved in insider trading, but wasn't aware of the legal implications. He greatly enjoys the hot dog eating contest during Beach Games, saying that laying on the beach eating hot dogs is \"all he's ever wanted\"."}],"images":[]},{"title":"Season 4","level":2,"content":[{"type":"paragraph","text":"In the season premiere, \"Fun Run\", Kevin openly suspects Jim and Pam of \"hooking up\" and is determined to prove his speculations to his neighboring accountant Oscar. Oscar is not convinced, but Kevin is vindicated in the episode \"Dunder Mifflin Infinity\", when Jim and Pam reveal their relationship to their coworkers."},{"type":"paragraph","text":"Kevin suffers a series of setbacks during the season. In the episode \"Money\", Kevin announces that he has split from the band \"Scrantonicity\" and formed \"Scrantonicity II\", however none of his coworkers come to support his new band. He also reveals in the episode The Chair Model that he and his fiancee Stacy have ended their engagement. Also, Kevin, along with all of the other Dunder Mifflin employees (except for Michael) are made to park in a satellite parking lot, which angers all of them. Kevin is one of the most distraught, and he teams up with Andy in order to do something about it. They suggest to Michael that an assembly be called between the \"Five Families\". He later explains that the \"Five Families\" are the five companies which share the Scranton business park, and that the bosses \"rarely meet\". When Michael denies him the opportunity to call a meeting, Kevin and Andy decide to call a meeting anyway. At the meeting, Kevin and Andy attempt to be polite and in charge, since Michael isn't there. Kevin finally breaks down, demanding the parking spaces back, claiming that \"some people have to park really far away and walk all the way to the office, and some people sweat too much for comfort.\" Kevin's later success in resolving the parking space problem in Dunder-Mifflin's favor gives him the small victory that he really needed. In \"Job Fair\", Kevin's zeal to gamble during a trip to the golf course with Jim, Andy and a prospective customer implies that his gambling may be a compulsive behavior rather than just a casual hobby, as he takes money from petty cash in order to turn it into \"this month's rent.\""},{"type":"paragraph","text":"In \"Goodbye, Toby\", Dwight, attempting to haze the new HR representative, Holly, tells her that Kevin is mentally challenged and got his job at Dunder-Mifflin though a special program. Kevin, however, interprets Holly's frequent praise and breathy condescension as sexual interest in him. When Michael ignores Holly's romantic advances at the end of the episode, Kevin steps in and goes off to have \"PIE\" with her at a nearby diner."}],"images":[]},{"title":"Season 5","level":2,"content":[{"type":"paragraph","text":"In \"Weight Loss\", Holly still thinks that Kevin is mentally challenged, thoughts enforced by Kevin's miscalculation of Pam's weight by 100 pounds. However, when Angela is yelling at Kevin for his slowness, Holly comes to his defense, saying he is not stupid, but mentally challenged. Kevin then realizes why Holly has been praising him so much, and asks her if she thinks he's retarded. Realizing what Dwight has done, Holly walks away, embarrassed."},{"type":"paragraph","text":"In a deleted scene from \"Baby Shower\", it is revealed that Kevin donated sperm to the same sperm bank Jan went to, proclaiming \"I might have done it with Jan\" afterward. She is then taken back at the idea that he might be the biological father. In another scene, Jan publicly breastfeeds Astrid, much to the disturbance of most of the office-workers. Kevin then tries to discreetly look at the topless Jan, but she allows him to stare because she feels that it is natural. However, when Creed begins to stare, she starts to feel embarrassed and calls for Michael."},{"type":"paragraph","text":"During an office robbery in \"Crime Aid\", Kevin's surge protector was stolen. Unfortunately, Kevin \"is now prone to surges\"."},{"type":"paragraph","text":"In a deleted scene, Ryan confesses that he ran his BMW into Kevin's car and damaged a side mirror, but refuses to pay for the damages by claiming that \"Ryan 1.0\" was responsible; Kevin later puts Ryan's pricey sunglasses in the microwave and melts them, sarcastically blaming it on \"Kevin 1.0\"."},{"type":"paragraph","text":"In \"Prince Family Paper\" Kevin finds out that he does not have full internet access at the office."},{"type":"paragraph","text":"During the episode \"Blood Drive\", Kevin meets a woman named Lynne, and likes her but is awkward when talking to her. Andy, Jim, and Pam give him greatly disparate advice on wooing her in \"Golden Ticket\", and ultimately he successfully asks her to dinner and a movie. Kevin is seen kissing her passionately in \"Cafe Disco\"."},{"type":"paragraph","text":"In \"Casual Friday\" Kevin brings a batch of his \"Kevin's Famous Chili\" upstairs to the office, only to drop the pot, causing chili to spill all over the floor in front of Erin's desk. He desperately tries to clean up the mess, only to drench papers and binders in chili while spreading the food all over the carpet. It is also shown that he drives a Honda CR- V."}],"images":[]},{"title":"Season 6","level":2,"content":[{"type":"paragraph","text":"It is implied Lynn and Kevin broke up, because, after Michael said Erin liked him, he said he dated Lynn 'Delivery Part 2\"."}],"images":[]},{"title":"Season 7 ","level":2,"content":[{"type":"paragraph","text":"In Costume Contest, Kevin comes into the office dressed as Michael Moore."},{"type":"paragraph","text":"In Viewing Party, Kevin walks into one of the bedrooms in Gabe's apartment while Dwight is keeping Cece Halpert, Jim and Pam's daughter, asleep, and crawls into the bed. When Dwight whispers to him to ask what he is doing, he whispers in response, \"I wanted to eat \"Pigs In A Blanket\"... in a blanket...\""}],"images":[]},{"title":"Season 8","level":2,"content":[{"type":"paragraph","text":"While photocopying Robert's notebook, Kevin insists that they need a warning signal in case Robert comes in and catches them. Jim tells Kevin that this is unnecessary however suddenly Kevin spontaneously starts to scream \"Warning! Warning! Warning! Warning!\" causing Robert to come in and investigate. To cause a distraction, Phyllis falls over and Kevin and others help her back up. Later, when Dwight attacks numerous people Kevin begins to yell \"Warning!\" again to which Robert again appears to investigate. Kevin is later invited to lunch by Robert as he is on the \"winners\" side of his list. During a discussion of Sesame Street, Kevin admits he likes Elmo because \"of the tickling\". Kevin appears very happy when he learns that he is on the \"winners\" side of Robert's list. This causes Kevin to become cocky and treat the people on the \"losers\" side of Robert's list as inferior. This is shown when he repeatedly sprays Meredith with a water gun saying \"loser\" as he does so. Kevin later gains respect for Andy as does the rest of the office when they see Andy is genuinely caring for them. Kevin fist bumps Andy on his way to the parking lot as the office staff pack up and leave for the day (The List)."},{"type":"paragraph","text":"When Jim hands in an assignment for Kevin to work on, Kevin talks in a very primitive way. Jim and Pam become worried and decide to take him to a hospital however Angela remarks about how Kevin has always been this way. Kevin tells the cameras that he is talking this way to save time as simple words get the message across. Kevin is taken to Andy's office where Andy tries to persuade him to talk normally however Kevin refuses. Pam tries to convince him that he can't save very much time by cutting back on a few words and Kevin finally relents. However during an interview he is back to talking the same way and claims that when he is president some day \"they'll see\"."}],"images":[]},{"title":"Season 9","level":2,"content":[{"type":"paragraph","text":"During a meeting, Dwight fires Kevin by giving him a cake, and then announcing he's fired. He begins to sob, but he does say the cake is good. Sometime after he was fired, he purchased a bar and began to work there. Later, Mose kidnaps Angela and takes her to Kevin's bar. Dwight appears, looking for his wife, and instead finds Kevin. Jim tells Dwight to make up with him, which he does, albeit angrily. Later, he shows for the final round of interviews and is present in the office during the last scene (Finale)."}],"images":[]},{"title":"Central Episodes","level":2,"content":[{"type":"list","elements":[{"text":"Michael's Birthday","elements":[]},{"text":"Blood Drive","elements":[]},{"text":"Secretary's Day","elements":[]},{"text":"The Inner Circle","elements":[]},{"text":"Pam's Replacement","elements":[]},{"text":"Last Day in Florida","elements":[]}]}],"images":[]},{"title":"Webisodes","level":2,"content":[{"type":"paragraph","text":"During the time period between the second and third seasons, NBC posted \"webisodes\" (online mini episodes). Most webisodes consisted of the Accountants (Kevin, Angela, Oscar), with Dwight also appearing in an episode."},{"type":"paragraph","text":"Kevin starred in his own webisode, Kevin's Loan. It ran in July 2008 on NBC.com. The webisode featured Kevin pursuing a unique solution in an effort to pay back his looming gambling debts. In his attempts at securing a bank loan, he seeks help from Oscar and Darryl."}],"images":[]},{"title":"Trivia","level":2,"content":[{"type":"list","elements":[{"text":"Kevin was engaged to a single mother named Stacy.","elements":[]},{"text":"Kevin is very musical, is seen drumming to The Full Monty in \"A Benihana Christmas\", he sings the song You Oughta Know at Pam and Karen's Christmas Party","elements":[]},{"text":"Kevin played drums for a Police cover band named Scrantonicity. The band was going to play at Pam and Roy's wedding before it got called off. They later played at Phyllis and Bob Vance's wedding. He later became associated with a new band, Scrantonicity 2.","elements":[]},{"text":"He does a cooking show called \"Kevin Cooks Stuff in the Office\", seen in Season 3 extras.","elements":[]},{"text":"Kevin has Jim's back (Boys and Girls, The Negotiation).","elements":[]},{"text":"Kevin is very good at basketball (Basketball), poker (Casino Night), golf (Job Fair), and Skee-Ball (Happy Hour*). (In an April 2010 interview, Steve Carell told radio host Dan Patrick that Brian Baumgartner was \"by far\" the best athlete among the cast, which Patrick would later mention in his weekly Sports Illustrated column. [1])","elements":[]},{"text":"Kevin's favorite number is 69 because it is also the name for a sexual position. In \"Dwight's Speech\" he sets the office thermostat to 69 degrees. In \"Michael's Birthday\", Pam and Jim get 69 Cup Noodles containers in their gift to Kevin.","elements":[]},{"text":"In the Webisode \"The Accountants,\" Kevin says that he scored over 100 on an I.Q. test, proving that he's more slow witted than mentally challenged.","elements":[]},{"text":"Kevin likes to gamble.","elements":[{"text":"Kevin gambles petty cash in the Webisode Things Are Getting Tense and again in the episode Job Fair.","elements":[]},{"text":"Kevin gambles on NBA basketball games in Traveling Salesmen.","elements":[]},{"text":"Kevin gambles on college basketball (and pretty much anything else) in Safety Training.","elements":[]},{"text":"Kevin mentions a bet with a friend from the Albany branch, wagering a month's salary on Karen being hired to replace Jan - at which point it dawns on him that he may have a gambling problem - in a deleted scene from The Job.","elements":[]},{"text":"Michael, looking for a way to reduce his Jan-worsened debts, asks Kevin for gambling advice in Money.","elements":[]},{"text":"Kevin incurs significant gambling debts in the 2008 summer Webisodes.","elements":[]}]},{"text":"In a talking head interview in The Convict, Kevin reveals he unintentionally practices insider trading.","elements":[]},{"text":"In \"Scott's Tots,\" Michael reveals to Erin that Kevin initially applied for a warehouse position with Dunder-Mifflin but Michael hired him as an accountant because Michael thought he saw potential in Kevin.","elements":[]},{"text":"Kevin suffers from hyperhidrosis (excessive sweating) of the feet. Angela is particularly disgusted by his condition.","elements":[{"text":"In a deleted scene from the episode \"Grief Counseling\", Angela is disgusted when Kevin takes off his shoes. In a talking head interview, Kevin explains that it is a medical condition.","elements":[]},{"text":"In the episode \"Diwali\", Angela remarks, \"I wish some of us still had our shoes on.\"","elements":[]},{"text":"In the episode \"Beach Games\", Angela remarks, \"I'm not going to walk through the fire after your disgusting feet have gone through.\"","elements":[]},{"text":"In the episode \"Chair Model\", Kevin sits by the side of the road rubbing his feet.","elements":[]},{"text":"In the episode \"Chair Model\", Kevin addresses a meeting of the Five Families, explaining that \"some people sweat too much for comfort.\"","elements":[]},{"text":"In the episode \"Niagara\", the hotel manager throws away Kevin's shoes due to their stench. At the end of the episode, Kevin dunks his feet in an ice machine for relief.","elements":[]}]},{"text":"Despite the many references to this unhygienic condition, in a deleted scene from \"Traveling Salesmen\", Michael comments to Andy that Kevin \"always smells really good\", and that his slovenly appearances belies \"impeccable\" grooming habits.","elements":[]},{"text":"In Search Committee Part 2, it is implied that Kevin does not know the alphabet.","elements":[]},{"text":"In Promos, it is revealed that Kevin never knew that the series was a documentary.","elements":[]},{"text":"At the beginning of the series, Kevin speaks in a more quiet and monotone voice much like his UK counterpart Keith Bishop.","elements":[]},{"text":"It is revealed that Kevin keeps M&M's at his desk so no one steals them.","elements":[]}]}],"images":[]},{"title":"Appearances","level":2,"content":[{"type":"paragraph","text":"Kevin has appeared and had lines in every episode with the following exeption of"},{"type":"list","elements":[{"text":"Dinner Party - has no lines","elements":[]}]}],"images":[]},{"title":"References","level":2,"content":[{"type":"list","elements":[{"text":"↑ http:\/\/nbcumv.com\/release_detail.nbc\/entertainment-20080402000000-nbcdigitalentertai.html Nbc Digital Entertainment Brings More Video, Original Content And Interactivity For Summer And Fall Season Programming.","elements":[]}]}],"images":[]}]}