{"sections":[{"title":"List of IT guys","level":1,"content":[{"type":"paragraph","text":"According to Michael Scott, there has been eight men who are IT guys at Dunder Mifflin Scranton."}],"images":[]},{"title":"IT Guys","level":2,"content":[],"images":[]},{"title":"Fatso","level":3,"content":[{"type":"paragraph","text":"The very first IT guy at the Scranton branch but he was unsuccessful in creating a network server."}],"images":[]},{"title":"Lozenge","level":3,"content":[{"type":"paragraph","text":"The second IT guy who could have set up the network server."}],"images":[]},{"title":"Fatty 2","level":3,"content":[{"type":"paragraph","text":"The third IT guy is the second fat IT guy."}],"images":[]},{"title":"Shorts","level":3,"content":[{"type":"paragraph","text":"The fourth IT guy who wears shorts all the time."}],"images":[]},{"title":"Fatty 3","level":3,"content":[{"type":"paragraph","text":"The fifth IT guy who is the last fat IT guy."}],"images":[]},{"title":"Earhair","level":3,"content":[{"type":"paragraph","text":"The sixth IT guy who has tons of hair in his ears."}],"images":[]},{"title":"Sadiq (Turban)","level":3,"content":[{"type":"paragraph","text":"Sadiq was the seventh IT guy and did some email surveillance until Michael thought that he was a terrorist."}],"images":[]},{"title":"Nick (Glasses)","level":3,"content":[{"type":"paragraph","text":"Nick was the eighth IT guy at Dunder Mifflin Scranton. He used to take care of the network servers until he found out that Andy Bernard did the leak of the printers catching on fire. Nick announces he is leaving Dunder-Mifflin to teach inner-city kids about computers. Dwight tells Nick that they only use the internet for games and porn. The actor who plays Nick also appears in Season 4, Episode 13 Job Fair manning a booth for creative services. He gives Pam advice on going to New York or Philadelphia to acquire creative skills."}],"images":[]},{"title":"Frank","level":3,"content":[{"type":"paragraph","text":"Frank was the final IT guy at Dunder Mifflin Scranton. It was a small role without any lines. You can see Frank in the background of one shot from Season 6, Episode 12 \"Scott's Tots\"."}],"images":[]},{"title":"Trivia","level":2,"content":[{"type":"list","elements":[{"text":"Michael thinks that Lozenge set up the network server.","elements":[]}]}],"images":[]}]}