{"sections":[{"title":"Lonny Collins","level":1,"content":[{"type":"paragraph","text":"Lonnis \"Lonny\" Collins is a fictional character played by Patrice O'Neal in the television series The Office. Patrice O'Neal passed away on November 29th, 2011. He was 41 years old."}],"images":[]},{"title":"Season 1","level":2,"content":[{"type":"paragraph","text":"Lonny works in the warehouse and has no problem standing up for himself and intimidating Michael, forcing the office workers to work on Saturday instead of the warehouse employees. He seems to be second-in-command of the warehouse. He is one of the best basketball players in the warehouse. Lonny appears to not like Michael at all and has on numerous occasions yelled at Michael or tried to scare him."}],"images":[]},{"title":"Season 2","level":2,"content":[{"type":"paragraph","text":"Lonny is one of the most vocal supporters of the idea of forming a union to increase the benefits of warehouse employees. He insults Michael, referring to him as \"Hasselhoff\" when Michael attempts to be \"one of the guys\" by leaving part of his shirt unbuttoned."}],"images":[{"src":"https:\/\/vignette.wikia.nocookie.net\/theoffice\/images\/f\/f0\/Lonnie_pissed.png\/revision\/latest\/scale-to-width-down\/220?cb=20150805160855","caption":"Lonny mad at Michael for knocking things down in the warehouse."}]},{"title":"Season 3","level":2,"content":[{"type":"paragraph","text":"Lonny yells at Michael for not paying attention during Darryl's safety presentation. During Toby's safety presentation, he insults the things that Toby is reading about safety in order to talk back at Michael. After he calls a heart attack \"Fat Butt Disease\", he is called a sea monster by Kelly. He then talks back at her and tells Ryan to shut her up."}],"images":[]},{"title":"Season 4","level":2,"content":[{"type":"paragraph","text":"In a press still from Did I Stutter?, Lonny's last name is revealed as Collins."}],"images":[]},{"title":"Season 7","level":2,"content":[{"type":"paragraph","text":"In Threat Level Midnight, every warehouse member except for Lonny appears in Michael's movie."}],"images":[]},{"title":"Season 8","level":2,"content":[{"type":"paragraph","text":"Lonny likely quit after the entire warehouse won the lottery. He did not return, due to the death of Patrice O'Neal."}],"images":[]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":"Basketball","elements":[]},{"text":"Boys and Girls","elements":[]},{"text":"Safety Training","elements":[]}]}],"images":[]}]}