{"sections":[{"title":"Louanne Kelley","level":1,"content":[{"type":"paragraph","text":"Louanne Kelley is a fictional character on The Office."},{"type":"paragraph","text":"Louanne works in the Annex along with Toby and Kelly. She has the desk near the kitchen door which faces toward Toby's desk. She almost never participates in office activities, has no audible lines, and is seen only in passing in the first three seasons."}],"images":[]},{"title":"Character","level":2,"content":[{"type":"paragraph","text":"In Season 1, her hair is red, but by Season 2, she has gray hair."},{"type":"paragraph","text":"Louanne does not participate in meetings or almost any other event. Her mini water fountain is a unique identifier of Louanne's desk, as it appears throughout the series on numerous occasions. While Louanne's last on camera appearance is in Season 3, her desk continues to appear to be in use, as many papers and folders litter the surface and her signature water fountain and computer monitor are turned on."}],"images":[]},{"title":"Speculative backstory","level":2,"content":[{"type":"paragraph","text":"Considering her absence from every meeting and almost all events, Louanne may have been a corporate employee, like Toby. She may also have worked in human resources as well, inferring from a binder on her desk in Hot Girl that says \"Nutritional Healing\" and her plants and water fountain that were intended to induce a calming effect. However, Dwight mentions in The Dundies that there are no female HR employees."},{"type":"paragraph","text":"She may have quit shortly after another former employee, Hannah Smoterich-Barr, as Louanne is briefly seen in the following episode Back From Vacation."}],"images":[]},{"title":"Identity","level":2,"content":[{"type":"paragraph","text":"In an online web chat, producer Greg Daniels identified the woman as Louanne, but it was not clear whether he was referring to the character's name or the actor's. Angela Kinsey and Jenna Fischer confirmed the actor's name."},{"type":"paragraph","text":"Daniels believed it would be more realistic to have office employees that we know nothing about, but as the series progressed, her continuing presence became harder to explain, and she disappeared just as mysteriously as she arrived."},{"type":"paragraph","text":"Like Creed Bratton, Louanne plays a character with the same name as the actor."}],"images":[]},{"title":"Speculation on identity","level":2,"content":[{"type":"paragraph","text":"Although there was no solid evidence to suggest it, many fans had originally linked her to possibly being Marjorie, a character mentioned in passing in the episode The Fire."},{"type":"paragraph","text":"It was originally believed that Louanne Kelley's name was simply Luanne, and her last name was unknown. However, it was discovered in 2019 that there is a frame on a pillar in the annex next to Louanne's desk that states \"Special Award\" and the award is dedicated to a \"Louanne Kelley.\" While this frame appears in many seasons, it is often small and too hard to read. In Livin' The Dream, however, a larger, clearer image of the award is shown, indicating that her name is indeed Louanne Kelley instead of Luanne."}],"images":[]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":"The Alliance - in the background when Michael eats ice cream cake at Meredith's party","elements":[]},{"text":"Hot Girl - walking past the conference room in the background during Dwight's talking head, and working at her desk (B-roll) when Michael reflects on his employees.","elements":[]},{"text":"Office Olympics - observing several events, including \"Horse\"","elements":[]},{"text":"The Fight - leaving the office at the end of the day","elements":[]},{"text":"The Secret - cleaning her desk when Jim confesses his crush to Pam","elements":[]},{"text":"The Carpet - seen in multiple scenes. For example, when Jim goes to talk to Ryan, a brief, distorted voice can be heard when the door is open. Luanne is talking to Kelly, so it is presumably Louanne's voice.","elements":[]},{"text":"Boys and Girls - behind Dwight when he says, \"they're gonna get on the same cycle.\"","elements":[]},{"text":"Dwight's Speech  - working at her desk when Pam and Jim are talking","elements":[]},{"text":"Drug Testing - working at her desk when Dwight talks to the nurse","elements":[]},{"text":"Conflict Resolution - working at her desk when Michael walks to the annex","elements":[]},{"text":"The Coup* - working at her desk when Dwight goes looking for Angela","elements":[]},{"text":"Grief Counseling - working at her desk when Michael comforts Kelly","elements":[]},{"text":"A Benihana Christmas - working at her desk when Toby feels Kevin's robe","elements":[]},{"text":"Back From Vacation - working at her desk when Pam enters the break room where Jim is sitting.","elements":[]}]},{"type":"paragraph","text":"* Deleted scene."}],"images":[]}]}