{"sections":[{"title":"Madge Madsen","level":1,"content":[{"type":"paragraph","text":"Madge (Pudge) Madsen, is a fictional character played by Karly Rothenberg in the television series The Office. In Season 8, she quits work in the warehouse as she and five other staff won the lottery."}],"images":[]},{"title":"Season 1","level":2,"content":[{"type":"paragraph","text":"Madge works in the warehouse. During their basketball game, Michael tells Dwight that he can cover the \"East German gal\"."}],"images":[]},{"title":"Season 2","level":2,"content":[{"type":"paragraph","text":"Madge is seen in the background in \"Sexual Harassment\" when Michael asks the warehouse staff for a good joke he could use. She starts laughing along with the rest of the warehouse staff when Roy and Darryl start making jokes at Michael's expense."},{"type":"paragraph","text":"Michael holds a seminar in the warehouse for all the men in the office in \"Boys and Girls\". When Michael starts talking about what they are like as human men Madge can be seen and asks Michael 'Do you want me to go?' and then leaves."}],"images":[]},{"title":"Season 3","level":2,"content":[{"type":"paragraph","text":"In \"Safety Training\", Michael refers to her as \"Pudge\" and later \"Padge\"."}],"images":[]},{"title":"Season 4","level":2,"content":[{"type":"paragraph","text":"In a press still from Did I Stutter?, Madge's last name is revealed to be Madsen."}],"images":[]},{"title":"Season 5","level":2,"content":[{"type":"paragraph","text":"In Heavy Competition, Dwight mistakes Madge for Michael."}],"images":[]},{"title":"Season 6","level":2,"content":[{"type":"paragraph","text":"In the episode, Secret Santa, Michael invites Madge and the other warehouse employees to the annual Dunder-Mifflin Christmas Party. In several shots, she is seen talking and drinking. In a deleted scene, she tells Jim that lasagna has a powerful hold over her, and thus is nicknamed by Darryl, \"Garfield.\" She is later seen eating a whole lasagna (made by Pam), with the warehouse workers chanting, with Meredith saying, \"That woman is a beast.\""}],"images":[]},{"title":"Season 7","level":2,"content":[{"type":"paragraph","text":"In the episode Costume Contest, Jim mentions Madge saying that she made her first sale after Dunder Mifflin begins the policy of having warehouse workers suggest additional products to the customers they deliver to, increasing sales for the company. In the episode The Seminar, she is shown to outsell Andy in November, December, and January."}],"images":[]},{"title":"Season 8","level":2,"content":[{"type":"paragraph","text":"Madge is indirectly referred to in Lotto, where she and five other of the warehouse staff won $950,000 in the lottery. Her share of about $158,333 prompted her to quit work. Darryl later reveals that she and several other warehouse workers pooled their money together to start a strip club on a boat."}],"images":[]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":"Basketball","elements":[]},{"text":"The Dundies (credit only)","elements":[]},{"text":"Sexual Harassment","elements":[]},{"text":"Boys and Girls","elements":[]},{"text":"Safety Training","elements":[]},{"text":"Heavy Competition","elements":[]},{"text":"Secret Santa","elements":[]},{"text":"Threat Level Midnight","elements":[]}]}],"images":[]}]}