{"sections":[{"title":"Mentioned characters","level":1,"content":[{"type":"paragraph","text":"The following are characters mentioned but not seen in The Office."}],"images":[]},{"title":"Dunder Mifflin Scranton","level":2,"content":[],"images":[]},{"title":"Catherine","level":3,"content":[{"type":"paragraph","text":"Catherine was a former employee of Dunder Mifflin Scranton and was mentioned in the episode Sexual Harassment. Michael claims that she was hot and that she wanted him. Kevin, however, replies that \"she wasn't that hot.\""}],"images":[]},{"title":"Marjorie","level":3,"content":[{"type":"paragraph","text":"Marjorie was mentioned in the episode The Fire as a supposed employee of Dunder Mifflin Scranton. Dwight explains that Marjorie is not there that day. In the current show canon, it is likely that Marjorie does not actually exist at all due to the fact that the supporting cast was not fully established when that episode aired. Many fans had initially linked her to possibly being Luanne before show creator Greg Daniels explained who Luanne was."}],"images":[]},{"title":"Tom Peets","level":3,"content":[{"type":"paragraph","text":"Tom Peets was a former accountant at Dunder Mifflin Scranton. In the episode Performance Review, Michael reads some old suggestions from the suggestion box. One of them stated \"We need better outreach for employees fighting depression\" and it was signed by Tom. Michael thinks this is a fake suggestion considering there is nobody named Tom, but Phyllis reminds him that Tom had shot himself. Michael then goes on to describe him as \"weird\". "},{"type":"paragraph","text":"During the Writer's Block Q&A session at The Office Convention in 2007 (shown on the Season 4 DVD), the writers half-jokingly suggested that-"},{"type":"paragraph","text":"In a press still from Did I Stutter?, Tom's last name is revealed as Peets."}],"images":[]},{"title":"Steve","level":3,"content":[{"type":"paragraph","text":"Steve is the vending machine stocker at Dunder Mifflin Scranton. In the episode Booze Cruise, Jim is helped by Steve to pull a prank on Dwight by putting all of Dwight's belongings in the vending machine. Dwight mentions Jim being friends with Steve."}],"images":[]},{"title":"Miles","level":3,"content":[{"type":"paragraph","text":"Miles was mentioned in the episode The Carpet. He was a former member of Dunder Mifflin Scranton but quit to start up his own business."}],"images":[]},{"title":"Randall","level":3,"content":[{"type":"paragraph","text":"In the episode Sexual Harassment, Todd Packer revealed to Michael that the former CFO, Randall resigned due to sexual harassment charges regarding sleeping with his secretary."},{"type":"paragraph","text":"This explains why, just a few episodes later (Valentine's Day), Michael must meet with the new CFO, David."}],"images":[]},{"title":"Bruce Meyers","level":3,"content":[{"type":"paragraph","text":"Bruce Meyers is the Scranton representative for Hammermill Paper. (Recall that Michael secured the Hammermill account in The Convention.) Michael calls him Bruuuuuuuuce! Meredith slept with Bruce in exchange for discounts on paper and Outback Steakhouse gift certificates."}],"images":[]},{"title":"Andy","level":3,"content":[{"type":"paragraph","text":"Andy, not to be confused with Andy Bernard, is a member of the Scranton branch from early in the series. His name appears on a sales chart in the conference room that can be seen behind Katy."}],"images":[]},{"title":"Michele","level":3,"content":[{"type":"paragraph","text":"Michele is a member of the Scranton branch from early in the series. Her name appears on a sales chart in the conference room that can be seen behind Katy."}],"images":[]},{"title":"Roger","level":3,"content":[{"type":"paragraph","text":"Roger is a member of the Scranton branch from early in the series. His name appears on a sales chart in the conference room that can be seen behind Katy."},{"type":"list","elements":[{"text":"For Andy, Michele, and Roger, they probably are the early, unnamed and non-canon characters that appear in the Season 1 episodes.","elements":[]}]}],"images":[]},{"title":"Other branches","level":2,"content":[],"images":[]},{"title":"Denise Stim","level":3,"content":[{"type":"paragraph","text":"Mentioned in the deleted scenes of Launch Party, Denise Stim is the head of the party planning committee at the Buffalo branch. As a result, Angela considers her her rival."}],"images":[]},{"title":"Jeff","level":3,"content":[{"type":"paragraph","text":"In the episode Survivor Man, Toby mentions having attended a wilderness retreat with Jeff from Albany, suggesting that he is the new regional manager of the Albany branch, replacing Craig. On the other hand, Jeff might hold some other position since Toby's presence at the retreat indicates that is was not exclusive to regional managers. Also, given Craig's less-than-competent performance in \"Valentine's Day\" (on its DVD commentary track, the character was explicitly said to have been created for the purpose of showing that, for all his faults, Michael is by no means the least effective person in his job), it is not unreasonable to think that Craig might have been fired in the year-and-a-half between the two episodes."}],"images":[]},{"title":"Mark Chisholm","level":3,"content":[{"type":"paragraph","text":"Another attendee of the above wilderness retreat was Mark Chisholm. Considering Ryan only invited regional managers (other than Toby), he must be the regional manager of either Rochester, Nashua, Akron, Camden, or Yonkers."}],"images":[]},{"title":"Non-Dunder Mifflin Employees","level":2,"content":[],"images":[]},{"title":"Teresa","level":3,"content":[{"type":"paragraph","text":"Teresa is Andy Bernard's maid who was mentioned in a deleted scene of Test the Store. Oscar Martinez talked to Teresa in Spanish on the phone. Teresa has Andy's car keys."}],"images":[]},{"title":"Cathy Becker","level":3,"content":[{"type":"paragraph","text":"Cathy Becker (formerly Cathy Flenderson) is Toby Flenderson's ex-wife, who Toby Flenderson followed to Scranton and eventually married. They had one daughter (Sasha Flenderson) and the two had a messy divorce."}],"images":[]},{"title":"Jerry Trupiano","level":3,"content":[{"type":"paragraph","text":"Jerry Turpiano is a friend of Robert Mifflin, that Robert Dunder meets through the Rotary Club. It's mentioned that Turpiano had a wife named Beverly, and also that he was tall, like Mifflin. Michael invites Robert Dunder to the office in response to Ryan's new proposals, which Michael constitutes as ageism. "}],"images":[]}]}