{"sections":[{"title":"Meredith Palmer","level":1,"content":[{"type":"paragraph","text":"Meredith Palmer, Ph.D. is a fictional character on The Office, played by Kate Flannery. She is an original character created for the US series."}],"images":[]},{"title":"Character Information","level":2,"content":[{"type":"paragraph","text":"Meredith has two kids. Her son, Jake, lives with her (Take Your Daughter to Work Day). Her daughter, Wendy ('the good one'), lives with her ex-husband (The Accountants: Meredith). In the episode Take Your Daughter to Work Day, she brings her son, who has been suspended from school. In the season 1, it is mentioned Meredith has been divorced twice. As it is not mentioned beyond season 1, it is unclear whether it was the same man both times. Meredith is allergic to dairy, which was revealed on S1, E4. (The Alliance)"},{"type":"paragraph","text":"Meredith has an alcohol problem that sometimes affects her job performance. In one episode she passes out with her head on her desk. In another, after a party in the office, she's so drunk she removes her top in front of her boss (Michael) in his office after everyone else has left. Michael responds by taking a deep breath\/sigh then taking a quick picture."},{"type":"paragraph","text":"Meredith apparently also has some kinky sexual interests, based on a scene in the episode when Michael tells the girls that Jan likes some unusual, even \"dangerous\" sexual practices. Pam says \"Normal women don't do those things\", and the expression on Meredith's face at this point seems to indicate that she thinks Pam has led a sheltered life."},{"type":"paragraph","text":"Meredith has an unfortunate habit of suffering various misadventures. She's contracted herpes, been hit by Michael's car, had her pelvis broken, had her hair set on fire, caught head lice, and been bitten by a bat, a rat, and a raccoon, all on separate occasions, and had to get rabies post-exposure treatment. Pam also accidentally threw a football at her head (Night Out)."}],"images":[]},{"title":"Season 1","level":2,"content":[{"type":"paragraph","text":"Meredith had had a hysterectomy, and Dwight was somewhat confused as to what this meant, believing her to have no vagina. (Health Care)."},{"type":"paragraph","text":"Michael makes the entire office throw a month-early birthday party for Meredith, in hopes of boosting morale and relieving the stress from downsizing rumors. Unfortunately, it was not much of a success, especially because Michael makes fun of her age in one of his many unintentionally offensive jokes. In a deleted scene, a joke about her hysterectomy doesn't go over well, sending her crying into the arms of coworkers. When Michael reads what Jim wrote on Meredith's card, he says that she is an accountant but later she is made out to be in Supplier Relations\/Purchasing. (The Alliance)."},{"type":"paragraph","text":"Her alcohol problems are not revealed in the first season, although they were hinted at in her character photo, in which a shot glass sits on the table in front of her as she tries to hide a bottle of whiskey."}],"images":[]},{"title":"Season 2","level":2,"content":[{"type":"paragraph","text":"When Michael is talking about a female employee that he could have slept with if he wanted to, Dwight automatically assumes that it's Meredith. Meredith is present during Toby's sexual harassment meeting. She later listens to a joke being told by Todd Packer (Sexual Harassment)."},{"type":"paragraph","text":"Meredith watches the office olympics and later views the closing ceremonies (Office Olympics)."},{"type":"paragraph","text":"During the fire, Meredith and the others play several games and Jim and Pam are impressed by Meredith's list of books. During \"who would you do\", Meredith lists Jim, Oscar and Toby (The Fire)."},{"type":"paragraph","text":"When Michael has to fire someone, Dwight names her as a potential candidate but it is later revealed he is just naming everyone in the office. She later is invited to join Devon at Poor Richard's along with the rest of the office staff and goes. As it was halloween everyone was wearing a costume and she appeared to be a zombie (Halloween)."},{"type":"paragraph","text":"Meredith attends the fight between Michael and Dwight. When Jim starts horsing around with Pam and her shirt starts to be lifted, Pam realizes that Meredith is looking and Pam becomes embarrassed telling Jim to put her down angrily. Meredith mostly appears in the background for the rest of the episode (The Fight)."},{"type":"paragraph","text":"Meredith appears in this episode but has no lines. She attends the screen play reading of \"Threat Level Midnight\" (The Client)."},{"type":"paragraph","text":"Meredith confronts Michael along with the rest of the office when it is learned that he is doing e-mail surveillance. Michael later intercepts an e-mail inviting everyone in the office except for him to a barbeque at Jim's house. When Meredith shows up she apparently stands around on the patio drinking all the beer as Jim tells the party that \"the beer is not just for Meredith and Kelly\" (Email Surveillance)."},{"type":"paragraph","text":"During the Christmas party Meredith becomes excited with drinking as she tells the cameras that she made a new years resolution to stop drinking during the week. She becomes the first person to step forward when Michael offers vodka to the party. During the party she stumbles around drunk and Todd Packer catches her. When the party leave to go to Poor Richard's together, a drunken Meredith goes into Michaels office and takes her shirt off leaving Michael disgusted although he quickly takes a picture (Christmas Party)."},{"type":"paragraph","text":"When Michael announces to a less than enthusiastic office that they are going on a booze cruise, Meredith exclaims \"all right!\" On the cruise when Captain Jack asks who will hold his limbo stick, Meredith volunteers but Dwight steps in saying he will. Meredith is later seen limboing and shouting happily as she makes it. Apparently drunk, she later follows Captain Jack up into his cabin. When Michael's motivational speech causes a panic on board the ship and someone jumps overboard, Captain Jack comes down demanding to know what the problem is, Meredith is seen behind him shirtless, with a life vest covering herself up (Booze Cruise)."},{"type":"paragraph","text":"During Michael's spring cleaning day, Meredith is seen emptying her desk out and throwing away several old liquor bottles in her desk. Dwight later tasks her with cleaning the men's bathroom and replacing the urinal cakes (The Secret)."},{"type":"paragraph","text":"Meredith attends Jan's seminar on women in the workplace. When asked her goal in life she replies she would like to be 5 years sober before changing her answer to 4 and a half (Boys and Girls)."},{"type":"paragraph","text":"Meredith watches from her desk Phyllis being showered with all sorts of flowers and gifts from her boyfriend, Bob Vance with great jealousy. She later makes herself an alcoholic beverage in the kitchen and passes out on her desk later on in the day (Valentine's Day)."}],"images":[]},{"title":"Season 3","level":2,"content":[{"type":"paragraph","text":"In Season Three, Meredith is caught eating Angela's waterless hand sanitizer (which is alcohol-based) in the season premiere. "},{"type":"paragraph","text":"Her excitement over merger-day champagne was quickly quashed by Michael who says the beverages are for \"guests only.\" (The Merger)."},{"type":"paragraph","text":"In Branch Closing, she recalls a past agreement with a coworker to have sex together on the last day of work, but can't remember who she made the deal with, thus she goes around asking different coworkers about the deal. Later, she receives a phone call from a former employee who worked in the warehouse, he confirmed that it was with him that she made the deal."},{"type":"paragraph","text":"During a deleted scene from Back From Vacation, Meredith implies her tendency to sleep around was worth it because she also \"got to see the world\"."},{"type":"paragraph","text":"She joins Pam and Karen's party in A Benihana Christmas because it has alcohol. She declines the margaritas, saying that they are too sweet, and takes a bottle of vodka."},{"type":"paragraph","text":"In Ben Franklin she yells \"Shut up, Angela!\" when Angela says a male stripper has no business dancing in the office."},{"type":"paragraph","text":"In Women's Appreciation, she is seen as a careless driver, with one hand controlling the steering wheel, while the other hand is holding a bag of potato chips over her head, pouring its contents directly into her mouth. Afterward, she tosses the empty potato chip bag out the window. When Pam, sitting in the passenger seat, cautions her to not be a litterbug, Meredith replies, \"My car, my rules\". In a later scene at the Steamtown Mall parking lot, she attempts to wedge her minivan into too small a parking space, damaging several cars in the process. She almost lost control of the car on the way back to the office as Angela kept telling her to slow down. Her car eventually got a flat tire, causing Pam to fix it since no one else knew how to."},{"type":"paragraph","text":"In Beach Games she accidentally exposes herself to the camera after forgetting she was not wearing her swimsuit underneath her clothes. In a deleted scene, she orders for the bus to stop because she needs to use the bathroom, even though there are no bathrooms in sight. But instead of going behind a bush she instantly squats right in front of the bus to which everyone looks away in disgust (except Creed)."},{"type":"paragraph","text":"In The Job, she describes Jim's haircut as \"sexy-hot\" and orders him to turn around so she can see it from all angles. When discussing Jan's breast implants in a talking head interview, Meredith comments, \"in my experience, guys are more interested in the back of you than in the front\", unintentionally showing her negative past relationships with men due to her unattractiveness."}],"images":[]},{"title":"Season 4","level":2,"content":[{"type":"paragraph","text":"In the first episode of Season Four, Michael strikes Meredith as he drives into work, cracking her pelvis. The entire staff later visits her in the hospital. Michael bothers her to forgive him for the incident and she initially refuses, but after hearing about the \"Rabies Awareness Fun Run\" he put together in her \"honor\", she tells him he's forgiven."},{"type":"paragraph","text":"Upon returning to the office in the third episode of the season, she approaches Jim and requests that he sign her cast — which is on her crotch — and tells him in a whisper she especially appreciated him coming to visit her at the hospital, suggesting she finds him attractive. Jim signs awkwardly while Creed leers on in the background."},{"type":"paragraph","text":"During the making of Michael's alternative local Dunder Mifflin ad, Meredith notes she is not used to making videos \"with so many people around\" and later gives Jim a ride home from work when Pam stays late to work on the ad (Local Ad)."}],"images":[]},{"title":"Season 5","level":2,"content":[{"type":"paragraph","text":"In Business Ethics, Meredith confesses that she been sleeping with a Hammermill employee to receive discounts on office supplies and food at Outback Steakhouse."},{"type":"paragraph","text":"In Moroccan Christmas, Meredith sets her hair on fire during a drunken belly dance. The employees of Dunder-Mifflin then stage an intervention, where Michael tries to convince her to stop drinking. Michael tells Meredith that they will go to a bar, but instead takes her to a rehab facility. He ends up dragging her into it. Michael is disappointed when he discovers that you can't just sign someone up for rehab, but that they have to reach rock bottom and do it themselves."}],"images":[]},{"title":"Season 6","level":2,"content":[{"type":"paragraph","text":"Meredith hates being a mother. (Gossip)."},{"type":"paragraph","text":"She tells Creed that she slept with him, before, however Creed doesn't remember (The Promotion)."},{"type":"paragraph","text":"She smokes cigars and goes to Pam and Jim's wedding (Niagara)."},{"type":"paragraph","text":"She says she caught her son taking an \"upper-decker\" (The Lover).  "},{"type":"paragraph","text":"She also says that she has had sex with a terrorist before, and also found the video of Michael falling into a koi pond (Koi Pond)."}],"images":[]},{"title":"Season 8","level":2,"content":[{"type":"paragraph","text":"Meredith is seen in a meeting laughing heartily at a \"and shove it up your butt!\" joke from Stanley and later goes planking on top of a stall in a men's room. Dwight- who has been tasked by Andy to get rid of all plankers- knocks her off with a fire extinguisher (The List)."}],"images":[]},{"title":"Season 9","level":2,"content":[{"type":"paragraph","text":"Meredith gets head lice from Pam, noticeably more than anyone else in the office as she's seen furiously scratching her head. Pam walks in on Meredith shaving her head in the break room and is so shocked she couldn't even apologize. Meredith and Pam then talk things out over a drink after work and Pam comments on how much she admires Meredith for managing to be a parent on her own (Lice)."}],"images":[]},{"title":"References and Citations","level":2,"content":[{"type":"list","elements":[{"text":"↑ In \"Finale\" (Season 9, episodes 24\/25), she says that although it was never shown on camera, she received a Ph.D. in School Psychology.","elements":[]}]}],"images":[]},{"title":"Central Episodes","level":2,"content":[{"type":"list","elements":[{"text":"The Alliance","elements":[]},{"text":"Fun Run","elements":[]},{"text":"Business Ethics","elements":[]},{"text":"Moroccan Christmas","elements":[]},{"text":"Sex Ed","elements":[]},{"text":"Lice","elements":[]}]}],"images":[]},{"title":" Appearances","level":2,"content":[{"type":"paragraph","text":"Meredith appears and has lines in all episodes, with the following exceptions:"},{"type":"list","elements":[{"text":"Pilot - does not appear","elements":[]},{"text":"Diversity Day - provides background noise but has no lines","elements":[]},{"text":"Basketball - has no lines","elements":[]},{"text":"Hot Girl - has no lines","elements":[]},{"text":"The Dundies - has no lines","elements":[]},{"text":"Sexual Harassment - has no lines","elements":[]},{"text":"Office Olympics - has no lines","elements":[]},{"text":"Halloween - has no lines","elements":[]},{"text":"The Fight - speaks only in a deleted scene","elements":[]},{"text":"The Client - provides background noise but has no lines","elements":[]},{"text":"Performance Review - has no lines","elements":[]},{"text":"Email Surveillance - has no lines","elements":[]},{"text":"The Secret - has no lines","elements":[]},{"text":"The Carpet - has no lines","elements":[]},{"text":"Valentine's Day - has no lines","elements":[]},{"text":"Dwight's Speech - speaks only in a deleted scene","elements":[]},{"text":"Michael's Birthday - has no lines","elements":[]},{"text":"Drug Testing - speaks only in a deleted scene","elements":[]},{"text":"Conflict Resolution - has no lines","elements":[]},{"text":"Casino Night - provides background noise but speaks only in a deleted scene","elements":[]},{"text":"Gay Witch Hunt - speaks only in a deleted scene","elements":[]},{"text":"The Coup - speaks only in a deleted scene","elements":[]},{"text":"Initiation - has no lines","elements":[]},{"text":"Back From Vacation - speaks only in a deleted scene","elements":[]},{"text":"Traveling Salesmen - does not appear","elements":[]},{"text":"Cocktails - has no lines","elements":[]},{"text":"The Negotiation - has no lines","elements":[]},{"text":"Safety Training - has no lines","elements":[]},{"text":"Dunder Mifflin Infinity - does not appear","elements":[]},{"text":"Branch Wars - has no lines","elements":[]},{"text":"Dinner Party - has no lines","elements":[]},{"text":"Did I Stutter? - speaks only in a deleted scene","elements":[]},{"text":"Crime Aid - has no lines","elements":[]},{"text":"Business Trip - has no lines","elements":[]}]}],"images":[]}]}