{"sections":[{"title":"Michael Scott","level":1,"content":[{"type":"paragraph","text":"Michael Gary Scott  (born March 15, 1965, in Scranton, Pennsylvania), is a fictional character played by Steve Carell, who is a former branch manager of the Scranton branch of Dunder Mifflin Paper Company, The Michael Scott Paper Company, and later Dunder Mifflin Sabre. He is the main character of the first seven seasons of The Office."},{"type":"paragraph","text":"Michael served as branch manager in two stints, the first of which spanned from the pilot episode to the Season 5 episode Two Weeks when he chose to form the eponymous Michael Scott Paper Company. Scott returned to the branch manager position in the episode Broke and, for a period in Season 6, shared co-managerial duties with Jim Halpert. Michael eventually resumed his position as sole branch manager following Dunder Mifflin's merger with Sabre and remained in the position until his move to Colorado in the Season 7 episode Goodbye, Michael."}],"images":[]},{"title":"Biography","level":2,"content":[{"type":"paragraph","text":"Michael was born on March 15, 1965, at 11:23 AM, in Scranton, Pennsylvania. He was raised by his mother and stepfather, Jefferson (“Jeff”), with a home on Kenneth Road. On several occasions, he has talked about his loneliness as a child. In Diversity Day, Michael claims to be of English, Irish, German, and Scottish ancestry. He also claims that he is 2\/15 Native American. In \"Pilot\", it is revealed that he has an unnamed brother when he said \"That was a joke that was actually my brother's, and it was for bills. It doesn't work with faxes.\"  In \"Nepotism\", it is revealed that Michael has a half-sister, from whom he was estranged from 1995 through 2010. As a consequence of their reunion, Michael hires his nephew Luke as an intern for the office. Michael is reminded of an older brother in Email Surveillance, but he is never mentioned again. In the First Dundie awards, he sees Angela Martin’s cousin in Chili's and calls George’s baby Jamie Jimmy Stewart, which George dislikes and tells Michael to go away."},{"type":"paragraph","text":"In the episode \"Take Your Daughter to Work Day\", it is revealed that Michael was a child star on a kids' show called Fundle Bundle. Michael did not attend college, having lost all his tuition money in a pyramid scheme. In the season 5 premiere episode Weight Loss, Michael says he once went twenty-eight years without having sex, implying he was a virgin until his late twenties. It is also revealed in season 5 that Michael got his job at Dunder Mifflin by following an attractive woman to the office park and leaving with a job. He rose to his manager position by being one of the best salesmen in the company, winning consecutive awards for best salesman."},{"type":"paragraph","text":"When it comes to leaving the personal life out of work, Michael does not seem to understand the concept. He will continually make awkward, inappropriate, or sometimes ignorant comments during conversations with people. He believes that his co-workers idolize him because he is their boss, mirroring the way he looked up to his previous boss. Michael believes that the workplace should be a fun environment for everyone and a “place where dreams come true.” He emphasizes this to his co-workers to help them understand that he views them as friends rather than colleagues. Michael is a devoted loyal employee to Dunder Mifflin and will do what he believes is best for the company. He has the same dedication to his co-workers and will go to great lengths to make sure they continue working at Dunder Mifflin. As of \"Michael's Last Dundies\", Michael has worked at Dunder Mifflin for 9,986,000 minutes, meaning he would have started work on April 6, 1992. This coincides with what he says in other episodes. In \"Pilot\", which takes place in 2005, he says he has worked at the Scranton branch for twelve years, four of which he has been the boss, and in the season 3 episode \"The Negotiation\", which takes place roughly two years later, after Darryl Philbin says he (Michael) has worked at Dunder Mifflin for twelve years, Michael corrects him, saying \"fourteen years\"."},{"type":"paragraph","text":"Michael's constant desire to be the center of attention often manifests itself in selfish behavior. For example, when he burns his foot in \"The Injury\", he expects Pam Beesly and Ryan Howard to tend to his needs, despite Dwight Schrute's much more serious concussion. When invited to be an usher in \"Phyllis' Wedding\", he assumes that his participation will be the high point of the ceremony and pouts when he is upstaged by Phyllis Vance's elderly father. Michael appears to emphasize moments of sympathy or civility directed at him by his co-workers (mostly Jim) and inflate their importance to compensate for his loneliness."},{"type":"paragraph","text":"Due to his overall lack of common sense, Michael can withstand significant abuse from his peers and is often the butt of jokes. He is quick to take offense when he realizes he is being wronged and his response is often disproportionate to the harm suffered. Even though he is generally oblivious to criticism, derision, and sarcasm, Michael has some limits to his patience and leaves to question the extent of offense that he can actually acknowledge (demanding professional respect from Stanley Hudson in \"Did I Stutter?\" or standing up to the employees in favor of Holly Flax in \"Business Ethics\")."},{"type":"paragraph","text":"In \"The Meeting\", it is shown that Michael does not aim for his employees' betterment or his own, thinking that this would put his job at jeopardy; he unwittingly turns down a promotion that would put Jim in his position, choosing the status quo over his employees' ambitions. He is eventually forced to budge, having to co-manage the branch with Jim. He believes he has more power over Jim even though he doesn't."},{"type":"paragraph","text":"Following his departure from the office in Scranton PA., Michael received an appointment from Colorado Governor John Hickenlooper to be the new Director of Paper Distribution for the Department of Natural Resources. Said Governor Hickenlooper: Scott has a unique management approach, where he spends 80 percent of his time “distracting others,” 19 percent of his time “procrastinating,” and 1 percent of his time “critical thinking.” “Scott will be a wonderful addition to our paper team, focusing particularly on the use of beetle kill in paper production,” Hickenlooper said. “We hired him based on his skills, personal drive, and love for ‘That’s what she said’ jokes.”"},{"type":"paragraph","text":"Darryl reveals in Season 8 episode 20 that Michael's code name in the warehouse was \"Dennis the Menace\"."}],"images":[]},{"title":"Interests","level":3,"content":[{"type":"paragraph","text":"Michael's favorite catchphrase is \"That's what she said!\" inserted as a sexually suggestive double entendre even in the most inappropriate circumstances, including business meetings and legal depositions. Michael finds uttering the phrase so irresistible that in \"Sexual Harassment\" he is goaded into saying it just seconds after Jan Levinson and a lawyer from Corporate specifically order him not to do so."},{"type":"paragraph","text":"Michael enjoys writing song parodies. In Goodbye, Toby, it is said that he had written songs such as \"Beers in Heaven\" (which he tells Holly is \"very sexual\") and \"Total Eclipse of the Fart\". In \"Diwali\", Michael performs his own parody of Adam Sandler's \"The Chanukah Song\", replacing the Jewish-themed lyrics with Hindu ones."},{"type":"paragraph","text":"He also appears to have a history of playing ice hockey and is, as Jan once noted when trying to find a compliment to give him, a very talented ice skater. On multiple occasions, Michael has also expressed interest in basketball even though he is terrible at it (in \"The Fire\" and \"Basketball\"). He also once stated that he is an Oakland Raiders fan (citation needed)."},{"type":"paragraph","text":"Michael attends classes in improvisational comedy, which he found out about by reading a flyer, and although he believes his skills are among the best in the world, he is shown in \"E-mail Surveillance\" to be a frustrating and unpopular presence in the class. He is the playwright of such skits as Threat Level: Midnight (which was discovered by Pam and read by the entire office without Michael's knowledge), celebrating Michael's main character alter-ego Michael Scarn. He constantly compliments his own performances, from joke-telling to impressions to videotape skits that he creates for presentation in the office."},{"type":"paragraph","text":"Michael loves wearing jeans, in particular, a pair of Levi's he refers to as his \"Fun Jeans\" (\"The Convention\"). He is so fond of his jeans that he gets them dry cleaned; Pam surmises that he instituted Casual Friday just to show off his jeans (\"The Client\")."},{"type":"paragraph","text":"Michael treasures his \"World's Best Boss\" mug, even though he bought it for himself at Spencer Gifts and has multiple replacements. The audience knows that he has purchased at least two because Dwight precariously places one of them on Michael's desk, and Michael accidentally knocks it off with a golf putter that he was using to practice within his office. This is also proven in \"The Promotion\" when Michael presents Jim with his own \"World's Best Boss\" mug at the end of the episode when they drink gin together."},{"type":"paragraph","text":"Michael is a passionate fan of YouTube, although he may not be entirely clear about what it is and seems to believe that it is a news media organization. He is an avid fan of the HBO television series, Entourage. It is also established that Michael tends to be a bit \"behind\" when it comes to pop culture references, particularly in music. This is mainly shown through his cellphone ringtones, such as \"My Humps\" early on in the show, or \"Salt N Pepa\" in \"The Lover\"."},{"type":"paragraph","text":"Michael likes Chrysler cars. For the first three seasons, he drove a silver 2004 Sebring convertible, until the season four episode \"Money\" in which he mentions he traded it in (along with Jan's car) for a Porsche Boxster. After breaking up with Jan, he buys a red PT Cruiser convertible. He drives the PT Cruiser until the season 5 episode \"Broke\" in which he asks for a new Sebring convertible as part of his agreement to return to Dunder Mifflin."},{"type":"paragraph","text":"Michael's PIN is YMCA (9622) as illustrated in the season 6 episode \"Secret Santa\"."},{"type":"paragraph","text":"Michael is a big fan of the film The Devil Wears Prada, implying that he has rented it multiple times. He is also a fan of animated movies with mentions of Finding Nemo and Toy Story in episodes, allowing an insight into Michael's naive, simple side which appreciates warmth. "}],"images":[]},{"title":"Personality and Management Style","level":3,"content":[{"type":"paragraph","text":"Michael is almost inexplicably lacking in every skill, management or otherwise. Co-manager Jim Halpert once made a color graph of how Michael spends his time: 80% \"distracting others,\" 19% \"procrastination,\" and 1% \"critical thinking.\" His laid-back approach more often results in lower than expected workplace productivity, particularly when Michael places his personal interests as a priority over work (such as his birthday, someone else's birthday, or his various seminars). To avoid being disciplined for his foolish actions, Michael often resorts to scapegoating employees to cover himself. Although his actions often lead to more problems for his employees, Michael believes that Scranton is \"the cool fun branch\", and is genuinely upset when the top salesman from the Utica office trashes Scranton in a phone call by saying it's \"worse than Camden\"."},{"type":"paragraph","text":"Although his position as Regional Manager gives him broad decision-making authority on branch operations, he often places those responsibilities secondary to his desire to be friends with his employees. On the other hand, he also oversteps his authority by hosting events that Corporate disapproves of such as \"The Dundies\", and a \"Booze Cruise\"."},{"type":"paragraph","text":"It is revealed in the episode \"The Duel\" that, despite Michael's incompetence, the Scranton branch outperformed both Utica and Albany, reporting strong sales amid the floundering economy. Michael is called to Corporate to answer the question, \"What are you doing right?\" After several minutes of Michael's inarticulate babble, his superiors concede that while Michael is definitely doing something right, they will probably never know exactly what."},{"type":"paragraph","text":"Altogether, Michael's management style seems to rely on making his subordinates feel comfortable in the workplace. This method proves to be successful, indicating that Michael is, after all, a capable manager and, at one point, showed great potential, also evidenced by the fact that he was promoted to Regional Manager and retained the position for over a decade despite lacking higher education."},{"type":"paragraph","text":"When referring to sex, Michael says that he likes cuddling and spooning, revealing his true romantic side. He mentions on several occasions that he would love to get married and have children and is hurt when Jan reveals that she is pregnant by a sperm donor and was inseminated while she and Michael were still dating (Jan later explains to the camera that if she was young and had time to have a lot of kids she would give Michael a chance to father one, but at her age, she needs to \"make this one count\"). When witnessing PDAs from his employees, Michael sometimes smiles and looks happy for them. He creates a thoughtful and romantic scrapbook for Pam's mom, Helene, for her birthday when he is dating her, showing he is a very romantic character."}],"images":[]},{"title":"Relationships","level":2,"content":[{"type":"paragraph","text":"Michael tends to overestimate his importance to his employees, and, despite constantly demeaning and offending some of them, has a close bond with them. Most of the employees have been the focus of Michael's jokes at one point or another, usually about their race, sex, size, attractiveness, or sexual orientation. Examples of Michael's difficult relationship with his staff include getting slapped by Kelly Kapoor for being racist, hitting Meredith Palmer with his car, getting kicked out of Phyllis and Bob Vance's wedding, getting slapped by Pam for dating her mother, Helene, and outing Oscar Martinez to the entire office without his permission."},{"type":"paragraph","text":"Michael's relationship with the company warehouse employees is tense. He tends to disrupt their daily workflow, and in a talking head interview, warehouse supervisor Darryl Philbin (Craig Robinson) explains that they have never been able to make a full year accident-free because of Michael's antics. CFO David Wallace tolerates Michael's antics because his branch is the best in the company, but Michael offends CEO Alan Brand and the rest of the executives during his only meeting with them by making lunk-headed comments and creating false claims to Dunder Mifflin's investors that he can't back up."}],"images":[]},{"title":"Dwight","level":3,"content":[{"type":"paragraph","text":"Of the office staff, Dwight has the most respect for Michael, viewing him as a model for success, and is thrilled when asked to handle any task given to him however ill-conceived it may be. Although on the surface, Michael usually appears dismissive of Dwight, and generally views him as a suck-up, he is genuinely hurt and angry at the few times when Dwight has deceived him, such as when Dwight went over Michael's head to vie for the manager's job and when he went to reveal office secrets to Michael's new company, the Michael Scott Paper Company. In the episode \"Heavy Competition\" of Season 5, Dwight steals Michael's Rolodex and finds his own business card, on the back of which, Michael had written (before leaving Dunder Mifflin): Dwight Schrute, tall, beets. Michael also cares how Dwight feels about him. After Michael beats Dwight at his own dojo, Michael later finds out that Dwight no longer wanted Michael as his primary contact in case of an emergency which causes him to promote Dwight from \"Assistant to the Regional Manager\" to \"Assistant Regional Manager,\" with a three-month probational period. Dwight told Michael in Season 6 that Michael's career path was pathetic and that he regretted working for him instead of taking a fast-track job at Office Depot, but they buried their differences later on. In Season 7, Dwight is hurt that Michael didn't recommend him for the job. However, he changes his mind when Michael writes a letter of recommendation, and the two play a game of paintball together. Additionally, Dwight becomes delighted to see Michael return for his wedding in the series finale."}],"images":[]},{"title":"Ryan","level":3,"content":[{"type":"paragraph","text":"Michael has a one-sided man-crush on Ryan, which makes Ryan extremely uncomfortable. Examples of this are when Michael gave Ryan a $400 iPod for the staff's Christmas Secret Santa exchange, despite an agreed-upon office limit of $20 per person. Another example is when Michael was staring at Ryan through Michael's office blinds when Ryan replaces Pam as receptionist. He also gave Ryan the \"Hottest in The Office\" Dundie for 6 years straight until Danny Cordray broke his 6-year streak. Despite admiring Ryan, Michael eventually acknowledges that Ryan makes bad decisions, but still opts to believe in him. Ryan often uses Michael to get what he wants as seen in \"WUPHF.com\"."}],"images":[]},{"title":"Jim and Pam","level":3,"content":[{"type":"paragraph","text":"Michael doesn't hesitate to compliment or criticize Pam for her looks and he frequently makes inappropriate comments about her body. Their relationship comes to a rocky point when he begins dating her mother Helene. This is only repaired after he breaks up with Helene and allows Pam to slap him in the face in the parking lot. He trusts and respects Jim, although when they were co-managers they clashed due to their polar-opposite management styles. In \"Secret Santa\", Michael mentions that in a future vision he sees himself and his future wife living next door to Jim and Pam and that their children will play together. He often also refers to Jim as his best friend in the office. Michael attempts unsuccessfully to have Jim and Pam over for dinner on many occasions, though he finally succeeds in the episode \"Dinner Party\"; the entire evening is a disaster. In a Season 5 episode, Michael also shows his admiration for Jim when he wears a tuxedo to work and jokingly suggests having a 'classy party' for Michael's 15th year work anniversary. Jim frequently repeats all of the ideas Dwight had offered that Michael had then rejected, only to frustrate Dwight by having Michael acknowledging whatever Jim says regardless of the context. He seems to think that both of them are his best friends. During season 2, in episode 7 \"The Client \", Michael and Jim share a mutual special glance at each other after both being rejected by Pam and Jan. In \"Goodbye, Michael\", Jim mentions what a great boss Michael has been over the years and Pam gives Michael a big hug at the airport before he goes off to Colorado to begin his new life with Holly."}],"images":[]},{"title":"Toby","level":3,"content":[{"type":"paragraph","text":"Michael, despite liking most of the staff, fiercely hates Human Resources Manager Toby Flenderson, likely due to Toby's requirement to enforce the rules of proper office behavior that Michael loves to flout. Michael once reasoned that \"Toby is in HR, which technically means he works for Corporate. So he’s really not a part of our family\". His longtime goal is to get rid of Toby and any attempts at reconciliation between the two usually fail and result in Michael resorting to name-calling or jokes at Toby's expense. In the episode \"Goodbye, Toby\", Michael is thrilled when Toby decides to move to Costa Rica and gives as his going-away present a rock with a note that reads \"Suck on this\". The next season, after Toby's replacement Holly, is transferred, Michael is horrified when Toby returns to Dunder Mifflin. In \"Frame Toby\", he goes to great lengths to get him fired. In \"The Chump\", Michael says if he had a gun with two bullets and was in a room with Adolf Hitler, Osama bin Laden, and Toby, he would shoot Toby twice (which disgusts the rest of the office). During \"Nepotism\", Toby can deduce that Luke, the surly, universally disliked intern is Michael's nephew. When Michael makes an example of Luke by spanking him in front of the staff, it's perceived by Gabe Lewis as an assault on a company employee. To avoid termination, Gabe suggests Michael's spanking of Luke be written up as a stress-related outburst, which can be addressed at therapy with Toby, who has a degree in social work. Obviously displeased but with no other options, Michael reluctantly agrees. In \"Counseling\" Toby tricks Michael into talking about his past, which upsets Michael."},{"type":"paragraph","text":"In Michael's home movie Threat Level Midnight, Toby plays one of the hostages of Goldenface (played by Jim Halpert). When Goldenface kills a hostage, it is Toby's character that gets shot in the head. The scene repeatedly shows Toby's head exploding in slow motion. Though Goldenface expects Scarn to be shocked, Scarn happily informs him that Toby's character was a wanted animal rapist."},{"type":"paragraph","text":"Despite his hatred of Toby, there have been times where Michael acts friendly to Toby. In \"Take Your Daughter to Work Day\", Michael and Toby have a conversation on Michael someday having kids and even asking Toby if he can be Sasha's godfather. In \"Counseling\", at the end of the episode, Michael and Toby are shown drawing together and having fun. In \"Goodbye Michael\", Michael says goodbye to Toby and doesn't insult him at all."}],"images":[]},{"title":"Romantic relationships","level":3,"content":[{"type":"paragraph","text":"Michael is romantically hopeless during Season 1 but does manage to have some relationships as the series progresses. One of Michael's earliest relationships was with Jan Levinson (Melora Hardin), his original-then-former boss from Corporate. Despite the tumultuous aftermath of spending the night together talking and kissing, Michael and Jan eventually go on vacation together in Jamaica. Michael and Jan begin dating, become an official couple, and eventually move in together after Jan is fired from her job, though Jan usually treats Michael with contempt. After Michael fails to defend Jan in her Wrongful dismissal suit against Dunder Mifflin, they remain together for a short while but end up blowing up at each other during an ill-fated dinner party and eventually break up. He also dated Carol (played by Carell's wife Nancy Walls), a real estate agent from whom Michael bought his condominium. Michael was much more interested in Carol than she was in him, and after he made an unwanted and rejected impromptu public marriage proposal, Michael's decision to Photoshop pictures of himself over Carol's ex-husband in her family pictures resulted in their break up. Michael then dated Holly Flax (Amy Ryan), Toby's replacement as HR Representative, who appears for a while to be Michael's best chance at love, with the two sharing a similar sense of humor and social awkwardness. However, after David Wallace witnesses them kissing, Holly is transferred to the Nashua branch and she and Michael break up after choosing not to pursue a long-distance relationship. On a business trip to Winnipeg, Michael & \"Concierge Marie\" become close, and Michael wants to stay the night with her after their one night stand, which she refuses. After Jim and Pam's wedding, Michael begins dating Pam's mother Helene (much to Pam's horror), but he breaks up with her when he realizes he wants a family and their age difference means he wouldn't have one with her. Near the end of season six, Michael begins dating Donna (Amy Pietz), the manager of a local bar, but later finds out that she's married and he is, as he puts it, \"the mistress\". He continues seeing her until the disgust of his employees drives him to listen to his conscience and break things off with her. In Season 7's \"Sex Ed\", Michael reunites (in person or by telephone) with all of his aforementioned past girlfriends when he believes that he has contracted herpes. In doing so, he realizes that Holly was the only one he truly loved. He eventually marries Holly but leaves Dunder Mifflin to move in with her in Colorado. In Finale Holly and Michael are happily married with children. In a Where Are They Now on NBC's website reveals that Michael and Holly are expecting their fourth child."}],"images":[]},{"title":"Alter Egos of Michael Scott","level":2,"content":[{"type":"paragraph","text":"Given his tendency of constantly trying to keep his employees entertained coupled with his juvenile personality, Michael has created a variety of different alter egos which he uses for both entertainment and educational purposes."},{"type":"paragraph","text":"\"Carnac\" (\"The Dundies\") Michael dons a jeweled turban and reads the content of a letter before opening. Although this character's name is never revealed, he says, \"This is a little character I like to do; it's loosely based on Carnac, one of Carson's classic characters,\" based on Johnny Carson's Carnac the Magnificent."},{"type":"paragraph","text":"Ping (\"The Dundies\", \"The Seminar\", \"Goodbye Michael\"), an Asian caricature based on Michael's Chinese food deliveryman."},{"type":"paragraph","text":"Agent Michael Scarn (\"The Client\", \"Email Surveillance\", referenced in \"Product Recall\", \"Money\", \"Dinner Party\") is the star of Threat Level: Midnight, a derivative spy\/action hero screenplay written and illustrated by Michael. He had kept it hidden in his desk drawer until it was discovered by Pam without his knowledge and photocopied so the staff could stage a rollicking reading of it while Michael was on a sales call."},{"type":"paragraph","text":"Detective Michael Scarn (\"Email Surveillance\") Used during his improv class."},{"type":"paragraph","text":"Michael Scarn (\"Prince Family Paper\") Michael pretends that he is a lawyer at a law firm to get information about Prince Paper so that Dunder Mifflin can run them out of business. A thinly-veiled portrayal of himself, Michael also adopts the persona in one session of his improv comedy class, ignoring the rule to base his dialogue off of his scene partners, and ultimately shooting everyone in the room, regardless of their participation in the scene."},{"type":"paragraph","text":"Prison Mike (\"The Convict\") wears a purple bandana over his head, speaking in a caricature of New York English, and explains that he is in prison for theft, robbery and kidnapping the president's son for ransom (although he claims, in knee-jerk defensiveness, that he was never caught). He proceeds to paint an awful, and somewhat fanciful, picture of prison life. He states that the scariest part of prison is the Dementors. The character is likely the result of Michael's take on the Scared Straight documentary series."},{"type":"paragraph","text":"Michael the Magic (\"Cocktails\") attempts to escape from a straightjacket but fails because of a lost key which was acthually hidden by Jim. Michael's fondness for magic is referenced throughout the series, including an off-screen visit to a children's magic camp. Michael also attempts to utilize a magic prop briefcase (which included a working chainsaw) while speaking at Karen's Utica branch in \"Lecture Circuit\". In the cold open for Nepotism, he is seen performing numerous, albeit repetitive, magic tricks."},{"type":"paragraph","text":"Michael Klump (\"Weight Loss\", referenced in \"Garage Sale\") attempts to show that overweight people are people too. Michael wears a partially-inflated sumo suit underneath a business suit and is patterned after the Eddie Murphy character in the Nutty Professor remakes."},{"type":"paragraph","text":"Michael Scotch (\"New Boss\") was co-created when Michael and Dwight were trying to contact David Wallace to complain when Charles Miner canceled Michael's fifteenth-anniversary party because of budget cuts. Michael Scotch is an overly aggressive character who threatens that he has kidnapped David Wallace's son."},{"type":"paragraph","text":"Blind Guy McSqueezy (\"The Lover\") is a character Michael created at his improv class so he could feel up women."},{"type":"paragraph","text":"Caleb Crawdad (\"Murder\") is a Southern persona used for the purposes of a game."},{"type":"paragraph","text":"Date Mike (\"Happy Hour\") is a personality Michael takes on when on a date. Michael creates this personality when Jim points out to him that Pam's friend likes him. Up to that point, Michael had been charming and likable, but Date Mike completely ruined things and the friend fled in disgust. Ironically, Michael felt Date Mike was successful because he impressed Donna, while Jim thought Date Mike was a disaster because he didn't know about Donna. Michael says Date Mike is inspired by \"the winners of reality dating shows. AND the losers\". Catchphrase: \"Hi I'm Date Mike, nice to meet me.\""},{"type":"paragraph","text":"Orville Tootenbacher (\"The Search\") is a character Michael created who is a millionaire that farts popcorn."},{"type":"paragraph","text":"Mike Leno is an interview personality that is a parody of Jay Leno."},{"type":"paragraph","text":"Reginald Poofda (\"The Seminar\") is an English character that Michael mentioned that he was working on when he bumped into David Brent."},{"type":"paragraph","text":"Classy Santa (\"Classy Christmas\") Michael's version of Santa Claus at a 'Classy Christmas Party' which Michael throws when Holly Flax is temporarily transferred back to Scranton while Toby Flenderson is on jury duty. Classy Santa wears an untraditional Kangol-style Santa hat, a black dress shirt, a red smoking jacket, dress slacks, and smokes a pipe."},{"type":"paragraph","text":"Mikanos (\"The Seminar\") is a Greek character (based on Spyros) made up when Andy held a seminar to increase his sales. \"Mikanos\" was the character to buy one ream of paper from Andy to get other potential customers and local business owners to buy paper and increase his sales."}],"images":[]},{"title":"Mentions\/Cameos","level":2,"content":[{"type":"paragraph","text":"In season 9, Pam has a flashback of the day she and Jim got married at the church and in the row of people you can spot Michael Scott sitting down (Paper Airplane)."},{"type":"paragraph","text":"Jim and Michael's conversation from the Pilot is heard as the employees watch the premiere of the documentary, The Office: An American Workplace at Poor Richard's. (A.A.R.M.)"},{"type":"paragraph","text":"Michael appears at Dwight's wedding after Jim passes being Dwight's best man to Michael as his \"greatest prank ever\". He is then seen during the reception showing pictures of his kids to Pam. His final appearance (new\/unseen in any prior episode) on the show is him talking to the camera about how proud he is that his \"kids\" (Dwight, Angela, Jim, Pam) have grown up and married each other. His final time on screen is prior footage of him straightening a drawing of the Dunder Mifflin Scranton building, which was created by Pam. This also happens to be the last scene any character is shown (the final scene depicts the Scranton branch building). "}],"images":[]},{"title":"Appearances","level":2,"content":[{"type":"paragraph","text":"Michael has appeared in every episode except the last 4 episodes of season 7, all of season 8, and most of season 9:"},{"type":"paragraph","text":"\"The Inner Circle\" (S07E23) through \"A.A.R.M.\" (S09E22E23) - Does not appear (in Colorado after leaving the office because of Holly)"}],"images":[]},{"title":"Quotes","level":2,"content":[{"type":"paragraph","text":"\"That's what she said!\""},{"type":"paragraph","text":"\"Don't ever, for any reason, do anything to anyone, for any reason, ever, no matter what, no matter where, or who, or who you are with, or where you are going, or where you've been, ever, for any reason whatsoever.\""},{"type":"paragraph","text":"\"You know what they say. 'Fool me once, strike one, but fool me twice... strike three'.\""},{"type":"paragraph","text":"\"No, God, please, no! No! No! NOOOOOOO!\""},{"type":"paragraph","text":"\"I tried to talk to Toby and be his friend, but that is like trying to be friends with an evil snail.\""},{"type":"paragraph","text":"\"They say that on your deathbed you never wish you spent more time at the office. But I will.\""},{"type":"paragraph","text":"\"If I had a gun with two bullets, and if I was in a room with Hitler, Bin Laden, & Toby, I would shoot Toby twice.\""},{"type":"paragraph","text":"\"New York, New York, the city so nice, they named it twice. Manhattan is the other name.\""},{"type":"paragraph","text":"\"Well, well, well. How the turntables...\" "},{"type":"paragraph","text":"\"I declare, BANKRUPTCY!!"},{"type":"paragraph","text":"\"I hate, hate, hate being left out. Whether it's not being picked for a team...Or being picked for a team and then showing up and realizing the team doesn't exist. Or that the sport doesn't exist! I should've known. 'Poop ball?' \""},{"type":"paragraph","text":"\"There's no such thing as an appropriate joke. That's why it's a joke.\""},{"type":"paragraph","text":"\"My mind is going a mile an hour.\""},{"type":"paragraph","text":"\"Abraham Lincoln once said that \"if you're a racist, I will attack you with the North.\""},{"type":"paragraph","text":"\"I need two men on this. That's what she said. NO TIME. But she did. NO TIME.\""},{"type":"paragraph","text":"\"Bippity boppity give me the zoppity.\""},{"type":"paragraph","text":"\"I recognize that. It is Japanese for California roll.\""},{"type":"paragraph","text":"\"Hey, Ryan. This is your girlfriend. And I'm mad.\""},{"type":"paragraph","text":"\"Would I rather be feared or loved? Um, easy. Both. I want people to be afraid of how much they love me.\""},{"type":"paragraph","text":"\"The worst thing about prison was the the dementors!\""},{"type":"paragraph","text":"\"Occasionally, I will hit somebody with a car. So sue me! No, don't sue me. That's... the opposite of the point I'm trying to make.\""},{"type":"paragraph","text":"\"I need a username, and I have a great one: 'Little Kid Lover.' That way people will know exactly where my priorities are at\""},{"type":"paragraph","text":"\"I'm not superstitious, but I am a little stitious.\""},{"type":"paragraph","text":"“Please don’t send Dwight.”"},{"type":"paragraph","text":"“This is an environment of welcoming, and you should just get the hell out of here.”"},{"type":"paragraph","text":"“I am running away from my responsibilities. And it feels good.”"},{"type":"paragraph","text":"\"Damn it, Dwight!\""},{"type":"paragraph","text":"\"What's missing? The turtles. Where are the turtles? Where are the turtles? WHERE ARE THE TURTLES?!\""},{"type":"paragraph","text":"\"That's what he said! Right guys, 'cause of gay?\""},{"type":"paragraph","text":"\"Catch ya on the flippity flip!\""},{"type":"paragraph","text":"\"Just poopin, you know how I be.\""},{"type":"paragraph","text":"\"Crazy world, lotta smells\""},{"type":"paragraph","text":"\"Dwight, you ignorant slut!\""},{"type":"paragraph","text":"\"I am serious. And don't call me Shirley. Airplane.\""},{"type":"paragraph","text":"\"I am serious. And don't call me honey. Airplane 2.\""}],"images":[]},{"title":"Notes and Trivia","level":2,"content":[{"type":"list","elements":[{"text":"Michael's favorite ice cream flavor is mint chocolate chip.","elements":[]},{"text":"Michael planned to invent a hybrid of a chair and pair of pants.","elements":[]},{"text":"Michael learned numerous lessons from the movie Scream 2.","elements":[]},{"text":"Michael didn't learn how to talk until the age of 5.","elements":[]},{"text":"Michael lost his virginity at the age of 28.","elements":[]},{"text":"Michael's PIN is 9622, based on the song YMCA which is the clue he gives Dwight in Secret Santa.","elements":[]},{"text":"Michael once kissed Oscar.","elements":[]},{"text":"Whenever someone uses a sentence ending in -er Michael will respond with \"I hardly know her\"","elements":[]},{"text":"Michael bought Blockbuster stock.","elements":[]},{"text":"Michael shares a birthday with Eva Longoria.","elements":[]},{"text":"Michael's second-favorite movie is Back to the Future.","elements":[]},{"text":"Michael is one of nine characters to manage the Scranton branch of Dunder Mifflin. The others are Ed Truck, Jim Halpert, Deangelo Vickers, Creed Bratton, Robert California, Andy Bernard, Nellie Bertram, and Dwight Schrute.","elements":[]},{"text":"Michael's eye color is 'Shrek Green'.","elements":[]},{"text":"Michael's facial type is 'marsupial', according to Dwight. Also, according to Michael, others have described it as \"symmetircal.\" ","elements":[]},{"text":"Michael has a powerful sweet tooth, as seen in multiple episodes where he adds large amounts of sweetener to drinks.","elements":[]},{"text":"Michael is a Class C driver in the state of Pennsylvania.","elements":[]},{"text":"Michael and Pam had made a deal to have a child together if neither of them did in 30 years.","elements":[]},{"text":"According to Holly, Micheal can put both of his legs behind his head.","elements":[]},{"text":"He has never liked Mickey Mouse.","elements":[]},{"text":"Micheal has a $20 limit on his ATM.","elements":[]},{"text":"Michael believes that Russia no longer exists in Secret Santa","elements":[]}]}],"images":[]},{"title":"References","level":2,"content":[{"type":"list","elements":[{"text":"↑ in the episode Broke, which aired April 23, 2009, Michael states that he is 44 years old.","elements":[]}]}],"images":[]}]}