{"sections":[{"title":"Oscar Martinez","level":1,"content":[{"type":"paragraph","text":"Oscar Martinez is a fictional character played by Oscar Nunez on The Office. He is an Accountant at Dunder Mifflin\/Sabre: Scranton Branch. Oscar is openly gay after being unwillingly outed by Michael Scott in the episode Gay Witch Hunt."}],"images":[]},{"title":"Season 1","level":2,"content":[{"type":"paragraph","text":"Oscar is Mexican-American, son of parents born in Mexico. His parents moved to the United States a year before he was born. (Diversity Day)."}],"images":[]},{"title":"Season 2","level":2,"content":[{"type":"paragraph","text":"Oscar attends the Dundies but his award is unknown (The Dundies)."},{"type":"paragraph","text":"Oscar attends Toby's sexual harassment meeting and is mostly seen in the background (Sexual Harassment)."},{"type":"paragraph","text":"During the fire, Oscar and the rest of the office staff stand around in the parking lot. When Jim suggests playing \"who would you do\" both Kevin and Oscar say Pam. Pam, Meredith and Phyllis  all agree on Oscar in \"who would you do\" (The Fire)."},{"type":"paragraph","text":"Oscar dresses as a woman during Halloween and when Michael remarks that he is \"showing his true colors\" Oscar seems to get paranoid and asks what Michael is implying. When Angela later discovers that the accounting department has more people than necessary and Michael has to fire someone, Oscar gets nervous. As he is later walking out of the bathroom, Ryan remarks that his dress is stuck in the back. Oscar is later invited to join Devon at Poor Richard's to which he accepts along with most of the office staff (Halloween)."},{"type":"paragraph","text":"When Jim pranks Dwight by moving his desk into the men's bathroom, Oscar observes this from the reception desk. He later attends the fight between Michael and Dwight (The Fight)."},{"type":"paragraph","text":"When Michael and Jan leave to woo a potential major candidate Michael tells everyone goodbye however says \"adios\" to Oscar. When sitting in the break room the gang is talking about worst first dates and Oscar is heard saying \"she\" when talking about his horrible first date. In Michael's absence the staff decide to read the script to a screen play that Michael wrote. Oscar played the villain Goldenface (The Client)."},{"type":"paragraph","text":"Oscar attends Michael's meeting on how to make the workplace better but has no lines throughout the whole episode (Performance Review)."},{"type":"paragraph","text":"Oscar asks Michael why he is spying on their computers when Michael comes out however Michael tries to convince the whole office that Oscar has lost it. Michael later asks Oscar where he is going and Oscar is able to get out of it by pointing out that he is on the phone. Oscar later goes to Jim's barbeque and talks to Stanley about work. When Kelly asks that they all please talk about something else, an awkward silence goes between them (Email Surveillance)."},{"type":"paragraph","text":"Oscar reveals that he got Creed for Secret Santa, but doesn't know anything about him. However, Oscar believes that Creed might be Irish, so he got him a Shamrock key chain (Christmas Party)."},{"type":"paragraph","text":"Oscar explains Michael's theme for last year's \"retreat\" (Booze Cruise)."},{"type":"paragraph","text":"Oscar calls in sick however Michael and Dwight call him believing that he might be playing hooky. Oscar sounds sick however Dwight goes to spy on him. It turns out that Oscar was in fact playing hooky and was actually on a date with his boyfriend Gil. Dwight, not realizing that Oscar is secretly gay, tells Oscar that he won't tell Michael if he can hang out with them. Dwight later watches TV with them while Oscar and Gil hold hands behind his back (The Secret)."},{"type":"paragraph","text":"When Michael asks anyone if they want a souvenir from New York, Oscar tells Michael that the best present is for him to make a good impression in front of the new CFO. Michael assures him that he will. Oscar later gets flowers for Valentine's Day. When asked who they're from, Oscar replies his mom (Valentine's Day)."}],"images":[]},{"title":"Season 3","level":2,"content":[{"type":"paragraph","text":"Oscar and Gil went on a three month vacation to Europe on Dunder-Mifflin's tab after Michael accidentally outed him and, in an attempt to make Oscar feel better and show the rest of the employees that he was not homophobic, kissed Oscar in front of everyone in the conference room. He said he was planning to quit before he was given the time off. (Gay Witch Hunt). Oscar is absent from the office from The Convention to The Return."},{"type":"paragraph","text":"Oscar says that he was planning on breaking up with Gil (Beach Games)."}],"images":[]},{"title":"Season 4","level":2,"content":[{"type":"paragraph","text":"Oscar speaks Spanish fluently, using it in Night Out to explain to the Spanish speaking cleaning crew that the office staff had been locked in the parking lot."}],"images":[]},{"title":"Season 5","level":2,"content":[{"type":"paragraph","text":"Oscar continues to speak Spanish fluently, using it in Stress Relief, he rants about Michael at his roast. He accompanies Michael and Andy to Canada in Business Trip."}],"images":[]},{"title":"Season 6","level":2,"content":[{"type":"paragraph","text":"In Secret Santa, Oscar has a crush on another worker in the warehouse named Matt, and Pam tries setting them up. I n the episode Happy Hour, Oscar shows up hours before the building even opens just to say hello to Matt. He suggests to Darryl that the office and warehouse employees all go out for a happy hour after work, where Oscar tries to interact with Matt and the other warehouse guys. Darryl later tells Oscar that \"Matt is a great guy, but he's a dummy\" and that they have nothing in common."}],"images":[]},{"title":"Season 7","level":2,"content":[{"type":"paragraph","text":"During the episode Dwight K. Schrute, (Acting) Manager, Dwight makes the office recite the Pledge of Allegiance. Oscar is clearly shown to not say the line, 'One nation under God'. In that same episode Oscar is also disgusted by the fact that the carpet in the office covers up hardwood flooring."}],"images":[]},{"title":"Season 8","level":2,"content":[{"type":"paragraph","text":"On his way into work, Oscar spots Erin planking in the parking lot and goes off on an angry rant telling the cameras that he finds planking to be both stupid and dangerous. Later in the episode, Oscar is seen on the left side of Robert California's list of names. He is also one of the people invited out to lunch and later agrees with Robert's analysis of Sesame Street to appear more as one of Robert's favorite (The List)."},{"type":"paragraph","text":"Oscar is present during Dwight's meeting and is offended when he learns why Andy calls him \"Cocker Spaniel\". Andy also asks him which tie he should wear when he meets Robert. When Robert visits the Scranton Branch, Oscar is quick to hang up his phone along with everyone else and pretends to be busy. He later listens to Robert's speech and encourages Kevin not to add his thoughts into the conversation as he knows Kevin doesn't understand what is going on. Oscar is seen laughing and enjoying the sketches brought forward when the office is voting on what should be tattooed on Andy. He watches Andy get the tattoo later on (The Incentive)."}],"images":[]},{"title":"Season 9","level":2,"content":[{"type":"paragraph","text":"It is revealed that Oscar is having an affair with Angela's gay husband, Robert Lipton. Kevin later discovers this secret, and Oscar struggles to keep his secret with Angela. Meanwhile, Angela suspects that Robert is having an affair, and enlists Oscar to spy on him at his yoga class (The Whale). When Robert leaves, they catch him making a phone call, and Oscar's phone rings. Oscar takes his phone, looking at Angela, wondering if she discovered his secret. Later, Oscar is nervous coming into work because of he doesn't know if Angela discovered the secret or not. He believes that she has not, but when Oscar is in a talking head, Angela is seen with a face of intense hatred. Later that day, Dwight surprises a confused Oscar and forces him to hide in the warehouse. He discovers, from Dwight and Angela, that they hired somebody to break Oscar's knees for having an affair with Robert. In the Finale, it is seen that Oscar is running for state senator. It is also revealed that Oscar is the godfather of Philip Schrute, Dwight and Angela's son."}],"images":[]},{"title":"Central Episodes","level":2,"content":[{"type":"list","elements":[{"text":"The Secret","elements":[]},{"text":"Gay Witch Hunt","elements":[]},{"text":"The Return","elements":[]},{"text":"Job Fair","elements":[]},{"text":"Business Trip","elements":[]},{"text":"The Surplus","elements":[]},{"text":"Happy Hour","elements":[]},{"text":"China","elements":[]},{"text":"The Target","elements":[]}]}],"images":[]},{"title":"Trivia","level":2,"content":[{"type":"list","elements":[{"text":"Oscar joins Party Planning Committee to help plan his own \"Welcome Back\" party.","elements":[]},{"text":"Both his parents are from Mexico and moved to the US a year before he was born.","elements":[]},{"text":"Oscar is a member of the exclusive \"Finer Things Club\" and claims that besides having sex with men, the Finer Things Club is the gayest thing about him.","elements":[]},{"text":"Oscar takes a Bikram Yoga class in Dickson City (which he recommends to Holly in Weight Loss).","elements":[]},{"text":"The shooting location for Oscar's house (seen in The Secret) is actually 5232 Longridge Ave, Los Angeles.","elements":[]},{"text":"Oscar is an impressively good figure skater, as seen in Michael's Birthday.","elements":[]},{"text":"His favorite musicians are Bowling For Soup and Elton John.","elements":[]},{"text":"He says he liked Shakespeare in Love more than Die Hard, which prompts Michael to call him \"Faggy.\"","elements":[]},{"text":"Sometime between A.A.R.M. and Finale, Oscar is promoted to Chief Accountant and is subsequently given Darryl’s old office.","elements":[]}]}],"images":[]},{"title":"Recurring jokes","level":2,"content":[{"type":"paragraph","text":"Oscar talks on his cell phone a lot."},{"type":"list","elements":[{"text":"In Basketball, Oscar talks on the phone while the others play basketball.","elements":[]},{"text":"In Hot Girl, Oscar is on the phone when Michael shows Katy around.","elements":[]},{"text":"In The Fire, Oscar is on the phone when the fire alarm rings. He continues talking on the phone as he leaves the office and tells the person on the phone, \"I don't hear that.\"","elements":[]},{"text":"In Email Surveillance, Oscar talks on the phone as he leaves work to avoid having to tell Michael where he's going.","elements":[]}]},{"type":"paragraph","text":"Oscar inserts himself into a lot of conversations to add facts or correct grammar. He tends to use \"actually\" a lot when doing so."},{"type":"list","elements":[{"text":"\"Actually, you're speculating\". (China)","elements":[]}]}],"images":[]},{"title":"Quotes","level":2,"content":[{"type":"list","elements":[{"text":"\"Kids, sometimes it pays to be gay.\"","elements":[]},{"text":"\"Angela's engaged to a gay man. As a gay man, I'm horrified. As a friend of Angela's, horrified. As a lover of elegant weddings, I'm a little excited! But overall... horrified.\"","elements":[]},{"text":"\"I didn't realize how many of Angela's opinions I agreed with until she tried to have my kneecap shattered for sleeping with her husband.\"","elements":[]},{"text":"\"I'm an accountant at a failing paper company in Scranton.\"","elements":[]},{"text":"\"Look, it doesn't take a genius to know that any organization thrives when it has two leaders.\"","elements":[]},{"text":"\"I love a good quitting story. It makes me feel like I have control over my own life, it gives me hope. Maybe I'll have one of my own some day... But I dream...\"","elements":[]},{"text":"\"What exactly is my responsibility here? To comfort insecure heterosexual men? That can't possibly fall to me.\"","elements":[]}]}],"images":[]},{"title":"Appearances","level":2,"content":[{"type":"paragraph","text":"Oscar appears and has lines in every episode, with the following exceptions:"},{"type":"list","elements":[{"text":"Sexual Harassment - speaks only in a deleted scene","elements":[]},{"text":"The Fight - speaks only in a deleted scene","elements":[]},{"text":"Performance Review - has no lines","elements":[]},{"text":"Boys and Girls - does not appear","elements":[]},{"text":"The Convention through Traveling Salesmen - does not appear (on vacation), with the exception of a brief appearance in A Benihana Christmas.","elements":[]},{"text":"Ben Franklin - does not appear, although a coat hangs on the back of his chair","elements":[]},{"text":"Phyllis' Wedding - has no lines","elements":[]},{"text":"Cocktails - speaks only in a deleted scene","elements":[]},{"text":"Women's Appreciation - has no lines","elements":[]},{"text":"Dinner Party - has no lines","elements":[]}]}],"images":[]}]}