{"sections":[{"title":"Pam Beesly","level":1,"content":[{"type":"paragraph","text":"Pamela Morgan \"Pam\" Beesly Halpert (née Beesly) is a fictional character played by Jenna Fischer in the television series The Office. She is based on Dawn Tinsley in The Office (UK). She is married to Jim Halpert and has two children -- a girl named Cecelia Marie \"Cece\" Halpert and a boy named Phillip Halpert. Pam is generally polite toward others. She enjoys drawing and painting."}],"images":[]},{"title":"Season 1","level":2,"content":[{"type":"paragraph","text":"Pam is the receptionist at Dunder Mifflin's Scranton, PA branch. She appears shy and hesitant at times, but she is very kind and has a good sense of humor.  She had been dating warehouse employee Roy Anderson for eight years and engaged to him for three. Roy's hesitance to set a date for their wedding often leaves Pam hurt; Michael, however, finds it hilarious.  She was not very attractive and was a nerd in high school. Pam is unenthusiastic about her job, showing a real passion and talent for art as early as the Pilot. She states in a talking head interview that, \"I don't think it's many little girls' dream to be a receptionist\" and comments that she would be unfazed if she were let go; however, when Michael mock-fires her, she breaks down. Upon learning he was joking she calls him a \"jerk\". She appears resigned to the fact that her job amounts to little more than babysitting Michael."},{"type":"paragraph","text":"It is clear from early in the series that Pam and Jim are very close friends; they are frequently found chatting, and devising pranks to play on Dwight. While she does appear cognizant of the fact that Roy is not Jim's favorite person, Pam seems to be oblivious of Jim's romantic interest in her throughout the first season, and either ignorant or in denial of her love for him. It is also seen that every time Jim talks to Pam and Roy comes into the room, Jim immediately keeps a safe distance."},{"type":"paragraph","text":"She becomes a bit jealous when Jim is with Katy. This is shown by Pam putting on makeup after Jim says he is going to go out with Katy."}],"images":[]},{"title":"Season 2","level":2,"content":[{"type":"paragraph","text":"Jim and Pam's relationship in Season 2 continues to be a source of speculation. Pam receives the \"Whitest Sneakers Award,\" something secretly engineered by Jim when he saw how upset she was at the prospect of receiving yet another \"Longest Engagement\" Dundie. After her jubilant acceptance speech, Pam drunkenly kisses Jim full on the lips in front of everyone, an event which has not been discussed or acknowledged since. Pam was later banned from all Chili's locations for sneaking drinks from other tables."},{"type":"paragraph","text":"There are a few instances in this season in which tensions between Jim and Pam run particularly high, for example, when Jim misinterprets Pam's innocent suggestion that he should pursue another job far from Scranton (\"Halloween\"), or when Jim rebukes her after she dismisses the idea of a rooftop dinner being a \"date.\"  Despite their disagreements, their friendship remains relevant."},{"type":"paragraph","text":"Pam is seen being uncomfortable with Jim's relationship with salesgirl Katy, which began in the Season 1 finale \"Hot Girl\" and extends into the second season. . She also seems to rejoice on the fact that Katy and Jim apparently don't have a lot in common  and that their relationship was never very solid . (Roy also admits to being attracted to Katy.)"},{"type":"paragraph","text":"Pam is joyful when a drunken Roy finally sets June 10 as their wedding date.  However, she becomes saddened when Jim deliberately schedules a trip out of the country to ensure his absence at the wedding."},{"type":"paragraph","text":"When Michael reveals that Jim had feelings for Pam to the entire office, Jim preemptively tells Pam, before she is told by other employees. However, he does not fully come clean about his ongoing feelings for her and claims that he had a crush on her only when they first met. Michael later hints to Pam that Jim may not have been telling the full truth, but, in a rare moment of self-awareness, stops himself from further confirming it."},{"type":"paragraph","text":"Jan informs Pam about an internship in graphic design that Dunder Mifflin is sponsoring in New York. Pam is hesitant at first, but after encouragement from Jan and Jim, decides to pursue the program. Her excitement is quelled by Roy, who deemed the idea as \"impractical\". Later in a talking head, Pam begins to cry at the realization that she may never achieve her dreams."},{"type":"paragraph","text":"Pam eventually learns the truth about Jim's ongoing feelings for her. Jim reveals during Dunder Mifflin's casino night, that he is in love with her. Visibly shaken by his confession, she gently tells him she cannot pursue a relationship with him. Afterward, Pam retreats to the darkened office to call her mother. She can be heard consulting the idea of a relationship with Jim, with her Mom. Minutes later, Jim walks in and quickly kisses her."}],"images":[]},{"title":"Season 3","level":2,"content":[{"type":"paragraph","text":"Season Three began where season two ended; showing the aftermath of Jim's decision to kiss Pam. Once Jim and Pam part from the kiss, Pam tells Jim she cannot begin a relationship with him, and that she is obligated to Roy. Shortly after however, Pam decides to break up with Roy. Roy is seen attempting to regain the confidence of Pam by changing his attitude to support her needs."},{"type":"paragraph","text":"Jim, unable to work around Pam, accepted a higher paying sales job at the Dunder Mifflin Stamford branch. Pam can be seen, multiple times, exhibiting feelings of remorse about her decisions concerning Jim. Later in the season, Jim forms a relationship with a Stamford saleswoman, Karen Filippelli. After a threat of merger becomes public, Pam was hopeful that Jim would return to the Scranton branch, and inquires, to other employees, if they have any information about Stamford employee integration."},{"type":"paragraph","text":"Pam is happily surprised when, after a Stamford-Scranton merger, Jim returns to his previous position."},{"type":"paragraph","text":"Pam attempts to restart her friendship with Jim by initiating pranks on Dwight and eliciting Jim for help. Pam becomes bewildered when Jim tells her that he is dating Karen (who also joined the Scranton branch) and that he has decided to \"give up\" his old, prankster ways. Pam takes it personally and is visibly saddened."},{"type":"paragraph","text":"Jim, noticing that Pam is saddened by his new attitude, decides after a period, to aid Pam in her pranks."},{"type":"paragraph","text":"Pam and Jim are, for a time, comfortable that their friendship remains intact."},{"type":"paragraph","text":"Later, Jim begins to have relationship problems with Karen. After a conversation with Karen, Pam realizes she has been unnecessarily impersonal to her and consults both Karen and Jim. Pam advises Jim that his disagreements with Karen are hurting her feelings and that he should relent. Jim takes her advice, and his relationship problems are resolved. After realizing she cares more about Jim than she previously thought, and that she has inadvertently pushed him into the arms of another woman, Pam breaks down and cries. Dwight later stumbles upon her crying alone in the building lobby."},{"type":"paragraph","text":"During the Phyllis Lapin-Vance wedding, Pam becomes lonely and depressed while watching Jim enjoy himself with Karen. She is also uncomfortable with the fact that she is essentially attending the wedding she and Roy were supposed to have together, considering the fact that almost every detail is identical to what she had planned for her own wedding, even down to Phyllis's wedding dress. During the reception, Roy mentions the similarities and asks Pam to dance. Pam decides that she would rather be with Roy than be alone and attempts to restart their relationship."},{"type":"paragraph","text":"For a period, both couples are preoccupied with each other."},{"type":"paragraph","text":"When Pam reveals to Roy at a bar that she kissed Jim shortly before they were to wed, Roy becomes violent and enraged and trashes the bar. Pam now sees why she should not be with Roy, and quickly tells him their relationship is totally over. Roy blames all of his woes on Jim and vows revenge."},{"type":"paragraph","text":"The next day, Roy waits for Jim to leave the office. After waiting, Roy enters the office and attempts to punch Jim. Dwight defeats Roy using a hidden bottle of pepper spray. Roy is fired from Dunder Mifflin."},{"type":"paragraph","text":"Pam and Jim elect not to speak to each other about the incident. Pam does, however, offer Jim an apology, to which Jim perceives as insincere."},{"type":"paragraph","text":"In \"Beach Games\", Pam decides she is tired of keeping her feelings from Jim and reveals to him (and all the other employees) that, although there were other causes, he was the main reason she'd broken up with Roy, and that she misses his friendship and the ways they would have fun."},{"type":"paragraph","text":"Some days later, being mocked by the office for her speech, Pam is seen telling employees (including Karen) that she does not regret making her feelings public."},{"type":"paragraph","text":"A position opens at Dunder Mifflin corporate headquarters which Jim, Karen, Michael, and, secretly, Ryan the Temp, are all applying for. During Jim's interview, he reads a note from Pam that contains a sentimental item from before they kissed (a gold yogurt lid that was used as a gold medal in \"Office Olympics\"). The note reads \"Don't forget us when you're famous!\". At this moment Jim decides to remove himself from consideration for the position."},{"type":"paragraph","text":"While Pam is in the middle of being interviewed in the conference room by the camera crew, Jim asks Pam if she would like to have dinner with him. Pam, taken completely off guard, replies \"yes\". Jim states that it is a date, and Pam is left almost in tears, ecstatic."}],"images":[]},{"title":"Season 4","level":2,"content":[{"type":"paragraph","text":"Season four begins with Pam and Jim dating. Jim reveals he swiftly broke up with Karen, the same day he asked Pam to dinner. Pam denies dating Jim during the \"Fun Run,\" but when the camera crew confronts them with a clip of them kissing after work, she admits that she and Jim have been happily dating since \"The Job\". Pam and Jim attempt to keep their relationship a secret from the office employees. Their relationship comes much to the disappointment of Toby, who has developed a crush on Pam. Toby witnesses Pam kissing Jim on the cheek in the break room and creates a \"PDA\" memo designed to call attention to Pam and Jim's relationship. After scrutiny from employees as to whom the memo pertains, Jim declares he is dating Pam. Many of the office employees are surprised."},{"type":"paragraph","text":"Pam and Jim are not without their rough patches - in \"Branch Wars,\" for example, when Pam was reluctant to let Jim join the Finer Things Club (or later, when she let him join and her fears were proved right), or in \"Survivor Man,\" when Jim's stint as acting manager backfires when he tries to merge birthday celebrations. On the whole, however, their relationship seems very solid. In \"Dinner Party,\" for example, the ending moments show that they are clearly the happiest and most stable couple there, the other couples being Andy and Angela, and Michael and Jan."},{"type":"paragraph","text":"Pam attempts to set Michael up with her landlady Margaret in \"Chair Model,\" which backfires when Michael finds her homely and boring. Pam later tells Jim that she's not fond of her apartment, though she brushes off Jim's suggestion that she move in with him, saying she doesn't want to live with someone without being engaged. Jim then teasingly tells her that he will, in fact, propose to her, but he wants to make the proposal special (\"when it happens, it's going to kick your ass, Beesly, so stay sharp.\") In a talking head immediately after this, Jim shows the camera crew an engagement ring, which he purchased one week into their relationship."},{"type":"paragraph","text":"Toby's crush on Pam is outed to the office when, in \"Night Out,\" he puts his hand on Pam's knee. Jim and Pam remain silent, as do the other office workers, but an extremely embarrassed Toby stammers that he is moving to Costa Rica and leaves immediately."},{"type":"paragraph","text":"Pam is overjoyed to learn that she's been accepted at the Pratt Institute, a design school in New York, in \"Goodbye, Toby.\" Jim is thrilled for her. Both are apprehensive at the prospect of being apart for three months, but Jim remains very supportive, assuring her they'll visit whenever possible. After paying Phyllis extra to incorporate fireworks into Toby's going away party, Jim reveals to the camera crew that he plans to propose that night. Pam begins to suspect that he might, and Jim even gets so far as to get the ring out of his pocket, but before he can pop the question, Andy makes his own very public proposal to Angela. Upset, Jim puts the ring back in his pocket, and Pam and Jim leave the party, both clearly disappointed."}],"images":[]},{"title":"Season 5","level":2,"content":[{"type":"paragraph","text":"The premiere episode of Season Five, \"Weight Loss,\" follows Pam through the beginning of her art school program. Jim explains after her departure for New York that they talked after the events of \"Goodbye, Toby,\" and they decided not to get engaged just yet. Pam is unenthusiastic about the idea of a long engagement, a hangover from her relationship with Roy, and she and Jim agree that they'd rather not spend the first few months of their engagement apart. She and Jim find ways to stay in touch and see each other as often as possible, but they clearly miss one another during their separation."},{"type":"paragraph","text":"Frustrated with their conflicting schedules, Jim asks to meet her at a gas station halfway between them for lunch, at which Jim proposes to her in the rain, saying he couldn't wait any longer. Pam happily accepts. To help pay for school, she gets a small job at Corporate. She then stays away for months, sometimes being only seen on the computer. When she fails one of her classes, we learn she has to stay away for another three months to complete the program. She decides to return home instead to be with Jim."},{"type":"paragraph","text":"She returns to her usual position of receptionist. Unfortunately, her parents get divorced. While it initially puts a strain on her relationship with Jim, and he might have accidentally ended it (her father seeks the divorce after talking to Jim), in the end, this only brings her and Jim closer, since she tells Jim that her father came to the decision after realizing that the love Jim felt for Pam was stronger than anything he'd ever felt about his wife. She also becomes friends again with Karen Fillipelli, who is now pregnant and married. Karen even happily embraces Pam when she announces her engagement to Jim. Michael quits to form his own company, Michael Scott Paper Company but fails to recruit anyone but Pam and Ryan, as she joins him on a whim. Trying to move up from the receptionist position, she asks to be made a salesman. At a pancake lunch, Pam talks with a person enjoying the food. Later in the episode, it is revealed that he is a potential client, and Pam makes her first sale. After The Michael Scott Paper Company gets bought out by Dunder Mifflin, Pam stays on as a sales representative."},{"type":"paragraph","text":"At the company picnic, we learn that Pam was a volleyball player in school, which gets them into the volleyball tournament finals against Corporate. Pam injures her ankle, and Jim carries her to a hospital a few blocks away. While at the hospital the audience is led to believe the doctor tells Jim and Pam that Pam is pregnant, due to his call to Dwight to continue the game without them, and their show of excitement."}],"images":[]},{"title":"Season 6","level":2,"content":[{"type":"paragraph","text":"In the season premiere, it is revealed that Pam is, in fact, four months pregnant. In \"The Meeting,\" Pam expresses concern that she may not fit in her wedding dress because she is pregnant, after which Ryan makes an insulting remark about her weight."},{"type":"paragraph","text":"Pam gets married to Jim in Niagara Falls. The night before the wedding at the rehearsal dinner her Memaw, who is very old-fashioned, learns that she is pregnant, and is outraged. However, Michael persuades her to stay for the wedding. That same night Andy seriously injures himself trying to have a dance off with Kelly, and Pam is the only person sober enough to drive him to the hospital, after which he stays the night in her room on the floor. The stress of the previous night's events, culminating with her mom trying to talk her out of marriage on her wedding day (still bitter from her recent divorce) and her veil tearing, lead Pam and Jim to elope on The Maid of the Mist, and then get married in the church, but Jim's brothers, Dwight, and Michael recreate the YouTube video, \"JK Wedding Dance\" to the song \"Forever\" by Chris Brown and the entire office dances down the aisle. During the song, both a montage of their marriage on the boat and the dance is shown."},{"type":"paragraph","text":"When Jim and Pam return from their honeymoon, Jim tries not to let Pam know that Michael is dating her mom. Once Pam finds out, she is outraged and openly belittles Michael.  After denying Pam's request to break things off with her mom, Michael realizes Helene is too old for him and dumps her on her 58th birthday. Pam becomes fed up with Michael. Later, Pam slaps Michael once he says that her mom came on to him."},{"type":"paragraph","text":"Later in the season, Pam is scared that she, Jim, and the other employees will lose their jobs as Dunder Mifflin heads towards insolvency.  When Michael needs help telling a group of kids that he'd promised to pay their tuition that he cannot keep his promise, Pam is unsympathetic and tells Michael that he has done a terrible thing. She refuses to go with him; Erin goes instead.  During the trip, Michael openly belittles Erin and misses Pam. Pam supports Oscar and Matt's relationship and wants them to get together. As she enjoys the Christmas party, she tries to set up Oscar and Matt, although she is unsuccessful. Pam is thrilled when everyone in the office gets to keep their jobs, and embraces Jim."},{"type":"paragraph","text":"Pam and Jim go to an exclusive daycare center for an interview. However, she gets defensive when the employee there doesn't like them because Jim walked in on him when he was in a children's bathroom.  She recommends Jim go back to being a salesman because it could pay more than being the manager. Jim goes back to being the manager (a short while before returning to his position as a salesman), pranks Dwight twice, and Pam is happy to get him back to his old roots."},{"type":"paragraph","text":"Pam is overjoyed when she delivers a baby girl, Cecelia Marie Halpert.  When Jim returns to work from paternity leave she keeps him updated on Cecelia's progress.  She is later ecstatic when she gets to leave home and be around adults for a night out with the office. She sets up her friend Julie with Michael, but their short date ends horribly.  Her relationship with Michael has completely healed by now; she supports him both when he begins a relationship with bar manager Donna and when that relationship later has problems."},{"type":"paragraph","text":"Pam is one of at least four Sabre\/Dunder Mifflin employees who leaked the story of the printer fires to the press, after inadvertently telling the wife of a reporter at the local newspaper (\"Whistleblower\")."}],"images":[]},{"title":"Season 7","level":2,"content":[{"type":"paragraph","text":"In \"Nepotism\", Pam accidentally ruins Jim's planned-out prank on Dwight. Pam feels guilty, so she tries to make it up to Jim by devising a prank of her own. She enlists Kevin to rewire the elevator so the buttons all do different things. To her dismay, Kevin's alterations to the elevator's 'circus board' result in Pam and Dwight getting trapped in the elevator together. In the end, the backfired prank does impress Jim."},{"type":"paragraph","text":"In \"Counseling\", Pam feels inadequate about her poor performance in sales and successfully tricks Gabe into promoting her to a phony new salaried office administrator position."},{"type":"paragraph","text":"Later, in \"China\", Pam tries to use her authority as Office Administrator to force Building Manager Dwight to stop his annoying cost-cutting measures. Pam threatens to move the office to a new building, which Dwight discovers doesn't exist. Pam saves face, however, when Dwight secretly has his assistant provide her with a book on building regulations that proves Dwight's measures were not allowed. The episode is another example of Dwight's curiously covert protectiveness and fondness for Pam (as previously demonstrated in \"The Injury\", \"Back from Vacation\", \"The Job\" and \"Diwali\"); Mindy Kaling said during an online Q&A session that Dwight has a soft spot for her that he does not extend to anyone else at the office, especially Jim. She also uses her position to buy Erin Hannon an expensive desktop computer to replace the terrible one she had to use for years. After Andy Bernard has a fit about it, Pam drops hints that he can get a similarly modern computer if he ruins his current one, and Andy proceeds to do just that. Pam then lies to everyone that she found a spare computer in the warehouse, and buys a knowing Darryl's silence with three extra vacation days, leading Pam to cheerfully tell the cameras that \"I'm full-on corrupt!\""},{"type":"paragraph","text":"In \"Goodbye, Michael\", Pam almost misses saying goodbye to Michael, as she spends most of the day out of the office trying to hunt down supplies for his farewell party the next day as well as attending a showing of The King's Speech. Jim figures out Michael's plan to leave early and tells her. Pam reaches the airport in time and is the last person to see Michael before he leaves for Colorado."}],"images":[]},{"title":"Season 8","level":2,"content":[{"type":"paragraph","text":"It is revealed that Pam is pregnant again and she appears offended when Angela calls her \"Big Pregs\". Pam later watches a commercial that makes her cry and Jim tries to persuade her to stop. Erin later discovers a list in new Sabre CEO Robert California's notebook of everyone in the office's name and calls Pam over to show her. She gets emotional again and tells Jim she believes that the list she is on is Robert California's \"firing list\". She begins to cry again when she learns that the people on her side of the list are \"losers\" to Robert. Andy tries to console her as Jim is not there; however, he accidentally makes a comment on how Pam has gained weight during her pregnancy, causing Pam to get even more upset. Andy makes a new list where he puts the losers back on the winner list, and Pam is touched when Andy remarks to Robert how Pam is \"one of the kindest people\" he has ever worked with. Jim later purposely lets Pam see a list he made that is similar in fashion to Robert's, where he believes that Pam, Cece, and the new baby are winners and everything else doesn't matter. Pam wonders out loud to the cameras if she should frame it (\"The List\")."},{"type":"paragraph","text":"Throughout the season, Pam argues with Angela about how they both want to name their unborn sons \"Philip\"; Pam's son after her late grandfather, and Angela's after her cat. In \"Pam's Replacement\", she becomes insecure about her belief that Jim finds her maternity leave replacement, Cathy, attractive. Jim refuses to admit to it despite her insistence that he's lying to make her feel better about herself. She gives birth to their son Philip sometime shortly after this episode. Pam also sets Kelly up with Ravi, her children's pediatrician."}],"images":[]},{"title":"Season 9","level":2,"content":[{"type":"paragraph","text":"Early in season 9, Jim is restless about his life in Scranton and helps a friend start a sports marketing business, Athlead, in Philadelphia, but keeps it a secret from Pam until the third episode, \"Andy's Ancestry\". Although Pam is happy for his decision, she is concerned about the fact that he had kept it a secret from her and she is later disturbed to hear about just how much of their money he has invested in it. Jim begins spending part of each work week in Philadelphia, but in \"Customer Loyalty\", the strain of this on Pam is evident when she breaks down in tears and is comforted by Brian, the boom mic operator of the film crew."},{"type":"paragraph","text":"In \"Moving On\", Pam interviews for a job in Philadelphia to be closer to Jim, but she is turned off by the idea when her prospective new boss bears a striking resemblance in behavior to Michael Scott. Over dinner, Pam reveals to Jim that she doesn't really want to move to Philadelphia after all. However, in \"Livin' the Dream\", when Athlead is bought out and Jim is offered a large sum of money for 3 months to pitch the company across the country, Pam overhears Jim refuse the opportunity because of her and appears to have mixed feelings about this decision. In \"A.A.R.M.\", Pam tells Jim that she's afraid that he will resent her for making him stay and that she might not be enough for him. Jim asks the camera crew to compile documentary footage of the two of them to show her. When she finishes the montage, which ends with Jim taking back a letter he intended to give her with his teapot gift during season 2's Christmas party, Jim finally gives her the letter, and she reads it, visibly moved. In the series finale, which takes place a year later, she reveals to Jim that she secretly put the house on the market, so that they can move to Austin, Texas, and take his job back at Athlead (now Athleap)."}],"images":[]},{"title":"Personality","level":2,"content":[{"type":"paragraph","text":"In the first few seasons, Pam is portrayed as reserved, lacking both the self-confidence and courage to make real changes in her life. In these episodes, her love life consists of her being too afraid to confront her true feelings. Her self-confidence begins to grow after she calls off the wedding and is left without Jim in the office. She finally gets to experience being on her own, and although she still misses Jim, it gives her the opportunity to discover herself as the funny, kind-hearted woman she is. The real turning point in Pam's personality, however, takes place in the episode \"Beach Games\" (third season). In this episode Pam is the only one to successfully complete Michael's fire walk, symbolizing the courage, strength, and confidence she has finally found. After finally taking this step, she uses this new found bravery to tell Jim how she truly feels. Pam continues to take steps towards self-improvement by enrolling in art school, standing by Michael on his business venture and starting a family with Jim. There are times we see Pam struggle with her art career and her marriage as she battles with her deep-seated insecurities, but these moments serve to show the strength and resilience Pam holds."}],"images":[]},{"title":"Relationships","level":2,"content":[],"images":[]},{"title":"Jim Halpert","level":3,"content":[{"type":"paragraph","text":"The \"will they or won't they\" tension between Jim and Pam is a strong storyline in the early episodes of The Office, encompassing much of Seasons 1 to 3. In the opener of Season 4, the two characters are revealed to be dating, and as such, other character romances, such as the romance between fellow co-workers Dwight Schrute and Angela Martin, begin to move more toward the forefront of episodes. In season 5, the two become engaged and move in together. In Season 6, Jim and Pam are married in the season's 4th and 5th episodes, a feat considered noteworthy by many television critics, as bringing together the two lead love interests in a television series is often thought to be a risky venture. Their child is born in the second half of the season, during another hour long, \"The Delivery\". Pam and Jim's second child is born during season 8. In season 9, their marriage becomes strained when Jim takes up a second job in Philadelphia. They ultimately decide to leave Dunder Mifflin together so Jim can pursue his dream job."}],"images":[]},{"title":"Roy Anderson","level":3,"content":[{"type":"paragraph","text":"When the series begins, Pam is engaged to her high school sweetheart Roy Anderson; this engagement is revealed to be three years old and running. They finally set a date, but Pam calls off the wedding at the last minute, partly due to her feelings for Jim. They get back together briefly in season 3, but Pam is much more assertive this time, and finally breaks up with him after he has a violent outburst. Roy is deeply flawed - he is overbearing, neglectful, dismissive of her desire to be an artist, and offers her sex as a gift on Valentine's Day. Jim comments in Season 2 that Pam does not like to \"bother\" Roy with her \"thoughts or feelings\". He tells the camera crew that the only two problems in Pam's life seemed to be Roy and her job at Dunder Mifflin."},{"type":"paragraph","text":"In the early seasons, there is a great deal of tension between Jim and Roy, with Roy often acting threatening towards Jim. In \"Basketball\", when Jim starts to impress Pam with his basketball skills, Roy elbows Jim in the nose. In season 2, when Jim encourages Pam to pursue a graphic arts internship offered by Dunder Mifflin, Roy objects to the opportunity and convinces her that the idea is foolish. Pam ultimately calls off her wedding to Roy, but they remain friendly and he is determined to win her back by being less of a jerk. She reconciles with Roy at Phyllis's wedding as a response to watching Jim date Karen. In an attempt at a fresh start with Roy, Pam comes clean about Jim kissing her during \"Casino Night\". Roy flies into a violent rage and Pam ends the relationship on the spot. The next day, Roy attempts to attack Jim in the office but is stopped by Dwight's pepper spray and is fired. After losing his job, Roy meets Pam for coffee and says that even though Jim is dating Karen, she should at least make an effort to date him, as she called off the wedding because of him."},{"type":"paragraph","text":"In season 5, Jim and Roy run into each other at a bar and Roy learns that Jim and Pam are engaged. The mood is somewhat awkward, but Roy is congratulatory, but then makes a somewhat passive-aggressive comment, seemingly meant to make Jim feel insecure about his current role in Pam's life, which tempts him to drive to Pratt, where she is attending art classes. Jim gets on the freeway, but changes his mind and remembers that he trusts Pam. Jim didn't want to treat Pam in the same way Roy treated her."}],"images":[]},{"title":"Michael Scott (friendship)","level":3,"content":[{"type":"paragraph","text":"In the series pilot, Michael is overtly rude to Pam and at one point fakes firing her, leaving her in tears. He often makes suggestive if harmless remarks about her beauty and general appearance, and at one point lies to the camera that they used to date (inspiring a horrified \"WHAT!?\" from Pam when an interviewer relays the message to her). However, his impulsive attempt to kiss her during Diwali is shot down and marked the end of any romantic dreams for Michael with Pam. Over time, the combination of Michael being supportive of her goals, her transition from a bad relationship with Roy to a great one with Jim, her finding a job she not only enjoys but is effective at in the office administrator position and Michael finding his own soulmate in Holly Flax made Pam soften her stance towards Michael, and the experience at the Michael Scott Paper Company further bonded them (as did Michael's decision to choose Pam instead of Ryan Howard as the only MSPC salesman to keep that job when Michael returned as Branch Manager). Pam was furious at Michael for dating her mom Helene, and excoriated him at length during \"The Lover\" before eventually slapping him in \"Double Date\", but they once again were able to be civil to each other afterward. Pam does set up boundaries around her personal life that Michael can't cross, like telling him that he wasn't Cece's godfather. By Season 7, Pam acts as something of a guardian for Michael, steering him away from (numerous) bad ideas and towards his (fewer but real) good ones, such as his successful efforts to propose to Holly. In Michael's finale \"Goodbye, Michael\", Pam spends the whole day, looking for a shredder, believing that the next day Michael was leaving. As Michael takes off his microphone and heads down the airport concourse, Pam runs to him with no shoes and hugs him as he kisses her cheek. The two have a nice moment and he walks off, leaving her holding her shoes. She then tells the camera that he was happy, wanting to be an advanced rewards member, and was glad to be going home to see Holly. She then is there to watch Michael's plane take off. In a deleted scene from \"The Inner Circle\", we learn Pam is flattered that Michael named his new puppy \"Pamela Beagsley\", and in \"The List\" she playfully teases Jim by calling their second child \"Little Michael Scott\", further proving that the two have developed a genuine friendship."}],"images":[{"src":"https:\/\/vignette.wikia.nocookie.net\/theoffice\/images\/3\/35\/1196337372580513_GHIdlfqO_c.jpg\/revision\/latest\/scale-to-width-down\/181?cb=20121104182103","caption":"Pam in the episode \"Here Comes Treble\"."},{"src":"https:\/\/vignette.wikia.nocookie.net\/theoffice\/images\/8\/89\/110714office-jenna1.jpg\/revision\/latest\/scale-to-width-down\/180?cb=20130513021443","caption":"Pam in Season Seven"}]},{"title":"Recurring Jokes","level":2,"content":[{"type":"list","elements":[{"text":"A strange and at times annoying recurring theme is that despite Pam’s kind, gentle and timid nature, she’s often interpreted as a “drama queen” and “little miss thing” (primarily from Meredith).","elements":[]},{"text":"Pam is also accused on a few occasions of being somewhat promiscuous. For instance, Angela calls her the \"office mattress\"  Jan is under the mistaken belief that she once dated Michael , and Phyllis insinuates that she sleeps with a different person every week once it's revealed that she is dating Jim .","elements":[]}]}],"images":[]},{"title":"Trivia","level":2,"content":[{"type":"list","elements":[{"text":"It is revealed in Garden Party, that Pam vowed to her grandfather, Phillip, that she would name her son after him.","elements":[]}]},{"type":"list","elements":[{"text":"Pam animated the end of Michael's Dunder Mifflin commercial in \"Local Ad.\"","elements":[]}]},{"type":"list","elements":[{"text":"Pam's maiden name has been spelled several ways over the course of the series. According to the NBC website, the appropriate spelling is \"Beesly,\" as was used in \"Did I Stutter?\" and \"Business School\". However, in \"Conflict Resolution,\" Pam's ID badge clearly shows that she signs her name \"Pam Beesley,\" and in \"Sexual Harassment,\" a shot of Kevin's computer shows her name spelled \"Pam Beasly.\" The correct spelling is generally assumed to be \"Beesly\". This disagreement spans the whole series, however, as her name is spelled \"Beesley\" once again in the season 9 episode \"A.A.R.M.\".","elements":[]},{"text":"Pam is profoundly nearsighted (she states in \"Did I Stutter?\" that her vision is 20\/400). She usually wears contacts but has a pair of backup glasses when the need arises.","elements":[]},{"text":"Pam's birthday is March 25, 1979.","elements":[]}]},{"type":"list","elements":[{"text":"Pam has worked at Dunder Mifflin since March 2002, according to Jenna Fischer's MySpace page.","elements":[]}]},{"type":"list","elements":[{"text":"Pam is a fan of Sudoku; she has, on at least one occasion, completed a level moderate puzzle in 18 minutes.","elements":[]}]},{"type":"list","elements":[{"text":"Pam is very close to her mom, as seen in \"Sexual Harassment.\"","elements":[]}]},{"type":"list","elements":[{"text":"Her middle name (Morgan) was revealed by Jim in \"Did I Stutter?\"","elements":[]},{"text":"Her middle name was \"Jane\" on the wedding invitation in \"Phyllis's Wedding\"","elements":[]}]},{"type":"list","elements":[{"text":"Pam says she's \"not great with kids\" in \"Take Your Daughter to Work Day,\" though she does connect with Meredith's son Jake.","elements":[]},{"text":"In \"Fun Run\", Pam reveals that her religious denomination was Presbyterian, as well as Darryl.","elements":[]}]},{"type":"list","elements":[{"text":"Debate persists over whether Jim or Pam started at Dunder Mifflin first, as various episodes seem to contradict themselves. Greg Daniels has stated that, in his mind, Pam was there before Jim; however, if this is correct, then either Pam's March 2002 start date or the statement that Jim has been at Dunder Mifflin for seven years must be incorrect. In \"Launch Party,\" Jim tells Pam he first discovers he likes her when she showed him his desk on his first day of work, telling him to \"enjoy this moment\", as he could never go back to the time before he met Dwight. Daniels admits that he realizes the contradictions and says this is not something set in stone.","elements":[]},{"text":"Michael has been seen naked by Pam once, and it comes back to that same recurring aspect in The Delivery when Michael walks in on Pam delivering her firstborn child. Michael abruptly walks out of the room and says \"That kid's gonna have a lot of hair\"","elements":[]}]},{"type":"list","elements":[{"text":"According to Weight Loss, Pam weighs 126 pounds (as of the summer of 2008). - Revision, as of New Guys - she weighs 105 lbs (although at 5'5 105 lbs would make her underweight, leading room to believe Pam may exaggerate slightly).","elements":[]}]},{"type":"list","elements":[{"text":"Pam is an accomplished volleyball player, a talent not revealed until the Company Picnic.","elements":[]},{"text":"Since season 7 episode 2 \"Counseling\" Pam is the official office administrator. However, Pam lied to get the position as the office administrator and was nearly caught by Gabe.","elements":[]},{"text":"Pam has the final talking head interview in the series, during which she delivers the final line of the series: \"There's a lot of beauty in ordinary things. Isn't that kind of the point?\"","elements":[]},{"text":"In \"The Fire,\" Pam's \"Desert Island Movies\" are Fargo, Edward Scissorhands, Dazed and Confused, The Breakfast Club, and The Princess Bride. She also chooses both Oscar and Toby for the game \"Who Would You Do?\"","elements":[]},{"text":"In season 3, episode 2, \"The Convention\", Pam and Michael made a deal that if neither of them had children in 30 years then they would have a child together.","elements":[]}]},{"type":"list","elements":[{"text":"Jenna Fischer named Pam and Jim's daughter Cece after her own niece Cece, who was born two weeks before they filmed The Delivery.","elements":[]}]}],"images":[]},{"title":"Appearances","level":2,"content":[{"type":"paragraph","text":"Pam appears and has lines in every episode, with the following exceptions:"},{"type":"list","elements":[{"text":"Business Ethics - voice only","elements":[]},{"text":"Mafia - voice only","elements":[]},{"text":"St. Patrick's Day - voice only","elements":[]},{"text":"Mrs. California through Pool Party - does not appear (on maternity leave)","elements":[]}]}],"images":[]},{"title":"Relationship status","level":2,"content":[{"type":"paragraph","text":"Engaged to Roy (beginning 3 years prior) Pilot - Casino Night"},{"type":"paragraph","text":"Single Gay Witch Hunt - Phyllis' Wedding"},{"type":"paragraph","text":"Dating Roy Again Phyllis' Wedding - Cocktails"},{"type":"paragraph","text":"Single Cocktails - The Job"},{"type":"paragraph","text":"Dating Jim Fun Run - Weight Loss"},{"type":"paragraph","text":"Engaged To Jim Weight Loss - Niagara"},{"type":"paragraph","text":"Married To Jim Niagara - Present"}],"images":[]},{"title":"See also","level":2,"content":[{"type":"list","elements":[{"text":"Jim-Pam Relationship","elements":[]},{"text":"John Krasinski And Jenna Fischer's Old Audition For The Show","elements":[]}]}],"images":[]}]}