{"sections":[{"title":"Robert Lipton","level":1,"content":[{"type":"paragraph","text":"Robert Lipton is a fictional character played by Jack Coleman in The Office. His secret homosexuality is the basis for a story arc in Season 9. "}],"images":[]},{"title":"Season 7","level":2,"content":[{"type":"paragraph","text":"In WUPHF.com, Robert appears at Dwight's Hay Festival with his son. When Angela sits down on a hay bale, Robert joins her. Angela makes a joke calling the hay festival a \"pay place\". Robert laughs and Angela retorts \"Don't laugh at me!\" Robert tells her he was just laughing at her joke. Angela calms down and continues to make fun of the festival. This is where the pair begins to show chemistry. They are shown later in the season to be dating. Oscar is shown later in the episode in which their relationship is revealed to the office, firmly believing that Robert is gay."}],"images":[]},{"title":"Season 8","level":2,"content":[{"type":"paragraph","text":"Robert and Angela get married and have one child. But, it is implied later that the father is Dwight."}],"images":[]},{"title":"Season 9","level":2,"content":[{"type":"paragraph","text":"It is revealed that Robert Lipton is having an affair with Oscar Martinez but they break up. When the promos for the documentary start airing, Angela and Oscar call Robert to tell him that the documentary is going to out him as gay, but he comes out on his own terms during a press conference, also revealing that he had yet another lover. He and Angela got divorced sometime after the press conference."}],"images":[]},{"title":"Trivia","level":2,"content":[{"type":"list","elements":[{"text":"According to the episode Stairmageddon, Robert is apparently a Republican.","elements":[]}]}],"images":[]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":"WUPHF.com","elements":[]},{"text":"Classy Christmas, Part 2","elements":[]},{"text":"Fundraiser","elements":[]},{"text":"New Guys (voice)","elements":[]},{"text":"Here Comes Treble (Episode)","elements":[]},{"text":"Jury Duty","elements":[]},{"text":"Free Family Portrait Studio","elements":[]},{"text":"The Boat","elements":[]},{"text":"The Whale","elements":[]},{"text":"The Target (deleted scene)","elements":[]},{"text":"Vandalism","elements":[]},{"text":"Moving On","elements":[]},{"text":"Stairmageddon","elements":[]}]}],"images":[]}]}