{"sections":[{"title":"Robert California","level":1,"content":[{"type":"paragraph","text":"Robert California\/Bob Kazamakis played by James Spader, is the former Chief Executive Officer (CEO) of Sabre, having served from his appointment at the end of Season 7 to Sabre's liquidation in the episode Free Family Portrait Studio at the conclusion of Season 8. California is an intense, eccentric and immensely confident character known for his awkward obsessions and unorthodox management style."}],"images":[]},{"title":"Biography","level":2,"content":[{"type":"paragraph","text":"Before becoming CEO of Sabre, Robert California was involved in the refinery equipment, or the business of deep-sea drilling equipment, per the contents of his interview in the episode Search Committee."},{"type":"paragraph","text":"In the episode Christmas Wishes, Robert reveals he was married twice before marrying his wife Susan, whom he later divorces as well. Although it is unclear with whom, Robert has a child, Bert, whom he brought into the office for their Halloween party in Spooked."}],"images":[]},{"title":"Season 7","level":2,"content":[{"type":"paragraph","text":"Robert California first appears in the finale of Season 7, Search Committee. An applicant for the position of branch manager at the Scranton branch of Dunder Mifflin Paper Company, then a division of Sabre, California astonishes the search committee of Jim, Toby, and Gabe with his audacious statements and mysterious aura. Initially, the team asks Robert how his experience in refinery equipment will be compatible with leading a branch of a paper company, to which Robert replies that the ultimate object needed to be sold is respect. Robert continues his extended analogy by insisting \"there is no product. There is only sex. Everything is sex,\" a prelude to Robert's fascination with sexual behavior. Jim later admits \"he creeps me out... but he might be a genius\" in referring to California's obscure interview. Such a fascination lays the foundation for Robert ultimately being offered the job of branch manager in the first episode of the eighth season, The List."}],"images":[]},{"title":"Season 8","level":2,"content":[{"type":"paragraph","text":"In the opening episode of Season 8, The List, Robert California is offered the position of Scranton branch manager of Dunder Mifflin, then a division of Sabre. California \"took one look around\" the office and, underwhelmed, traveled to Tallahassee, where he convinced then-CEO Jo Bennett to vacate the job in his favor. As CEO, Robert selects Andy as branch manager."},{"type":"paragraph","text":"In the same episode, Erin discovers a list Robert keeps in his journal that includes the names of all Scranton employees, separated into two columns. The workers are unable to determine the reason for the list, but after Robert invites the names from one column to lunch, he admits the lunch group is a group of \"winners\" in his mind, and the remaining workers \"not winners,\" or perhaps even \"losers,\" to him. Robert uses the conflict to encourage the \"winners\" to \"prove him right,\" and the \"losers\" to \"prove him wrong,\" a flash of his progress-minded style."},{"type":"paragraph","text":"As the employees warm up to Robert and seek his respect, Andy decides to host a gathering in the eponymous episode Garden Party. There, Andy's attempt to impress his parents by inviting praise from the company's CEO backfires when Robert opines in a toast that \"the boss is irrelevant,\" insisting that himself and Andy \"produce nothing\" for the good of the company. Robert concludes by thanking the Scranton employees for giving him the \"easiest job in the universe,\" a sign of humility in an otherwise intimidating character."},{"type":"paragraph","text":"Robert brings his son Bert to the office's Halloween party in the episode Spooked, during which the employees' attempts to impress Robert are laid bare. When Robert assumes the childish decorations were put out for his son, Andy instructs Erin to find more frightening decorations. Robert's interactions with the office employees during the day reveal his philosophical underpinnings, suggesting Andy lacks any semblance of ambition in dressing up as a laborer on the \"day of fantasy\" and questioning whether Kelly is \"fulfilled in [her] life\" after doing a skeleton dance with Toby and Gabe. After asking of the worst fears of some of his employees, Robert ends the party by telling a bizarre story of a woman whose baby is strangled by a snake in the night, but whose baby turns out to be her estranged husband. \"How dare we,\" says Robert, \"let fear into our decision-making.\""},{"type":"paragraph","text":"When Andy decides to take some of the office staff to Gettysburg National Military Park to inspire a war-like mentality in business, Robert visits the remaining workers and invited them to present innovative business ideas. Robert is visibly disappointed in the lack of creativity from the staff, but attaches promise to Kevin's idea of placing the most enticing cookies in more visually appealing spots of the vending machines. Robert extends Kevin's idea to Dunder Mifflin pushing its most popular products, but when Robert attempts to will Kevin along in his idea, he realizes Kevin never truly meant for it to extend beyond simple food positioning. Robert's high expectations for his employees, and their persistent failure to meet them, is made clear in this episode.  In the episode Mrs. California, Robert suggests to his wife she pursue a job at the Scranton branch, but secretly Robert insists that Andy not offer her a position. Seeing an opportunity to meet Robert's expectations of him, Andy is persistent in highlighting the undesirable aspects of the branch, particularly the lack of positions open and the unflattering qualities of the workers. Robert, however, wishes to appear uncompromising for his wife, Susan, telling Andy he would be \"eternally grateful\" if his wife were hired. Andy, unable to read the complex emotions of Robert, decides to hire Susan in human resources. Robert then backs Andy into a corner and tells him to undo the hire, creating a strain on Andy that leads to him telling Susan about Robert's secret demands. Susan then reveals how difficult Robert can be, and hints that she will divorce him when she mistakenly assumes Andy has asked her out in consoling her. The discord between Robert and his wife spills over into the next episode, Christmas Wishes, when Robert reveals his wife has divorced him. His remorse over the separation doesn't seem to quell his mysterious ways, encouraging Erin to embrace her \"adventurous spirit\" to take a shot of alcohol. Robert's emotional side, rarely captured during the show, is partly revealed when he asks Erin to \"make [him] feel better\" as the two share relationship woes. Robert drives the intoxicated Erin home, compelling Andy to tail them and ensure Robert does nothing to Erin. Knowing Robert's almost seductive ways, Andy is relieved to watch Robert take Erin home and bid her goodnight."},{"type":"paragraph","text":"Robert reveals elements of his leadership style in the episode Trivia, when Dwight travels to Tallahassee to interview for a manager position. After Robert leaves his office and tasks Gabe with conducting the interview, Dwight insists on meeting with Robert at his apartment. There, Robert is unimpressed with Dwight's enthusiastic pitch and tells Dwight that the job, and the Florida location, are not right for him. Robert attempts to encourage Dwight by giving him an ancestral military medal, but Dwight declines Robert's \"flea market\" offer."},{"type":"paragraph","text":"Upon returning to Scranton in the episode Pool Party, Robert reveals his need to sell his 11,000 square foot house, intended to be his \"Playboy mansion,\" following his divorce. Kevin convinces Robert to invite the office staff for a pool party at the house before Robert vacates it. There, Robert takes some of the men of the workplace on a tour of the house, one of the series' best glimpses into Robert's emotional state. Each room embodied an unfulfilled dream for Robert: the parlor a place for setting down inhibitions, the kitchen for rabidly consuming meat to feed his superiority complex, the screening room for cinematic adventures. After the tour stoked Robert's longings of the past and the group returns to the pool room, Robert giddily concludes his dream of revelry in his house is coming true with the party. Robert then strips naked and tosses himself triumphantly into the pool."},{"type":"paragraph","text":"For the Last Day in Florida episode, Robert goes golfing in Tallahassee with Dwight, Jim, and Nellie after Dwight was named the vice-president of retail for Sabre. After the round, Robert confides in Jim and reveals he will veto the retail project and terminate the vice-president, admitting that Sabre products are cheap and cannot be marketed in a retail setting. Recognizing how the livelihood of his longtime colleague and friend is at risk, Jim stops Dwight from presenting the concept to Sabre executives, forcing Todd Packer to step in as Dwight's replacement. There, Robert unapologetically fires Packer, a display of his unemotional and unforgiving side."},{"type":"paragraph","text":"In a show of his dedication to competition and progress, Robert lets Nellie Bertram, the former president of retail for Sabre who had headed the Tallahassee store project, assume the branch manager position in Andy's unexplained absence. The episode, Get the Girl, foreshadows the decline of Robert's reputation, as the employees become increasingly disgruntled with Robert's gung-ho leadership style that seems to lack an awareness of consequences."},{"type":"paragraph","text":"Robert's reputation among his employees begins to decline in the Welcome Party episode. Intending to solidify Nellie's role as new manager while Andy is away winning back Erin, Robert suggests the office throw a party to welcome her. The office workers are clearly unhappy with Robert's decision to sign off on Nellie's move to Scranton, choosing to throw an ironic party featuring black decorations, distasteful carrot cake, homemade guitar music by Creed, and a magician, the purveyor of a hobby that Nellie despises after her divorce from Henry, her former husband who was himself a magician. Robert is disappointed by the offbeat party, sarcastically referring to it as a \"great party.\""},{"type":"paragraph","text":"After Andy returns with Erin in the episode Angry Andy, he and Nellie dispute who should carry on as manager. Robert attempts to convince Nellie that Andy is the rightful manager but is taken aback by Nellie's insistence on her keeping the job. Robert appears astonished at Nellie's refusal to listen to him, and he simply tells the two to work it out amongst themselves. In a camera interview, Robert tries to justify his decision by suggesting his sexual attraction to Nellie was threatening to affect his decision-making, but the power of Robert's voice has clearly tapered off. Robert tries to regain control of the situation by threatening to fire Andy after Andy launches an angry tirade against Nellie, but Andy refuses to accept Nellie as manager and Robert terminates Andy."},{"type":"paragraph","text":"In the next episode, Fundraiser, the office staff attends an animal welfare fundraiser sponsored by Angela's then-fiancee, Robert Lipton. Andy's appearance at the dinner bothers Robert, who suggests Andy and Erin go have a romantic dinner. Andy stays, however, and tries to one-up Robert's speech in favor of the fundraiser by agreeing to adopt all twelve dogs on hand at the event. Robert, sensing Andy's one-upsmanship, tries to dismiss the offer as overly generous, but Andy persists in order to prove Robert wrong about Andy's ambition and sacrifice."},{"type":"paragraph","text":"Robert reaches his decline in the episode Turf War, when it is shown that Robert closed the Binghamton branch of Dunder Mifflin in a drunken fling. Robert defends his decision, but the discord in the office following the Binghamton closure, particularly Dwight and Jim's scrambling to secure a former Binghamton client, becomes apparent, especially to Andy. From there, Andy is inspired to get his job back the hard way and successfully convinces the client to sign on with \"Big Red Paper Company,\" a fictitious brand Andy conjured in making the sale. Both Dwight and Jim and Harry Jannerone, a Syracuse branch salesman pursuing the same client, are flustered at the bizarre turn of events, not knowing it was Andy who made the sale. In a conversation after their collective defeat, Harry tells the other two that Robert will \"run [the] company into the ground,\" much to the surprise of the pair. A secondary storyline develops in the episode when Andy visits the home of David Wallace, the former Chief Financial Officer (CFO) of Dunder Mifflin, where he hints at David being able to invest in the company. The downfall of Sabre, and Robert in particular, is made apparent.   In the finale of Season 8, Free Family Portrait Studio, David Wallace visits the office and reveals he has bought out Dunder Mifflin upon Andy's invitation. At the same time, David reveals that not only will Sabre no longer own Dunder Mifflin, Sabre will liquidate its assets and cease to exist as a company. The presence of Robert California in the office makes for an awkward encounter with David, but Robert deems his loss of employment \"for the better\" and chalks up his lack of remorse to the \"corporate mess\" Sabre embodied."},{"type":"paragraph","text":"The newfound optimism of Robert begins with his referring to himself as Bob Kazamakis, presumably an alias of his. David reveals that Robert will make a significant sum of money from the liquidation, which Robert intends on using to travel the world, mostly Europe, to \"mentor\" young women, particularly gymnasts. The employees are visibly disappointed and confused as to why David has chosen to match funds for Robert's three-year escapade. Robert exits the show by kissing Andy and triumphantly declaring \"it's been a great year.\""}],"images":[{"src":"https:\/\/vignette.wikia.nocookie.net\/theoffice\/images\/1\/19\/Robert_California_2.jpg\/revision\/latest\/scale-to-width-down\/160?cb=20120910023734","caption":"Robert California"},{"src":"https:\/\/vignette.wikia.nocookie.net\/theoffice\/images\/f\/f9\/Robert_California_and_Ryan_Howard.JPG\/revision\/latest\/scale-to-width-down\/285?cb=20170829194224","caption":"Robert California and Ryan Howard"},{"src":"https:\/\/vignette.wikia.nocookie.net\/theoffice\/images\/4\/4a\/Robert_California_%26_David_Wallace_2.png\/revision\/latest\/scale-to-width-down\/300?cb=20120910023337","caption":"David Wallace & Robert California"}]},{"title":"Trivia","level":2,"content":[{"type":"list","elements":[{"text":"Robert hates ties, noted through his comment of how he feels \"strangled\" like in an \"erotic asphyxiation chamber\" as he dressed for the animal welfare event in Fundraiser.","elements":[]},{"text":"Robert enjoys playing squash, as evidenced when Jim visits Robert at a squash court and plays a match with him in an attempt to delete an incriminating e-mail sent by a \"doomsday device\" installed by Dwight in the episode Doomsday.","elements":[]},{"text":"In the episode Pam's Replacement, Robert is revealed to have a significant talent with the harmonica, having invited several of his musically inclined friends to join in a warehouse jam session.","elements":[]}]}],"images":[]},{"title":"Quotes","level":2,"content":[{"type":"list","elements":[{"text":"\"There's something about an underdog that really inspires the unexceptional.\"","elements":[]},{"text":"\"Fear plays an interesting role in our lives. How dare we let it motivate us? How dare we let it into our decision making, into our livelihoods, into our relationships? It’s funny isn’t it, we take a day a year to dress up in costume and celebrate fear.\"","elements":[]},{"text":"\"Florida is America's basement. It's wet, it's filled with mold, the strange insects... alligators... alligators are dinosaurs, Dwight! You knew that, right?\"","elements":[]},{"text":"\"I will not be blackmailed by some ineffectual, privileged, effete, soft-penis debutante. You wanna start a street fight with me, bring it on, but you're gonna be surprised by how ugly it gets. You don't even know my real name. I'm the f***ing Lizard King.\"","elements":[]},{"text":"\"Oh yes. How hilarious it is to laugh at clowns, the painted jesters of the dying circus industry. Very funny, Jim. I get it.\"","elements":[]},{"text":"\"I am never uncomfortable.\"","elements":[]},{"text":"\"It's not a party if you don't do something that scares you.\"","elements":[]},{"text":"\"There is no such thing as a product. Don't ever think there is. There is only sex. Everything is sex.\"","elements":[]}]}],"images":[]}]}