{"sections":[{"title":"Rolf Ahl","level":1,"content":[{"type":"paragraph","text":"Rolf Ahl is a fictional character played by James Urbaniak in the television series The Office."}],"images":[]},{"title":"Season 5","level":2,"content":[{"type":"paragraph","text":"Rolf is one of Dwight Schrute's best friends, and Dwight brings him to the Dunder Mifflin Company Picnic. He has no problem using foul language, as he tells Charles Miner and David Wallace that Scranton will, \"Piss all over your faces,\" and tells Angela that she is a \"tramp\" and a \"whore.\" Dwight met Rolf in a shoe store where he heard Rolf ask for a shoe that would \"increase his speed and not leave any tracks.\""}],"images":[{"src":"https:\/\/vignette.wikia.nocookie.net\/theoffice\/images\/7\/70\/RolfCompanyPicnic.png\/revision\/latest\/scale-to-width-down\/174?cb=20100907222926","caption":"Rolf at the company picnic"}]},{"title":"Season 6","level":2,"content":[{"type":"paragraph","text":"Rolf later appears and helps Dwight destroy Pam and Jim's kitchen, with his new girlfriend, Annie."}],"images":[]},{"title":"Season 9","level":2,"content":[{"type":"paragraph","text":"Rolf is one of the candidates that Dwight brings in to work as a junior salesman at the company. Clark tries to make friendly small talk with him when he notices him staring intensly at him. Rolf believes he will definitely get the job. When Dwight shows him Jim's desk where he will work, Rolf tells Pam that he listens to music without earbuds. When Dwight interviews him, he explains how Rolf is cool and calm under pressure and the cameras show him yelling at a rabbit on a leash. During the interview, Rolf appears quite cocky and asks Dwight if he is qualified to interview him. He then turns the interview around so it seems like Rolf is the one interviewing Dwight. He then leaves and Dwight admits he is not sure about Rolf (Junior Salesman)."},{"type":"paragraph","text":"He is also in the background during the bar scene of Dwight's bachelor party in the final episode."}],"images":[]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":"Company Picnic","elements":[]},{"text":"The Delivery","elements":[]},{"text":"Junior Salesman","elements":[]},{"text":"Finale","elements":[]}]}],"images":[]}]}