{"sections":[{"title":"Ryan Howard","level":1,"content":[{"type":"paragraph","text":"Ryan Bailey Howard (born May 5, 1979) is a fictional character played by B.J. Novak in the television series The Office. He is based on Ricky Howard and Neil Godwin in the UK version of The Office. "}],"images":[]},{"title":"Character Biography","level":2,"content":[{"type":"paragraph","text":"Ryan Howard, as the newest hire in the Scranton branch was initially extremely confused as to how the office worked and often acts as the straight man in his role as the temp. He is often mild mannered and meek in comparison to the louder personalities in the Office. Similar to Jim, Ryan has a poor outlook on Michael's management style and doesn't intend to work at Dunder Mifflin long term. Despite this, he's shown to be quite ambitious---going to school to receive an MBA and showing his interest in learning sales techniques from the senior staff. He eventually transitions to sales in Season 3 (though he ends up never making a sale) and in Season 4 takes on Jan's job as Vice President of Sales. Throughout the series, it becomes clear that he's grown weary of the antics of his coworkers and life in Dunder Mifflin. After his promotion to VP, his ego swells and he develops an elitist, \"New Yorker\" personality. He's also known for his volatile, on\/off relationship with Kelly."}],"images":[]},{"title":"Season 1","level":2,"content":[{"type":"paragraph","text":"In \"Pilot,\" he starts his job as a temp at Dunder Mifflin Scranton. He is shy throughout the 6 episode season."}],"images":[]},{"title":"Season 2","level":2,"content":[{"type":"paragraph","text":"Ryan asks Michael to review him for his report he must send back to the Temp agency. Michael mistakes this as Ryan wishing to become Michael's \"apprentice\" and he attempts to school Ryan in the art of business, however Michael's advice is mostly inaccurate or questionable. Dwight gets jealous when he sees Ryan and Michael spending so much time together. During the fire, the office staff go to stand in the parking lot. Michael tries to school Ryan in business but Ryan proves to know more as he is attending business school. Dwight later reveals to the staff that Ryan had started the fire by burning a cheesy pita. Dwight then sings a song parody, \"Ryan started the fire...\" Ryan appears quite humiliated by this and tells the cameras that he can't believe he started the fire (The Fire)."},{"type":"paragraph","text":"While Ryan does not physically appear in this episode except for a moment where he tells Oscar his costume dress is stuck, it is referenced that he is somewhere in the office as Devon announces to the office a list of people he would welcome joining him at Poor Richards upon his firing. He refers to Ryan as \"the temp\" in the list (Halloween)."}],"images":[]},{"title":"Season 3","level":2,"content":[{"type":"paragraph","text":"Most of Ryan’s shyness has diminished and he's a little more assertive. Ryan tries to make the best of a bad situation by accepting a promotion to Jr. sales rep, while still secretly planning his escape by completing his business degree."},{"type":"paragraph","text":"Ryan seems to be happy about the idea of the Scranton Branch closing since he now has an excuse to end his relationship with Kelly, and he is confident that Michael will write a letter of recommendation on his behalf to be one of the employees retained and transferred to Stamford. However, the Scranton branch stays open, and Ryan and Kelly's relationship drags on. The relationship eventually ends however, when Ryan is promoted to Corporate Manager (replacing Jan Levinson), making the former temp Michael's boss."},{"type":"paragraph","text":"As a sales representative, Ryan tries eagerly to develop his sales skills but fails miserably at every opportunity. In Initiation, the client reportedly said that he did not like Ryan to his face. In Traveling Salesmen, Ryan is unable to say anything beyond \"Hi.\""},{"type":"paragraph","text":"In \"Grief Counseling\" Ryan somewhat picks up Jim's role of being the office funny man by telling Michael during the grief counseling session, as part of a prank with Pam, that he had a cousin named Mufasa who was trampled by a herd of wildebeests. It is shown that Pam is very pleased Ryan's actions. He later tells the camera when he finds out about the bird funeral that Michael is making the office attend that when he was 5 and he had a funeral for his fish he thought that he was a little old for it."},{"type":"paragraph","text":"In \"Initiation\" Ryan goes on a sales call with Dwight despite his better instinct. At the beginning of the episode Dwight is shown trying to fool Ryan with a riddle but Ryan answers all of them correctly. Ryan also appears slightly worried about going on a sales call with Dwight. Ryan is very angry when Dwight takes him to his beet farm and tries to initiate him. We find out that Ryan was in a frat in college. Ryan goes along with most of what Dwight asks him to do until Dwight tells him to wrestle his cousin, Mose, and get in a coffin. Ryan then puts his foot down. He then finds out that Dwight forgot about the sales call. They rush to the sale and while we do not see it we know it does not go well. When leaving the building Ryan says \"They did not like me\" and Dwight responds \"They did not but they didn't have to say it to your face\". Ryan then throws eggs at the sales office exciting Dwight. Back at the office we see that Kelly is worried about Ryan because he has been gone for so long. Ryan and Dwight then go to a bar where Ryan chugs a drink with ease. Dwight starts to chant \"Temp, Temp, Temp\" and then stops and chants \"Ryan, Ryan, Ryan\" symbolizing a friendship being born. However this friendship seems to be short lived and we never see Dwight and Ryan interact as friends again in the series. Except for Jim's reign as co-manager when they both conspired together against Jim."},{"type":"paragraph","text":"By the end of the season, Ryan decides to take his lemons and make lemonade, interviewing for and obtaining a senior management position at Dunder Mifflin Corporate."}],"images":[]},{"title":"Season 4","level":2,"content":[{"type":"paragraph","text":"Ryan is now Vice President of Regional Sales and Michael's direct superior. He has overseen a bottom-to-top streamlining of the entire company to help compete with other businesses. Among these is a new website called Dunder Mifflin Infinity."},{"type":"paragraph","text":"Ryan is trying to be a \"fun boss\", as shown when he arrives to Scranton and energetically says \"Hey, everyone! What's happening? How's my favorite branch doing?\""},{"type":"paragraph","text":"Ryan speaks in business cliches, talking about \"convergence,\" \"viral marketing\" and \"takin' it to the streets.\" He also uses other business platitudes, like responding to suggestions with empty phrases like \"I can tell you thought about this a lot\" and \"That is a great observation.\""},{"type":"paragraph","text":"Ryan is enamored of his new life in New York City, bragging about late night clubbing, meeting beautiful women, and getting a sandwich at 2am. He has let his meteoric rise go to his head, having bought a fancy sports car and fallen into cocaine use. Belying his attempt to maintain a hip facade, Ryan's apartment is a tiny unkempt studio. In the episode \"Dunder Mifflin Infinity\", he unsuccessfully tries to flirt and ask out Pam. When Pam replies that she's dating Jim, he is humiliated and slightly taken aback. Jim later says in a talking head interview, \"Well, I guess he (Ryan) can't get ANY girl he wants.\""},{"type":"paragraph","text":"Ryan struggles to execute on his ambitious plans, but his business efforts have met with disaster. The social networking section of Dunder Mifflin Infinity has been infiltrated by sexual predators, and the online paper sales are such a disappointment that he made the Scranton staff come to work on a Saturday to falsify data, entering their own sales into the computer system as an accounting trick to make the Web site appear more successful than it really is."},{"type":"paragraph","text":"It's also alluded to later in the season that Ryan's fast paced life has led him to a drug addiction, most likely cocaine. This is confirmed several times in \"Night Out.\" When Michael and Dwight visit Ryan at a nightclub in New York, Ryan is clearly high while rambling on anxiously, and when he's injured while dancing, Ryan's friend exclaims \"Don't take him to a hospital!\""},{"type":"paragraph","text":"Ryan sees Jim as his rival, and in the episode \"Did I Stutter?\" actively takes steps to discredit him with the intent of possibly firing him. However, his attempts backfire and Ryan is eventually arrested for fraud."}],"images":[]},{"title":"Season 5","level":2,"content":[{"type":"paragraph","text":"After getting arrested and promptly fired, Michael brings back Ryan and gives him his old job as a temp. Ryan pledges to climb back up the ladder and attempts to make amends with the co-workers who he alienated when he was at Corporate."},{"type":"paragraph","text":"Ryan convinces Kelly to dump Darryl (which Darryl accepts quite easily) and gets back together with her (in \"Business Trip\") . This doesn't last long as Ryan suddenly announces his intentions to take a break and go to Thailand."},{"type":"paragraph","text":"Ryan reappears in the episode \"Dream Team\", with bleached hair, working at a bowling alley. Michael convinces Ryan to join him and Pam at the Michael Scott Paper Company. Right before quitting, Ryan steals a pair of the rental bowling shoes, presumably to \"stick it to the man\". Initially, Pam and Ryan bicker back and forth when the Michael Scott Paper Company begins, but the situation gets better when the company begins to make sales and take clients away from Dunder Mifflin. Pam and Ryan even develop a friendship which continues throughout the series, even though Pam is often surprised of disapproving of some of Ryans ideas."},{"type":"paragraph","text":"Ryan developed the financial model behind the Michael Scott Paper Company, according to which the company would be profitable with sufficient volume. A visit to a financial consultant in Broke exposes Ryan's model as flawed, not taking into account that expenses will increase as the company grows. As Michael, Pam, and Ryan ponder their future, Ryan admits that he went to Fort Lauderdale and not Thailand. Michael manages to negotiate a deal that would end the Michael Scott Paper Company and return Dunder Mifflin's clients (Dunder Mifflin unaware that their new rival is broke) and in return give Michael, Ryan and Pam their jobs back. After a tense feud amongst the Sales Team, Ryan loses his job as a Salesman and is made a temp again."}],"images":[]},{"title":"Season 6","level":2,"content":[{"type":"paragraph","text":"Ryan is once again a temp and seems to be in an on-off relationship with Kelly once again and works in the annex with her and Toby."},{"type":"paragraph","text":"In the episode \"Gossip\", after Jim announces that Pam is pregnant, Ryan yells out, \"Don't get it vaccinated.\""},{"type":"paragraph","text":"In the episode \"The Meeting\", he tells Pam that he will go to her wedding."},{"type":"paragraph","text":"In the episode \"The Promotion\", Ryan tells Pam that she could either have one-hundred dollars now or five-thousand dollars later as a wedding gift. After great resistance, Pam takes the five-thousand dollars that Ryan claims he will have in one year's time. Pam reluctantly gives Ryan money to put towards a basketball betting scheme as part of the deal, because Ryan claims to be able to determine the winner of any NCAA basketball game using an algorithm."},{"type":"paragraph","text":"In the episode \"Niagara\", Ryan comes to Pam and Jim's wedding and is seen dancing with Kelly at an office party in Andy's room. Later in the same episode, he questions Jim and Pam after they left for a while to be married on the \"Maid of the Mist\" in Niagara Falls."},{"type":"paragraph","text":"In the episode \"The Lover\", after Pam says sarcastically that Michael should be allowed to date everyone's mom, Ryan yells to her, \"That's my mom you're talking about.\""},{"type":"paragraph","text":"In the episode \"Double Date\", Ryan seemed to be getting into photography and showed Erin pictures that he took, telling her about how he takes pictures of places where beauty is unlikely. He then shows her a nude picture of Kelly working at her desk in the annex, and Ryan tells her that he is working on a photography series called \"Exposure in the Workplace.\""},{"type":"paragraph","text":"In the episode, \"Shareholder Meeting\", a lazy Ryan is disciplined by Jim. When Ryan refuses to do any work, Jim moves his desk into the closet in the kitchen, and Ryan regrets and apologizes to Jim, but Jim still puts him in the closet while the office watches."},{"type":"paragraph","text":"In \"Scott's Tots\", Ryan joins Dwight in his plan to overthrow Jim."},{"type":"paragraph","text":"In \"Secret Santa\", Ryan gets Toby for Secret Santa, and is pinned down by Michael, who wants Ryan to sit on his lap."},{"type":"paragraph","text":"In this season, Ryan appears to dress in a different style or theme of clothing in each episode."}],"images":[]},{"title":"Season 7","level":2,"content":[{"type":"paragraph","text":"In \"Nepotism\", Ryan advertises his website WUPHF in the Lip Dub the Scranton Branch was making. In \"Counseling\", he helps Dwight avenge the shopkeeper who snubbed him at the mall by declaring, \"America is one big mall!\" In \"Andy's Play\", he shows off his iPad to Kelly, when Kelly becomes bored in the play. In \"The Sting\", he helps Jim and Dwight spy on Danny. When they try to hatch a plan, Jim tells Ryan he is a \"hot new executive\" and Ryan tells them he wants to work at Google.  In \"Costume Contest\" he dresses as Justin Bieber in hopes to win the Scranton book of savings worth $15,000 in savings. At the he costume contest, Ryan reveals that he himself voted for Oscar, and declares himself to be a Nader kind of guy (i.e., one who votes for unlikely candidates)."},{"type":"paragraph","text":"In \"Todd Packer\" Ryan makes a comment to make himself sound intelligent when discussing firing Todd however when asked to explain it, Ryan clearly doesn't know. Ryan later shows up to the conference room to practice with his band. Ryan later tells Kelly that she overreacts sometimes when Kelly begs Kevin not to accept Todd's apology saying that Ryan makes fake apologies to her all the time."},{"type":"paragraph","text":"Ryan shows more immoral traits in \"Garage Sale\", when he sells jars of his mother's homemade Pesto sauce, and tells the camera that his mother has never wanted to sell her sauce, as she intended it to just be for family. Ryan, however, tricked her into making about a hundred bottles worth (by lying about needing them for a \"pesto-party\" he was throwing for all his friends), and is now selling the jars for his own profits, as well as plastering pictures of Phyllis and Oscar on the jars without their permission (since Phyllis had that \"mom look\" he wanted, and he used Oscar's picture on his Mother's homemade jars of Salsa). Dwight then cons Ryan into giving him a box worth of the Pesto by trading him Stanley's old photo album (by commenting that only people like James Franco would want something like that sitting on their bookshelf). However, Ryan is also in the group that helps Michael think of a good way to propose to Holly. When Michael does propose to Holly, he has some employees jokingly ask Holly to marry them. He states that Ryan was the only one he was concerned about."},{"type":"paragraph","text":"In \"Training Day\", Ryan thinks that new manager Deangelo Vickers having a barber come to the office to shave him is \"badass\" and \"hardcore\". In \"Michael's Last Dundies\", he is shown to be hurt that Danny Cordray broke his streak of winning the \"Hottest in the Office\" award, although he tries to hide it. Ryan's contribution to the office workers' version of \"Season of Love\" is that Michael helped him get off drugs."},{"type":"paragraph","text":"In \"Goodbye, Michael\", Michael gives Ryan his St. Pauli Girl beer sign, but only after making sure he isn't prone to seizures. Ryan seems to genuinely appreciate the gift, and he thanks Michael, only for the regional manager to tell him to thank the St. Pauli Girl. In producer's cut of the episode, Ryan has a talking head interview where he claims that Michael has an interesting way of saying words."},{"type":"paragraph","text":"In \"The Inner Circle\", Ryan lies to Deangelo about his job at the Scranton Branch by strongly implying he's the Customer Service supervisor (Kelly's boss). While Kelly is angry, she goes along with it in exchange for Ryan being a dutiful boyfriend around the clock. However, Kelly soon exposes Ryan as a fraud after reprimanding her severely about her paycheck and making her out as a money grubber in front of Deangelo. However, because Deangelo prefers Ryan over Kelly, he appoints him as her official supervisor (until his accident hours later)."},{"type":"paragraph","text":"In \"Dwight K. Schrute, (Acting) Manager\", after Dwight accidentally misfires a gun in the office and Toby is filling out the gun violence accident form, the HR rep asks the staff if they felt like this was a terrorist incident. Ryan, who is clearly enjoying Dwight's situation, openly says that he felt terrorized."},{"type":"paragraph","text":"In \"Search Committee\", Ryan reveals to the camera that he, like Oscar and Pam, also believes Angela's boyfriend Robert (the State Senator) is gay, because he \"liked\" Ryan's Facebook photos at 3:00 AM. Later, when Stanley harshly berates Jim for not taking the search for a new manager seriously and informs him that the new boss will probably be his last, Ryan comments in mock seriousness that he believes Stanley will live forever. After Stanley leaves the kitchen, Ryan gives Jim the advice to take a day off from the whole \"Jim shtick\" and to try caring about something for once. He even addresses him as \"James\", before closing the door to his office\/closet. During a staff debate over who should be hired for the manager position, Ryan states he wants an outsider. While Jim thinks he is referring to the applicants outside of the office, Ryan says he meant an \"outsider\" as someone who is on the margins of society, and suggests a homeless person. When Pam challenges him to say he truly wants a homeless person as his boss, he asks who her ideal candidate would be, snidely suggesting Rachel Ray or \"the ladies of The View\". In a talking-head interview, Ryan laments that he got away with everything while Michael was his boss and it was not good for him. He says he wants guidance and leadership, but does not want the new manager to boss him around. He states he wants the new hire to lead him, but only when he's in the mood \"to be led\". Ryan also tells Gabe to \"take care\" when Gabe announces to the office that he's been reassigned to Sabre headquarters in Florida."}],"images":[{"src":"https:\/\/vignette.wikia.nocookie.net\/theoffice\/images\/a\/a0\/Theofficeryan.jpg\/revision\/latest\/scale-to-width-down\/238?cb=20111119155622","caption":"Ryan as Justin Bieber."}]},{"title":"Season 8","level":2,"content":[{"type":"paragraph","text":"In \"The List\", Ryan is on the \"Losers\" of new CEO Robert California's list. While the \"Winners\" are dining with Robert California, he says that everyone should be happy since he's in their group."},{"type":"paragraph","text":"In \"Lotto\", he approaches Pam, who is temporarily back at the receptionist's desk since Erin is working in the warehouse. He comments that he likes seeing her back at her old position before he asks her to make 10 copies, which she refuses to do. He asks what she is doing and leans over the counter to see that she is buying lottery tickets. He adds that everyone wants to be rich, and yet nobody wants to work for it. Pam then says that he came in to work at 10:30, and Ryan ignores her comment while walking away."},{"type":"paragraph","text":"In \"Garden Party\", Ryan makes a toast to \"the troops... all the troops... both sides\". When Kelly tries to get him to lend her his coat, he reminds that he told her she would need to bring one herself."},{"type":"paragraph","text":"In \"Spooked\", he dresses up as Jesse Pinkman, a character from the popular AMC drama Breaking Bad. He is briefly seen telling Kelly about the show."},{"type":"paragraph","text":"In \"Pam's Replacement\", he asks Jim if Pam's replacement, Kathy, is single."},{"type":"paragraph","text":"In \"Gettysburg\", he decides to stay at the office while Andy and some of the other employees are at Gettysburg. He tries to impress Robert California with some ideas for the company, but is outshined by Kevin."},{"type":"paragraph","text":"In \"Mrs. California\", Ryan tells Susan California and his co-workers his 'Dream for a Wish' idea. Susan refers to him as Brian, and in a talking head interview he calls her a b*tch."},{"type":"paragraph","text":"In \"Christmas Wishes\", Ryan and Kelly give a pregnant Angela a shirt that reads 'Ask, then touch.' He is also seen dancing with Kelly a number of times during this episode."},{"type":"paragraph","text":"In \"Welcome Party\", Darryl reveals that Ryan's nickname in the warehouse was \"Douchebag\". An annoyed Ryan tells him that its not a code name but an insult."},{"type":"paragraph","text":"In \"Angry Andy\", Ryan becomes jealous when Pam sets Kelly up with another guy. Ryan then tries to get her back through a number of immature and ridiculous means."},{"type":"paragraph","text":"In \"Free Family Portrait Studio\", Ryan takes a picture of himself with a sign that begs for Kelly to come back. However, he is later seen taking a picture with a sign that asks a girl he saw in a coffee shop to call him."}],"images":[]},{"title":"Season 9","level":2,"content":[{"type":"paragraph","text":"In \"New Guys\", after Kelly gets engaged to Ravi, they both move to Ohio after Ravi accepts a job at Miami University. Ryan moves there shortly after however claims that his reason for going there is unrelated to going to watch over Kelly. The cameras show him at a bus stop with his luggage however he tells them he is moving there as its a \"great college town\". In \"Promos\", Ryan is mentioned by Pam after Jim talks about Jim's company having a meeting with him, however has been confused with the American baseball star Ryan Howard."},{"type":"paragraph","text":"In \"Finale\" Ryan attends Dwight and Angela's wedding with his baby which he claims is the son of his ex-girlfriend who abandoned him. Ryan meets Kelly and Ravi and when Kelly believes that the baby, named Drake, is named after the hip hop artist, Ryan tells her that his name is a mix between Drew and Blake. Ryan and Kelly can be seen looking at each other during the ceremony. Ryan later gives Drake to Ravi and tells him that he has a rash. When Ravi goes to treat him he seems suspicious of Ryan not wanting to come and to stay with Kelly however Kelly convinces him to leave. Ryan then reveals that he let Drake suck on a strawberry to which he is allergic to. Kelly finds this horrible act romantic and the two begin to kiss. Ryan and Kelly are last seen running into the sunset to start a new life together, leaving Ravi and Drake behind, with Ryan ironically announcing \"I think I've finally mastered commitment!\"."}],"images":[]},{"title":"Central Episodes","level":2,"content":[{"type":"list","elements":[{"text":"The Fire","elements":[]},{"text":"Initiation","elements":[]},{"text":"Diwali","elements":[]},{"text":"Business School","elements":[]},{"text":"Dunder Mifflin Infinity","elements":[]},{"text":"Night Out","elements":[]},{"text":"Dream Team","elements":[]},{"text":"Michael Scott Paper Company","elements":[]},{"text":"Heavy Competition","elements":[]},{"text":"Broke","elements":[]},{"text":"Casual Friday","elements":[]},{"text":"Manager and Salesman","elements":[]},{"text":"WUPHF.com","elements":[]},{"text":"Pool Party","elements":[]},{"text":"Tallahassee","elements":[]},{"text":"After Hours","elements":[]},{"text":"Test the Store","elements":[]},{"text":"Angry Andy","elements":[]}]}],"images":[]},{"title":"Trivia","level":2,"content":[{"type":"list","elements":[{"text":"Ryan shares his name with Ryan Howard, first baseman of the Philadelphia Phillies. The similarity was intentional, as at the time, the baseball player was a slugging first baseman for the Scranton\/Wilkes-Barre Red Barons, the Phillies' Triple-A affiliate at the time. The character Ryan Howard tries to exploit this coincidence in the episode Night Out, telling the club bouncer, \"Check again. Ryan Howard, the baseball player.\" - though the two look absolutely nothing alike (Howard is 6'4\", 255 lbs. and African-American, Novak is 5'9\", 130 lbs and Jewish); this also might not be a wise name-drop in New York, given the fierce rivalry between the Phillies and the New York Mets. Five years later, the \"real\" Ryan Howard would appear in Promos.","elements":[]},{"text":"In the episode Christmas Party, Ryan was a member of the Party Planning Committee. He has not been a member since except in a deleted scene from Take Your Daughter to Work Day, and Diwali","elements":[]},{"text":"Ryan considers Scranton his hometown. (Launch Party)","elements":[]},{"text":"In Night Out it is implied that Ryan has taken to using cocaine. This is evidenced by his hyper-activity, drastic personality change(he was glad to see Michael and Dwight), frequent use of the washroom and twitching fingers. Additionally, his co-worker Troy, when leaving the club, tells Dwight and Michael not to take Ryan to the hospital. At his apartment, Ryan asks Michael and Dwight what he should do if one of his friends has a drug problem. This is again referenced in the episode Did I Stutter?, when Ryan arrives at the Scranton Branch, he checks his nose in his car's make-up mirror and again in Michael's Last Dundies, where his part of the lyrics say \"you helped me get off drugs\".","elements":[]},{"text":"B.J. Novak notes that it is the incompetent people who use the most jargon. Ryan as an executive \"is so far over his head, and he wears it so poorly.\" Novak concedes that he personally acts the most like a jerk when he's not confident, and he brings that trait to Ryan.","elements":[]},{"text":"Ryan returns in Weight Loss, and explains he helps the community. He writes down a \"list\" of people who he now hates, such as Jim and Kevin.","elements":[]},{"text":"In Diwali it is implied that Kelly's sisters think Ryan looks like Zach Braff.","elements":[]},{"text":"One of Ryan's quotes in the beginning of The Fire was, \"I don't want to be 'a guy' here. Like Stanley's the crossword-puzzle guy, and Angela has cats. I don't want to have a thing here. You know, I don't want to be the 'something' guy.\" As it turns out later in the episode, he had started the fire in the office building, and is now named the \"Fire Guy\" by Dwight and Kevin.","elements":[]},{"text":"Ryan's birthday is also the same day that Michael holds Meredith's birthday party in The Alliance, May 5","elements":[]},{"text":"Ryan has asked out 2 out of 3 of Jim's girlfriend's. He asks both Pam (during Dunder Mifflin Infinity) and Karen (by E-mail, mentioned in Women's Appreciation - though in Dunder Mifflin Infinity he tells Kelly that she asked him out), as well as when Jim breaks up with Katy, Ryan asks if he could call her.","elements":[]},{"text":"Ryan has been yelled at by Stanley twice for flirting with Stanley's daughter (\"Take Your Daughter to Work Day\" and \"Cocktails,\" deleted scene)","elements":[]},{"text":"Ryan and Kelly had an on and off relationship but get back together in series finale.","elements":[]},{"text":"Ryan plays the saxophone, most likely alto. (Todd Packer)","elements":[]},{"text":"Ryan shares his last name with his British counterpart Ricky Howard.","elements":[]}]}],"images":[]},{"title":"Recurring jokes","level":2,"content":[{"type":"list","elements":[{"text":"Ryan started a fire .","elements":[{"text":"In \"Email Surveillance\", Kevin cautions Ryan from getting too close to the barbecue. \"Not so fast... Fire Guy.\" While only said once in the aired version, in a deleted scene, Kevin obnoxiously takes the joke much farther.","elements":[]},{"text":"In Business School, Michael tells the class, \"And he started a fire trying to make a cheesy pita.\"","elements":[]},{"text":"In Dunder Mifflin Infinity, Michael kids, \"Don't start any fires, Ryan.\" Kevin and Andy join in the taunting. Kevin quickly reminds Andy that he was not present for that incident.","elements":[]},{"text":"In Launch Party, Dwight, mockingly pretending to be Ryan, says, \"I started a fire with my cheese pita.\" Michael joins in the taunting.","elements":[]},{"text":"In Goodbye, Toby*, Jim complains that all Ryan ever did was start a fire and grow a beard.","elements":[]},{"text":"In Weight Loss*, Kevin calls Ryan Fire-d Guy.","elements":[]},{"text":"In Business Ethics*, Kevin calls Ryan Hire-d Guy.","elements":[]}]},{"text":"In his time as a sales representative, Ryan has never made a sale.","elements":[{"text":"In the episode \"Initiation\", Dwight mentions that Ryan hasn't made a sale yet. In the episode, Ryan goes on a sales call with Dwight and fails miserably. The client said that he didn't like Ryan. Dwight adds, \"They didn't have to say it to your face.\"","elements":[]},{"text":"In the episode \"Traveling Salesmen\", Ryan goes on a sales call with Stanley, and Ryan can only manage to say, \"Hi.\"","elements":[]},{"text":"In the episode \"Business School\", Michael tells the class, \"Ryan has never made a sale.\"","elements":[]},{"text":"In the episode \"Product Recall\", Michael rejects Ryan's offer of help. \"No, sweet cheeks. We need someone who's actually made a sale.\"","elements":[]},{"text":"In the episode \"Local Ad\", Ryan admits that he was a bad salesman. \"Look, I wasn't good at sales, right?\"","elements":[]}]},{"text":"Ryan repeatedly attempts (unsuccessfully) to date whoever Jim is dating.","elements":[{"text":"In \"Email Surveillance\", Ryan asks Jim if Katy was coming to the house party, but Jim responds that they hadn't spoken in a while. Ryan then asks if he can call Katy, which Jim rejects.","elements":[]},{"text":"In \"Women's Appreciation\", Ryan sheepishly admits to Jim that he'd asked Karen out, via e-mail, in the past. Jim replies that Karen had already read it to him, and that \"she liked him as a friend.\"","elements":[]},{"text":"In \"Dunder Mifflin Infinity\", Ryan asks Pam to go out to dinner. She rejects him and lets him know that she's dating Jim.","elements":[]}]}]}],"images":[]},{"title":"Appearances","level":2,"content":[{"type":"paragraph","text":"Ryan appears and has lines in all episodes with the following exceptions:"},{"type":"list","elements":[{"text":"Back From Vacation - speaks only in a deleted scene","elements":[]},{"text":"Phyllis' Wedding - has no lines","elements":[]},{"text":"Branch Wars - does not appear","elements":[]},{"text":"Survivor Man - speaks only in a deleted scene","elements":[]},{"text":"Dinner Party - does not appear","elements":[]},{"text":"Chair Model - does not appear","elements":[]},{"text":"The Surplus through Two Weeks - does not appear","elements":[]},{"text":"Sex Ed - speaks only in a deleted scene","elements":[]},{"text":"Roy's Wedding through A.A.R.M. - does not appear","elements":[]}]}],"images":[]}]}