{"sections":[{"title":"Sadiq","level":1,"content":[{"type":"paragraph","text":"Sadiq is a fictional character played by Omi Vaidya in the television series The Office. He was the seventh IT guy before Dunder Mifflin is acquired by Sabre and he was replaced by Nick."}],"images":[]},{"title":"Season 2","level":2,"content":[{"type":"paragraph","text":"Sadiq is an IT Technician from Pittsburgh. He is first introduced in the episode Email Surveillance when he is called in to install an e-mail surveillance program onto Michael's computer. Before entering the building, Michael spots Sadiq through his window and concludes in a panic that he is a terrorist. Later, he is invited to Jim's party, much to the chagrin of Michael."}],"images":[]},{"title":"Season 4","level":2,"content":[{"type":"paragraph","text":"Sadiq is seen again in the episode Fun Run, solving a computer virus on Pam's computer that came about because Pam clicked on a link for a video of a celebrity sex tape. Because he was in the office at the time, he ends up at Michael's meeting about religion. Here, he reveals that he is a Sikh, restores vintage cars, listens to NPR, and likes hip hop music. Michael only seemed to be interested in learning what religion Sadiq was. While not very relevant, it is worth pointing out that even though Sadiq is Sikh, he is clean-shaven which contrary to Sikh Law, as Sikhs are not supposed to cut their hair or their beard. "}],"images":[]},{"title":"Season 6","level":2,"content":[{"type":"paragraph","text":"When Dunder Mifflin is acquired by Sabre, Sadiq loses his job, as Sabre brings the eighth IT guy, Nick. In Whistleblower, Dwight claims that the employees enjoyed Sadiq's company more than Nick's, as Sadiq kept to himself."}],"images":[]},{"title":"Season 7","level":2,"content":[{"type":"paragraph","text":"Michael Scott recites all the IT guys his company had in backwards with descriptive titles instead of names. Sadiq is referred to as Turban."}],"images":[]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":"Email Surveillance","elements":[]},{"text":"Fun Run","elements":[]}]}],"images":[]},{"title":"Mentioned in","level":2,"content":[{"type":"list","elements":[{"text":"Whistleblower","elements":[]},{"text":"WUPHF.com (As Turban)","elements":[]}]}],"images":[]}]}