{"sections":[{"title":"Teri Hudson","level":1,"content":[{"type":"paragraph","text":"Teri Hudson (played by Joanne Carlsen) is Stanley Hudson's second wife. He and Teri had already been married when the series began; they attended The Dundies together in Season 2."},{"type":"paragraph","text":"Teri is a white, middle-aged woman. On two separate occasions, at the Dundies and Phyllis' wedding, Michael has had to be told by an unamused Stanley that Teri is his spouse, as he is confused as to why she is not the same race as Stanley."}],"images":[]},{"title":"Season 2","level":2,"content":[{"type":"paragraph","text":"Teri is first seen when Stanley takes her to the Dundie's. Michael asks where she is and Stanley tells him that its the woman whose hand he is holding. Michael does not seem to understand that Stanley is in an interracial relationship (The Dundies)."},{"type":"paragraph","text":"Stanley's daughter, Melissa, is unfond of her stepmother Teri. When she visits the office in Take Your Daughter to Work Day, she becomes hostile when Pam refers to Teri as her mother."}],"images":[]},{"title":"Season 6","level":2,"content":[{"type":"paragraph","text":"The first episode of the sixth season, Gossip, involves Michael finding out from an intern that he has seen Stanley cheating on his wife, Teri, with a woman named Cynthia (Algerita Wynn Lewis). Michael initially thinks the rumor was false, but Stanley confirms it, saying he's about to break the affair off. Michael spreads the rumor around the office, but just retrieves the situation, and it seems Stanley has gotten away with the affair, until Michael talks to Teri on the phone, accidentally calling her Cynthia, confirming her suspicions. Presumably, Teri leaves Stanley, who smashes Michael's car in anger."}],"images":[]},{"title":"Season 8","level":2,"content":[{"type":"paragraph","text":"In a deleted scene from Garden Party Stanley breaks up with Cynthia and Cynthia goes angrily yells at Stanley that she is taking the car and he can call his wife and tell her why she has to pick him up. Dwight and Gabe also refer to Cynthia as \"Stanley's Mistress\" so it can be assumed that Stanley is still married to Teri."}],"images":[]}]}