{"sections":[{"title":"Troy Underbridge","level":1,"content":[{"type":"paragraph","text":"Troy L. Underbridge, is a fictional character in the television series The Office."}],"images":[]},{"title":"Season 4","level":2,"content":[{"type":"paragraph","text":"In The Deposition, Troy is briefly seen typing on his Blackberry alongside Ryan, and another guy with the same look as Ryan."},{"type":"paragraph","text":"Troy accompanies Ryan on his night out clubbing but abandons him when Ryan's drug habit starts getting him into trouble. He runs away, shouting, \"Do not take him to a hospital!\" In a deleted scene from the episode, Troy reveals that he sells Ryan \"the stuff you need to have a good time.\""},{"type":"paragraph","text":"Dwight insists he looks like a hobbit. He asks him \"Do you live in a regular sized house?\""},{"type":"paragraph","text":"In a deleted scene from Goodbye, Toby, Troy identifies himself as \"Troy Undercook\" when he comes to see Michael."}],"images":[]},{"title":"Season 7","level":2,"content":[{"type":"paragraph","text":"In \"Threat Level Midnight\" Troy stars as a thug of Goldenface."}],"images":[]},{"title":"Season 9","level":2,"content":[{"type":"paragraph","text":"Troy is brought in as a candidate for a junior sales position by Dwight. He is seen drying his pants using the air dryer in the bathroom (\"Junior Salesman\")."}],"images":[]},{"title":"Trivia","level":2,"content":[{"type":"list","elements":[{"text":"His surname may be a reference to Lord of the Rings: The Fellowship of the Ring. This is reinforced because the main character, Frodo Baggins, uses the alias \"Underhill\" and Dwight thinks Troy looks like a hobbit.","elements":[]}]}],"images":[]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":"The Deposition (uncredited)","elements":[]},{"text":"Night Out","elements":[]},{"text":"Goodbye, Toby (deleted scenes)","elements":[]},{"text":"Threat Level Midnight","elements":[]},{"text":"Junior Salesman","elements":[]}]}],"images":[]}]}