{
    "season": 1,
    "title": "Pilot",
    "episode": "1",
    "episodes": [
        1
    ],
    "coldOpens": [
        "None "
    ],
    "storylines": [
        "A documentary crew gives a firsthand introduction to the staff of the Scranton branch of the Dunder Mifflin Paper Company, managed by Michael Scott.",
        "During a meeting, Jim Halpert tells his boss, Michael, that he couldn't close a sale with the library. Michael closes the sale easily, but accidentally calls the woman he's speaking with, \"Sir\". He thinks she might have been a smoker.",
        "Michael tells the camera that he's worked for Dunder-Mifflin for 12 years and has been Regional Manager for 4. The branch has the entire second floor of the building. He introduces the camera to receptionist Pam Beesly and mentions how much better she looked a couple of years ago. She gives him a fax from corporate which he crumples up and tosses into the trash, calling it his special file for messages from the corporate office. He shows the camera his World's Best Boss mug and tells how he bought it from Spencer Gifts.",
        "Jim tries to explain his job selling paper, but admits it's boring him even talking about it.",
        "Michael comes out of his office and shouts the years-old gag \"Whassssuuupp?\" to Jim and Dwight who play along.",
        "Michael's direct supervisor, Jan Levinson-Gould, then enters the office for a meeting with Michael. Michael admits he calls her Hillary Rodham Clinton, but not because he's afraid of her. Jan asks if Michael has any questions about the agenda which he claims not to have seen and proceeds to lecture Pam who then reveals, in front of Jan, that Michael threw it away. Michael backpedals that it was just a joke.",
        "Jan explains that corporate doesn't see the point in having both the Scranton and Stamford branches. Michael immediately assumes the worst. Jan tries to assure him that it's not a foregone conclusion that Scranton will be shut down. Michael wonders if Josh, the regional manager at Stamford, is worried about downsizing.",
        "Then Michael takes a call from Todd Packer, the branch's traveling salesman, who, not realizing he's on speakerphone in Jan's presence, calls her \"Godzillary\" and asks Michael if the carpet matches the drapes. Michael quickly realizes his mistake and mumbles about how inappropriate that was.",
        "Jan concludes the meeting by asking Michael to keep all of this information under wraps for now.",
        "In the break room, Oscar Martinez, Phyllis Lapin, and Stanley Hudson are at a table talking about the possibility of downsizing. Oscar admits he's updating his resume. Angela Martin worries she'll be let go and Kevin Malone agrees. Jim and Pam are too busy laughing about whether or not they will attend Angela's cat party on Sunday.",
        "In the midst of all this, Ryan Howard arrives from the temporary employment agency. Michael demonstrates his humor by imitating Moe, from The Three Stooges and Adolf Hitler. It's clear that Michael's idea of humor is lost on his employees.",
        "Pam admits it wouldn't be the worst thing if she was laid off. She enjoys working with watercolor and oil pencils. Jim likes her work.",
        "While Jim is trying to make a sales call, Dwight distracts him by using his ruler to push some of Jim's overlapping papers off of his desk. In retaliation, Jim built a pencil fence between his desk and Dwight's, which Dwight smashes with his phone. Because of this, Jim tells the camera he's not afraid of the downsizing issue. Dwight, too, tells the camera he has no problem with downsizing and that he has been recommending it since he first arrived at Dunder Mifflin.",
        "Pam hands Michael some of his messages. He pretends to act like the Six Million Dollar Man for several long moments. He decides that six million dollars would be a great salary for him and asks Pam's opinion. Pam mentions her salary could use a boost, too. Suddenly, Michael becomes serious, lecturing Pam she should take up her salary concerns with HR if she thinks there's a problem.",
        "The staff is called into the conference room. Dwight, desperate to help, wants to back up Michael as Assistant Regional Manager. Michael will only acquiesce to Assistant to the Regional Manager. Michael explains that he's aware of the rumors and can confirm that Jan has indicated to him that there might be downsizing which could involve either Scranton or Stamford. Both Oscar and Stanley question Michael's assurances that he will not permit this branch to be closed. To change the subject, he tries to field a question from Pam who he claims looks like she wants to ask a question. Pam mentions that, being present in the meeting with Jan, it certainly did sound like Scranton could be shuttered. Michael, who doesn't seem to recognize that this whole meeting is breaking Jan's request for confidentiality, lectures Pam about leaking information. Out in the office, Ryan expresses his concerns by phone that he's hearing rumors the branch might be shut down.",
        "Jim wonders what he will do with all this useless information he's gathered about paper. He also knows Pam's favorite yogurt flavor: mixed berry. Pam admits to the camera that he's right.",
        "Michael introduces Ryan to the office. When he gets to Dwight, he asks him to tell Ryan about his car and his martial arts. Dwight starts to grab some photos of his car when he finds that someone has encased his stapler in Jell-O. He's furious because this is the third time and insists that Michael, as a witness, should discipline Jim. Jim, eating Jell-O, wants to know why Dwight thinks it's him. He and Ryan distract Michael by making dessert puns. Michael can't think of one.",
        "Jim tries to convince Pam to join the gang for some drinks after work. Her fiancé, Roy, one of the warehouse workers, arrives. Pam admits that she and Roy have been engaged for three years. They are supposed to be married in September, but she believes it'll probably not be until Spring. Roy tells her he just wants to go home. She leaves her desk to finish up some work. Jim tries to make small talk, but Roy isn't having it.",
        "Jim tells the camera that he doesn't think he'll be invited to the wedding.",
        "While Michael conveys his management style to Ryan (friend first, boss second), he decides to pull a prank on Pam. When she comes in, he tells her that she's made downsizing easier because he has to fire her for stealing Post-It notes. She denies having stolen anything and bursts into tears. Ryan sits awkwardly until Michael reveals the gag. Pam calls him a jerk and storms out.",
        "Michael tells the camera that people are more important than money. The proudest day of his life was when one of his employees made him the godfather of his child. It didn't work out as they had to fire the guy because he wasn't very good.",
        "Pam and Jim say good-bye at the end of the day. They are interrupted by Roy's angry honking from outside.",
        "Before Jim leaves, he walks into Michael's office and leaves a Jell-O mold with Michael's World's Best Boss mug inside."
    ],
    "quotes": [
        [
            {
                "speaker": " Michael",
                "content": " This is our receptionist Pam, and if you think she's cute now, you should've seen her a couple of years ago!"
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " Did we get a fax this morning?"
            },
            {
                "speaker": "Pam",
                "content": " Uh, yeah, the one..."
            },
            {
                "speaker": "Michael",
                "content": " Why isn't it in my hand? A company runs on efficiency of communication, right? So what's the problem, Pam? Why didn't I get it?"
            },
            {
                "speaker": "Pam",
                "content": " You put it in the garbage can that was a special filing cabinet."
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " [Talking head] What is the most important thing for a company? Is it the cash flow? Is it the inventory? Nuh-uh. It's the people. The people. My proudest moment here was not when I increased profits by 17% or when I cut expenses without losing a single employee. No, no, no, no, no. It was a young Guatemalan guy. First job in the country, barely spoke English. He came to me, and said, \"Mr. Scott, would you be the godfather of my child?\" Wow. Wow. Didn't work out in the end. We had to let him go. He sucked."
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " Pam, as you know, there is going to be downsizing. And you have made my life so much easier that I am going to have to let you go first."
            },
            {
                "speaker": "Pam",
                "content": " What? Why?"
            },
            {
                "speaker": "Michael",
                "content": " Why? Well, theft and stealing."
            },
            {
                "speaker": "Pam",
                "content": " Stealing? What am I supposed to have stolen?"
            },
            {
                "speaker": "Michael",
                "content": " Post-it Notes."
            },
            {
                "speaker": "Pam",
                "content": " Post-it Notes? What are those worth, fifty cents?"
            },
            {
                "speaker": "Michael",
                "content": " Fifty cents, yeah. If you steal a thousand Post-it Notes at fifty cents apiece, and you know, you've made a profit... margin. You're gonna run us out of business, Pam."
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " And yeah, Jim this is the time to stop putting Dwight's personal effects into Jell-O."
            }
        ],
        [
            {
                "speaker": "Jim",
                "content": " Okay. Dwight, I'm sorry, because I have always been your biggest flan."
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " [Talking head] People I respect, heroes of mine would be Bob Hope, um, Abraham Lincoln, definitely. Bono, uh and probably God would be the fourth one and I just think all those people really, uh, helped the world in so many ways that it's, um, it's really beyond words. It's really incalculable."
            }
        ],
        [
            {
                "speaker": "Angela",
                "content": " [Talking about downsizing] I think it's gonna be me. It'll probably be me."
            },
            {
                "speaker": "Kevin",
                "content": " Yeah, it'll be you."
            }
        ],
        [
            {
                "speaker": "Dwight",
                "content": " [Talking head] Downsizing? I have no problem with that. I have been recommending downsizing since I first got here. I even brought it up in my interview. I say, bring it on."
            }
        ]
    ]
}