{
    "season": 1,
    "title": "Diversity Day",
    "episode": "2",
    "episodes": [
        2
    ],
    "episodeDetails": {
        "sections": [
            {
                "title": "Diversity Day",
                "level": 1,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "\"Diversity Day\" is the second episode of the first season of The Office and the 2nd episode overall. It was written by B.J. Novak and directed by Ken Kwapis. It originally aired on March 29, 2005, and was viewed by 6 million people."
                    }
                ],
                "images": []
            },
            {
                "title": "Summary",
                "level": 2,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Michael explains in his talking head that it's Diversity Day and that a guest speaker is at Dunder Mifflin Scranton to talk about diversity in the workplace. Michael claims that he's wanted this for awhile. Corporate mandated it without Michael having to talk to them about it, though. But Michael still believes it's very important."
                    },
                    {
                        "type": "paragraph",
                        "text": "Jim is trying to make a sales call when Dwight begins noisily shredding paper. Jim turns off Dwight's surge strip. In retaliation, Dwight disconnects Jim's phone call. Jim explains to the camera that this client makes up 25% of his commission each year. He brings a small bottle of champagne to the office with him to celebrate."
                    },
                    {
                        "type": "paragraph",
                        "text": "While Pam plays freecell, Michael walks out of his office, then backs up when he sees the corporate representative is heading out of the conference room. He makes sure to walk out at the same time as the other man and make a point of singling out Oscar Martinez as a friend of his. Jim has made contact with his client just in time for Michael to order him into the meeting. Jim is forced to hang up again."
                    },
                    {
                        "type": "paragraph",
                        "text": "When the meeting begins, Michael tries to take over by talking about how he doesn't even see Stanley as a black man. The representative explains that's not the point here. No one is expected to be color-blind. That's just fighting ignorance with more ignorance."
                    },
                    {
                        "type": "paragraph",
                        "text": "Then Michael decides everyone should go around and name an ethnicity that he or she finds sexually attractive. Dwight claims he's attracted to whites and Indians. The representative does not think that's a good start. He asks Michael for permission to run this session himself and suggests it would be easier if Michael sits down."
                    },
                    {
                        "type": "paragraph",
                        "text": "He explains that he asked each of them to write down an incident that offended them. He would like volunteers to assist him. Dwight asks that they don't do anything involving gays."
                    },
                    {
                        "type": "paragraph",
                        "text": "The representative attempts to take control again from Michael who asks his name. When he reveals that it's Mr. Brown, Michael thinks it's a trick to see if he will call a black man Mr. Brown. Brown assures him that is his name. He goes on to explain that almost everyone wrote down the same incident and asks if everyone is familiar with the Chris Rock routine."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael complains to the camera how Chris Rock can do a hilarious routine that makes everyone laugh, but he gets in trouble from corporate when he does the same routine. Michael volunteers to be the joker, Brown doesn't want the person who was the original offender in the same position. Kevin offers to be the joke teller, but doesn't tell it to Michael's liking. Michael interrupts with a loud, profane rendition of the routine before Brown stops him."
                    },
                    {
                        "type": "paragraph",
                        "text": "While Jim listens to his phone ring, helpless to answer it, Brown sets up an acronym for Hero: Honesty, Empathy, Respect and Open-Mindedness. Dwight adds additional criteria that essentially describes a super-hero, not a hero. Brown passes out forms, asking everyone sign it. Michael refuses because he didn't learn anything."
                    },
                    {
                        "type": "paragraph",
                        "text": "Privately, Brown explains that they both know he is here because of Michael's behavior. Michael argues that this office is racially advanced enough that it really doesn't need a diversity lecture. Brown tells him it does because it's Michael that caused the need for it. He only needs Michael's signature, but put the whole office through the seminar because he didn't want Michael to feel singled out. Michael feigns offense that this wasn't really about diversity then."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael signs the form and then jokes after the fact that he signed it \"Daffy Duck\"."
                    },
                    {
                        "type": "paragraph",
                        "text": "In the meantime, Jim has tried to call back his client and has to leave a message."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael comes out, tears up the pledge, and criticizes Mr. Brown's lack of an \"Oprah moment\". He wants everyone to get as much done before lunch as possible."
                    },
                    {
                        "type": "paragraph",
                        "text": "Jim gets nothing but a busy signal right before Michael forces them all into the conference room again."
                    },
                    {
                        "type": "paragraph",
                        "text": "The HR representative, Toby Flenderson asks if they are going to sit Indian style. Michael orders him out for being offensive. Then he shows the staff a video announcing his new initiative for Diversity Tomorrow and quotes Abraham Lincoln as saying, \"If you are a racist, I will attack you with the North\"."
                    },
                    {
                        "type": "paragraph",
                        "text": "Kelly Kapoor, a young Indian woman, asks to be excused for a customer meeting. Michael lets her go. He introduces himself and describes his ethnic breakdown, including that he is part Native American. Oscar asks him what part he is. Michael asks about Oscar's ethnicity. Oscar explains his parents were born in Mexico, moved here and he was born. Michael wants to know if there's something he would like to be called besides Mexican. Oscar doesn't understand why Michael would think Mexican is offensive."
                    },
                    {
                        "type": "paragraph",
                        "text": "Jim, hearing his phone ring, runs out to grab it, but is too late."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael hands out cards with different ethnicities on them. The employees are to take a card and then try to guess their pretend ethnicity by how their co-workers treat them."
                    },
                    {
                        "type": "paragraph",
                        "text": "Stanley is inadvertently given Black. Dwight is Asian but can't guess it based upon people telling him they like his people's food or eat lots of rice. Michael, who's chosen Martin Luther King for himself, insists Pam stir up the pot by getting extreme. Pam hesitantly suggests to Dwight that his people aren't very good drivers. Dwight angrily asks if he's a woman."
                    },
                    {
                        "type": "paragraph",
                        "text": "Jim goes to Pam's desk where Ryan is watching an online sketch. Ryan mentions how cute she is. Jim agrees, but that Pam is engaged. Ryan says he was talking about the girl in the sketch."
                    },
                    {
                        "type": "paragraph",
                        "text": "Kevin is Italian and is trying to get Angela to guess that she's Jamaican by using the word \"mon\" and talking about beaches. Angela won't go any further when he asks if she wants to get high."
                    },
                    {
                        "type": "paragraph",
                        "text": "Irritated that no one is trying very hard to be offensive, Michael immediately jumps on Kelly when she returns from her meeting by throwing himself into a really offensive Indian stereotype until Kelly slaps him. Michael gets visibly upset. He tells the employees how now Kelly knows what it's like to be a minority."
                    },
                    {
                        "type": "paragraph",
                        "text": "Jim finally gets ahold of his client who was able to close his sale with Dwight instead who gave him a discount. Jim puts the mini champagne bottle on Dwight's desk."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael continues mumbling about Mr. Brown and corrects Stanley on how to pronounce the word collard in collard greens. When 5 PM arrives, Pam is asleep on Jim's shoulder. He smiles at the camera, then wakes her up so they can go."
                    },
                    {
                        "type": "paragraph",
                        "text": "He tells the camera that today was a pretty good day."
                    }
                ],
                "images": [
                    {
                        "src": "https://vignette.wikia.nocookie.net/theoffice/images/c/cc/The_Employees_meeting_for_Diversity_Day.png/revision/latest/scale-to-width-down/226?cb=20190227030425",
                        "caption": "The meeting for Diversity Day"
                    },
                    {
                        "src": "https://vignette.wikia.nocookie.net/theoffice/images/1/1f/Pam_%26_Dwight_trying_to_guess_their_races.png/revision/latest/scale-to-width-down/225?cb=20190227030058",
                        "caption": "Pam and Dwight trying to guess each other's race"
                    },
                    {
                        "src": "https://vignette.wikia.nocookie.net/theoffice/images/c/c5/Pam_fall_asleep_on_Jim%27s_Shoulder.png/revision/latest/scale-to-width-down/225?cb=20190227030547",
                        "caption": "Pam falls asleep on Jim's shoulder"
                    }
                ]
            },
            {
                "title": "Cultural references",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Diversity is a term used in corporate culture to refer to multiple races, cultures, and customs being represented within a company's workforce.",
                                "elements": []
                            },
                            {
                                "text": "Michael's exclamation \"Celebrate good times, come on!\" comes from the chorus of the 1980s song \"Celebration\" by the group Kool & the Gang.",
                                "elements": []
                            },
                            {
                                "text": "Daffy Duck is a cartoon character.",
                                "elements": []
                            },
                            {
                                "text": "Toby jokes about \"sitting in a circle Indian style.\" This is a typical campfire arrangement (and terminology) used by children at camp.",
                                "elements": []
                            },
                            {
                                "text": "Namaste (with the accompanying hand gesture) is a traditional Indian greeting.",
                                "elements": []
                            },
                            {
                                "text": "I Have a Dream is the refrain of a famous speech by civil rights activist Martin Luther King, Jr.",
                                "elements": []
                            },
                            {
                                "text": "The routine Michael imitates is \"Black People vs. N—s\" from Chris Rock's 1996 HBO special Bring the Pain.",
                                "elements": []
                            },
                            {
                                "text": "The melting pot is an American concept for describing how multiple cultures are assimilated into a single combined culture. The more contemporary concept of diversity emphasizes how the cultures retain their identity rather than lose it via assimilation (with the new analogy of a salad bowl).",
                                "elements": []
                            },
                            {
                                "text": "Googy-googy is a made-up term.",
                                "elements": []
                            },
                            {
                                "text": "In a deleted scene, Dwight mentions James Earl Jones, a noted African-American actor and voice-over performer.",
                                "elements": []
                            },
                            {
                                "text": "In a deleted scene, Michael imitates the character of Colonel Klink from the 1960s sitcom Hogan's Heroes. The sitcom is set in a German POW camp. Hogan is the leader of a group of Allied POWs whose activities regularly frustrate camp commandant Klink. Michael compares Jan to General Burkhalter (Klink's superior) and Dwight to Sergeant Schultz (Klink's bumbling aide).",
                                "elements": []
                            },
                            {
                                "text": "In a deleted scene, Michael (pretending to be Martin Luther King, Jr.) talks about marching to the Washington Monument, the Lincoln Memorial and the U.S. Mint. King did march from the Washington Monument to the Lincoln Memorial, but not the U.S. Mint.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Trivia",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Michael's attempts to upstage Brown echoes David Brent's treatment of a visiting consultant in the episode Training from The Office UK.",
                                "elements": []
                            },
                            {
                                "text": "Michael's diversity exercise with the index cards is similar to one sometimes done in actual diversity training programs.",
                                "elements": []
                            },
                            {
                                "text": "These are the roles played by the Dunder Mifflin employees in Michael's diversity exercise:",
                                "elements": []
                            }
                        ]
                    },
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Although it's true that \"insect\" would not have made sense either, another anagram for \"incest\" is \"nicest\", which would have worked well in this context.",
                                "elements": []
                            },
                            {
                                "text": "Wilmore appears as Mr. Brown again in the Season Three episode \"Gay Witch Hunt\", giving the Stamford branch the Diversity Today sensitivity training. It is implied he was brought in because of events in Scranton.",
                                "elements": []
                            },
                            {
                                "text": "Michael says, \"Don't take my word for it. Let's take a look at the tape.\" But the tape consists merely of Michael talking.",
                                "elements": []
                            },
                            {
                                "text": "As Dwight gives his explanation of heroes, Jim's face goes through at least four expressions.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Behind the Scenes",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Originally, producer Greg Daniels wasn't sure where to use Mindy Kaling on screen in the series until the point came in this episode's script when Michael needed to be slapped by a minority. \"Since then, I've been on the show,\" Kaling says. Daniels also loves the scene where Pam falls asleep on Jim's shoulder.",
                                "elements": []
                            },
                            {
                                "text": "Larry Wilmore (Mr. Brown) is a writer for the show. At the table-read for this show, they hadn't cast the part yet and Daniels just had Wilmore read for the role to fill in. After the read, Daniels thought he was perfect for the role. However, because of stipulations with the Screen Actors Guild, producers still had to have Wilmore formally audition with other actors for the role.",
                                "elements": []
                            },
                            {
                                "text": "The diversity training company's name (and Michael's response to it) went through a number of changes before Diversity Today was settled on, including Diversity 360 (Michael would rename it Diversity 365, \"Because diversity shouldn't take five days off\") and Diversity 2000 (Michael would rename it Diversity 3000). Unfortunately, research discovered a real company named Diversity 360, and they didn't want to make it sound like they were making fun of that company.",
                                "elements": []
                            },
                            {
                                "text": "This episode was nominated for the Writers Guild of America Award for \"Best Episodic Comedy\".",
                                "elements": []
                            },
                            {
                                "text": "This episode unintentionally features Creed Bratton's first lines. The first assistant director asked him to provide banter with Phyllis, unaware that Creed was hired for background only and was not supposed to speak.[1]",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Deleted scenes",
                "level": 2,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Included on the Season 1 DVD were various deleted scenes:"
                    },
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Michael and Mr. Brown discussing erasing racism.",
                                "elements": []
                            },
                            {
                                "text": "Dwight telling the camera he's wasting busy sales hours because of the meeting.",
                                "elements": []
                            },
                            {
                                "text": "A scene at the meeting where Michael creates his own acronym for sensitivity (inclusion, new attitude, color blind, expectations, sharing, and tolerance) which ends up spelling I.N.C.E.S.T. After Pam points this out, he tries to explain how the term works in context.",
                                "elements": []
                            },
                            {
                                "text": "Pam in a talking head saying Michael could've just used insect as an acronym, though it still wouldn't have made sense.",
                                "elements": []
                            },
                            {
                                "text": "Ryan mentioning his childhood neighbor who played pro baseball \"before the leagues were integrated\" and his stories, though Michael interrupts him and asks him to leave the meeting because he sees this information as irrelevant. He tells Ryan to check if anyone parked in the handicap spots and tries to talk about how that ties in with the new attitude part of his acronym, though Mr. Brown stops him from continuing.",
                                "elements": []
                            },
                            {
                                "text": "Pam trying to think of good things about Michael.",
                                "elements": []
                            },
                            {
                                "text": "Ryan in the parking lot looking at the empty handicap parking spots.",
                                "elements": []
                            },
                            {
                                "text": "An extended scene with Michael showing his Daffy Duck signature.",
                                "elements": []
                            },
                            {
                                "text": "Jim helping Pam in her game of solitaire, but Dwight trying to stop them as the game should only be played alone.",
                                "elements": []
                            },
                            {
                                "text": "Dwight and Michael filming the short sensitivity video.",
                                "elements": []
                            },
                            {
                                "text": "Michael talking about marching on Washington \"back in the day.\"",
                                "elements": []
                            },
                            {
                                "text": "Devon smoking on a balcony with \"West Nile\" on his forehead card.",
                                "elements": []
                            },
                            {
                                "text": "When Dwight asks if he's a woman, Jim changes his forehead card from Asian to \"Dwight\" and continues asking what race he is, though Angela eventually tells him what his card says.",
                                "elements": []
                            },
                            {
                                "text": "Pam telling the camera there was once an ethnic festival in Scranton.",
                                "elements": []
                            },
                            {
                                "text": "Reactions from the office workers after Kelly slaps Michael.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": [
                    {
                        "src": "https://vignette.wikia.nocookie.net/theoffice/images/1/15/Devon%27s_race.JPG/revision/latest/scale-to-width-down/300?cb=20070327161929",
                        "caption": "Devon's forehead card."
                    }
                ]
            },
            {
                "title": "Cast",
                "level": 2,
                "content": [],
                "images": []
            },
            {
                "title": "Main Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Steve Carell as Michael Scott",
                                "elements": []
                            },
                            {
                                "text": "Rainn Wilson as Dwight Schrute",
                                "elements": []
                            },
                            {
                                "text": "John Krasinski as Jim Halpert",
                                "elements": []
                            },
                            {
                                "text": "Jenna Fischer as Pam Beesly",
                                "elements": []
                            },
                            {
                                "text": "B.J. Novak as Ryan Howard",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Recurring Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Leslie David Baker as Stanley Hudson",
                                "elements": []
                            },
                            {
                                "text": "Brian Baumgartner as Kevin Malone",
                                "elements": []
                            },
                            {
                                "text": "Kate Flannery as Meredith Palmer",
                                "elements": []
                            },
                            {
                                "text": "Mindy Kaling as Kelly Kapoor",
                                "elements": []
                            },
                            {
                                "text": "Paul Lieberstein as Toby Flenderson",
                                "elements": []
                            },
                            {
                                "text": "Angela Kinsey as Angela Martin",
                                "elements": []
                            },
                            {
                                "text": "Oscar Nunez as Oscar Martinez",
                                "elements": []
                            },
                            {
                                "text": "Phyllis Smith as Phyllis Lapin",
                                "elements": []
                            },
                            {
                                "text": "Creed Bratton (actor) as Creed Bratton (Uncredited)",
                                "elements": []
                            },
                            {
                                "text": "Devon Abner as Devon White (Only in Deleted Scenes)",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            }
        ]
    },
    "quotesDetails": {
        "sections": [
            {
                "title": "Diversity Day Quotes",
                "level": 1,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Dwight: Dit for tit"
                    },
                    {
                        "type": "paragraph",
                        "text": "Mr. Brown: Now, this is a simple acronym. HERO. Uh, at Diversity Today, we believe it is very easy to be a HERO. All you need are honesty, empathy, respect, and open-mindedness.\nDwight: Excuse me, I'm sorry, but that's not all it takes to be a hero.\nMr. Brown: Oh, great. Well, what is a hero to you?\nDwight: A hero kills people, people that wish him harm.\nMr. Brown: OK.\nDwight: A hero is part-human and part-supernatural. A hero is born out of a childhood trauma, or out of a disaster, that must be avenged.\nMr. Brown: Ok, you're thinking of a superhero.\nDwight: We all have a hero in our heart."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael: Kevin is a great guy. He's a great accountant. He is not much of an entertainer."
                    },
                    {
                        "type": "paragraph",
                        "text": "Kevin: Basically, there are two types of black people and black people are actually more racist because they hate the other type of black people. Every time the one type wants to have a good time, then the other type comes in and makes a real mess."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael: OK. I'm sorry. I'm sorry. He's ruin... He's butchering it. Could you just let me... [As Chris Rock] Every time... Every time black people want to have a good time, some ignant ass... [Bleep] I take care of my kid!"
                    },
                    {
                        "type": "paragraph",
                        "text": "Mr. Brown: Wait a second."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael: [Bleep] They always want credit for something they supposed to do!"
                    },
                    {
                        "type": "paragraph",
                        "text": "Mr. Brown: Stop it!"
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael: [As Chris Rock] What you want a cookie?"
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael: I'm Michael Scott, founder of Diversity Tomorrow because today is almost over."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael: [to Oscar] Is there a term besides Mexican that you prefer or is it too offensive?"
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael: [Talking head] Abraham Lincoln once said that \"If you're a racist, I will attack you with the North.\" And those are the principles that I carry with me in the workplace."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael: You'll notice I didn't have anybody be an Arab. I thought that would be too explosive. No pun intended. But I just though. \"Too soon for Arabs.\" Maybe next year. Um... You know, the ball's in their court."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael: All right? Everybody pretty? Come on. Here we go. It's time. Let's do some good."
                    },
                    {
                        "type": "paragraph",
                        "text": "Toby: Hey, we're not all going to sit in a circle Indian style are we? [Laughing]"
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael: Get out."
                    },
                    {
                        "type": "paragraph",
                        "text": "Toby: I'm sorry."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael: No, this is not a joke. OK? That was offensive and lame. So double offensive. This is an environment of welcoming and you should just get the hell out of here. OK, let's go. Let's do it. Come on. Let's have some fun, everybody. Here we go. Take a seat. Cop a squat. And um... thanks for coming in. Um... Diversity... is the cornerstone of progress as I've always said. But don't take my word for it. Let's take a look at the tape."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael: I want you all to take a card, put it on your forehead... [Pam picks up a card] Don't look at it! I want you to take the card and I want you to put it on your forehead, and take a card, any card... [Angela and Pam place their cards on their foreheads, with the cards saying \"Jamaican\" and \"Jewish\" respectively] and I want you to treat other people like the race [Kevin places his card on his head; it says \"Italian\"] that is on their forehead. OK, so everyone has a different race, and nobody knows what their race is. [The camera pans over to Stanley, whose card says \"Black\".] So, I want you to really go for it, cause this is real, this isn't just an exercise, this is real life [Places a card saying \"Martin Luther King Jr.\" on his forehead] and I have a dream that you will really let the sparks fly... Git-r-done!"
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael: [Goes over to Pam and Stanley] Oh! This is a good one!"
                    },
                    {
                        "type": "paragraph",
                        "text": "Pam: [To Stanley, who has been assigned \"Black\" as his race] Hi, how are you?"
                    },
                    {
                        "type": "paragraph",
                        "text": "Stanley:  I'm fine, how are you?"
                    },
                    {
                        "type": "paragraph",
                        "text": "Pam: Great... Umm... "
                    },
                    {
                        "type": "paragraph",
                        "text": "Stanley: I admire your cultural success in America."
                    },
                    {
                        "type": "paragraph",
                        "text": "Pam: Thank you."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael: Bomb! Bomb! Bomb! Bomb! Come on, Olympics of suffering right here - Slavery vs. The Holocaust, come on!"
                    },
                    {
                        "type": "paragraph",
                        "text": "Stanley: [Removes his card] I know I'm not supposed to look, but who am I supposed to be? [Finds out his card says \"Black\"]."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael: That was inadvertent, we didn't actually plan that."
                    },
                    {
                        "type": "paragraph",
                        "text": "Dwight: [Having been assigned \"Asian\" as his race] Lots of cultures eat rice. That doesn't help me. [Goes over to Pam, who has been assigned with \"Jewish\"] Shalom! I would like to apply for a loan."
                    },
                    {
                        "type": "paragraph",
                        "text": "Pam: That's nice, Dwight."
                    },
                    {
                        "type": "paragraph",
                        "text": "Dwight: OK, do me. Something stereotypical so I can get it really quick."
                    },
                    {
                        "type": "paragraph",
                        "text": "Pam: OK, I like your food."
                    },
                    {
                        "type": "paragraph",
                        "text": "Dwight: Outback Steakhouse! [Australian accent] I'm Australian, mate!"
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael: Pam, come on. \"I like your food?\" Come on, stir the pot, stir the melting pot, Pam! Let's do it, let's get ugly, let's get real!"
                    },
                    {
                        "type": "paragraph",
                        "text": "Pam: OK, if I have to do this, based on stereotypes that are totally untrue, that I do not agree with, you would maybe not be a very good driver."
                    },
                    {
                        "type": "paragraph",
                        "text": "Dwight: Oh man! Am I a woman?!"
                    },
                    {
                        "type": "paragraph",
                        "text": "Kevin: [To Angela, who has been assigned with \"Jamaican\"; He himself has been assigned with \"Italian\"] Hey."
                    },
                    {
                        "type": "paragraph",
                        "text": "Angela: Hey."
                    },
                    {
                        "type": "paragraph",
                        "text": "Kevin: You wanna go to the beach?"
                    },
                    {
                        "type": "paragraph",
                        "text": "Angela: Sure."
                    },
                    {
                        "type": "paragraph",
                        "text": "Kevin: You wanna get high?"
                    },
                    {
                        "type": "paragraph",
                        "text": "Angela: No."
                    },
                    {
                        "type": "paragraph",
                        "text": "Kevin: I think you do, mon."
                    },
                    {
                        "type": "paragraph",
                        "text": "Angela: Stop..."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael: [Voice raised, Indian accent] Kelly, how are you?"
                    },
                    {
                        "type": "paragraph",
                        "text": "Kelly: I just had the longest meeting."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael: Oh! Welcome to my convenience store. Would you like some googi googi? I have some very delicious googi, googi, only 99 cents plus tax. Try my googi, googi. [Lowering voice] Try my googi, googi. [High-pitched voice] Try my googi, googi. Try my... [slap!]"
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael: [Trying not to cry] All right! All right! Yes! That was great, she gets it! Now she knows what it's like to be a minority."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael: Man, I hated it when that guy was in here. Mr. Brown, if that was his real name. I mean he has never met any of us before, and here he was, telling us how to do our thing. I just wanted... I just wanted to do it our way. You know? On our own. Man, I should've gotten some food."
                    },
                    {
                        "type": "paragraph",
                        "text": "Kevin: [Italian accent] Maybe some spagh-etti!"
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael: OK, Kevin, you can take that thing off."
                    }
                ],
                "images": []
            }
        ]
    },
    "coldOpens": [
        "None "
    ],
    "storylines": [
        "Michael explains in his talking head that it's Diversity Day and that a guest speaker is at Dunder Mifflin Scranton to talk about diversity in the workplace. Michael claims that he's wanted this for awhile. Corporate mandated it without Michael having to talk to them about it, though. But Michael still believes it's very important.",
        "Jim is trying to make a sales call when Dwight begins noisily shredding paper. Jim turns off Dwight's surge strip. In retaliation, Dwight disconnects Jim's phone call. Jim explains to the camera that this client makes up 25% of his commission each year. He brings a small bottle of champagne to the office with him to celebrate.",
        "While Pam plays freecell, Michael walks out of his office, then backs up when he sees the corporate representative is heading out of the conference room. He makes sure to walk out at the same time as the other man and make a point of singling out Oscar Martinez as a friend of his. Jim has made contact with his client just in time for Michael to order him into the meeting. Jim is forced to hang up again.",
        "When the meeting begins, Michael tries to take over by talking about how he doesn't even see Stanley as a black man. The representative explains that's not the point here. No one is expected to be color-blind. That's just fighting ignorance with more ignorance.",
        "Then Michael decides everyone should go around and name an ethnicity that he or she finds sexually attractive. Dwight claims he's attracted to whites and Indians. The representative does not think that's a good start. He asks Michael for permission to run this session himself and suggests it would be easier if Michael sits down.",
        "He explains that he asked each of them to write down an incident that offended them. He would like volunteers to assist him. Dwight asks that they don't do anything involving gays.",
        "The representative attempts to take control again from Michael who asks his name. When he reveals that it's Mr. Brown, Michael thinks it's a trick to see if he will call a black man Mr. Brown. Brown assures him that is his name. He goes on to explain that almost everyone wrote down the same incident and asks if everyone is familiar with the Chris Rock routine.",
        "Michael complains to the camera how Chris Rock can do a hilarious routine that makes everyone laugh, but he gets in trouble from corporate when he does the same routine. Michael volunteers to be the joker, Brown doesn't want the person who was the original offender in the same position. Kevin offers to be the joke teller, but doesn't tell it to Michael's liking. Michael interrupts with a loud, profane rendition of the routine before Brown stops him.",
        "While Jim listens to his phone ring, helpless to answer it, Brown sets up an acronym for Hero: Honesty, Empathy, Respect and Open-Mindedness. Dwight adds additional criteria that essentially describes a super-hero, not a hero. Brown passes out forms, asking everyone sign it. Michael refuses because he didn't learn anything.",
        "Privately, Brown explains that they both know he is here because of Michael's behavior. Michael argues that this office is racially advanced enough that it really doesn't need a diversity lecture. Brown tells him it does because it's Michael that caused the need for it. He only needs Michael's signature, but put the whole office through the seminar because he didn't want Michael to feel singled out. Michael feigns offense that this wasn't really about diversity then.",
        "Michael signs the form and then jokes after the fact that he signed it \"Daffy Duck\".",
        "In the meantime, Jim has tried to call back his client and has to leave a message.",
        "Michael comes out, tears up the pledge, and criticizes Mr. Brown's lack of an \"Oprah moment\". He wants everyone to get as much done before lunch as possible.",
        "Jim gets nothing but a busy signal right before Michael forces them all into the conference room again.",
        "The HR representative, Toby Flenderson asks if they are going to sit Indian style. Michael orders him out for being offensive. Then he shows the staff a video announcing his new initiative for Diversity Tomorrow and quotes Abraham Lincoln as saying, \"If you are a racist, I will attack you with the North\".",
        "Kelly Kapoor, a young Indian woman, asks to be excused for a customer meeting. Michael lets her go. He introduces himself and describes his ethnic breakdown, including that he is part Native American. Oscar asks him what part he is. Michael asks about Oscar's ethnicity. Oscar explains his parents were born in Mexico, moved here and he was born. Michael wants to know if there's something he would like to be called besides Mexican. Oscar doesn't understand why Michael would think Mexican is offensive.",
        "Jim, hearing his phone ring, runs out to grab it, but is too late.",
        "Michael hands out cards with different ethnicities on them. The employees are to take a card and then try to guess their pretend ethnicity by how their co-workers treat them.",
        "Stanley is inadvertently given Black. Dwight is Asian but can't guess it based upon people telling him they like his people's food or eat lots of rice. Michael, who's chosen Martin Luther King for himself, insists Pam stir up the pot by getting extreme. Pam hesitantly suggests to Dwight that his people aren't very good drivers. Dwight angrily asks if he's a woman.",
        "Jim goes to Pam's desk where Ryan is watching an online sketch. Ryan mentions how cute she is. Jim agrees, but that Pam is engaged. Ryan says he was talking about the girl in the sketch.",
        "Kevin is Italian and is trying to get Angela to guess that she's Jamaican by using the word \"mon\" and talking about beaches. Angela won't go any further when he asks if she wants to get high.",
        "Irritated that no one is trying very hard to be offensive, Michael immediately jumps on Kelly when she returns from her meeting by throwing himself into a really offensive Indian stereotype until Kelly slaps him. Michael gets visibly upset. He tells the employees how now Kelly knows what it's like to be a minority.",
        "Jim finally gets ahold of his client who was able to close his sale with Dwight instead who gave him a discount. Jim puts the mini champagne bottle on Dwight's desk.",
        "Michael continues mumbling about Mr. Brown and corrects Stanley on how to pronounce the word collard in collard greens. When 5 PM arrives, Pam is asleep on Jim's shoulder. He smiles at the camera, then wakes her up so they can go.",
        "He tells the camera that today was a pretty good day."
    ],
    "quotes": [
        "Dwight: Dit for tit",
        "Mr. Brown: Now, this is a simple acronym. HERO. Uh, at Diversity Today, we believe it is very easy to be a HERO. All you need are honesty, empathy, respect, and open-mindedness.\nDwight: Excuse me, I'm sorry, but that's not all it takes to be a hero.\nMr. Brown: Oh, great. Well, what is a hero to you?\nDwight: A hero kills people, people that wish him harm.\nMr. Brown: OK.\nDwight: A hero is part-human and part-supernatural. A hero is born out of a childhood trauma, or out of a disaster, that must be avenged.\nMr. Brown: Ok, you're thinking of a superhero.\nDwight: We all have a hero in our heart.",
        "Michael: Kevin is a great guy. He's a great accountant. He is not much of an entertainer.",
        "Kevin: Basically, there are two types of black people and black people are actually more racist because they hate the other type of black people. Every time the one type wants to have a good time, then the other type comes in and makes a real mess.",
        "Michael: OK. I'm sorry. I'm sorry. He's ruin... He's butchering it. Could you just let me... [As Chris Rock] Every time... Every time black people want to have a good time, some ignant ass... [Bleep] I take care of my kid!",
        "Mr. Brown: Wait a second.",
        "Michael: [Bleep] They always want credit for something they supposed to do!",
        "Mr. Brown: Stop it!",
        "Michael: [As Chris Rock] What you want a cookie?",
        "Michael: I'm Michael Scott, founder of Diversity Tomorrow because today is almost over.",
        "Michael: [to Oscar] Is there a term besides Mexican that you prefer or is it too offensive?",
        "Michael: [Talking head] Abraham Lincoln once said that \"If you're a racist, I will attack you with the North.\" And those are the principles that I carry with me in the workplace.",
        "Michael: You'll notice I didn't have anybody be an Arab. I thought that would be too explosive. No pun intended. But I just though. \"Too soon for Arabs.\" Maybe next year. Um... You know, the ball's in their court.",
        "Michael: All right? Everybody pretty? Come on. Here we go. It's time. Let's do some good.",
        "Toby: Hey, we're not all going to sit in a circle Indian style are we? [Laughing]",
        "Michael: Get out.",
        "Toby: I'm sorry.",
        "Michael: No, this is not a joke. OK? That was offensive and lame. So double offensive. This is an environment of welcoming and you should just get the hell out of here. OK, let's go. Let's do it. Come on. Let's have some fun, everybody. Here we go. Take a seat. Cop a squat. And um... thanks for coming in. Um... Diversity... is the cornerstone of progress as I've always said. But don't take my word for it. Let's take a look at the tape.",
        "Michael: I want you all to take a card, put it on your forehead... [Pam picks up a card] Don't look at it! I want you to take the card and I want you to put it on your forehead, and take a card, any card... [Angela and Pam place their cards on their foreheads, with the cards saying \"Jamaican\" and \"Jewish\" respectively] and I want you to treat other people like the race [Kevin places his card on his head; it says \"Italian\"] that is on their forehead. OK, so everyone has a different race, and nobody knows what their race is. [The camera pans over to Stanley, whose card says \"Black\".] So, I want you to really go for it, cause this is real, this isn't just an exercise, this is real life [Places a card saying \"Martin Luther King Jr.\" on his forehead] and I have a dream that you will really let the sparks fly... Git-r-done!",
        "Michael: [Goes over to Pam and Stanley] Oh! This is a good one!",
        "Pam: [To Stanley, who has been assigned \"Black\" as his race] Hi, how are you?",
        "Stanley:  I'm fine, how are you?",
        "Pam: Great... Umm... ",
        "Stanley: I admire your cultural success in America.",
        "Pam: Thank you.",
        "Michael: Bomb! Bomb! Bomb! Bomb! Come on, Olympics of suffering right here - Slavery vs. The Holocaust, come on!",
        "Stanley: [Removes his card] I know I'm not supposed to look, but who am I supposed to be? [Finds out his card says \"Black\"].",
        "Michael: That was inadvertent, we didn't actually plan that.",
        "Dwight: [Having been assigned \"Asian\" as his race] Lots of cultures eat rice. That doesn't help me. [Goes over to Pam, who has been assigned with \"Jewish\"] Shalom! I would like to apply for a loan.",
        "Pam: That's nice, Dwight.",
        "Dwight: OK, do me. Something stereotypical so I can get it really quick.",
        "Pam: OK, I like your food.",
        "Dwight: Outback Steakhouse! [Australian accent] I'm Australian, mate!",
        "Michael: Pam, come on. \"I like your food?\" Come on, stir the pot, stir the melting pot, Pam! Let's do it, let's get ugly, let's get real!",
        "Pam: OK, if I have to do this, based on stereotypes that are totally untrue, that I do not agree with, you would maybe not be a very good driver.",
        "Dwight: Oh man! Am I a woman?!",
        "Kevin: [To Angela, who has been assigned with \"Jamaican\"; He himself has been assigned with \"Italian\"] Hey.",
        "Angela: Hey.",
        "Kevin: You wanna go to the beach?",
        "Angela: Sure.",
        "Kevin: You wanna get high?",
        "Angela: No.",
        "Kevin: I think you do, mon.",
        "Angela: Stop...",
        "Michael: [Voice raised, Indian accent] Kelly, how are you?",
        "Kelly: I just had the longest meeting.",
        "Michael: Oh! Welcome to my convenience store. Would you like some googi googi? I have some very delicious googi, googi, only 99 cents plus tax. Try my googi, googi. [Lowering voice] Try my googi, googi. [High-pitched voice] Try my googi, googi. Try my... [slap!]",
        "Michael: [Trying not to cry] All right! All right! Yes! That was great, she gets it! Now she knows what it's like to be a minority.",
        "Michael: Man, I hated it when that guy was in here. Mr. Brown, if that was his real name. I mean he has never met any of us before, and here he was, telling us how to do our thing. I just wanted... I just wanted to do it our way. You know? On our own. Man, I should've gotten some food.",
        "Kevin: [Italian accent] Maybe some spagh-etti!",
        "Michael: OK, Kevin, you can take that thing off."
    ]
}