{
    "season": 1,
    "title": "Health Care",
    "episode": "3",
    "episodes": [
        3
    ],
    "coldOpens": [
        "None "
    ],
    "storylines": [
        "Because he is in charge of choosing a health plan for his employees, Michael decides that makes him the equivalent of their doctor.",
        "He wants to choose the Gold Plan which Jan explains that even she doesn't have. With downsizing possible, it's important that Michael chose an inexpensive plan for his employees. Michael, wanting to be liked, isn't enthusiastic about cutting their benefits. Jan tells him that part of being a manager involves giving unpleasant news. This is something he has to do.",
        "Michael tries to give the job to Jim who prefers he focus on his own job. He isn't planning to stay at Dunder Mifflin forever so doesn't really believe he should be acting the part of a manager. He suggests Dwight who accepts wholeheartedly, setting up a temporary workspace in the conference room.",
        "Dwight, who doesn't have any health problems and believes in cutting costs, picks a dirt cheap plan with virtually no benefits. To avoid his employees' complaints, Michael hides out in his office, pretending to have calls that Pam can tell he doesn't. After Jim and Pam try to get Dwight to have more compassion toward his co-workers, the employees gather outside the men's room and confront Michael about the plan.",
        "Michael orders Dwight to make changes and promises the crew a surprise at the end of the day. In the conference room, Dwight orders everyone to write down what diseases they need covered. Jim explains that such information is confidential. Michael leaves the office to figure out what the surprise should be, considering Atlantic City or a trip to a coal mine.",
        "In the meantime, Jim and Pam have fun making up fake diseases to put on the forms. When Dwight recognizes the prank, he accuses Jim who refuses to confess. Jim locks Dwight in the meeting room.",
        "Dwight calls Jan, identifies himself as Assistant Manager and demands the ability to fire Jim. Jan tells him he's not a manager at all. Dwight explains that Michael put him in charge of the health plan and isn't in the office right now. She lectures Dwight, tells him to never call her on her cell phone again and to have Michael call her when he gets back.",
        "When Michael returns, he throws ice cream sandwiches at the staff. They point out that this isn't a very good surprise, considering the day they've been having. Michael assures them it isn't the surprise. He goes into his office and doesn't come out.",
        "Meanwhile, Dwight goes through the questionnaires people submitted and verifies that Meredith Palmer needs coverage for an inverted vagina, Kevin for anal fissures and Angela for dermatitis. Finally he picks a plan so cheap that Oscar likens it to a pay decrease.",
        "At the end of the day, Michael is confronted again by the employees, wanting to know why he put Dwight in charge. Michael pretends not to know that Dwight picked a bad plan and that he did so against his orders. Since it's the end of the day, there's nothing to be done about it now.",
        "They ask about their surprise. While Michael still insists he has one, they walk out as he continues to kill time trying to think of one. Then Dwight tells him Jan wants to him to call her back."
    ],
    "quotes": [
        [
            {
                "speaker": "Michael",
                "content": " Well, that is, kind of a tough assignment, it's not gonna be a popular decision around the old orifice."
            }
        ],
        [
            {
                "speaker": "Dwight",
                "content": " What did I do? I did my job. I slashed benefits to the bone, I saved this company money. Was I too harsh? Maybe. I don't believe in coddling people, in the wild, there is no health care. In the wild health care is Ow, I hurt my leg, I can't run, a lion eats me and I'm dead. Wow. I'm not dead. [looks into camera] I'm the lion, you're dead"
            }
        ],
        [
            {
                "speaker": "Dwight",
                "content": " I'm now going to read out loud your submitted medical conditions. When you hear yours read, please raise your hand to indicate that it is real. If you do not raise your hand, it will not be covered."
            }
        ],
        [
            {
                "speaker": "Stanley",
                "content": " What about confidentiality?"
            }
        ],
        [
            {
                "speaker": "Dwight",
                "content": " You know what? You have forfeited that privilege. I have tried to treat you all as adults, but obviously, I am the only adult here. Number one, inverted penis."
            }
        ],
        [
            {
                "speaker": "Meredith",
                "content": " Could you mean vagina? Because if you do, I want that covered."
            }
        ],
        [
            {
                "speaker": "Dwight",
                "content": " I thought your vagina was removed during your hysterectomy?"
            }
        ],
        [
            {
                "speaker": "Meredith",
                "content": " A uterus is different from a vagina. I still have a vagina."
            }
        ],
        [
            {
                "speaker": "Dwight",
                "content": " Okay, great. Dermatitis. Thank you, Angela. I'll make sure that's covered. Who wrote this hysterical one? Anal fissures?"
            }
        ],
        [
            {
                "speaker": "Kevin",
                "content": " That's a real thing."
            }
        ],
        [
            {
                "speaker": "Dwight",
                "content": " Yeah, but no one here has it."
            }
        ],
        [
            {
                "speaker": "Kevin",
                "content": " Someone has it."
            }
        ],
        [
            {
                "speaker": "Dwight",
                "content": " Through concentration, I can raise and lower my cholesterol at will."
            }
        ],
        [
            {
                "speaker": "Pam",
                "content": " Why would you want to raise your cholesterol?"
            }
        ],
        [
            {
                "speaker": "Dwight",
                "content": " So I can lower it."
            }
        ],
        [
            {
                "speaker": "Jim",
                "content": " Wait, what are you writing? Don't write ebola or mad cow disease, all right? Because I'm suffering from both of them."
            }
        ],
        [
            {
                "speaker": "Pam",
                "content": " I'm inventing new diseases."
            }
        ],
        [
            {
                "speaker": "Jim",
                "content": " Oh, great."
            }
        ],
        [
            {
                "speaker": "Pam",
                "content": " So, like, let's say that my teeth turn to liquid and then they drip down the back of my throat? What would you call that?"
            }
        ],
        [
            {
                "speaker": "Jim",
                "content": " I thought you said you were inventing new diseases? That's spontaneous dental hydroplosion."
            }
        ],
        [
            {
                "speaker": "Pam",
                "content": " Nice."
            }
        ],
        [
            {
                "speaker": "Dwight",
                "content": " The problem, Jim, is that people who are really suffering from a medical condition won't receive the care they need because someone in this office is coming up with ridiculous stuff. \"Count Choculitis\""
            }
        ],
        [
            {
                "speaker": "Jim",
                "content": " Sounds tough."
            }
        ],
        [
            {
                "speaker": "Dwight",
                "content": " Why did you write that down Jim? Is it because you know I love Count Chocula?"
            }
        ],
        [
            {
                "speaker": "Dwight",
                "content": " OK. First, let's go over some parameters. How many people can I fire?"
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " Uh, none. You're picking a healthcare plan."
            }
        ],
        [
            {
                "speaker": "Dwight",
                "content": " Please knock. This is an office."
            }
        ],
        [
            {
                "speaker": "Jim",
                "content": " [Pointing to sign] It says \"workspace.\""
            }
        ],
        [
            {
                "speaker": "Dwight",
                "content": " Same thing."
            }
        ],
        [
            {
                "speaker": "Jim",
                "content": " If it's the same thing, then why'd you write \"workspace.\""
            }
        ],
        [
            {
                "speaker": "Dwight",
                "content": " All right, who did this? I'm not mad, I just want to know who did it so I can punish them."
            }
        ],
        [
            {
                "speaker": "Jim",
                "content": " What are you talking about?"
            }
        ],
        [
            {
                "speaker": "Dwight",
                "content": " Uh, someone, uh, forged medical information, and that is a felony."
            }
        ],
        [
            {
                "speaker": "Jim",
                "content": " Okay, whoa, all right, 'cause that's a pretty intense accusation. How do you know that they're fake?"
            }
        ],
        [
            {
                "speaker": "Dwight",
                "content": " Uh, leprosy? Flesh-eating bacteria? Hot dog fingers. Government created killer nano robot infection."
            }
        ],
        [
            {
                "content": "[to Jim]"
            }
        ],
        [
            {
                "speaker": "Dwight",
                "content": " You did this, didn't you?"
            }
        ],
        [
            {
                "speaker": "Jim",
                "content": " Absolutely not."
            }
        ],
        [
            {
                "speaker": "Dwight",
                "content": " Yes you did."
            }
        ],
        [
            {
                "speaker": "Jim",
                "content": " No I didn't."
            }
        ],
        [
            {
                "speaker": "Dwight",
                "content": " I know it was you. OK, fine, you know what? I'm going to have to interview each and every one of you until the perpetrator makes him or herself known. And until that time, there will be no health care coverage for anyone."
            }
        ],
        [
            {
                "content": "[Dwight slams the door to his workspace]"
            }
        ],
        [
            {
                "speaker": "Jim",
                "content": " [to Pam] Killer nanorobots?"
            }
        ],
        [
            {
                "speaker": "Pam",
                "content": " It's an epidemic."
            }
        ],
        [
            {
                "speaker": "Jan",
                "content": " [On phone] Dwight, listen to me very carefully: You are not a manager of anything. Understand?"
            }
        ],
        [
            {
                "speaker": "Dwight",
                "content": " That's not entirely true, because he put me in charge of picking a health care plan."
            }
        ],
        [
            {
                "speaker": "Jan",
                "content": " Really? OK. When Michael gets back, you tell him to call me immediately."
            }
        ],
        [
            {
                "speaker": "Dwight",
                "content": " Call you immediately, good. Hey, listen, since I have you on the phone, um, can I fire Jim?"
            }
        ],
        [
            {
                "speaker": "Jan",
                "content": " No."
            }
        ],
        [
            {
                "content": "[Michael doesn't want to come out of his office]"
            }
        ],
        [
            {
                "speaker": "Kevin",
                "content": " He has to some time... To go to the bathroom!"
            }
        ],
        [
            {
                "speaker": "Angela",
                "content": " Kevin, that's inappropriate."
            }
        ]
    ]
}