{
    "season": 1,
    "title": "The Alliance",
    "episode": "4",
    "episodes": [
        4
    ],
    "episodeDetails": {
        "sections": [
            {
                "title": "The Alliance",
                "level": 1,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "\"The Alliance\" is the fourth episode of the first season of The Office and the 4th overall. It was written by Michael Schur and directed by Bryan Gordon. It first aired on April 12, 2005 and was viewed by 5.4 million people."
                    }
                ],
                "images": []
            },
            {
                "title": "Summary",
                "level": 2,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Although time has dragged on, the downsizing rumors at Dunder Mifflin have not ceased. Michael will still not accept that there will be any staff cuts. Dwight feels particularly threatened by the impending crisis, and, in an act of desperation, forms an alliance with his office nemesis Jim. Jim sees the alliance as an opportunity with great potential and agrees as a lark. He immediately enlists Pam's help in the situation."
                    },
                    {
                        "type": "paragraph",
                        "text": "Meanwhile, Michael tries to boost morale in the office by having an office birthday party for Meredith, even though her birthday is a month away. Since this isn't really about Meredith, Michael has no problem despite ordering an ice cream cake even though she's lactose intolerant. He also agonizes over writing an insulting joke in her birthday card that he thinks will be hilarious. In the meantime, Oscar asks Michael for a donation for his nephew's cerebral palsy walk-a-thon. Michael looks over the $2 and $3 contributions and, feeling generous, signs up for $25. When Jim points out that the dollar amounts are per mile which adds up, Michael goes to Oscar to explain his misunderstanding. Oscar reminds him what a walk-a-thon is and thinks Michael is being cheap for retracting a charitable donation."
                    },
                    {
                        "type": "paragraph",
                        "text": "Meanwhile, Dwight, following Jim and Pam's efforts, ends up in a box in the warehouse to overhear information. The party falls flat when Michael's insulting jokes fail to amuse Meredith or anyone else."
                    },
                    {
                        "type": "paragraph",
                        "text": "At the end of the day, after a breakthrough in his pranks on Dwight, Jim giddily grabs Pam's hand in an attempt to explain what has just happened. However, Pam's fiance Roy walks in and immediately assumes Jim is hitting on her. Jim tries to explain that they were just playing a joke on Dwight by pretending to be in an alliance with him. Dwight, not finding it funny, denies any knowledge."
                    }
                ],
                "images": []
            },
            {
                "title": "Deleted scenes",
                "level": 2,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "The Season One DVD contains a number of deleted scenes from this episode. Notable cut scenes include:"
                    },
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Dwight brags to Jim how secure his computer is. Jim successfully guesses Dwight's password (\"Frodo\"). Dwight changes it, and Jim guesses it again (\"Gollum\").",
                                "elements": []
                            },
                            {
                                "text": "Michael critiques Pam's phone-answering delivery. (This is the scene used in the title sequence when Jenna Fischer's name appears.)",
                                "elements": []
                            },
                            {
                                "text": "Dwight throws old food out of the office fridge.",
                                "elements": []
                            },
                            {
                                "text": "Jim complains to Dwight that he threw out his lunch as Dwight plays with his Phillies bobbleheads.",
                                "elements": []
                            },
                            {
                                "text": "Oscar asks Angela to sign up for the walk-a-thon.",
                                "elements": []
                            },
                            {
                                "text": "Extension of Jim and Dwight's conversation in the parking lot.",
                                "elements": []
                            },
                            {
                                "text": "Toby signs Meredith's card in Michael's office, but Michael prevents him from writing any jokes.",
                                "elements": []
                            },
                            {
                                "text": "Jim hopes to get Dwight to say \"immunity\" (a la Survivor).",
                                "elements": []
                            },
                            {
                                "text": "Extended scene with Dwight trying to help Michael with Meredith's card but only with jokes referencing to her hysterectomy. When Dwight asks Michael for immunity from downsizing, Jim quietly celebrates.",
                                "elements": []
                            },
                            {
                                "text": "Michael tries to get Meredith to inconspicuously recall recent funny moments with him.",
                                "elements": []
                            },
                            {
                                "text": "Michael explains to Oscar how he shouldn't have deceived him with the walk-a-thon.",
                                "elements": []
                            },
                            {
                                "text": "Michael presents his alternate (and just as bad) card jokes to Meredith and when she starts crying he asks the cameras if they can just edit to the best one.",
                                "elements": []
                            },
                            {
                                "text": "Dwight questions Ryan about his alliances to which Ryan says \"what?\" and Dwight says \"well played\".",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Trivia",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "This episode features three alliances, a fake alliance between Jim and Dwight, a real alliance between Jim and Pam, and a minor alliance between Dwight and Roy.",
                                "elements": []
                            },
                            {
                                "text": "The Dundie awards are first mentioned in this episode. We finally get to see the Dundies in the episode \"The Dundies\".",
                                "elements": []
                            },
                            {
                                "text": "A sign seen in this episode gives Dunder Mifflin's address as 1725 Slough Avenue, a reference to the UK The Office locale in Slough, Berkshire, England.",
                                "elements": []
                            },
                            {
                                "text": "On the Season One DVD, the synopsis for this episode mistakenly refers to Jim as John, the name of the actor portraying him (John Krasinski).",
                                "elements": []
                            },
                            {
                                "text": "When Dwight asks Jim if he would like to form an alliance, Jim responds by saying \"Absolutely, I do\". This is later referenced in The Job, in which Pam says that Jim told her that if Dwight ever asks you to be in something secret, you respond with \"Absolutely, I do\".",
                                "elements": []
                            },
                            {
                                "text": "This episode marks the first appearance of the staff newsletter. The text of the staff newsletter is the same each time it appears (since it is merely a prop); only the picture and headline change.",
                                "elements": []
                            }
                        ]
                    },
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Jim mentions that Dwight should spy on the Stamford branch this would foreshadow his transfer to Stamford later in the series until the Stamford branch is shut down and Jim is transferred back to Scranton.",
                                "elements": []
                            },
                            {
                                "text": "This episodes introduces the Party Planning Committee.",
                                "elements": []
                            },
                            {
                                "text": "When discussing the color of the streamers for the party, Phyllis begins naming colors and Pam recommends green. Angela then says green is 'whorish' and the camera pans to Phyllis, who is wearing a green shirt. Later, in A Benihana Christmas, Angela tells Phyllis to get green streamers, to which Phyllis says, \"I thought you said green was whorish.\" Angela tells her orange is whorish, and the camera pans to Phyllis, who is wearing an orange shirt.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Behind the Scenes",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "In the warehouse scene with Pam, the role of Dwight in the box was played not by actor Rainn Wilson but by prop master Phil Shea. Photo. He had to scramble to obtain boxes big enough to fit Rainn Wilson. He found a company in San Diego who could make 100 boxes on very short notice.",
                                "elements": []
                            },
                            {
                                "text": "The first cut of the episode ran 37 minutes long. Producers considered making the episode a two-parter, one focusing on the Alliance and another focusing on Meredith's birthday party. This ended up not being possible because the alliance plot ends with the office decorated for a birthday party.",
                                "elements": []
                            },
                            {
                                "text": "Most of the Party Planning Committee interactions were unscripted. Greg Daniels told them, \"Just keep planning the party.\" This established the dynamic of Angela bullying Phyllis, with Pam caught in the middle. In addition to Angela calling green 'whorish', she also belittled Phyllis's suggestion that they shout, \"Happy birthday, surprise!\" instead of \"Surprise, happy birthday!\"",
                                "elements": []
                            },
                            {
                                "text": "Jenna Fischer's take on the Party Planning Committee scene was that Pam didn't volunteer but was rather forced into it by Michael, and she wanted to participate as little as possible, hoping for it to be over.",
                                "elements": []
                            },
                            {
                                "text": "The car that Dwight kicks actually belongs to actress Phyllis Smith, who plays Phyllis on the show. Rainn Wilson stated that after every take she would tell him, \"Please don't kick the hubcap too hard.\"",
                                "elements": []
                            },
                            {
                                "text": "There were over a dozen takes of the scene where Michael wolfs down cake. Steve Carell ate so much (at 7:30 in the morning) that he got sick. Jenna Fischer considers shooting the scene as \"the absolute worst\" experience on the show. \"We all got so sick [from eating ice cream cake]\". She made the mistake of taking a big bite of ice cream cake in the first take, which then required her to take big bites from then on in order to preserve continuity.",
                                "elements": []
                            },
                            {
                                "text": "Not much of the footage made the final cut, but during the party, Ryan talks to a different woman in the background of each scene. The producers thought this was a nice character touch for the new employee.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Amusing details",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "When Jim begins taping up the box, there is a rat caught in a trap under the rolling cart behind him. (The production team even went to the effort of getting an animatronic rat.)",
                                "elements": []
                            },
                            {
                                "text": "In a conversation between Toby and Ryan it is revealed that it is actually Ryan's birthday. Toby and Ryan are in mid-conversation and Toby says \"really? today?\" and Ryan says \"yeah\" Toby says \"want me to say something\" and Ryan says \"don't do that.\"",
                                "elements": []
                            },
                            {
                                "text": "In Meredith's birthday card, Michael reads what Jim wrote. \"You're an accountant, just fudge the numbers\". Meredith is in supplier relations not accounting.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Cultural references",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "The terms alliance and immunity come from the early 21st century television reality game show Survivor. Contestants are eliminated one by one, although a contestant can win \"immunity\" from elimination, and contestants typically form \"alliances\" to engineer the elimination of a rival. Randall Einhorn, the camera man for this episode and several other, was a camera man for Survivor.",
                                "elements": []
                            },
                            {
                                "text": "Come on down! is the catch phrase from the television game show The Price Is Right.",
                                "elements": []
                            },
                            {
                                "text": "\"You're fired!\" is the catch phrase from the television reality game show The Apprentice, hosted by Donald Trump.",
                                "elements": []
                            },
                            {
                                "text": "Michael uses his cell phone like a communicator from Star Trek, a 1960s science fiction television program.",
                                "elements": []
                            },
                            {
                                "text": "Beeyotches is an intentional mispronunciation of bitches, a derogatory term for women.",
                                "elements": []
                            },
                            {
                                "text": "Baskin-Robbins is a chain of ice cream parlors.",
                                "elements": []
                            },
                            {
                                "text": "Guns is a slang term for muscles, most commonly the biceps.",
                                "elements": []
                            },
                            {
                                "text": "Bird day is a pun on birthday.",
                                "elements": []
                            },
                            {
                                "text": "Mary had a little lamb is the opening line of a nursery rhyme.",
                                "elements": []
                            },
                            {
                                "text": "A walkathon is a fundraising event where donors pay a pledged amount for each mile (or other distance) the participant walks, up to a pre-set limit.",
                                "elements": []
                            },
                            {
                                "text": "Liz Taylor is an actress who has been divorced seven times.",
                                "elements": []
                            },
                            {
                                "text": "A brain fart is slang for a momentary mental lapse.",
                                "elements": []
                            },
                            {
                                "text": "Frodo and Gollum are characters from the epic fantasy novel The Lord of the Rings.",
                                "elements": []
                            },
                            {
                                "text": "Michael Jackson is a musician known for, among other things, undergoing large quantities of cosmetic surgery.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Cast",
                "level": 2,
                "content": [],
                "images": []
            },
            {
                "title": "Main cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Steve Carell as Michael Scott",
                                "elements": []
                            },
                            {
                                "text": "Rainn Wilson as Dwight Schrute",
                                "elements": []
                            },
                            {
                                "text": "John Krasinski as Jim Halpert",
                                "elements": []
                            },
                            {
                                "text": "Jenna Fischer as Pam Beesly",
                                "elements": []
                            },
                            {
                                "text": "B.J. Novak as Ryan Howard",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Recurring cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "David Denman as Roy Anderson",
                                "elements": []
                            },
                            {
                                "text": "Leslie David Baker as Stanley Hudson",
                                "elements": []
                            },
                            {
                                "text": "Brian Baumgartner as Kevin Malone",
                                "elements": []
                            },
                            {
                                "text": "Kate Flannery as Meredith Palmer",
                                "elements": []
                            },
                            {
                                "text": "Angela Kinsey as Angela Martin",
                                "elements": []
                            },
                            {
                                "text": "Paul Lieberstein as Toby Flenderson",
                                "elements": []
                            },
                            {
                                "text": "Oscar Nunez as Oscar Martinez",
                                "elements": []
                            },
                            {
                                "text": "Phyllis Smith as Phyllis Lapin",
                                "elements": []
                            },
                            {
                                "text": "Craig Robinson as Darryl Philbin",
                                "elements": []
                            },
                            {
                                "text": "Creed Bratton (actor) as Creed Bratton (uncredited)",
                                "elements": []
                            },
                            {
                                "text": "Devon Abner as Devon White (uncredited)",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "References",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "↑ Kinsey, Angela and Jenna Fischer. 2018. Office Ladies: The Alliance podcast.",
                                "elements": []
                            },
                            {
                                "text": "↑ Daniels, Greg (Producer). 2005. \"The Alliance\" [Commentary track], The Office Season One (U.S./NBC Version) [DVD], Los Angeles, CA: Universal.",
                                "elements": []
                            },
                            {
                                "text": "↑ Wilson, Rainn (Actor). 2005. \"The Alliance\" [Commentary track], The Office Season One (U.S./NBC Version) [DVD], Los Angeles, CA: Universal.",
                                "elements": []
                            },
                            {
                                "text": "↑ Fischer, Jenna (Actor), Krasinski, John (Actor), and Daniels, Greg (Producer). 2005. \"The Alliance\" [Commentary track], The Office Season One (U.S./NBC Version) [DVD], Los Angeles, CA: Universal.",
                                "elements": []
                            },
                            {
                                "text": "↑ Celebrity Parade: Jenna Fischer, Parade Magazine",
                                "elements": []
                            },
                            {
                                "text": "↑ Novak, B. J. (Actor/Writer). 2005. \"The Alliance\" [Commentary track], The Office Season One (U.S./NBC Version) [DVD], Los Angeles, CA: Universal.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            }
        ]
    },
    "quotesDetails": {
        "sections": [
            {
                "title": "The Alliance Quotes",
                "level": 1,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Dwight: Did you get your tickets?"
                    },
                    {
                        "type": "paragraph",
                        "text": "Jim: To what?"
                    },
                    {
                        "type": "paragraph",
                        "text": "Dwight: The gun show. [Rolls up his sleeve and kisses his bicep]"
                    },
                    {
                        "type": "paragraph",
                        "text": "Dwight: [Talking head] I'm a deer hunter. I go all the time with my dad. One thing about deer, they have very good vision. One thing about me, I am better at hiding than they are... at vision."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael: [Talking head] It looks like there's gonna be downsizing. And it's part of my job, but... blah! I hate it. I think the main difference between me and Donald Trump is that, uh, I get no pleasure out of saying the words, \"You're fired.\" [as Donald Trump] \"You're foir-ed. Uh, you're foir-ed.\" It just makes people sad, and an office can't function that way. No way. [as Donald Trump] \"You're foir-ed.\" I think if I had a catchphrase it would be, \"You're hired, and you can work here as long as you want.\" But that's unrealistic, so..."
                    },
                    {
                        "type": "paragraph",
                        "text": "Dwight: [Talking head] It's a real shame, 'cause studies have shown that more information gets passed through water-cooler gossip than through official memos. Which puts me at a disadvantage, because I bring my own water to work."
                    },
                    {
                        "type": "paragraph",
                        "text": "Phyllis: Well, uh, for decorations, maybe we could... it's stupid, forget it."
                    },
                    {
                        "type": "paragraph",
                        "text": "Angela: What?"
                    },
                    {
                        "type": "paragraph",
                        "text": "Phyllis: I was just going to say, maybe we could have streamers, but that's dumb, everybody has streamers. Never mind."
                    },
                    {
                        "type": "paragraph",
                        "text": "Angela: No, yeah, I think that's a good idea."
                    },
                    {
                        "type": "paragraph",
                        "text": "Phyllis: Yeah?"
                    },
                    {
                        "type": "paragraph",
                        "text": "Angela: What color do you guys think?"
                    },
                    {
                        "type": "paragraph",
                        "text": "Phyllis: Well, there's green, um, blue... yellow... red... "
                    },
                    {
                        "type": "paragraph",
                        "text": "Pam: How about green?"
                    },
                    {
                        "type": "paragraph",
                        "text": "Angela: I think green is kind of whoreish."
                    },
                    {
                        "type": "paragraph",
                        "text": "Pam: [Talking head] This was tough. I suggested we flip a coin, but Angela says she doesn't gamble. Of course by saying that, she was gambling that I wouldn't smack her."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael: So I was thinking, if you haven't already got a cake, um, maybe going for one of those ice-cream cakes from Baskin-Robbins. Those are very good. Very delicious."
                    },
                    {
                        "type": "paragraph",
                        "text": "Angela: Meredith's allergic to dairy, so..."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael: She's not the only one who's going to be eating it right? I think everybody likes ice-cream cake. It's not, uh, it's not just about her, so..."
                    },
                    {
                        "type": "paragraph",
                        "text": "Pam: It is... her birthday."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael: [to the camera] Can you get her? She's right there. [camera zooms in on Meredith at her desk] That is Meredith, the birthday girl. And this... is Meredith's card. Happy Bird-Day. [laughs] Um, let's see. Jim, Jim wrote, \"Meredith, I heard you're turning 46, but, come on, you're an accountant. Just fudge the numbers.\" Not bad, pretty funny, I don't appreciate condoning corporate fraud though. Uh, here's the thing. Whatever I write here has to be really, really funny. Because people out there are expecting it. I've already set the bar really high. And they're all worried about their jobs, you know. It's kinda dark out there. Can you imagine if I wrote something like, uh, \"Oh, Meredith, Happy Birthday. You're great. Love, Michael.\" [pretends to vomit and laughs]"
                    },
                    {
                        "type": "paragraph",
                        "text": "Jim: Toby and Kevin, they're trying to get Angela kicked off."
                    },
                    {
                        "type": "paragraph",
                        "text": "Dwight: Good, let them. It helps our cause."
                    },
                    {
                        "type": "paragraph",
                        "text": "Jim: Well, I don't know, if Kevin's in accounting, and Toby's in human resources, and they're talking..."
                    },
                    {
                        "type": "paragraph",
                        "text": "Dwight: Oh, they're forming an alliance."
                    },
                    {
                        "type": "paragraph",
                        "text": "Dwight: Dammit, god!"
                    },
                    {
                        "type": "paragraph",
                        "text": "Jim: OK, listen, we need to assume that everyone in the office is forming an alliance and is, therefore, trying to get us kicked off."
                    },
                    {
                        "type": "paragraph",
                        "text": "Dwight: God...dammit! Why us?!"
                    },
                    {
                        "type": "paragraph",
                        "text": "Jim: Because we're strong, Dwight. Because we're strong."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael: [Looking at birthday card] Meredith, bad breath. Meredith has bad breath."
                    },
                    {
                        "type": "paragraph",
                        "text": "Dwight: Hey, you wanted to see me?"
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael: Yeah, what do you know about Meredith?"
                    },
                    {
                        "type": "paragraph",
                        "text": "Dwight: I don't think she'll be missed."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael: There's not going to be downsizing Dwight, OK? I just, I need to know a little bit more about my friend."
                    },
                    {
                        "type": "paragraph",
                        "text": "Dwight: Name: Meredith Palmer. Uh, personal information: divorced twice, two kids. Uh, employer: Dunder Mifflin Incorporated. Awards: Multiple Dundies."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael: I know all that. I know all that. I just, I need something kind of embarrassing, you know, kind of fun inside."
                    },
                    {
                        "type": "paragraph",
                        "text": "Dwight: She had a hysterectomy."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael: [Laughs] Which one's that again?"
                    },
                    {
                        "type": "paragraph",
                        "text": "Dwight: That's where they remove the uterus."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael: Oh god! Dwight, no, I'm trying to write something funny. What am I going to do with a removed uterus?"
                    },
                    {
                        "type": "paragraph",
                        "text": "Dwight: It could be kind of funny."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael: You know what, I'm on a deadline here, and just... OK. Thanks, thanks for your help. I'll work it out. Thank you, Dwight. That was a waste of time."
                    },
                    {
                        "type": "paragraph",
                        "text": "Jim: Wait, this isn't going to work. The lid's open."
                    },
                    {
                        "type": "paragraph",
                        "text": "Dwight: So tape it down."
                    },
                    {
                        "type": "paragraph",
                        "text": "Jim: I can't do that. You won't be able to breathe."
                    },
                    {
                        "type": "paragraph",
                        "text": "Dwight: Look, I can breathe just fine OK, but if it makes you feel better, I'll poke holes in the box."
                    },
                    {
                        "type": "paragraph",
                        "text": "Dwight: [Talking head] Can I trust Jim? I don't know. Do I have a choice? No, frankly, I don't. Will I trust Jim? Yes. Should I trust Jim? You tell me."
                    },
                    {
                        "type": "paragraph",
                        "text": "Pam: He's in a box?"
                    },
                    {
                        "type": "paragraph",
                        "text": "Jim: Pam, he's in a box. He's downstairs, in a box, on the floor, near the shelves. I'm serious. Go down there and work your magic."
                    },
                    {
                        "type": "paragraph",
                        "text": "Pam: [In warehouse; on her phone] Hey, where are you? Yeah, we were supposed to meet her. What? Oh my gosh! That ties in perfectly with something Michael was telling me earlier! I just don't know what some of the people in, like, accounting are going to do? It said specifically that..."
                    },
                    {
                        "type": "paragraph",
                        "text": "Dwight: [His box falls over] Oh."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael: Jim, good party, huh? Just a little something I whipped up. You know, a little morale boost. No big deal."
                    },
                    {
                        "type": "paragraph",
                        "text": "Jim: Speaking of which, I meant to tell you. Very impressive, the uh, donation you gave to Oscar's charity. What was it? 25 bucks?"
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael: Well, you know, money isn't everything Jim. It's not the key to happiness. You know what is? Joy. You should remember that. Maybe you'll give more than three dollars next time."
                    },
                    {
                        "type": "paragraph",
                        "text": "Jim: Yeah, well, three dollars a mile. It's gonna end up being like 50 bucks. So... God, I can't even calculate what you're gonna have to give."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael: Is Oscar around?"
                    },
                    {
                        "type": "paragraph",
                        "text": "Pam: Happy Birthday. [gives Meredith her card]"
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael: Read it out loud. And say who wrote everything so we know whose is the best."
                    },
                    {
                        "type": "paragraph",
                        "text": "Meredith: \"Happy Bird-day\" Um... \"Meredith, good news. You're not actually a year older because you work here, where time stands still.\""
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael: [under his breath] I don't know about that."
                    },
                    {
                        "type": "paragraph",
                        "text": "Meredith: That was Stanley. \"Meredith, happy birthday, you're the best. Love, Pam.\""
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael: [pretends to vomit] Huh! Thanks, downer."
                    },
                    {
                        "type": "paragraph",
                        "text": "Meredith: This is from Michael. \"Meredith, let's hope the only downsizing that happens to you is that someone downsizes your age.\""
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael: Because of the downsizing. Rumors. And because you're gettin' old."
                    },
                    {
                        "type": "paragraph",
                        "text": "Meredith: No, I... I get it. It's funny."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael: [laughs] You didn't get the joke. So, that's cool. That's, you know what? Actually... I have a bunch of these, good ones, that I didn't use. Um... Oh, where's that? Oh, OK, here's a good one. Um... \"Hey Meredith, Liz Taylor called, she wants her age back and her divorces back.\" 'Cause Meredith's been divorced like, twice. Is that right?"
                    },
                    {
                        "type": "paragraph",
                        "text": "Meredith: You're right. You're right. Yes."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael: Divorce. Um... OK, \"Meredith is so old...\""
                    },
                    {
                        "type": "paragraph",
                        "text": "Oscar: How old is she?"
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael: Everybody? If... could do it? \"Meredith is so old...\""
                    },
                    {
                        "type": "paragraph",
                        "text": "Everyone: How old is she?"
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael: \"She's so old, she went into an antique store and they kept her.\" That wasn't even mine. I got that off the internet. Website. Um, don't get mad at me."
                    },
                    {
                        "type": "paragraph",
                        "text": "Oscar: Uh, nice party Michael."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael: This isn't my fault. Ladies, not your best effort. The streamers? I think we could have done better than that."
                    },
                    {
                        "type": "paragraph",
                        "text": "Angela: Phyllis wanted red, I didn't."
                    },
                    {
                        "type": "paragraph",
                        "text": "Phyllis: Oh, boy... You..."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael: OK, we... all right. People, hold on, hold on. Just a second. OK, I think we're losing sight of what is really important here. And that is that we are... a group of people... who work together. I was... I really wasn't gonna flaunt this. I have made a very sizable donation to Oscar's nephew's... walkathon. $25."
                    },
                    {
                        "type": "paragraph",
                        "text": "Oscar: Per mile."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael: Per mile, yes."
                    },
                    {
                        "type": "paragraph",
                        "text": "Jim: OK, OK. I have something that totally tops the box."
                    },
                    {
                        "type": "paragraph",
                        "text": "Pam: Oh, tell me, tell me."
                    },
                    {
                        "type": "paragraph",
                        "text": "Jim: OK. I have just convinced Dwight that he needs to go to Stamford and... [Pam starts laughing]... spy on our other branch. No no no. But before he does so, I told him that he should dye his hair to go undercover."
                    },
                    {
                        "type": "paragraph",
                        "text": "Pam: [laughing] That's perfect!"
                    },
                    {
                        "type": "paragraph",
                        "text": "Jim: If we can get him to drive to Connecticut... and put peroxide in his hair..."
                    },
                    {
                        "type": "paragraph",
                        "text": "Roy: [yelling] What the hell is this? What are you trying to cop a feel or something? Huh Halpert?"
                    },
                    {
                        "type": "paragraph",
                        "text": "Jim: No, no, dude, no."
                    },
                    {
                        "type": "paragraph",
                        "text": "Pam: Hey, Hey!"
                    },
                    {
                        "type": "paragraph",
                        "text": "Jim: No, dude, no, I was just, listen! Whoa."
                    },
                    {
                        "type": "paragraph",
                        "text": "Pam: Come on."
                    },
                    {
                        "type": "paragraph",
                        "text": "Jim: God, I don't even, I don't even know how to explain this. Uh, um... Dwight, uh, asked me to be in an alliance. And then um... um... we were... we've just been messing with him. Uh, because of the whole alliance thing. Um..."
                    },
                    {
                        "type": "paragraph",
                        "text": "Pam: It's just office pranks."
                    },
                    {
                        "type": "paragraph",
                        "text": "Jim: It's stupid. It's, it's just office pranks."
                    },
                    {
                        "type": "paragraph",
                        "text": "Roy: [looking at Dwight] An alliance? What the hell is he talking about?"
                    },
                    {
                        "type": "paragraph",
                        "text": "Dwight: I have absolutely no idea."
                    },
                    {
                        "type": "paragraph",
                        "text": "Dwight: [V/O] Do I feel bad about betraying Jim? Not at all. That's the game. Convince him we're in an alliance, get some information, throw him to the wolves."
                    },
                    {
                        "type": "paragraph",
                        "text": "Dwight: [In talking head, with blonde hair] That's politics baby. Get what you can out of someone, then crush them. I think Jim might have learned a very valuable lesson."
                    }
                ],
                "images": []
            }
        ]
    },
    "coldOpens": [
        "None "
    ],
    "storylines": [
        "Although time has dragged on, the downsizing rumors at Dunder Mifflin have not ceased. Michael will still not accept that there will be any staff cuts. Dwight feels particularly threatened by the impending crisis, and, in an act of desperation, forms an alliance with his office nemesis Jim. Jim sees the alliance as an opportunity with great potential and agrees as a lark. He immediately enlists Pam's help in the situation.",
        "Meanwhile, Michael tries to boost morale in the office by having an office birthday party for Meredith, even though her birthday is a month away. Since this isn't really about Meredith, Michael has no problem despite ordering an ice cream cake even though she's lactose intolerant. He also agonizes over writing an insulting joke in her birthday card that he thinks will be hilarious. In the meantime, Oscar asks Michael for a donation for his nephew's cerebral palsy walk-a-thon. Michael looks over the $2 and $3 contributions and, feeling generous, signs up for $25. When Jim points out that the dollar amounts are per mile which adds up, Michael goes to Oscar to explain his misunderstanding. Oscar reminds him what a walk-a-thon is and thinks Michael is being cheap for retracting a charitable donation.",
        "Meanwhile, Dwight, following Jim and Pam's efforts, ends up in a box in the warehouse to overhear information. The party falls flat when Michael's insulting jokes fail to amuse Meredith or anyone else.",
        "At the end of the day, after a breakthrough in his pranks on Dwight, Jim giddily grabs Pam's hand in an attempt to explain what has just happened. However, Pam's fiance Roy walks in and immediately assumes Jim is hitting on her. Jim tries to explain that they were just playing a joke on Dwight by pretending to be in an alliance with him. Dwight, not finding it funny, denies any knowledge."
    ],
    "quotes": [
        "Dwight: Did you get your tickets?",
        "Jim: To what?",
        "Dwight: The gun show. [Rolls up his sleeve and kisses his bicep]",
        "Dwight: [Talking head] I'm a deer hunter. I go all the time with my dad. One thing about deer, they have very good vision. One thing about me, I am better at hiding than they are... at vision.",
        "Michael: [Talking head] It looks like there's gonna be downsizing. And it's part of my job, but... blah! I hate it. I think the main difference between me and Donald Trump is that, uh, I get no pleasure out of saying the words, \"You're fired.\" [as Donald Trump] \"You're foir-ed. Uh, you're foir-ed.\" It just makes people sad, and an office can't function that way. No way. [as Donald Trump] \"You're foir-ed.\" I think if I had a catchphrase it would be, \"You're hired, and you can work here as long as you want.\" But that's unrealistic, so...",
        "Dwight: [Talking head] It's a real shame, 'cause studies have shown that more information gets passed through water-cooler gossip than through official memos. Which puts me at a disadvantage, because I bring my own water to work.",
        "Phyllis: Well, uh, for decorations, maybe we could... it's stupid, forget it.",
        "Angela: What?",
        "Phyllis: I was just going to say, maybe we could have streamers, but that's dumb, everybody has streamers. Never mind.",
        "Angela: No, yeah, I think that's a good idea.",
        "Phyllis: Yeah?",
        "Angela: What color do you guys think?",
        "Phyllis: Well, there's green, um, blue... yellow... red... ",
        "Pam: How about green?",
        "Angela: I think green is kind of whoreish.",
        "Pam: [Talking head] This was tough. I suggested we flip a coin, but Angela says she doesn't gamble. Of course by saying that, she was gambling that I wouldn't smack her.",
        "Michael: So I was thinking, if you haven't already got a cake, um, maybe going for one of those ice-cream cakes from Baskin-Robbins. Those are very good. Very delicious.",
        "Angela: Meredith's allergic to dairy, so...",
        "Michael: She's not the only one who's going to be eating it right? I think everybody likes ice-cream cake. It's not, uh, it's not just about her, so...",
        "Pam: It is... her birthday.",
        "Michael: [to the camera] Can you get her? She's right there. [camera zooms in on Meredith at her desk] That is Meredith, the birthday girl. And this... is Meredith's card. Happy Bird-Day. [laughs] Um, let's see. Jim, Jim wrote, \"Meredith, I heard you're turning 46, but, come on, you're an accountant. Just fudge the numbers.\" Not bad, pretty funny, I don't appreciate condoning corporate fraud though. Uh, here's the thing. Whatever I write here has to be really, really funny. Because people out there are expecting it. I've already set the bar really high. And they're all worried about their jobs, you know. It's kinda dark out there. Can you imagine if I wrote something like, uh, \"Oh, Meredith, Happy Birthday. You're great. Love, Michael.\" [pretends to vomit and laughs]",
        "Jim: Toby and Kevin, they're trying to get Angela kicked off.",
        "Dwight: Good, let them. It helps our cause.",
        "Jim: Well, I don't know, if Kevin's in accounting, and Toby's in human resources, and they're talking...",
        "Dwight: Oh, they're forming an alliance.",
        "Dwight: Dammit, god!",
        "Jim: OK, listen, we need to assume that everyone in the office is forming an alliance and is, therefore, trying to get us kicked off.",
        "Dwight: God...dammit! Why us?!",
        "Jim: Because we're strong, Dwight. Because we're strong.",
        "Michael: [Looking at birthday card] Meredith, bad breath. Meredith has bad breath.",
        "Dwight: Hey, you wanted to see me?",
        "Michael: Yeah, what do you know about Meredith?",
        "Dwight: I don't think she'll be missed.",
        "Michael: There's not going to be downsizing Dwight, OK? I just, I need to know a little bit more about my friend.",
        "Dwight: Name: Meredith Palmer. Uh, personal information: divorced twice, two kids. Uh, employer: Dunder Mifflin Incorporated. Awards: Multiple Dundies.",
        "Michael: I know all that. I know all that. I just, I need something kind of embarrassing, you know, kind of fun inside.",
        "Dwight: She had a hysterectomy.",
        "Michael: [Laughs] Which one's that again?",
        "Dwight: That's where they remove the uterus.",
        "Michael: Oh god! Dwight, no, I'm trying to write something funny. What am I going to do with a removed uterus?",
        "Dwight: It could be kind of funny.",
        "Michael: You know what, I'm on a deadline here, and just... OK. Thanks, thanks for your help. I'll work it out. Thank you, Dwight. That was a waste of time.",
        "Jim: Wait, this isn't going to work. The lid's open.",
        "Dwight: So tape it down.",
        "Jim: I can't do that. You won't be able to breathe.",
        "Dwight: Look, I can breathe just fine OK, but if it makes you feel better, I'll poke holes in the box.",
        "Dwight: [Talking head] Can I trust Jim? I don't know. Do I have a choice? No, frankly, I don't. Will I trust Jim? Yes. Should I trust Jim? You tell me.",
        "Pam: He's in a box?",
        "Jim: Pam, he's in a box. He's downstairs, in a box, on the floor, near the shelves. I'm serious. Go down there and work your magic.",
        "Pam: [In warehouse; on her phone] Hey, where are you? Yeah, we were supposed to meet her. What? Oh my gosh! That ties in perfectly with something Michael was telling me earlier! I just don't know what some of the people in, like, accounting are going to do? It said specifically that...",
        "Dwight: [His box falls over] Oh.",
        "Michael: Jim, good party, huh? Just a little something I whipped up. You know, a little morale boost. No big deal.",
        "Jim: Speaking of which, I meant to tell you. Very impressive, the uh, donation you gave to Oscar's charity. What was it? 25 bucks?",
        "Michael: Well, you know, money isn't everything Jim. It's not the key to happiness. You know what is? Joy. You should remember that. Maybe you'll give more than three dollars next time.",
        "Jim: Yeah, well, three dollars a mile. It's gonna end up being like 50 bucks. So... God, I can't even calculate what you're gonna have to give.",
        "Michael: Is Oscar around?",
        "Pam: Happy Birthday. [gives Meredith her card]",
        "Michael: Read it out loud. And say who wrote everything so we know whose is the best.",
        "Meredith: \"Happy Bird-day\" Um... \"Meredith, good news. You're not actually a year older because you work here, where time stands still.\"",
        "Michael: [under his breath] I don't know about that.",
        "Meredith: That was Stanley. \"Meredith, happy birthday, you're the best. Love, Pam.\"",
        "Michael: [pretends to vomit] Huh! Thanks, downer.",
        "Meredith: This is from Michael. \"Meredith, let's hope the only downsizing that happens to you is that someone downsizes your age.\"",
        "Michael: Because of the downsizing. Rumors. And because you're gettin' old.",
        "Meredith: No, I... I get it. It's funny.",
        "Michael: [laughs] You didn't get the joke. So, that's cool. That's, you know what? Actually... I have a bunch of these, good ones, that I didn't use. Um... Oh, where's that? Oh, OK, here's a good one. Um... \"Hey Meredith, Liz Taylor called, she wants her age back and her divorces back.\" 'Cause Meredith's been divorced like, twice. Is that right?",
        "Meredith: You're right. You're right. Yes.",
        "Michael: Divorce. Um... OK, \"Meredith is so old...\"",
        "Oscar: How old is she?",
        "Michael: Everybody? If... could do it? \"Meredith is so old...\"",
        "Everyone: How old is she?",
        "Michael: \"She's so old, she went into an antique store and they kept her.\" That wasn't even mine. I got that off the internet. Website. Um, don't get mad at me.",
        "Oscar: Uh, nice party Michael.",
        "Michael: This isn't my fault. Ladies, not your best effort. The streamers? I think we could have done better than that.",
        "Angela: Phyllis wanted red, I didn't.",
        "Phyllis: Oh, boy... You...",
        "Michael: OK, we... all right. People, hold on, hold on. Just a second. OK, I think we're losing sight of what is really important here. And that is that we are... a group of people... who work together. I was... I really wasn't gonna flaunt this. I have made a very sizable donation to Oscar's nephew's... walkathon. $25.",
        "Oscar: Per mile.",
        "Michael: Per mile, yes.",
        "Jim: OK, OK. I have something that totally tops the box.",
        "Pam: Oh, tell me, tell me.",
        "Jim: OK. I have just convinced Dwight that he needs to go to Stamford and... [Pam starts laughing]... spy on our other branch. No no no. But before he does so, I told him that he should dye his hair to go undercover.",
        "Pam: [laughing] That's perfect!",
        "Jim: If we can get him to drive to Connecticut... and put peroxide in his hair...",
        "Roy: [yelling] What the hell is this? What are you trying to cop a feel or something? Huh Halpert?",
        "Jim: No, no, dude, no.",
        "Pam: Hey, Hey!",
        "Jim: No, dude, no, I was just, listen! Whoa.",
        "Pam: Come on.",
        "Jim: God, I don't even, I don't even know how to explain this. Uh, um... Dwight, uh, asked me to be in an alliance. And then um... um... we were... we've just been messing with him. Uh, because of the whole alliance thing. Um...",
        "Pam: It's just office pranks.",
        "Jim: It's stupid. It's, it's just office pranks.",
        "Roy: [looking at Dwight] An alliance? What the hell is he talking about?",
        "Dwight: I have absolutely no idea.",
        "Dwight: [V/O] Do I feel bad about betraying Jim? Not at all. That's the game. Convince him we're in an alliance, get some information, throw him to the wolves.",
        "Dwight: [In talking head, with blonde hair] That's politics baby. Get what you can out of someone, then crush them. I think Jim might have learned a very valuable lesson."
    ]
}