{
    "season": 1,
    "title": "Basketball",
    "episode": "5",
    "episodes": [
        5
    ],
    "coldOpens": [
        "None "
    ],
    "storylines": [
        "Michael comes in to work prepared to pit the office staff against the warehouse in a game of basketball, with the losers having to work on Saturday. Michael picks Jim, Ryan and Stanley as \"Michael's 'secret weapon'\"",
        "Dwight then confronts Michael, and both of them go talk in Michael office. Dwight suggests that he should be on the team, but Michael disagrees, saying that he can't let him play because of his previous behavior. Instead, Michael gives him a temporary charge of handling the holiday and weekend. Dwight takes the position without any doubt.",
        "At his desk, Dwight is busy pretending to plan who's going to work on Saturday. While Jim is babbling about how Dwight is enjoying his small authority, Pam is aware that Dwight can ruin her fiance plans for them.",
        "The game begins and Stanley, despite being black (which is the main reason that Michael chose him), is a horrible player. Furthermore, Michael cannot make a shot, nor is he a fan of passing or defending. During the game, Roy and Jim gradually become aggressive toward each other, with Pam looking on. At a crucial point in the game, Michael is accidentally hit in the face. Michael knew his team was ahead so he claims it is a \"flagrant personal intentional foul\". He pettily stops the game and declares the office winners since they were winning when the foul occurred. The warehouse finds the call unfair and Michael caves under pressure, conceding the victory to the warehouse staff. As everybody returns to work, Kevin demonstrates his excellent shooting skills.",
        "Afterward, Michael, in a rare moment of heart, tells the office that they don't have to come in on Saturday either. However, his justification does little to calm them: \"Like coming in an extra day is going to prevent us from being downsized.\""
    ],
    "quotes": [
        [
            {
                "speaker": "Michael",
                "content": " [Talking head] Who am I? Am I Michael Scott? I don't know... I might just be a basketball machine. What's Dunder Mifflin? I've never heard of it. Filing? Paperwork? Who cares? Possible downsizing? Um... well, that's probably gonna happen, actually."
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " Oh yuck! That's even worse than you playing!"
            }
        ],
        [
            {
                "speaker": "Pam",
                "content": " Please don't throw garbage at me."
            },
            {
                "speaker": "Michael",
                "content": " Oh, Pam with a zinger!"
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " [watching Stanley play basketball] What? You gotta be kidding me!"
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " This is our warehouse or as I like to call it, the whorehouse! But, don't you call it that. I've earned the right."
            },
            {
                "speaker": "Ryan",
                "content": " Fine, don't worry about that."
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " [discussing his basketball team] We have Ryan, the new guy, right? Untested, willing to prove himself right now, a lot of passion, a lot of heart."
            },
            {
                "speaker": "Ryan",
                "content": " But I'm getting paid to skip lunch, right?"
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " And this is the foreman, Mr. Rogers!"
            },
            {
                "speaker": "Darryl",
                "content": " That's not my real name."
            },
            {
                "speaker": "Michael",
                "content": " No, Darryl. Darryl is Mr. Rogers!"
            },
            {
                "speaker": "Ryan",
                "content": " Darryl Rogers?"
            },
            {
                "speaker": "Darryl",
                "content": " Darryl Philbin. Then Regis, then Reeg, then Roger, then Mr... Rogers."
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " The hand strikes and gives a flower."
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " Let's put together the starting line-up, shall we? Stanley, of course."
            },
            {
                "speaker": "Stanley",
                "content": " I'm sorry?"
            },
            {
                "speaker": "Michael",
                "content": " Um, what do you play? Center?"
            },
            {
                "speaker": "Stanley",
                "content": " Why 'of course'? What's that supposed to mean?"
            },
            {
                "speaker": "Michael",
                "content": " I dunno... I don't remember saying that."
            },
            {
                "speaker": "Jim",
                "content": " Uh, I heard it."
            },
            {
                "speaker": "Michael",
                "content": " Well people hear a lot of things, man."
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " The great thing about sports is that it is all about character and you can learn lessons about life even if you don't win but we did because we were ahead."
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " [Talking head] Today at lunchtime we're going to be playing the warehouse staff at a friendly little game of basketball. My idea. Last time I was down there, I noticed they'd put up a couple of hoops, and I play basketball every weekend. So I thought, \"This might be kinda fun.\" And so I started messing around and... I'm sinking a few, you know. Swish, swish, swish. Nothing but net. And their jaws just dropped to the floor. African-Americans! So... you know, it's really just a good friendly game, a reason to get together."
            }
        ],
        [
            {
                "speaker": "Dwight",
                "content": " So we need someone to work this Saturday and I think that should be...Jim."
            }
        ],
        [
            {
                "speaker": "Jim",
                "content": " God this is so sad. This is the smallest amount of power I've seen go to someone's head. Phyllis, can you believe this?"
            }
        ],
        [
            {
                "speaker": "Phyllis",
                "content": " Keep me out of it."
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " [Talking head] Football is like rock and roll, it's just bam-bam-boo... And basketball is like jazz, you know? You're kind of... Dupee-doo, dupee-do. It's all downbeat, it's in the pocket, it's like... [singing] Dupee-do, dupee-do, dapee-dah..."
            }
        ]
    ]
}