{
    "season": 1,
    "title": "Basketball",
    "episode": "5",
    "episodes": [
        5
    ],
    "episodeDetails": {
        "sections": [
            {
                "title": "Basketball",
                "level": 1,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "\"Basketball\" is the fifth episode of the first season of The Office and the 5th overall. It was written and directed by Greg Daniels. It first aired on April 19, 2005 and was viewed by 5 million people."
                    }
                ],
                "images": []
            },
            {
                "title": "Summary",
                "level": 2,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Michael comes in to work prepared to pit the office staff against the warehouse in a game of basketball, with the losers having to work on Saturday. Michael picks Jim, Ryan and Stanley as \"Michael's 'secret weapon'\""
                    },
                    {
                        "type": "paragraph",
                        "text": "Dwight then confronts Michael, and both of them go talk in Michael office. Dwight suggests that he should be on the team, but Michael disagrees, saying that he can't let him play because of his previous behavior. Instead, Michael gives him a temporary charge of handling the holiday and weekend. Dwight takes the position without any doubt."
                    },
                    {
                        "type": "paragraph",
                        "text": "At his desk, Dwight is busy pretending to plan who's going to work on Saturday. While Jim is babbling about how Dwight is enjoying his small authority, Pam is aware that Dwight can ruin her fiance plans for them."
                    },
                    {
                        "type": "paragraph",
                        "text": "The game begins and Stanley, despite being black (which is the main reason that Michael chose him), is a horrible player. Furthermore, Michael cannot make a shot, nor is he a fan of passing or defending. During the game, Roy and Jim gradually become aggressive toward each other, with Pam looking on. At a crucial point in the game, Michael is accidentally hit in the face. Michael knew his team was ahead so he claims it is a \"flagrant personal intentional foul\". He pettily stops the game and declares the office winners since they were winning when the foul occurred. The warehouse finds the call unfair and Michael caves under pressure, conceding the victory to the warehouse staff. As everybody returns to work, Kevin demonstrates his excellent shooting skills."
                    },
                    {
                        "type": "paragraph",
                        "text": "Afterward, Michael, in a rare moment of heart, tells the office that they don't have to come in on Saturday either. However, his justification does little to calm them: \"Like coming in an extra day is going to prevent us from being downsized.\""
                    }
                ],
                "images": [
                    {
                        "src": "https://vignette.wikia.nocookie.net/theoffice/images/1/16/Basketball-Michael_after_seeing_the_others_ready_for_basketball_game.png/revision/latest/scale-to-width-down/207?cb=20190302044855",
                        "caption": ""
                    }
                ]
            },
            {
                "title": "Trivia",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "At least two of the scenes in the show's opening sequence are from this episode: Ryan holding up his bag and Dwight flipping his tie over his shoulder.",
                                "elements": []
                            },
                            {
                                "text": "Michael thinks Stanley is his secret weapon due to the fact that he believes all African Americans are good at Basketball.",
                                "elements": []
                            },
                            {
                                "text": "Actor Brian Baumgartner actually made 14 shots in a row, as revealed on the DVD commentary.",
                                "elements": []
                            },
                            {
                                "text": "Much of the basketball game was improvised. Greg Daniels simply told the cast to play basketball, and they kept the best parts.",
                                "elements": []
                            },
                            {
                                "text": "Although it was in the script for Roy to hit Jim in the mouth during the basketball game (and they rehearsed it), the scene in the episode was entirely accidental. The sound of the injury was juiced up during editing to make it match more closely the sound heard on set. Filming had to be halted shortly thereafter as John Krasinski was bleeding too much.",
                                "elements": []
                            },
                            {
                                "text": "Michael says he will use Oscar during baseball season, in an off-color joke about his Latino heritage. Actually, in the series' second episode (\"Diversity Day\"), there is a shot of Kevin using an oversize pencil where a magazine titled \"Baseball\" is seen on Oscar's neighboring desk.",
                                "elements": []
                            },
                            {
                                "text": "In the beginning of the episode when Dwight is wondering who will work on Saturday, Pam says that Roy wanted to do something with her on Saturday, but later Pam states that Roy wanted to take the Wave Runners to the lake that day.",
                                "elements": []
                            },
                            {
                                "text": "Jenna Fischer's imagined backstory for Pam and Roy was that they were saving up for their wedding, but their plans took a setback when Roy spent the wedding money on a pair of Wave Runners.",
                                "elements": []
                            },
                            {
                                "text": "The episode implies a number of backstories that are never explained: What did Dwight do at the basketball game with Todd Packer? What other times did Dwight usurp Angela's role as Safety Officer? Greg Daniels believed that this added to the verisimilitude of the documentary.",
                                "elements": []
                            },
                            {
                                "text": "The boom mike is visible in one of the scenes with Roy. Greg Daniels would keep a take even if it contained errors like this, because it was consistent with the documentary format.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Deleted scenes",
                "level": 2,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "The Season One DVD contains a number of deleted scenes from this episode."
                    },
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Michael and Dwight discuss the differences between Assistant Regional Manager and Assistant to the Regional Manager.",
                                "elements": []
                            },
                            {
                                "text": "Michael, Darryl and Roy talk about the Philadelphia 76ers.",
                                "elements": []
                            },
                            {
                                "text": "Michael reveals his nickname which he uses while playing basketball.",
                                "elements": []
                            },
                            {
                                "text": "Todd Packer tells Michael a racist joke over the phone, and then says he can't play the game.",
                                "elements": []
                            },
                            {
                                "text": "Dwight takes Tootsie Rolls from Angela.",
                                "elements": []
                            },
                            {
                                "text": "Kevin tells Dwight he can't come in on Saturday because he plays in a band.",
                                "elements": []
                            },
                            {
                                "text": "Pam says how Roy got her a WaveRunner, but her brother races it with Roy.",
                                "elements": []
                            },
                            {
                                "text": "Dwight shows Jim a new schedule he's made.",
                                "elements": []
                            },
                            {
                                "text": "Angela and Dwight argue over who has more authority in safety.",
                                "elements": []
                            },
                            {
                                "text": "Michael talks about basketball movies and compares it to jazz but can't remember the name of a musician.",
                                "elements": []
                            },
                            {
                                "text": "Michael almost scores a basket.",
                                "elements": []
                            },
                            {
                                "text": "Michael remembers that Kenny G is the musician he was thinking of.",
                                "elements": []
                            },
                            {
                                "text": "Stanley hurts his ankle but Michael says he still has to play, but then brings Phyllis on for him.",
                                "elements": []
                            },
                            {
                                "text": "Kevin scores seven consecutive baskets.",
                                "elements": []
                            },
                            {
                                "text": "Michael finally scores and celebrates.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Amusing details",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "During the early part of the game, after Roy makes an easy lay-up, Michael angrily shouts, \"Who's got Roy?\" presumably having forgotten that he is responsible for covering Roy. This could also be attributed to the fact that Michael doesn't want to be held accountable for Roy's scoring.",
                                "elements": []
                            },
                            {
                                "text": "During filming on the first take Steve Carell actually made the long distance shot he threw at the basket. ",
                                "elements": []
                            },
                            {
                                "text": "Over Pam's shoulder there can be seen a poster notifying the employees of an \"All Hands Meeting\" on an unspecified upcoming Saturday. The address listed for the hotel where the event is to be held is to an actual Hilton located in Glendale, California. ",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Cultural references",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Michael greets Pam by saying, \"Pam, Pam, thank you ma'am.\" The phrase Wham bam thank you ma'am is crude slang referring to a man having sex with a woman very quickly and impersonally.",
                                "elements": []
                            },
                            {
                                "text": "A pick-up game is a game formed spontaneously in a public place (such as a park) among people who do not all know each other.",
                                "elements": []
                            },
                            {
                                "text": "Regis Philbin is a television personality. Mr. Rogers was the host of the children's television program Mister Rogers' Neighborhood.",
                                "elements": []
                            },
                            {
                                "text": "To chicken out is to decline an option due to cowardice, usually applied to backing out of a previous agreement.",
                                "elements": []
                            },
                            {
                                "text": "Gimli is a fictional character from the fantasy book series The Lord of the Ring.",
                                "elements": []
                            },
                            {
                                "text": "WaveRunner is a brand of jet-ski personal water craft.",
                                "elements": []
                            },
                            {
                                "text": "Michael refers to a muscular woman as the East German gal. East Germany (which reunited with West Germany in 1990) dominated international sports competitions in part due to its athletes' use of steroids.",
                                "elements": []
                            },
                            {
                                "text": "Larry Bird is a former professional basketball player, considered by many to be one of the best players ever.",
                                "elements": []
                            },
                            {
                                "text": "In a deleted scene, Michael describes the basketball movie Like Mike but cannot remember its name.",
                                "elements": []
                            },
                            {
                                "text": "Dwight wears a mask that is similar to Richard Hamilton, a retired professional basketball player who won a championship with the Detroit Pistons.",
                                "elements": []
                            },
                            {
                                "text": "Michael kicks a ball like Nick Nolte in Blue Chips movie from 1990",
                                "elements": []
                            },
                            {
                                "text": "Michael and Dwight shouts \"defence\" it's a quote from Remember the Titans movie from 2000.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Cast",
                "level": 2,
                "content": [],
                "images": []
            },
            {
                "title": "Main Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Steve Carell as Michael Scott",
                                "elements": []
                            },
                            {
                                "text": "Rainn Wilson as Dwight Schrute",
                                "elements": []
                            },
                            {
                                "text": "John Krasinski as Jim Halpert",
                                "elements": []
                            },
                            {
                                "text": "Jenna Fischer as Pam Beesly",
                                "elements": []
                            },
                            {
                                "text": "B.J. Novak as Ryan Howard",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Recurring Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Craig Robinson as Darryl Philbin",
                                "elements": []
                            },
                            {
                                "text": "David Denman as Roy Anderson",
                                "elements": []
                            },
                            {
                                "text": "Patrice O'Neal as Lonnie",
                                "elements": []
                            },
                            {
                                "text": "Matt DeCaro as Jerry",
                                "elements": []
                            },
                            {
                                "text": "Karly Rothenberg as Madge",
                                "elements": []
                            },
                            {
                                "text": "Leslie David Baker as Stanley Hudson",
                                "elements": []
                            },
                            {
                                "text": "Brian Baumgartner as Kevin Malone",
                                "elements": []
                            },
                            {
                                "text": "Kate Flannery as Meredith Palmer",
                                "elements": []
                            },
                            {
                                "text": "Angela Kinsey as Angela Martin",
                                "elements": []
                            },
                            {
                                "text": "Paul Lieberstein as Toby Flenderson",
                                "elements": []
                            },
                            {
                                "text": "Oscar Nunez as Oscar Martinez",
                                "elements": []
                            },
                            {
                                "text": "Phyllis Smith as Phyllis Lapin",
                                "elements": []
                            },
                            {
                                "text": "Melora Hardin as Jan Levinson",
                                "elements": []
                            },
                            {
                                "text": "Philip Pickard as Philip (Uncredited)",
                                "elements": []
                            },
                            {
                                "text": "Creed Bratton as Creed Bratton (Uncredited)",
                                "elements": []
                            },
                            {
                                "text": "Devon Abner as Devon White (Uncredited)",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "References",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "↑ GMMR Exclusive Interview with David Denman",
                                "elements": []
                            },
                            {
                                "text": "↑ Kinsey, Angela and Jenna Fischer, Office Ladies podcast, Episode 5: Basketball",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            }
        ]
    },
    "quotesDetails": {
        "sections": [
            {
                "title": "Basketball Quotes",
                "level": 1,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Michael: [Talking head] Who am I? Am I Michael Scott? I don't know... I might just be a basketball machine. What's Dunder Mifflin? I've never heard of it. Filing? Paperwork? Who cares? Possible downsizing? Um... well, that's probably gonna happen, actually."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael: Oh yuck! That's even worse than you playing!"
                    },
                    {
                        "type": "paragraph",
                        "text": "Pam: Please don't throw garbage at me.\nMichael: Oh, Pam with a zinger!"
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael: [watching Stanley play basketball] What? You gotta be kidding me!"
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael: This is our warehouse or as I like to call it, the whorehouse! But, don't you call it that. I've earned the right.\nRyan: Fine, don't worry about that."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael: [discussing his basketball team] We have Ryan, the new guy, right? Untested, willing to prove himself right now, a lot of passion, a lot of heart.\nRyan: But I'm getting paid to skip lunch, right?"
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael: And this is the foreman, Mr. Rogers!\nDarryl: That's not my real name.\nMichael: No, Darryl. Darryl is Mr. Rogers!\nRyan: Darryl Rogers?\nDarryl: Darryl Philbin. Then Regis, then Reeg, then Roger, then Mr... Rogers."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael: The hand strikes and gives a flower."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael: Let's put together the starting line-up, shall we? Stanley, of course.\nStanley: I'm sorry?\nMichael: Um, what do you play? Center?\nStanley: Why 'of course'? What's that supposed to mean?\nMichael: I dunno... I don't remember saying that.\nJim: Uh, I heard it.\nMichael: Well people hear a lot of things, man."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael: The great thing about sports is that it is all about character and you can learn lessons about life even if you don't win but we did because we were ahead."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael: [Talking head] Today at lunchtime we're going to be playing the warehouse staff at a friendly little game of basketball. My idea. Last time I was down there, I noticed they'd put up a couple of hoops, and I play basketball every weekend. So I thought, \"This might be kinda fun.\" And so I started messing around and... I'm sinking a few, you know. Swish, swish, swish. Nothing but net. And their jaws just dropped to the floor. African-Americans! So... you know, it's really just a good friendly game, a reason to get together."
                    },
                    {
                        "type": "paragraph",
                        "text": "Dwight: So we need someone to work this Saturday and I think that should be...Jim."
                    },
                    {
                        "type": "paragraph",
                        "text": "Jim: God this is so sad. This is the smallest amount of power I've seen go to someone's head. Phyllis, can you believe this?"
                    },
                    {
                        "type": "paragraph",
                        "text": "Phyllis: Keep me out of it."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael: [Talking head] Football is like rock and roll, it's just bam-bam-boo... And basketball is like jazz, you know? You're kind of... Dupee-doo, dupee-do. It's all downbeat, it's in the pocket, it's like... [singing] Dupee-do, dupee-do, dapee-dah..."
                    }
                ],
                "images": []
            }
        ]
    },
    "coldOpens": [
        "None "
    ],
    "storylines": [
        "Michael comes in to work prepared to pit the office staff against the warehouse in a game of basketball, with the losers having to work on Saturday. Michael picks Jim, Ryan and Stanley as \"Michael's 'secret weapon'\"",
        "Dwight then confronts Michael, and both of them go talk in Michael office. Dwight suggests that he should be on the team, but Michael disagrees, saying that he can't let him play because of his previous behavior. Instead, Michael gives him a temporary charge of handling the holiday and weekend. Dwight takes the position without any doubt.",
        "At his desk, Dwight is busy pretending to plan who's going to work on Saturday. While Jim is babbling about how Dwight is enjoying his small authority, Pam is aware that Dwight can ruin her fiance plans for them.",
        "The game begins and Stanley, despite being black (which is the main reason that Michael chose him), is a horrible player. Furthermore, Michael cannot make a shot, nor is he a fan of passing or defending. During the game, Roy and Jim gradually become aggressive toward each other, with Pam looking on. At a crucial point in the game, Michael is accidentally hit in the face. Michael knew his team was ahead so he claims it is a \"flagrant personal intentional foul\". He pettily stops the game and declares the office winners since they were winning when the foul occurred. The warehouse finds the call unfair and Michael caves under pressure, conceding the victory to the warehouse staff. As everybody returns to work, Kevin demonstrates his excellent shooting skills.",
        "Afterward, Michael, in a rare moment of heart, tells the office that they don't have to come in on Saturday either. However, his justification does little to calm them: \"Like coming in an extra day is going to prevent us from being downsized.\""
    ],
    "quotes": [
        "Michael: [Talking head] Who am I? Am I Michael Scott? I don't know... I might just be a basketball machine. What's Dunder Mifflin? I've never heard of it. Filing? Paperwork? Who cares? Possible downsizing? Um... well, that's probably gonna happen, actually.",
        "Michael: Oh yuck! That's even worse than you playing!",
        "Pam: Please don't throw garbage at me.\nMichael: Oh, Pam with a zinger!",
        "Michael: [watching Stanley play basketball] What? You gotta be kidding me!",
        "Michael: This is our warehouse or as I like to call it, the whorehouse! But, don't you call it that. I've earned the right.\nRyan: Fine, don't worry about that.",
        "Michael: [discussing his basketball team] We have Ryan, the new guy, right? Untested, willing to prove himself right now, a lot of passion, a lot of heart.\nRyan: But I'm getting paid to skip lunch, right?",
        "Michael: And this is the foreman, Mr. Rogers!\nDarryl: That's not my real name.\nMichael: No, Darryl. Darryl is Mr. Rogers!\nRyan: Darryl Rogers?\nDarryl: Darryl Philbin. Then Regis, then Reeg, then Roger, then Mr... Rogers.",
        "Michael: The hand strikes and gives a flower.",
        "Michael: Let's put together the starting line-up, shall we? Stanley, of course.\nStanley: I'm sorry?\nMichael: Um, what do you play? Center?\nStanley: Why 'of course'? What's that supposed to mean?\nMichael: I dunno... I don't remember saying that.\nJim: Uh, I heard it.\nMichael: Well people hear a lot of things, man.",
        "Michael: The great thing about sports is that it is all about character and you can learn lessons about life even if you don't win but we did because we were ahead.",
        "Michael: [Talking head] Today at lunchtime we're going to be playing the warehouse staff at a friendly little game of basketball. My idea. Last time I was down there, I noticed they'd put up a couple of hoops, and I play basketball every weekend. So I thought, \"This might be kinda fun.\" And so I started messing around and... I'm sinking a few, you know. Swish, swish, swish. Nothing but net. And their jaws just dropped to the floor. African-Americans! So... you know, it's really just a good friendly game, a reason to get together.",
        "Dwight: So we need someone to work this Saturday and I think that should be...Jim.",
        "Jim: God this is so sad. This is the smallest amount of power I've seen go to someone's head. Phyllis, can you believe this?",
        "Phyllis: Keep me out of it.",
        "Michael: [Talking head] Football is like rock and roll, it's just bam-bam-boo... And basketball is like jazz, you know? You're kind of... Dupee-doo, dupee-do. It's all downbeat, it's in the pocket, it's like... [singing] Dupee-do, dupee-do, dapee-dah..."
    ]
}