{
    "season": 1,
    "title": "Hot Girl",
    "episode": "6",
    "episodes": [
        6
    ],
    "coldOpens": [
        "None "
    ],
    "storylines": [
        "A purse vendor, Katy, comes in to the office to sell purses for the day. While solicitors are generally not welcome in the office, Michael allows her to use the conference room to sell purses because he, as well as some of the other male staff, is attracted to her. Michael continually tries to get Katy interested in him but fails. Michael offers to give Katy a ride after work and is disturbed when he discovers her heading out with Jim, which is the beginning of the Jim-Katy Relationship. The episode also furthers Pam's character development. In the episode, we see her dissatisfaction with Roy as he says he would get with Katy if he wasn't \"dating\" Pam. Pam angrily reminds him that they are, in fact, engaged and proceeds to storm out of the kitchen. Additionaly, Pam is subtly upset by Jim's revelation that he is going to take Katy out that weekend. "
    ],
    "quotes": [
        [
            {
                "speaker": "Dwight",
                "content": " The purse girl hits everything on my checklist. Creamy skin. Straight teeth. Curly hair. Amazing breasts. Not for me, for my children. The Schrutes produce very thirsty babies."
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " Well, first what we have to do is find out what motivates people more than anything else."
            },
            {
                "speaker": "Dwight",
                "content": " Sex."
            },
            {
                "speaker": "Michael",
                "content": " It's illegal. Can't do that. Next best thing."
            },
            {
                "speaker": "Dwight",
                "content": " Torture."
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " All right, girls! Break it up. You're being infiltrated. Cock in the henhouse!"
            },
            {
                "speaker": "Dwight",
                "content": " Cocks in the henhouse!"
            },
            {
                "speaker": "Michael",
                "content": " Don't say cocks."
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " I do read Small Businessman. I also subscribe to USA Today and American Way magazine, that's the in-flight magazine, some great articles in that. They did this great... profile last month of Doris Roberts and where she likes to eat when she's Phoenix. Illuminating."
            }
        ],
        [
            {
                "speaker": "Jan",
                "content": " We've created an incentive program to increase sales. At the end of the month, you can reward your top seller with a prize worth up to $1,000."
            },
            {
                "speaker": "Michael",
                "content": " Whoa. Howdy ho. Wow, a thousand big ones. That's cool. Do, I, uh, do I get to pick the prize?"
            },
            {
                "speaker": "Jan",
                "content": " Uh, yes. Yes, you can."
            },
            {
                "speaker": "Michael",
                "content": " Um, question: does top salesman include people who were at one time such outstanding salesman that they've been promoted to..."
            },
            {
                "speaker": "Jan",
                "content": " No, Michael, no. You, you can't win this prize."
            },
            {
                "speaker": "Michael",
                "content": " I didn't mean me!"
            }
        ],
        [
            {
                "speaker": "Pam",
                "content": " Uh, Michael..."
            },
            {
                "speaker": "Michael",
                "content": " Pam!"
            },
            {
                "speaker": "Pam",
                "content": " Hey, there's...."
            },
            {
                "speaker": "Michael",
                "content": " Burger with cheese!"
            },
            {
                "speaker": "Pam",
                "content": " There's a person..."
            },
            {
                "speaker": "Michael",
                "content": " And fries!"
            },
            {
                "speaker": "Pam",
                "content": " There's..."
            },
            {
                "speaker": "Michael",
                "content": " And shake! What? Go ahead."
            },
            {
                "speaker": "Pam",
                "content": " There's a person here who wants to sell handbags."
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " [to Katy] No, here's the thing, you know? I do my best to be my own man and go by the beat of a different drummer and nobody gets me and they're always putting up walls and I'm always tearing 'em down, just breaking down barriers, that's what I do all day. So... a coffee?"
            }
        ],
        [
            {
                "speaker": "Ryan",
                "content": " Wow. How many filet-o-fishes did you eat?"
            }
        ]
    ]
}