{
    "season": 2,
    "title": "Booze Cruise",
    "episode": "11",
    "episodes": [
        11
    ],
    "coldOpens": [
        "Dwight's things are in the vending machine because Jim hides it and makes him pay to get his wallet with nickels. "
    ],
    "storylines": [
        "The episode opens with Dwight, who is incensed that Jim has put all of his possessions in the vending machine. Pam puts in some money and buys Dwight's pencil cup, to his great dismay.  Michael sends out a vague memo telling the staff to pack a number of random items, including a swimsuit, a toothbrush, rubber-soled shoes and a ski-mask, in preparation for the company's first quarter leadership training trip. The surprise trip turns out to be a \"booze cruise\" on Lake Wallenpaupack, and the staff is not happy--it's January, and much too cold for a cruise. Michael tells the staff: \"Leader... ship. The word \"ship\" is hidden inside the word \"leadership,\" as its derivation. So if this office is, in fact, a ship, as its leader, I am the captain!\" When they arrive on the boat, however, Michael immediately feels threatened by the ship's captain, Captain Jack, who declares that he will be the ship's \"party captain\" for the evening. A hilarious battle for top authority on the ship ensues, with Michael echoing everything Captain Jack says.",
        "Jim brings Katy, his new girlfriend, (played by Amy Adams) as his date, and Pam brings Roy along.  The four soon start talking, and it becomes clear that Katy and Roy enjoy each other more than they do their respective partners. Pam and Jim are left alone together, and the romantic tension is palpable. As the party inside begins, Michael tries unsuccessfully to motivate his staff and is disappointed when Captain Jack does a better job.  The awkwardness Michael creates is magnified by the fact Dunder Mifflin's group is not the only group on the boat. When Dwight volunteers to hold the limbo stick, Captain Jack sends him outside to \"steer the ship.\" Angela asks Dwight to come inside and talk to her, but he refuses, saying \"I can't. Do you want us to run aground, woman?!\" (The wheel Dwight is so seriously manning turns out to be fake). When Captain Jack leaves the festivities with Meredith, Michael claims wildly that the ship is sinking and will be at the bottom of the lake in mere minutes. At first no one believes him, but soon people start to panic and one passenger jumps overboard. Captain Jack returns and, after discovering what Michael has done, handcuffs him to the railing outside to prevent him from causing any more trouble. Roy, motivated by Captain Jack's stories about commitment (and slightly drunk), announces to Pam that it's time to set a date for their wedding. He suggests June 10th, and Pam happily accepts. After seeing this, Jim becomes depressed and soon breaks up with Katy, who is shocked and upset. Jim then admits to Michael that he has strong feelings for Pam. Michael more surprised than anything tells him he usually has a radar that kind of thing. Jim looks down and seems ready to let Pam go, Michael tells him that if he really likes her then he shouldn't give up. Michael also tells Jim: \"engaged ain't married,\" encouraging him never to give up on Pam."
    ],
    "quotes": [
        [
            {
                "speaker": "Michael",
                "content": " Sometimes you have to take a break from being the kind of boss that's always trying to teach people things. Sometimes you have to just be the boss of dancing."
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " In an office, when you are ranking people, Manager is higher than Captain. On a boat, who knows, it's nebulous."
            }
        ],
        [
            {
                "speaker": "Oscar",
                "content": " Last year, Michael's theme was \"Bowl over the competition\". So, guess where we went?"
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " Don't tell anybody, but we are going on a booze cruise on Lake Wallenpaupack!"
            },
            {
                "speaker": "Stanley",
                "content": " In January?"
            },
            {
                "speaker": "Michael",
                "content": " It's cheaper."
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " Well, if you like her so much, uh, don't give up on her."
            },
            {
                "speaker": "Jim",
                "content": "She's enganged."
            },
            {
                "speaker": "Michael",
                "content": "Pfff, BFD. Enganged ain't married"
            }
        ]
    ]
}