{
    "season": 2,
    "title": "Michael's Birthday",
    "episode": "19",
    "episodes": [
        19
    ],
    "coldOpens": [
        "Michael tries to interest the guys in purchasing calling cards. Jim asks Michael how is it not a pyramid scheme and goes on draw a pyramid around the sketch Michael has drawn to explain the idea, proving to everyone that this indeed is a pyramid scheme. "
    ],
    "storylines": [
        "Michael is excited to be celebrating his birthday and tries to get the employees excited with him. Unfortunately for Michael, Dwight seems to be the only one joining in, as the rest of the employees are more concerned with Kevin, who is awaiting his results from his skin cancer screening. Pam and Jim meanwhile decide to sneak out and go to the store to shop for gifts for Kevin.",
        "When Michael finds out about Kevin's predicament, he gives Kevin his condolences, but subtly remains bitter that Kevin is ruining his birthday fun. Dwight and Angela are less subtle than they think they are being when discussing their secret relationship within earshot of Ryan. After goofing around at the store, Jim and Pam return to the office. To \"make Kevin feel better\", Michael takes the employees out ice skating. At the rink, he also runs into his real estate agent Carol with her children and he entertains them, which puts a smile on Carol's face. Kevin gets the call about his results, which turn up negative, to everyone's relief except for Michael's who believes that negative meant he did have cancer. He later explains that \"Apparently, in the medicine community, negative means good, which makes absolutely no sense. In the real world community, ye-that would be... chaos.\" The gifts are passed out to Kevin and Michael and Pam expresses her feelings on the \"great day\"."
    ],
    "quotes": [
        [
            {
                "speaker": "Kelly",
                "content": " I never really thought about death until Princess Diana died. That was the saddest funeral ever. [Pauses] That and my sister's."
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " When I was seven, my mother hired a pony and a cart to come to my house for all the kids... and... I got a really bad rash from the pony, and all the kids got to ride the pony and I had to go inside, and my mother was rubbing cream on me... for probably three hours, and I never came outside. And by the time I got out the pony was already in the truck. And around the corner. So that was my worst birthday."
            }
        ],
        [
            {
                "speaker": "Dwight",
                "content": " Why tip someone for a job I'm capable of doing myself? I can deliver food. I can drive a taxi. I can, and do, cut my own hair. I did, however, tip my urologist, because... I am unable to pulverize my own kidney stones. "
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " When I was sixteen, I was supposed to go out on a date with a girl named Julie. But there was another Michael in the class that she apparently thought the date was with, so she went out with him, on my birthday. And, she got him a cake, at the restaurant. And it wasn't even his birthday, but I heard about it the next day in school. So... That was the worst birthday I think I ever had. "
            }
        ]
    ]
}