{
    "season": 2,
    "title": "Take Your Daughter to Work Day",
    "episode": "18",
    "episodes": [
        18
    ],
    "episodeDetails": {
        "sections": [
            {
                "title": "Take Your Daughter to Work Day",
                "level": 1,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "\"Take Your Daughter to Work Day\" is the eighteenth episode of the second season of The Office and the 24th overall. It was written by Mindy Kaling and directed by Victor Nelli Jr. It first aired on March 16, 2006. It was viewed by 5.42 million people."
                    }
                ],
                "images": []
            },
            {
                "title": "Synopsis",
                "level": 2,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "It is \"Take Your Daughter To Work Day\" at Dunder Mifflin Scranton, which Michael laments, as he feels he's not good with kids. Toby and Stanley bring their daughters (Sasha and Melissa respectively), Kevin brings his fiancée's daughter Abby, and Meredith brings her son Jake. Pam is determined to become one child's friend by the end of the day. Michael starts to win over Toby's daughter Sasha when she visits him in his office. Stanley's daughter develops a crush on Ryan, but a jealous Kelly alerts Stanley, leading him to reprimand Ryan for his \"motives\". Jim makes friends with Kevin's future step-daughter, who asks Jim over for dinner. However, Jim declines because he has a date, presumably Brenda from the Booze Cruise."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael shows the office his childhood appearance on the kid's show, Fundle Bundle, where he revealed his childhood dream was to \"get married and have 100 kids, so I can have 100 friends, and no one can say 'no' to being my friend.\" He becomes depressed and retreats into his office when the children remind him that he never achieved that dream (or anything resembling it). Toby then talks to him and Michael decides to start online dating (with the unfortunate username of \"LittleKidLover\"). After tormenting Dwight all day (and calling him \"Mr. Poop\"), Meredith's son is insulted by him, much to Angela's pleasure. Pam ends up winning over Meredith's son with the paper shredder. Jim leaves the pizza party early to go on a date, to Pam's chagrin. Michael and Dwight end the party with their duet of Crosby, Stills, Nash & Young's \"Teach Your Children\"."
                    }
                ],
                "images": []
            },
            {
                "title": "Trivia",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Alec Zbornak, who plays the blonde kid interviewed by Edward R. Meow, is the son of producer Kent Zbornak.[1]",
                                "elements": []
                            },
                            {
                                "text": "Two of Greg Daniels' kids, Haley and Spencer, guest star in this episode as Kevin's step-daughter and Meredith's son, respectively.",
                                "elements": []
                            },
                            {
                                "text": "At the end of the episode when Michael and Dwight are singing, Jim comments why would Michael own a guitar if he doesn't play it. In the episode Email Surveillance, Jim has a guitar sitting in his room and he does not play. Further confirmed in \"Local Ad\" when Pam inquires about Jim's Second Life avatar having a guitar and he admits he does not play.",
                                "elements": []
                            },
                            {
                                "text": "During his talking head interview Kevin says to the camera that he doesn't want Abby to look on his computer implying he may have explicit content. This is the second instance of a talking head being cut short.",
                                "elements": []
                            },
                            {
                                "text": "Meredith's reason for bringing Jake into work is that he was suspended from school however it is never explained why he was suspended.",
                                "elements": []
                            },
                            {
                                "text": "Michael wears a suit when he was on the TV show as a child. This is one of the many references in the show to Michael dressing formally as a child/teenager.",
                                "elements": []
                            },
                            {
                                "text": "Toby has his daughter with him, but in other episodes it is suggested that Toby only has custody of Sasha on weekends, like most single fathers do.",
                                "elements": []
                            },
                            {
                                "text": "When Michael takes the kids over to Creed's desk, you can see Toby watching them through the kitchen.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Deleted scenes",
                "level": 2,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "The Season Two DVD contains a number of deleted scenes from this episode. Notable cut scenes include:"
                    },
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "The Party Planning Committee squabbles over what food to serve.",
                                "elements": []
                            },
                            {
                                "text": "In a talking head interview, Jim suspects Toby's daughter Sasha may not think he's cool because she's seen him play with dolls.",
                                "elements": []
                            },
                            {
                                "text": "Dwight and Meredith's son have an argument over whether Optimus Prime will have flames in the upcoming Transformers movie. It turned out that Optimus was given flames, thus making Dwight correct.",
                                "elements": []
                            },
                            {
                                "text": "In a talking head interview, Stanley complains that his daughter is spoiled.",
                                "elements": []
                            },
                            {
                                "text": "Angela won't let Kevin pretend to be the head accountant just for the day.",
                                "elements": []
                            },
                            {
                                "text": "Roy and Darryl joke around with Jake, but when Darryl touches the boy, Michael angrily intervenes. In a talking head interview, Michael admits that he didn't do background checks on the warehouse crew.",
                                "elements": []
                            },
                            {
                                "text": "Jake asks for and gets a quarter from Michael for the vending machine. He then extracts a dollar. And then asks, \"Will you marry my mom?\"",
                                "elements": []
                            },
                            {
                                "text": "Oscar finds Melissa using his computer. She refuses to give it up.",
                                "elements": []
                            },
                            {
                                "text": "Abby playfully chases Sasha around the office.",
                                "elements": []
                            },
                            {
                                "text": "Dwight discovers an eraser in his coffee, put there by Jake.",
                                "elements": []
                            },
                            {
                                "text": "Abby notices Pam's drawing and notes that she wants to be an artist when she grows up. Pam tells her she shares the same dream. Abby responds, \"You are grown up.\"",
                                "elements": []
                            },
                            {
                                "text": "In the break room, Kelly complains to Pam that \"Stanley's daughter is such a slut.\"",
                                "elements": []
                            },
                            {
                                "text": "Ryan finds Sasha playing under his desk.",
                                "elements": []
                            },
                            {
                                "text": "Jim gives Abby an official certificate of appreciation. To satisfy Dwight, Jim shows him the certification number. In a talking head interview, Jim admits that he just made up the numbers, \"but you do what you have to do.\"",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Cultural references",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Michael's discussion about how nobody ever rebels against the fun uncle is a reference to Hamlet.",
                                "elements": []
                            },
                            {
                                "text": "Take Our Daughters to Work (now Take Our Daughters and Sons to Work) is an annual program that encourages employees to bring a pre-teen to work to expose them to career opportunities.",
                                "elements": []
                            },
                            {
                                "text": "Pam. Ms. Beesly if you're nasty is a modification of Janet. Ms. Jackson if you're nasty, a line from the Janet Jackson song Nasty.",
                                "elements": []
                            },
                            {
                                "text": "R and G are movie ratings in the United States. G-rated movies are suitable for all ages and typically target young children. R-rated movies require that patrons under age 17 be accompanied by an adult; it is the most restrictive movie rating in common use.",
                                "elements": []
                            },
                            {
                                "text": "Eddie Murphy is a comedian and actor. His stand-up performance in Raw was notable for its prolific use of profanity. His 2003 movie Daddy Day Care was decidedly more family-friendly.",
                                "elements": []
                            },
                            {
                                "text": "The super-hero Superman lives in the city Metropolis. As Jim and Dwight correctly note, Gotham City is the home of Batman. Aquaman, as his name suggests, lives in the sea.",
                                "elements": []
                            },
                            {
                                "text": "Students in eighth grade are approximately 13 or 14 years old.",
                                "elements": []
                            },
                            {
                                "text": "A student is suspended from school as a form of punishment. When on suspension, one of the most severe punishments available in the United States, the student cannot attend regular classes.",
                                "elements": []
                            },
                            {
                                "text": "From the Mixed-Up Files of Mrs. Basil E. Frankweiler is an award-winning children's book. In it, the protagonist hides in the Metropolitan Museum of Art.",
                                "elements": []
                            },
                            {
                                "text": "Michael's announcement \"Next stop: Cu......camonga\" recalls a recurring joke from the 1940s radio show \"Jack Benny Program\", wherein a train announcer calls off a list of stops and takes a long pause between the first and second syllables of the name Cucamonga.",
                                "elements": []
                            },
                            {
                                "text": "Jake calls his mother by her first name. As Dwight notes, this is considered disrespectful in United States culture. Even adults address their parents by title and not by name.",
                                "elements": []
                            },
                            {
                                "text": "Struwwelpeter is indeed a collection of cautionary tales for children.",
                                "elements": []
                            },
                            {
                                "text": "Dane Cook is an American stand-up comedian and actor.",
                                "elements": []
                            },
                            {
                                "text": "Fundle Bundle with Miss Trudy is a made-up children's show based on the real-life show \"Hatchy Milatchy\" and its host \"Miss Judy\".",
                                "elements": []
                            },
                            {
                                "text": "Brunetti's Pizza is a real pizza restaurant in Scranton.",
                                "elements": []
                            },
                            {
                                "text": "The name of the puppet Edward R. Meow is a pun on legendary newscaster Edward R. Murrow.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Goofs",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "When the office workers point out a young Chet Montgomery on Fundle Bundle, Phyllis says, \"He's the meteorologist from channel 4,\" but Darryl says, \"Checking in with Chet. Doppler 7.\"",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Cast",
                "level": 2,
                "content": [],
                "images": []
            },
            {
                "title": "Main cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Steve Carell as Michael Scott",
                                "elements": []
                            },
                            {
                                "text": "Rainn Wilson as Dwight Schrute",
                                "elements": []
                            },
                            {
                                "text": "John Krasinski as Jim Halpert",
                                "elements": []
                            },
                            {
                                "text": "Jenna Fischer as Pam Beesly",
                                "elements": []
                            },
                            {
                                "text": "B.J. Novak as Ryan Howard",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Supporting cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "David Denman as Roy Anderson",
                                "elements": []
                            },
                            {
                                "text": "Leslie David Baker as Stanley Hudson",
                                "elements": []
                            },
                            {
                                "text": "Brian Baumgartner as Kevin Malone",
                                "elements": []
                            },
                            {
                                "text": "Kate Flannery as Meredith Palmer",
                                "elements": []
                            },
                            {
                                "text": "Angela Kinsey as Angela Martin",
                                "elements": []
                            },
                            {
                                "text": "Oscar Nunez as Oscar Martinez",
                                "elements": []
                            },
                            {
                                "text": "Phyllis Smith as Phyllis Lapin",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Recurring cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Paul Lieberstein as Toby Flenderson",
                                "elements": []
                            },
                            {
                                "text": "Mindy Kaling as Kelly Kapoor",
                                "elements": []
                            },
                            {
                                "text": "Creed Bratton (actor) as Creed Bratton",
                                "elements": []
                            },
                            {
                                "text": "Craig Robinson as Darryl Philbin",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Guest cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Jazz Raycole as Melissa Hudson",
                                "elements": []
                            },
                            {
                                "text": "Delaney Ruth Farrellas as Sasha Flenderson",
                                "elements": []
                            },
                            {
                                "text": "Spencer Daniels as Jake Palmer",
                                "elements": []
                            },
                            {
                                "text": "Haley Daniels as Abby",
                                "elements": []
                            },
                            {
                                "text": "Sue Nelson as Ms. Trudy",
                                "elements": []
                            },
                            {
                                "text": "Kevin Carlson as Edward R. Meow (voice)",
                                "elements": []
                            },
                            {
                                "text": "Damani Roberts as Chet Montgomery",
                                "elements": []
                            },
                            {
                                "text": "Jake Kalendar as Young Michael Scott",
                                "elements": []
                            },
                            {
                                "text": "Alec Zbornak as Blonde Kid",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            }
        ]
    },
    "quotesDetails": {
        "sections": [
            {
                "title": "Take Your Daughter to Work Day Quotes",
                "level": 1,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Pam: I'm looking forward to 'Take Your Daughter to Work' day. I am not great with kids, but I wanna get better. Because I'm getting married. So, I put out a bunch of extra candy out on my desk so the kids will come talk to me. [Pause] Like the witch in Hansel and Gretel."
                    },
                    {
                        "type": "paragraph",
                        "text": "Kevin: Abby's my fiancee Stacy's daughter. I think she'll have a good time - I just hope she doesn't look on my computer... Actually, I better go check!"
                    },
                    {
                        "type": "paragraph",
                        "text": "Ryan: Kelly and I both agreed that we would just have fun. And, I'm learning that, fun for Kelly is... getting married, and having babies... immediately... with me."
                    },
                    {
                        "type": "paragraph",
                        "text": "Meredith: I got permission to bring Jakey into work - which is great, because... he got suspended this week, and now I don't have to pay for a sitter."
                    },
                    {
                        "type": "paragraph",
                        "text": "Ryan: Stanley yelled at me today... That was one of the most frightening experiences of my life..."
                    },
                    {
                        "type": "paragraph",
                        "text": "Stanley: [to Ryan] Boy have you lost your mind?"
                    }
                ],
                "images": []
            }
        ]
    },
    "coldOpens": [
        "Michael says he works with a bunch of nerds when Jim and Dwight correct his use of superhero analogies when talking to the kids. "
    ],
    "storylines": [
        "It is \"Take Your Daughter To Work Day\" at Dunder Mifflin Scranton, which Michael laments, as he feels he's not good with kids. Toby and Stanley bring their daughters (Sasha and Melissa respectively), Kevin brings his fiancée's daughter Abby, and Meredith brings her son Jake. Pam is determined to become one child's friend by the end of the day. Michael starts to win over Toby's daughter Sasha when she visits him in his office. Stanley's daughter develops a crush on Ryan, but a jealous Kelly alerts Stanley, leading him to reprimand Ryan for his \"motives\". Jim makes friends with Kevin's future step-daughter, who asks Jim over for dinner. However, Jim declines because he has a date, presumably Brenda from the Booze Cruise.",
        "Michael shows the office his childhood appearance on the kid's show, Fundle Bundle, where he revealed his childhood dream was to \"get married and have 100 kids, so I can have 100 friends, and no one can say 'no' to being my friend.\" He becomes depressed and retreats into his office when the children remind him that he never achieved that dream (or anything resembling it). Toby then talks to him and Michael decides to start online dating (with the unfortunate username of \"LittleKidLover\"). After tormenting Dwight all day (and calling him \"Mr. Poop\"), Meredith's son is insulted by him, much to Angela's pleasure. Pam ends up winning over Meredith's son with the paper shredder. Jim leaves the pizza party early to go on a date, to Pam's chagrin. Michael and Dwight end the party with their duet of Crosby, Stills, Nash & Young's \"Teach Your Children\"."
    ],
    "quotes": [
        "Pam: I'm looking forward to 'Take Your Daughter to Work' day. I am not great with kids, but I wanna get better. Because I'm getting married. So, I put out a bunch of extra candy out on my desk so the kids will come talk to me. [Pause] Like the witch in Hansel and Gretel.",
        "Kevin: Abby's my fiancee Stacy's daughter. I think she'll have a good time - I just hope she doesn't look on my computer... Actually, I better go check!",
        "Ryan: Kelly and I both agreed that we would just have fun. And, I'm learning that, fun for Kelly is... getting married, and having babies... immediately... with me.",
        "Meredith: I got permission to bring Jakey into work - which is great, because... he got suspended this week, and now I don't have to pay for a sitter.",
        "Ryan: Stanley yelled at me today... That was one of the most frightening experiences of my life...",
        "Stanley: [to Ryan] Boy have you lost your mind?"
    ]
}