{
    "season": 2,
    "title": "Dwight's Speech",
    "episode": "17",
    "episodes": [
        17
    ],
    "episodeDetails": {
        "sections": [
            {
                "title": "Dwight's Speech",
                "level": 1,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "\"Dwight's Speech\" is the seventeenth episode of the second season of The Office and the 23rd overall. It was written by Paul Lieberstein and directed by Charles McDougall. It first aired on March 2, 2006. It was viewed by 8.4 million people."
                    }
                ],
                "images": []
            },
            {
                "title": "Synopsis",
                "level": 2,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Dwight, the company's top salesman of the year, worries over a speech he must give at a ceremony honoring him. Jim \"helps\" him by giving him suggestions and speech notes from speeches of famous dictators."
                    },
                    {
                        "type": "paragraph",
                        "text": "Kelly hints to Ryan she'd like to get married, but Ryan hurts her feelings by saying he doesn't ever plan to get married. When Pam tries to tell Ryan how Kelly feels about him, he coldly says, \"I know what I said.\""
                    },
                    {
                        "type": "paragraph",
                        "text": "Jim, upset at having to hear wedding planning at Pam's desk, calls a travel agent and arranges a trip to Australia. When he tells Pam about it later, she is initially excited, until he tells her that he's leaving June 8th, meaning he will not be able to attend her wedding."
                    }
                ],
                "images": []
            },
            {
                "title": "Deleted scenes",
                "level": 2,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "The Season Two DVD contains a number of deleted scenes from this episode. Notable cut scenes include:"
                    },
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Dwight comes to work wearing sunglasses and tries to get Jim to complete the sentence, \"My future is so bright...\"",
                                "elements": []
                            },
                            {
                                "text": "Dwight practices his speech, and Michael criticizes his delivery.",
                                "elements": []
                            },
                            {
                                "text": "After Dwight's failed announcement, Michael tries to find a joke \"that not even you [Dwight] can ruin.\" Dwight begins telling the staff a sailor joke, but Meredith stops him because her nephew is serving in Iraq.",
                                "elements": []
                            },
                            {
                                "text": "In the speaking exercise, Phyllis toasts to her good fortune for having found a man she is in love with. Ryan describes how he hopes to land a \"challenging full-time or part-time position somewhere else.\" This is met with applause from the other staff, but this troubles Michael. In a talking-head interview, Michael explains that the fact that Ryan (as a temporary employee) can leave at any time scares him. This is the first time Michael has shown anything but admiration for Ryan.",
                                "elements": []
                            },
                            {
                                "text": "Ryan brings Pam the wrong type of stamps for her wedding invitations.",
                                "elements": []
                            },
                            {
                                "text": "Michael and Dwight look for the meeting hall. Their first stop is a numismatic meeting, then a science fiction convention, featuring the cast of Battlestar Galactica. Dwight gushes in adoration for the character of Starbuck, and Michael asks him, \"Are you a twelve-year-old girl?\"",
                                "elements": []
                            },
                            {
                                "text": "An extended scene of Michael's unfunny and extremely awkward speech.",
                                "elements": []
                            }
                        ]
                    },
                    {
                        "type": "paragraph",
                        "text": "Non-notable cut scenes include Michael scratching an itch on his thigh, Dwight nervously clicking a pen, and several closeups of Jim's face."
                    }
                ],
                "images": []
            },
            {
                "title": "Trivia",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "In Creed's talking head, he says, \"我的中華的朋友你好\" (\"Hello, my Chinese friends\") in an accent so thick it is practically unintelligible. What's more, his shout-out is in Mandarin, even though the primary dialect in Hong Kong is Cantonese.",
                                "elements": []
                            },
                            {
                                "text": "Global Television Network in Canada aired this episode the day before it aired in the United States due to a scheduling conflict with Skating with Celebrities.",
                                "elements": []
                            },
                            {
                                "text": "Portions of Dwight's speech are drawn from the speeches of Lenin (\"No revolution is worth anything unless it can defend itself\") and Benito Mussolini (\"Blood alone moves the wheels of history\"; \"It is a privilege to fight [with them]!\"). He also draws on Karl Marx , though it is from the book The Communist Manifesto and not a speech (\"Workers [/salesmen and women] of the world, Unite\").",
                                "elements": []
                            },
                            {
                                "text": "Dwight's award may have come at the expense of Jim. In Diversity Day, Jim loses a sale that normally makes up 25% of his yearly commission to Dwight. More than likely this had a significant impact on making Dwight the number one salesperson and Jim number nine.",
                                "elements": []
                            },
                            {
                                "text": "In this episode, Ryan tells us that Jim eats a ham and cheese sandwich everyday. However, in a deleted scene from The Alliance, Jim brings a tuna sandwich for lunch.",
                                "elements": []
                            },
                            {
                                "text": "According to writer Paul Lieberstein, Jim never did go on his Australian vacation it likely either he cancelled it or he moved his trip to the following week so he can go to Pam's wedding.[1]",
                                "elements": []
                            },
                            {
                                "text": "About halfway through Michael's improvised speech, a shot can be seen mirrored, evidenced by the backwards nametag of the closest guy named Luke",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Amusing details",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "On the inside door of Michael's cabinet is a framed clipping from the Dunder Mifflin staff newsletter announcing the promotion of \"Jan Gould\". Michael's crush on Jan goes back very far.",
                                "elements": []
                            },
                            {
                                "text": "Michael's North East Sales Association Top Salesman plaque incorrectly spells the word \"association\" with an \"s\" instead of a \"c.\"",
                                "elements": []
                            },
                            {
                                "text": "When Stanley tells his wife, \"Get the wallpaper,\" Creed sits at his desk pretending to play the drums.",
                                "elements": []
                            },
                            {
                                "text": "In the conference room scene, after Dwight pulls out his index cards, Angela is the only one looking forward to his speech.",
                                "elements": []
                            },
                            {
                                "text": "During the cold open, when Michael is throwing the football to Dwight he hits Jim's desk knocking a bunch of frames and pens onto the boxes in front of Jim's and Dwight's desk. Then right before Jim intercepts a subsequent throw, there are no boxes anymore.",
                                "elements": []
                            },
                            {
                                "text": "It is implied that Michael has never been to a wedding in his adult life despite being in his 40s.",
                                "elements": []
                            },
                            {
                                "text": "Even though Oscar is the one who set the thermostat to a colder temperature, he can be seen wearing his jacket when Dwight and Michael are leaving.",
                                "elements": []
                            },
                            {
                                "text": "Dwight says at one point that he lost a spelling bee to Raj Patel when he misspelled the word \"failure\". This line was completely improvised by Rainn Wilson.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Cultural references",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Heisman is the name of a football trophy. Michael strikes the pose depicted on the award.",
                                "elements": []
                            },
                            {
                                "text": "When Pam teases Jim in the kitchen for losing to Dwight, Jim drinks from a mug that says \"Together building a better Scranton. Restoring the Pride.\" This was the motto of the Scranton downtown revitalization project.",
                                "elements": []
                            },
                            {
                                "text": "Club Med is a chain of resorts.",
                                "elements": []
                            },
                            {
                                "text": "Hedonism Resorts is a pair of resorts in Jamaica, known for its naturism/nudism.",
                                "elements": []
                            },
                            {
                                "text": "V.A. is short for Veterans Administration. VA buildings are often rented for events.",
                                "elements": []
                            },
                            {
                                "text": "Good Morning, Vietnam is the title and catch phrase from a 1987 movie.",
                                "elements": []
                            },
                            {
                                "text": "The black guy from the \"Police Academy\" movies is actor Michael Winslow who has a talent for making sound effects using his voice.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Quotes",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Dwight: \"Blood alone moves the wheels of history! Have you ever asked yourselves in an hour of meditation, which everyone finds during the day,how long we have been striving for greatness? Not only the years we've been at war, the war of work, but from the moment as a child when we realized that the world could be conquered. It has been a lifetime struggle. A never-ending fight. I say to you, and you will understand that it is a privilege to fight! We are warriors! Salesmen of north-eastern Pennsylvania, I ask you once more: Rise and be worthy of this historical hour! No revolution is worth anything unless it can defend itself! Some people will tell you salesman is a bad word. They'll conjure up images of used car dealers and door to door charlatans. This is our duty: to change their perception. I say salesmen... and women of the world unite! We must never acquiesce for it is together, TOGETHER, THAT WE PREVAIL! We must never cede control of the motherland! For it is together that [the audience] we prevail!\"",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Cast",
                "level": 2,
                "content": [],
                "images": []
            },
            {
                "title": "Main Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Steve Carell as Michael Scott",
                                "elements": []
                            },
                            {
                                "text": "Rainn Wilson as Dwight Schrute",
                                "elements": []
                            },
                            {
                                "text": "John Krasinski as Jim Halpert",
                                "elements": []
                            },
                            {
                                "text": "Jenna Fischer as Pam Beesly",
                                "elements": []
                            },
                            {
                                "text": "B.J. Novak as Ryan Howard",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Supporting Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Leslie David Baker as Stanley Hudson",
                                "elements": []
                            },
                            {
                                "text": "Brian Baumgartner as Kevin Malone",
                                "elements": []
                            },
                            {
                                "text": "Kate Flannery as Meredith Palmer",
                                "elements": []
                            },
                            {
                                "text": "Angela Kinsey as Angela Martin",
                                "elements": []
                            },
                            {
                                "text": "Oscar Nunez as Oscar Martinez",
                                "elements": []
                            },
                            {
                                "text": "Phyllis Smith as Phyllis Lapin",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Recurring Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Creed Bratton (actor) as Creed Bratton",
                                "elements": []
                            },
                            {
                                "text": "Mindy Kaling as Kelly Kapoor",
                                "elements": []
                            },
                            {
                                "text": "Paul Lieberstein as Toby Flenderson",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Guest Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Ben Carroll as Announcer",
                                "elements": []
                            },
                            {
                                "text": "John Kelly as Salesman",
                                "elements": []
                            },
                            {
                                "text": "Sean Lake as Sci-Fi Attendee (Uncredited)",
                                "elements": []
                            },
                            {
                                "text": "Randy Vinneau as Conference-goer (Uncredited)",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "External Links",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Jenna Fischer's TV Guide blog",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            }
        ]
    },
    "quotesDetails": {
        "sections": [
            {
                "title": "Dwight's Speech Quotes",
                "level": 1,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Michael: Good morning Vietnam! \nDwight: He will never act again"
                    },
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Dwight: \"Blood alone moves the wheels of history! Have you ever asked yourselves in an hour of meditation, which everyone finds during the day,how long we have been striving for greatness? Not only the years we've been at war, the war of work, but from the moment as a child when we realized that the world could be conquered. It has been a lifetime struggle. A never-ending fight. I say to you, and you will understand that it is a privilege to fight! We are warriors! Salesmen of north-eastern Pennsylvania, I ask you once more: Rise and be worthy of this historical hour! No revolution is worth anything if it cannot defend itself! Some people will tell you salesman is a bad word. They'll conjure up images of used car dealers and door to door charlatans. This is our duty: to change their perception. I say salesmen... and women of the world unite! We must never acquiesce for it is together, TOGETHER, THAT WE PREVAIL! We must never cede control of the motherland!\"",
                                "elements": []
                            }
                        ]
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael: I captivated the guy, who captivated a thousand guys."
                    }
                ],
                "images": []
            }
        ]
    },
    "coldOpens": [
        "Michael and Dwight throw a football around the office, and it ends with Dwight tackling Ryan down. Michael then is about to throw it at Pam before the theme cuts it off. "
    ],
    "storylines": [
        "Dwight, the company's top salesman of the year, worries over a speech he must give at a ceremony honoring him. Jim \"helps\" him by giving him suggestions and speech notes from speeches of famous dictators.",
        "Kelly hints to Ryan she'd like to get married, but Ryan hurts her feelings by saying he doesn't ever plan to get married. When Pam tries to tell Ryan how Kelly feels about him, he coldly says, \"I know what I said.\"",
        "Jim, upset at having to hear wedding planning at Pam's desk, calls a travel agent and arranges a trip to Australia. When he tells Pam about it later, she is initially excited, until he tells her that he's leaving June 8th, meaning he will not be able to attend her wedding."
    ],
    "quotes": [
        "Michael: Good morning Vietnam! \nDwight: He will never act again",
        null,
        "Michael: I captivated the guy, who captivated a thousand guys."
    ]
}