{
    "season": 2,
    "title": "The Secret",
    "episode": "13",
    "episodes": [
        13
    ],
    "coldOpens": [
        "Jim says, \"Up dog\" leading Michael getting tricked into saying \"What's Up Dog?\". Michael tries to use it unsuccessfully. "
    ],
    "storylines": [
        "The show starts of with Jim telling a joke to Pam, which Michael then goes to tell everyone else that he can, only he keeps messing it up. Meanwhile, Dwight is assigning everyone their spring cleaning tasks, but soon discovers that Oscar isn't at work. He tells Michael and they proceed to call his house. Oscar says that he has the flu, and Dwight and Michael interrogate him about his symptoms to see if he is lying. Dwight is given permission to investigate Oscar's sickness.",
        "Afterwards, Pam is talking to Kelly about her wedding stuff, like her hair and veil. Pam's hair is down at the time and Michael notices, calling it sexy.  Pam puts it back up. On his way to the breakroom he tells Jim that it must be torture for him, knowing what he knows of Jim's feelings for Pam. Jim tells Michael that this subject needs to remain a secret.",
        "Since Dwight is investigating Oscar, he gives Ryan the task of spring cleaning. In the meantime, Jim and Michael get a soda, and Michael asks about Pam in code, i.e., he spells her name, while Stanley is in the room, causing Jim to leave. Dwight continues to call Oscar. Dwight then tells the camera that there are ways to tell if someone is lying but you must speak face-to-face, and since Dwight talked to Oscar over the phone, he cannot tell. Next, Michael continues to talk to Jim, but Dwight interrupts and asks what the secret is. Michael then lies to Dwight, doing everything on Dwight's list of ways to determine if someone is lying. Michael takes Jim to Hooters, and wants to talk about Pam. Dwight talks to Pam about Oscar's sick phone call. He asks about Oscar's sniffling, and rummages through all of the jelly beans, taking the remaining black ones, forcing Pam to throw the remainder out. Later on, Michael keeps asking about Pam, he also tells the staff that it was his birthday. They return to the office, and Dwight updates Michael on the Oscar situation.",
        "Michael eventually reveals Jim's secret and Jim is forced to admit his crush, wanting to tell Pam himself rather than let her find out from Michael or someone else who knows. However, he plays it down and tells her that while he used to have a crush on her, he is over it. Unbeknownst to Jim, Michael later adds to the ambiguity by implying to Pam that Jim's crush on her had not really ended.  Pam and Jim leave together, however, and she does not seem to feel too awkward."
    ],
    "quotes": [
        [
            {
                "speaker": "Jim",
                "content": " Yeah, on the Booze Cruise, I told Michael about some feelings I used to have for Pam...I, had just broken up with Katy and, had a couple of drinks, and...I confided in the world's worst confidante."
            }
        ],
        [
            {
                "speaker": "Dwight",
                "content": " There are several different ways to tell if a perp is lying. The liar will avoid direct eye contact. The liar will cover part of his or her face with his hands, especially the mouth. The liar will perspire. Unfortunately I spoke to Oscar on the phone so none of this is useful."
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " Dwight! Hey is it me or does this place smell like up-dog?"
            }
        ],
        [
            {
                "speaker": "Dwight",
                "content": " What's up-dog?"
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " Gotcha! [laughing] Oh, God. [low] Crap! Nothin' how ya doing?"
            }
        ],
        [
            {
                "speaker": "Dwight",
                "content": " Good. How are you doing?"
            }
        ],
        [
            {
                "speaker": "Jim",
                "content": " [mouthing] So close."
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " [low] Damn it."
            }
        ]
    ]
}