{
    "season": 2,
    "title": "The Injury",
    "episode": "12",
    "episodes": [
        12
    ],
    "coldOpens": [
        "Dwight crashes into a pole and throws up while rushing to get Michael after he calls for help because he burned his foot on a George Foreman Grill. "
    ],
    "storylines": [
        "Michael burns his foot stepping on to a George Foreman grill, and then tries to convince his staff that he has a serious injury. To do this, he irritates the office (Pam and Ryan, notably) to help him with his \"injury\". For example: He asks Pam to spread butter on his foot, and when Michael falls off the toilet, he yells for Ryan to help him. When Ryan refuses to do this, Michael calls a meeting in the conference room. During all this, Dwight, who tries to pick Michael up and bring him in to work upon hearing of his injury, crashes his car exiting Dunder Mifflin's parking lot, giving himself a concussion. Because of this Dwight is more helpful and friendly to Pam, which Jim notes. In the conference room meeting, Michael shows pictures of handicapped people (Forrest Gump, Franklin D. Roosevelt, Tom Hanks as Josh Baskin in Big which he mistakes for Philadelphia.) Then the handicapped business park manager enters and is told he was invited by Michael to come. When he asks if anyone has any questions about the building rules, Dwight raises his hand and says nothing. When Michael tells the building's manager that they are similar because they are \"disabled\" this causes him to wheel out. When Jim sees him enter the elevator he asks Jim \"What's wrong with that guy?\" meaning Dwight. He then states that he looks like he has a concussion. Ryan, sick of Michael, puts medicine in his pudding to help him recover. While Michael is boasting about his recovery, Dwight collapses, and Jim and Michael (Michael being less than willingly) take him to the hospital. While Jim waits in the waiting room, he calls Pam at the office, and tells her that Michael is taking Dwight to get a CATscan. Angela tries to listen into this. The episode ends with Michael trying to stick his foot into the CATscan machine."
    ],
    "quotes": [
        [
            {
                "speaker": "Michael",
                "content": " I enjoy having breakfast in bed. I like waking up to the smell of bacon, sue me. And since I don't have a butler, I have to do it myself. So, most nights before I go to bed, I will lay six strips of bacon out on my George Foreman Grill. Then I go to sleep. When I wake up, I plug in the grill, I go back to sleep again. Then I wake up to the smell of crackling bacon. It is delicious, it's good for me. It's the perfect way to start the day. Today I got up, I stepped onto the grill and it clamped down on my foot... that's it. I don't see what's so hard to believe about that."
            }
        ],
        [
            {
                "speaker": "Jim",
                "content": " So where are you shipping your foot?"
            }
        ],
        [
            {
                "speaker": "Jim",
                "content": " Do you think Dwight's being a little weird today?"
            },
            {
                "speaker": "Pam",
                "content": " No - he's actually been really nice, and helpful."
            },
            {
                "speaker": "Jim",
                "content": " And that isn't weird?"
            }
        ],
        [
            {
                "speaker": "Jim",
                "content": " I wanna clamp Michael's face in a George Foreman grill."
            }
        ],
        [
            {
                "speaker": "Billy Merchant",
                "content": " What's wrong with that guy?"
            },
            {
                "speaker": "Jim",
                "content": " You mean today? He stepped on a George Foreman grill and he burned his foot."
            },
            {
                "speaker": "Billy Merchant",
                "content": " No, not Michael, the moon-faced kid who crashed into the pole...He looks like he has a concussion!"
            }
        ],
        [
            {
                "speaker": "Dwight",
                "content": " Where are we going? Where are we going?"
            },
            {
                "speaker": "Jim",
                "content": " Chuck E. Cheese."
            },
            {
                "speaker": "Michael",
                "content": " Ugh! I'm sick of Chuck E. Cheese."
            },
            {
                "speaker": "Jim",
                "content": " We're going to the hospital, Michael "
            },
            {
                "speaker": "Michael",
                "content": " I know I'm just saying."
            }
        ],
        [
            {
                "content": "(as Pam is hugging him)"
            },
            {
                "speaker": "Dwight",
                "content": " Oh, huggy-hugs."
            }
        ]
    ]
}