{
    "season": 2,
    "title": "Take Your Daughter to Work Day",
    "episode": "18",
    "episodes": [
        18
    ],
    "coldOpens": [
        "Michael says he works with a bunch of nerds when Jim and Dwight correct his use of superhero analogies when talking to the kids. "
    ],
    "storylines": [
        "It is \"Take Your Daughter To Work Day\" at Dunder Mifflin Scranton, which Michael laments, as he feels he's not good with kids. Toby and Stanley bring their daughters (Sasha and Melissa respectively), Kevin brings his fiancée's daughter Abby, and Meredith brings her son Jake. Pam is determined to become one child's friend by the end of the day. Michael starts to win over Toby's daughter Sasha when she visits him in his office. Stanley's daughter develops a crush on Ryan, but a jealous Kelly alerts Stanley, leading him to reprimand Ryan for his \"motives\". Jim makes friends with Kevin's future step-daughter, who asks Jim over for dinner. However, Jim declines because he has a date, presumably Brenda from the Booze Cruise.",
        "Michael shows the office his childhood appearance on the kid's show, Fundle Bundle, where he revealed his childhood dream was to \"get married and have 100 kids, so I can have 100 friends, and no one can say 'no' to being my friend.\" He becomes depressed and retreats into his office when the children remind him that he never achieved that dream (or anything resembling it). Toby then talks to him and Michael decides to start online dating (with the unfortunate username of \"LittleKidLover\"). After tormenting Dwight all day (and calling him \"Mr. Poop\"), Meredith's son is insulted by him, much to Angela's pleasure. Pam ends up winning over Meredith's son with the paper shredder. Jim leaves the pizza party early to go on a date, to Pam's chagrin. Michael and Dwight end the party with their duet of Crosby, Stills, Nash & Young's \"Teach Your Children\"."
    ],
    "quotes": [
        [
            {
                "speaker": "Pam",
                "content": " I'm looking forward to 'Take Your Daughter to Work' day. I am not great with kids, but I wanna get better. Because I'm getting married. So, I put out a bunch of extra candy out on my desk so the kids will come talk to me. [Pause] Like the witch in Hansel and Gretel."
            }
        ],
        [
            {
                "speaker": "Kevin",
                "content": " Abby's my fiancee Stacy's daughter. I think she'll have a good time - I just hope she doesn't look on my computer... Actually, I better go check!"
            }
        ],
        [
            {
                "speaker": "Ryan",
                "content": " Kelly and I both agreed that we would just have fun. And, I'm learning that, fun for Kelly is... getting married, and having babies... immediately... with me."
            }
        ],
        [
            {
                "speaker": "Meredith",
                "content": " I got permission to bring Jakey into work - which is great, because... he got suspended this week, and now I don't have to pay for a sitter."
            }
        ],
        [
            {
                "speaker": "Ryan",
                "content": " Stanley yelled at me today... That was one of the most frightening experiences of my life..."
            }
        ],
        [
            {
                "speaker": "Stanley",
                "content": " [to Ryan] Boy have you lost your mind?"
            }
        ]
    ]
}