{
    "season": 2,
    "title": "The Dundies",
    "episode": "1",
    "episodes": [
        1
    ],
    "episodeDetails": {
        "sections": [
            {
                "title": "The Dundies",
                "level": 1,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "\"The Dundies\" is the first episode of the second season of The Office and the 7th overall. It was written by Mindy Kaling and directed Greg Daniels . It first aired on September 20, 2005, and was viewed by 9 million people."
                    }
                ],
                "images": []
            },
            {
                "title": "Synopsis",
                "level": 2,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "It's time for \"The Dundies\", Michael's annual embarrassing awards show for the Dunder-Mifflin Scranton employees, which takes place at the local Chili's restaurant. He thinks they love the awards and his comedy act, but in fact, they're dreaded."
                    },
                    {
                        "type": "paragraph",
                        "text": "Phyllis, Pam, and Kelly chat and giggle by the water cooler. Dwight asks them what the joke is, and learns that somebody wrote something on the ladies' room wall about Michael. He demands to know what it is, but the women won't tell. Dwight's attempts to determine what is written on the wall are embarrassingly unsuccessful."
                    },
                    {
                        "type": "paragraph",
                        "text": "Jan tells Michael that corporate will not fund the party, which breaks his hopes of a drunken show. Michael invites friends and family to the show to quiet rumors."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael asks Pam to go through the old Dundies footage for highlights. From an earlier Dundies, we see Michael award Pam the \"World's Longest Engagement\" award. Jim tries to convince Michael to give Pam a different award this year."
                    },
                    {
                        "type": "paragraph",
                        "text": "The awards begin with Michael attempting to perform a rap, but he can't keep up with the lyrics. Oscars sums up the Dundies \"as like a kid's birthday party, where there's nothing for you to do, but the kid's having a good time.\" As everyone prepares to order, Michael tells them they have to pay for their meals and drinks. Michael's jokes fall flat; Dwight's contributions also are not helpful. Darryl and Roy, concluding that the awards are lame, leave early, taking Pam with them. In the parking lot, Pam and Roy have an argument, and Pam returns to the awards show, just in time for Michael's caricature of a Chinese man named Ping."
                    },
                    {
                        "type": "paragraph",
                        "text": "While Michael awards Dundies to various members of the office staff, Pam consumes a beer and two margaritas and shows signs of being drunk. As he sings another song, Michael gets heckled by some other customers. Humiliated, Michael decides to wrap it up, but an intoxicated Pam (along with Jim) encourages him to finish the show, which he does. Pam braces herself for her annual \"World's Longest Engagement\" award, but is relieved to get the \"Whitest Sneakers\" award. Pam thanks Michael and, after an emotional acceptance speech, drunkenly kisses Jim on the lips."
                    },
                    {
                        "type": "paragraph",
                        "text": "As Jim recaps the Dundies for the documentary camera, Pam drunkenly falls off her stool. Dwight springs into action, but his assistance is not taken seriously by anyone. In a talking-head interview, the manager of the Chili's restaurant explains that Pam is no longer welcome at the restaurant chain due to her behavior."
                    },
                    {
                        "type": "paragraph",
                        "text": "While waiting for Angela to arrive (Pam is drunk herself), Pam admits to Jim that it was in fact she who wrote the graffiti on the ladies' room wall. She also begins to ask Jim a question, but stops herself when she notices the cameras. Jim helps Pam into Angela's car and smiles contentedly as he watches them leave."
                    }
                ],
                "images": []
            },
            {
                "title": "Deleted scenes",
                "level": 2,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "The Season Two DVD contains a number of deleted scenes from this episode. Notable cut scenes include:"
                    },
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Extension of Michael's \"TMI\" talking-head interview.",
                                "elements": []
                            },
                            {
                                "text": "In talking-head interviews:",
                                "elements": [
                                    {
                                        "text": "Toby is glad that he hasn't won any Dundies.",
                                        "elements": []
                                    },
                                    {
                                        "text": "Kelly describes having dinner with Toby at the Dundies.",
                                        "elements": []
                                    },
                                    {
                                        "text": "Angela is annoyed at always being the designated driver.",
                                        "elements": []
                                    },
                                    {
                                        "text": "Jim explains that Michael puts more effort into the Dundies than anything else.",
                                        "elements": []
                                    },
                                    {
                                        "text": "Dwight describes being a whistleblower.",
                                        "elements": []
                                    },
                                    {
                                        "text": "Kevin finds Ping funny.",
                                        "elements": []
                                    },
                                    {
                                        "text": "Michael tries to guess what the letters O.P.P. stand for.",
                                        "elements": []
                                    }
                                ]
                            },
                            {
                                "text": "Dwight mocks the women as they chat by the water cooler.",
                                "elements": []
                            },
                            {
                                "text": "Michael asks Jim for ideas for Kevin's Dundie. When Dwight informs Michael of the graffiti in the ladies' room, Michael instructs him to find out what it says.",
                                "elements": []
                            },
                            {
                                "text": "Dwight tries to peek into the ladies' room without going in. (An alternate take of the scene in which Phyllis catches him in the ladies' room.)",
                                "elements": []
                            },
                            {
                                "text": "Dwight interrogates Angela about the graffiti.",
                                "elements": []
                            },
                            {
                                "text": "Kelly and Oscar ask Michael not to do his Ping impression. Michael is unrepentant.",
                                "elements": []
                            },
                            {
                                "text": "Extension of the scene in which Phyllis catches Dwight in the ladies' room. Phyllis goes to Michael and demands that Dwight be disciplined.",
                                "elements": []
                            },
                            {
                                "text": "Dwight abruptly shuts off the accounting department computers to get them to leave for the Dundies.",
                                "elements": []
                            },
                            {
                                "text": "Michael prepares backstage at the Dundies.",
                                "elements": []
                            },
                            {
                                "text": "Extension of the opening Dundies rap.",
                                "elements": []
                            },
                            {
                                "text": "Kevin talks with Pam and Roy about the \"Longest Engagement\" award.",
                                "elements": []
                            },
                            {
                                "text": "Michael hands out the \"Most creative writing on the ladies' room wall\" Dundie.",
                                "elements": []
                            },
                            {
                                "text": "Toby tells Michael that Ryan's award was inappropriate..",
                                "elements": []
                            },
                            {
                                "text": "Extension of Dwight tending to Pam's fall off a stool.",
                                "elements": []
                            },
                            {
                                "text": "The Chili's manager orders Michael to leave, which ends with Michael hugging him and saying he'll see him next year.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Trivia/Goofs",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": ".Greg Daniels intended the Dundies concept to be the pilot episode for the show, but NBC requested that the pilot be an adaptatation of the British show. Nevertheless, Michael adjusts his Dundie in the Season 1 opening credits.",
                                "elements": []
                            },
                            {
                                "text": "The Dundies are inspired by the Swampy awards which Greg Daniels gave to the staff at his previous show King of the Hill. It was the identical \"businessman with briefcase\" award.",
                                "elements": []
                            },
                            {
                                "text": "The episode was filmed at an abandoned restaurant, reconstructed to look like a Chili's. Greg Daniels recalls that it was a closed Black Angus. It is the first time the show left the office.",
                                "elements": []
                            },
                            {
                                "text": "One of two scenes with the Chili's manager that made the final cut almost didn't get shot at all. The crew started packing up at the end of the day, and Christopher T. Wood had to remind the director that they hadn't shot the talking head yet. [1] The manager is also seen telling Dwight to put his clothes back on, after Dwight takes his shirt off to put under Pam's head following her fall at the bar.",
                                "elements": []
                            },
                            {
                                "text": "Devon, the employee fired in the Halloween episode, is first mentioned here. He previously appeared (without being mentioned by name) in several first-season episodes.",
                                "elements": []
                            },
                            {
                                "text": "This episode introduces the recurring joke of Michael's unusual affection for Ryan: He awards Ryan the \"Hottest in the office\" award and slaps him on the buttocks. The writers intended the episode The Fire to be the origin of Michael's weird affection for him, but NBC requested that the season begin with The Dundies.",
                                "elements": []
                            },
                            {
                                "text": "In the spat between Roy and Pam, the actors were under the impression that the scene would be played silently, so they improvised an argument.",
                                "elements": []
                            },
                            {
                                "text": "In the original script, Pam vomits and Dwight responds, \"A woman has vomited!\" The completed script was not available to Chili's until shooting had already started, and they objected to a customer vomiting in their restaurant. Chili's withdrew its permission to shoot, but, after a few hours, Steve Carell developed a compromise: Pam falls off her bar stool and Dwight responds, \"A woman has had a seizure!\"",
                                "elements": []
                            },
                            {
                                "text": "In the original script, Pam was to be overserved alcohol by the Chili's staff. Chili's didn't want this in the episode either, so the writers had Pam steal drinks off other people's tables instead.",
                                "elements": []
                            },
                            {
                                "text": "The extras playing the waitstaff at Chili's are all actual Chili's workers.",
                                "elements": []
                            },
                            {
                                "text": "Since Jenna Fischer doesn't drink much in real life, B.J. Novak took her out so she could get drunk while Novak described to her how she was behaving and how it didn't match her own perception. She drew upon this experience for her performance.",
                                "elements": []
                            },
                            {
                                "text": "The episode ends with Elton John's Tiny Dancer playing in the background, the second time in the series that background music is added. (The Pilot also included background music.)",
                                "elements": []
                            },
                            {
                                "text": "The movie Almost Famous uses the song Tiny Dancer in a notable scene. Rainn Wilson appeared in the film as one of the editors of Rolling Stone magazine.",
                                "elements": []
                            },
                            {
                                "text": "This was one of six episodes that was submitted to Emmy voters for Best Comedy consideration, which they went on to win. The other five were Booze Cruise, Christmas Party, The Injury, The Secret, and Valentine's Day.",
                                "elements": []
                            },
                            {
                                "text": "Originally, the characters were planned to go to the Outback Steakhouse instead of Chili's. Director and Co Creator Ricky Gervais noted a then-developing deal between The Office and the Outback chain in a 2005 audio commentary for The Simpsons episode \"Bart Sells His Soul\", which contains a subplot about a similar family restaurant and which Daniels wrote.",
                                "elements": []
                            },
                            {
                                "text": "Strangely, Michael's hair is much thicker and fuller compared to his receding hairline and balding that is seen in season one.",
                                "elements": []
                            },
                            {
                                "text": "This episode marks the first physical appearance of Stanley's wife Teri Hudson who Michael thinks is African-American until he points out that she is white",
                                "elements": []
                            },
                            {
                                "text": "In a deleted scene Dwight shuts down everyone's computer to get everyone ready to go to the Dundie Awards if he were to do that then when they would log on the next day they would have to likely enter a password to log back in.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Connections to previous episodes",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "This episode reprises Dwight's status as a volunteer sheriff's deputy, initially introduced in a talking head interview in the Pilot.",
                                "elements": []
                            },
                            {
                                "text": "Michael adjusts a Dundie in the opening credits of every episode. The Dundies were first mentioned by name in The Alliance when Dwight tries to help Michael write a message in Meredith's birthday card.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Cultural references",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Fat Albert is a character created by Bill Cosby. Michael does an impression of the character when he calls Jim Fat Halpert.",
                                "elements": []
                            },
                            {
                                "text": "T.M.I is an outdated slang phrase. Short for \"Too much information\", it is used when someone reveals too much personal information about himself. Don't go there is another outdated slang phrase, used to indicate the speaker's discomfort with at a new topic of conversation.",
                                "elements": []
                            },
                            {
                                "text": "Show me the money! is a catch phrase from the movie Jerry Maguire.",
                                "elements": []
                            },
                            {
                                "text": "Dave Barry is a humorist who used to write for the Miami Herald.",
                                "elements": []
                            },
                            {
                                "text": "Carnac is a comic character of late night talk show host Johnny Carson. Wearing a turban, Carnac would use his psychic powers to answer a question written inside a sealed envelope.",
                                "elements": []
                            },
                            {
                                "text": "The PLO is the Palestine Liberation Organization and the IRA is the Irish Republican Army. Neither are businesses, but nationalist movements that are sometimes seen as terrorist groups.",
                                "elements": []
                            },
                            {
                                "text": "Chili's is a chain of casual dining restaurants.",
                                "elements": []
                            },
                            {
                                "text": "Wrap it up music is Dwight's way of describing music played at an awards ceremony to indicate that the award recipient has talked too long and should leave the stage.",
                                "elements": []
                            },
                            {
                                "text": "Poor Richard's Pub is a pub in Scranton.",
                                "elements": []
                            },
                            {
                                "text": "A busy beaver is a hardworking person. Michael's error is an inadvertent pun on a vulgar sense of the word beaver for female genitalia.",
                                "elements": []
                            },
                            {
                                "text": "Tight ass is a rude term for a person who is uptight. Caboose is slang for the buttocks.",
                                "elements": []
                            },
                            {
                                "text": "Keds is a brand of casual athletic shoes.",
                                "elements": []
                            },
                            {
                                "text": "Xerox is informally used as a verb meaning \"to use a copy machine.\"",
                                "elements": []
                            },
                            {
                                "text": "Goldschläger is a brand of schnapps notable for the tiny gold flakes floating in the bottle.",
                                "elements": []
                            },
                            {
                                "text": "Foster's is an Australian brand of beer. For a time, it advertised itself in the United States with the catch phrase \"in the big can.\"",
                                "elements": []
                            },
                            {
                                "text": "In Michael's Dundie rap, he remakes the song OPP as performed by Naughty by Nature.",
                                "elements": []
                            },
                            {
                                "text": "During Michael's opening speech he makes a reference to drinking and driving however he incorrectly lists the reason as spilling the drink whereas it is illegal to drink in drive in the state of Pennsylvania.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Cast",
                "level": 2,
                "content": [],
                "images": []
            },
            {
                "title": "Main cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Steve Carell as Michael Scott",
                                "elements": []
                            },
                            {
                                "text": "Rainn Wilson as Dwight Schrute",
                                "elements": []
                            },
                            {
                                "text": "John Krasinski as Jim Halpert",
                                "elements": []
                            },
                            {
                                "text": "Jenna Fischer as Pam Beesly",
                                "elements": []
                            },
                            {
                                "text": "B.J. Novak as Ryan Howard",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Recurring cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "David Denman as Roy Anderson",
                                "elements": []
                            },
                            {
                                "text": "Leslie David Baker as Stanley Hudson",
                                "elements": []
                            },
                            {
                                "text": "Brian Baumgartner as Kevin Malone",
                                "elements": []
                            },
                            {
                                "text": "Kate Flannery as Meredith Palmer",
                                "elements": []
                            },
                            {
                                "text": "Mindy Kaling as Kelly Kapoor",
                                "elements": []
                            },
                            {
                                "text": "Angela Kinsey as Angela Martin",
                                "elements": []
                            },
                            {
                                "text": "Paul Lieberstein as Toby Flenderson",
                                "elements": []
                            },
                            {
                                "text": "Oscar Nunez as Oscar Martinez",
                                "elements": []
                            },
                            {
                                "text": "Phyllis Smith as Phyllis Lapin",
                                "elements": []
                            },
                            {
                                "text": "Craig Robinson as Darryl Philbin",
                                "elements": []
                            },
                            {
                                "text": "Melora Hardin as Jan Levinson (Voice Only)",
                                "elements": []
                            },
                            {
                                "text": "Creed Bratton as Creed Bratton (Uncredited)",
                                "elements": []
                            },
                            {
                                "text": "Devon Abner as Devon White (Uncredited)",
                                "elements": []
                            },
                            {
                                "text": "Joanne Carlsen as Terri Hudson (Uncredited)",
                                "elements": []
                            },
                            {
                                "text": "Trish Gates as Stacy (Uncredited)",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Guest cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Christopher T. Wood as Chili's Manager",
                                "elements": []
                            },
                            {
                                "text": "Matthew McKane as Frat Guy",
                                "elements": []
                            },
                            {
                                "text": "Beau Wirick as Frat Guy",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "References",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "↑ Kinsey, Angela and Jenna Fischer, Office Ladies: The Dundies podcast",
                                "elements": []
                            },
                            {
                                "text": "↑ Commentary, \"The Dundies\", Season 2 DVD",
                                "elements": []
                            },
                            {
                                "text": "↑ Novak, B.J. (September 20, 2005). \"Office Gossip's First Exclusive Blog!\" (broken link), TVGuide.com",
                                "elements": []
                            },
                            {
                                "text": "↑ Fischer, J. (April 12, 2006). \"Return of The Dundies\", TVGuide.com",
                                "elements": []
                            },
                            {
                                "text": "↑ Daniels Greg. (2005) 20th Century Fox, \"The Simpsons\". The Complete Seventh Season DVD commentary for the episode \"Bart Sells His Soul\" DVD.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            }
        ]
    },
    "quotesDetails": {
        "sections": [
            {
                "title": "The Dundies Quotes",
                "level": 1,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Dwight: Excuse me, everyone, could I have your attention please. I just wanted to say that the women in this office are terrible. Especially the ones who wrote that stuff about Michael on the bathroom wall. Having a bathroom is a privilege. It is called a ladies room for a reason. And if you cannot behave like ladies, well then you are not going to have a bathroom."
                    },
                    {
                        "type": "paragraph",
                        "text": "Oscar: The Dundies are kind of like a kid's birthday party, and you go, and there's really nothing for you to do there, but the kid's having a really good time, so you're, you're kinda there, that's...that's kinda what it's like."
                    },
                    {
                        "type": "paragraph",
                        "text": "Ryan: What am I gonna do with the award? Nothing...I don't know what I'm gonna do...That's the least of my concerns right now."
                    },
                    {
                        "type": "paragraph",
                        "text": "Jim: What a great year for the Dundies! We got to see Ping...and, we learned Michael's true feelings for Ryan, which was touching...and, we heard Michael change the lyrics to a number of classic songs - which, for me, has ruined them for life!"
                    },
                    {
                        "type": "paragraph",
                        "text": "Pam: God gave me this Dundie. I feel God in this Chili’s tonight."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael: And now... to someone who quietly goes about their job, but always seems to land the biggest accounts..."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael: ...the \"Busiest Beaver\" award goes to Phyllis Lapin.\n[Everybody starts clapping, Phyllis gets out of her booth and makes her way to Michael, she gives Jim a high five along the way]"
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael: Yeah, way to go Phyllis. Nice work, per usual."
                    },
                    {
                        "type": "paragraph",
                        "text": "Phyllis: This says \"Bushiest Beaver\"."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael: What? I told them busiest...idiots."
                    },
                    {
                        "type": "paragraph",
                        "text": "Phyllis: It's, it's fine."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael: Well, we'll fix it up. You don't have to display that."
                    }
                ],
                "images": []
            }
        ]
    },
    "coldOpens": [
        "None "
    ],
    "storylines": [
        "It's time for \"The Dundies\", Michael's annual embarrassing awards show for the Dunder-Mifflin Scranton employees, which takes place at the local Chili's restaurant. He thinks they love the awards and his comedy act, but in fact, they're dreaded.",
        "Phyllis, Pam, and Kelly chat and giggle by the water cooler. Dwight asks them what the joke is, and learns that somebody wrote something on the ladies' room wall about Michael. He demands to know what it is, but the women won't tell. Dwight's attempts to determine what is written on the wall are embarrassingly unsuccessful.",
        "Jan tells Michael that corporate will not fund the party, which breaks his hopes of a drunken show. Michael invites friends and family to the show to quiet rumors.",
        "Michael asks Pam to go through the old Dundies footage for highlights. From an earlier Dundies, we see Michael award Pam the \"World's Longest Engagement\" award. Jim tries to convince Michael to give Pam a different award this year.",
        "The awards begin with Michael attempting to perform a rap, but he can't keep up with the lyrics. Oscars sums up the Dundies \"as like a kid's birthday party, where there's nothing for you to do, but the kid's having a good time.\" As everyone prepares to order, Michael tells them they have to pay for their meals and drinks. Michael's jokes fall flat; Dwight's contributions also are not helpful. Darryl and Roy, concluding that the awards are lame, leave early, taking Pam with them. In the parking lot, Pam and Roy have an argument, and Pam returns to the awards show, just in time for Michael's caricature of a Chinese man named Ping.",
        "While Michael awards Dundies to various members of the office staff, Pam consumes a beer and two margaritas and shows signs of being drunk. As he sings another song, Michael gets heckled by some other customers. Humiliated, Michael decides to wrap it up, but an intoxicated Pam (along with Jim) encourages him to finish the show, which he does. Pam braces herself for her annual \"World's Longest Engagement\" award, but is relieved to get the \"Whitest Sneakers\" award. Pam thanks Michael and, after an emotional acceptance speech, drunkenly kisses Jim on the lips.",
        "As Jim recaps the Dundies for the documentary camera, Pam drunkenly falls off her stool. Dwight springs into action, but his assistance is not taken seriously by anyone. In a talking-head interview, the manager of the Chili's restaurant explains that Pam is no longer welcome at the restaurant chain due to her behavior.",
        "While waiting for Angela to arrive (Pam is drunk herself), Pam admits to Jim that it was in fact she who wrote the graffiti on the ladies' room wall. She also begins to ask Jim a question, but stops herself when she notices the cameras. Jim helps Pam into Angela's car and smiles contentedly as he watches them leave."
    ],
    "quotes": [
        "Dwight: Excuse me, everyone, could I have your attention please. I just wanted to say that the women in this office are terrible. Especially the ones who wrote that stuff about Michael on the bathroom wall. Having a bathroom is a privilege. It is called a ladies room for a reason. And if you cannot behave like ladies, well then you are not going to have a bathroom.",
        "Oscar: The Dundies are kind of like a kid's birthday party, and you go, and there's really nothing for you to do there, but the kid's having a really good time, so you're, you're kinda there, that's...that's kinda what it's like.",
        "Ryan: What am I gonna do with the award? Nothing...I don't know what I'm gonna do...That's the least of my concerns right now.",
        "Jim: What a great year for the Dundies! We got to see Ping...and, we learned Michael's true feelings for Ryan, which was touching...and, we heard Michael change the lyrics to a number of classic songs - which, for me, has ruined them for life!",
        "Pam: God gave me this Dundie. I feel God in this Chili’s tonight.",
        "Michael: And now... to someone who quietly goes about their job, but always seems to land the biggest accounts...",
        "Michael: ...the \"Busiest Beaver\" award goes to Phyllis Lapin.\n[Everybody starts clapping, Phyllis gets out of her booth and makes her way to Michael, she gives Jim a high five along the way]",
        "Michael: Yeah, way to go Phyllis. Nice work, per usual.",
        "Phyllis: This says \"Bushiest Beaver\".",
        "Michael: What? I told them busiest...idiots.",
        "Phyllis: It's, it's fine.",
        "Michael: Well, we'll fix it up. You don't have to display that."
    ]
}