{
    "season": 2,
    "title": "Valentine's Day",
    "episode": "16",
    "episodes": [
        16
    ],
    "episodeDetails": {
        "sections": [
            {
                "title": "Valentine's Day",
                "level": 1,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "\"Valentine's Day\" is the sixteenth episode of the second season of The Office and the 22nd overall. It was written by Michael Schur and directed by Greg Daniels. It first aired on February 9, 2006. It was viewed by 8.95 million people."
                    }
                ],
                "images": []
            },
            {
                "title": "Synopsis",
                "level": 2,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Michael spends Valentine's Day at \"Corporate\" in New York City, which he describes as Scranton \"on steroids.\" Before the meeting with the new CFO begins, Michael spills the beans to the other branch managers that he and Jan \"hooked up.\" The CFO and Jan arrive, and the presentation of Josh Porter (Stamford) goes well. Michael shows a video titled \"The Faces of Scranton\" before reluctantly providing the financial information of the Scranton branch. Craig (\"Craiggers\") from the Albany branch is completely unprepared and attempts to cover for it by suggesting that \"maybe I should've slept with [Jan], too.\""
                    },
                    {
                        "type": "paragraph",
                        "text": "Meanwhile, Angela gives Dwight a bobblehead doll of himself for Valentine’s Day, which he proclaims is the best gift he’s ever received. After consulting with Pam for advice, he gives Angela a key, presumably to his beet ranch home; she is visibly touched by this. Phyllis is inundated with gifts from her boyfriend Bob Vance, Vance Refrigeration, while Pam is irritated with Roy when the only thing he gives her for Valentine's Day is the promise of the \"best sex of [her] life.\" Jim is forced to witness Ryan turning Kelly down for a date after they hooked up the previous night."
                    },
                    {
                        "type": "paragraph",
                        "text": "In a private conversation with Michael, Jan is convinced that her career is over, but Michael assures her that he will \"fix it.\" In an unusual moment of tact, Michael defuses the situation by explaining to the CFO that the whole thing was a bad joke (which Craig stupidly misinterpreted as the truth) and accepts responsibility for the situation. Jan plays along by accepting Michael's apology and agreeing to drop the matter. Before Michael leaves, Jan catches Michael by the elevator and kisses him, but groans when she realizes they were caught on camera."
                    }
                ],
                "images": []
            },
            {
                "title": "Deleted scenes",
                "level": 2,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "The Season Two DVD contains a number of deleted scenes from this episode. Notable cut scenes include:"
                    },
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Michael delivers cheap plastic roses to the women of the office. In a talking head interview, Michael explains that the most attractive part of a women is her brain, because it is the brain that comes up with \"nasty ideas for bedroom stuff.\"",
                                "elements": []
                            },
                            {
                                "text": "Kevin explains that his fiancée is out of town, but he doesn't know where.",
                                "elements": []
                            },
                            {
                                "text": "Creed calls everybody \"Ace\". In a talking head interview, he admits, \"I'm not good with names.\"",
                                "elements": []
                            },
                            {
                                "text": "Many improvised scenes of Michael on the streets of New York.",
                                "elements": []
                            },
                            {
                                "text": "After delivering Phyllis's present, the Vance Refrigeration guys get into a fistfight.",
                                "elements": []
                            },
                            {
                                "text": "In a talking head interview, Michael can't decide whether there is any significance that his meeting with Jan is scheduled for Valentine's Day.",
                                "elements": []
                            },
                            {
                                "text": "Dwight asks Jim for spelling help but won't reveal what he's writing. (In a blooper, we learn that he's writing a love poem to Angela.)",
                                "elements": []
                            },
                            {
                                "text": "In a talking head interview, Jim says that Dwight having a girlfriend proves that \"there really is someone for everybody.\"",
                                "elements": []
                            },
                            {
                                "text": "Kevin gets a phone call from Stacy and learns that she's back in town.",
                                "elements": []
                            },
                            {
                                "text": "Michael is chased down the street by Devon, who is now homeless in New York City.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Trivia- Caution, here be spoilers",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "This episode is the first appearance of David Wallace.",
                                "elements": []
                            },
                            {
                                "text": "David Wallace has a mug on his desk that says \"World's Best Boss\", but it's black with white cursive lettering, as opposed to Michael's which is white with black print lettering.",
                                "elements": []
                            },
                            {
                                "text": "The Tina Fey joke was based on Michael Schur's observation that nearly every woman that wore glasses walking around Rockefeller Center was mistaken for Tina Fey. Ironically, when he went outside with the real Tina Fey, nobody recognized her. The actress who played Fake Tina Fey would later appear on an episode of 30 Rock.",
                                "elements": []
                            },
                            {
                                "text": "The location Michael is sitting in one of the New York scenes is actually about two blocks away from where the building is actually located as shown in Season 3 during \"The Job\". He is sitting two blocks on the opposite side of the Hilton hotel. In \"The Job\", you can see the building they focus on is on the right side of the Hilton.",
                                "elements": []
                            },
                            {
                                "text": "Michael says, \"New York is like Scranton [...] on steroids\". On his September 26, 2007 appearance on The Tonight Show with Jay Leno, while speaking about expressions that annoy him, Steve Carell said, \"people refer to things being on steroids... that's pretty stupid.\"",
                                "elements": []
                            },
                            {
                                "text": "The \"Faces of Scranton\" clips were shot by Randall Einhorn the week before the episode was filmed.",
                                "elements": []
                            },
                            {
                                "text": "The original Dwight bobblehead doll was custom-ordered by prop master Phil Shea. The company was originally named It's You Small, but now it's called Bobble Maker. The original Dwight bobblehead doll was auctioned by NBC when the series ended.",
                                "elements": []
                            },
                            {
                                "text": "When the Dwight bobblehead dolls went on sale on NBC.com, they sold out their initial order of 5000 units.",
                                "elements": []
                            },
                            {
                                "text": "Jim and Pam do not speak to each other until the end of episode when Jim leaves for the day. However, Greg Daniels made a point to put them in the background of each others' shots.",
                                "elements": []
                            },
                            {
                                "text": "During all of Jim's talking heads Pam will wander by delivering Phyllis gifts and in Pam’s talking heads Jim is sitting at the back talking to someone.",
                                "elements": []
                            },
                            {
                                "text": "First time Pam wears her hair in a headband instead of half-up half-down.",
                                "elements": []
                            },
                            {
                                "text": "First time Kelly and Ryan hook up.",
                                "elements": []
                            },
                            {
                                "text": "Michael says Rockefeller Center was founded by Theodore Rockefeller, confusing that with Theodore Roosevelt.",
                                "elements": []
                            },
                            {
                                "text": "Both Dwight and Angela seek relationship advice about the other person from Pam.",
                                "elements": []
                            },
                            {
                                "text": "Darryl had to fire four people in September, however Michael only had to fire one person in October.",
                                "elements": []
                            },
                            {
                                "text": "Actor Devon Abner had moved to New York to do theater, making him available for his brief performance as Devon White in a deleted scene.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Analysis",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "When Oscar receives a delivery of flowers, he quickly dismisses them as coming from his mother. Oscar was revealed to the documentary crew as gay in the earlier episode \"The Secret\" but had not revealed it to the office. It is likely that the flowers were sent by his partner Gil.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Amusing details",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "In the background of Jim's talking head at the beginning of the episode, Pam delivers Phyllis yet another gift.",
                                "elements": []
                            },
                            {
                                "text": "While Michael walks around Times Square, he claims that while other people go straight to the Empire State Building when they come to New York, that is too “touristy” for him. Ironically, Times Square is one of the most popular tourist spots in the city.",
                                "elements": []
                            },
                            {
                                "text": "In the \"Faces of Scranton\" video, Michael repeatedly dips his tea bag into an empty cup.",
                                "elements": []
                            },
                            {
                                "text": "In the \"Faces of Scranton\" video, when Michael first shows Pam, the camera darts to Craig, who shows much more interest in the video.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Cultural references",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Valentine's Day is a holiday that celebrates romantic love.",
                                "elements": []
                            },
                            {
                                "text": "Michael calls New York the City of Love. That nickname more traditionally belongs to Paris.",
                                "elements": []
                            },
                            {
                                "text": "Michael's interjection Fuggedaboutit is the phrase \"Forget about it\" in an exaggerated Italian New York accent. The phrase was popularized by the movie Donnie Brasco. Michael's use of the phrase is somewhat nonsensical.",
                                "elements": []
                            },
                            {
                                "text": "The city so nice they named it twice is a saying applied to New York City because its mailing address is often written \"New York, New York\" (New York City in the state of New York). Michael doesn't understand this and says that Manhattan (the central borough) is its other name. (Etymologist Barry Popik traced the phrase back to 1975.[1])",
                                "elements": []
                            },
                            {
                                "text": "Sbarro is a national chain of pizza restaurants. It is not a \"local New York pizza joint\" as Michael believes. Similarly, Michael identifies Bubba Gump Shrimp and Red Lobster, both national seafood restaurant chains, as local New York restaurants.",
                                "elements": []
                            },
                            {
                                "text": "Rockefeller Center is named after philanthropist John. D. Rockefeller, Jr, not \"Theodore Rockefeller\". Michael was probably thinking of Theodore Roosevelt. The Rangers are a professional hockey team; they do not practice in the Rockefeller Center ice rink, which is far too small to play hockey.",
                                "elements": []
                            },
                            {
                                "text": "Tina Fey was at the time the head writer for the sketch comedy program Saturday Night Live. The man who walks past is Conan O'Brien, host of a popular nighttime talk show.",
                                "elements": []
                            },
                            {
                                "text": "Michael identifies a river as \"either the Hudson or the East\", rivers which are located on opposite sides of Manhattan.",
                                "elements": []
                            },
                            {
                                "text": "Michael Jordan is a well-known basketball player. Stormin' Norman Schwarzkopf was the general who commanded Coalition forces in the 1991 Gulf War.",
                                "elements": []
                            },
                            {
                                "text": "Michael's Faces of Scranton video concludes with the phrase A Michael Scott Joint. Director Spike Lee identifies his films as \"A Spike Lee Joint\". it ends with \"Great Scott!\" (an exclamation of surprise and a pun on Michael's name) and the images of Robin Williams and Steve Martin, two of Michael's comedy idols. The song that plays in the video is \"With or Without You\" by U2.",
                                "elements": []
                            },
                            {
                                "text": "Michael says And don't call me Shirley, repeating a joke from the movie Airplane!. The joke is a pun, relying on the homophones \"surely\" and \"Shirley\", so when Jan says “Surely, you cannot be serious” it sounds like “Shirley, you cannot be serious”.",
                                "elements": []
                            },
                            {
                                "text": "Michael's exclamation \"Oy vey” is a shortening of the Yiddish phrase \"Oy vey's mir\" (oh woe is me). The word schmear is a term for cream cheese spread on a bagel (a stereotypically Jewish food). Michael appears to be separating \"vey's mir\" into \"vey, schmear\" because he doesn't know the proper saying.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Cast",
                "level": 2,
                "content": [],
                "images": []
            },
            {
                "title": "Main cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Steve Carell as Michael Scott",
                                "elements": []
                            },
                            {
                                "text": "Rainn Wilson as Dwight Schrute",
                                "elements": []
                            },
                            {
                                "text": "John Krasinski as Jim Halpert",
                                "elements": []
                            },
                            {
                                "text": "Jenna Fischer as Pam Beesly",
                                "elements": []
                            },
                            {
                                "text": "B.J. Novak as Ryan Howard",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Supporting cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Melora Hardin as Jan Levenson",
                                "elements": []
                            },
                            {
                                "text": "David Denman as Roy Anderson",
                                "elements": []
                            },
                            {
                                "text": "Leslie David Baker as Stanley Hudson",
                                "elements": []
                            },
                            {
                                "text": "Brian Baumgartner as Kevin Malone",
                                "elements": []
                            },
                            {
                                "text": "Kate Flannery as Meredith Palmer",
                                "elements": []
                            },
                            {
                                "text": "Angela Kinsey as Angela Martin",
                                "elements": []
                            },
                            {
                                "text": "Oscar Nunez as Oscar Martinez",
                                "elements": []
                            },
                            {
                                "text": "Phyllis Smith as Phyllis Lapin",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Recurring cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Andy Buckley as David Wallace",
                                "elements": []
                            },
                            {
                                "text": "Mindy Kaling as Kelly Kapoor",
                                "elements": []
                            },
                            {
                                "text": "Creed Bratton (actor) as Creed Bratton",
                                "elements": []
                            },
                            {
                                "text": "Charles Esten as Josh Porter",
                                "elements": []
                            },
                            {
                                "text": "Devon Abner as Devon White (Deleted Scenes)",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Guest cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Dan Cole as Dan Gore",
                                "elements": []
                            },
                            {
                                "text": "Craig Anton as Craig",
                                "elements": []
                            },
                            {
                                "text": "Lee Eisenberg as Gino (Delivery Man #1)",
                                "elements": []
                            },
                            {
                                "text": "Jason Kessler as Delivery Man #2",
                                "elements": []
                            },
                            {
                                "text": "Jeremy Radin as Delivery Man #3",
                                "elements": []
                            },
                            {
                                "text": "Gene Stupnitsky as Leo (Delivery Man #4)",
                                "elements": []
                            },
                            {
                                "text": "Vivianne Collins as Grace (Deleted Scenes)",
                                "elements": []
                            },
                            {
                                "text": "Miriam Tolan as Fake Tina Fey (Uncredited)",
                                "elements": []
                            },
                            {
                                "text": "Conan O'Brien as Himself (Uncredited)",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "References",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "↑ Kinsey, Angela and Jenna Fischer, Office Ladies: Valentine's Day with Andy Buckley podcast",
                                "elements": []
                            },
                            {
                                "text": "↑ Schur, Michael (Writer). 2006. \"The Client\" [Commentary track], The Office Season Two (US/NBC Version) [DVD], Los Angeles, CA: Universal.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            }
        ]
    },
    "quotesDetails": {
        "sections": [
            {
                "title": "Valentine's Day Quotes",
                "level": 1,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Dwight: Women are like wolves. If you want a wolf, you have to trap it. You have to snare it. And then you have to tame it. Keep it happy. Care for it. Feed it. Lovingly, the way an animal deserves to be loved. And my animal deserves a lot of loving."
                    },
                    {
                        "type": "paragraph",
                        "text": "Jan: Nervous? No, I'm not nervous - well, I guess I'd be lying if I didn't say I was a little nervous, um, the new CFO is judging me on this, too, and, uh, well, it is Michael, so...Yeah, I'm very nervous."
                    },
                    {
                        "type": "paragraph",
                        "text": "Craig: Yeah, here's the deal - I did not understand that this was supposed to be a full-on, like, report, or what not...\nJan: I'm sorry, what did you think \"Financial Presentation\" meant?!\nCraig: I was under the impression that this was more of a...meet and greet-type deal...\nDavid Wallace: So, does that mean that you don't have the numbers on your branch?\nCraig: That is correct, yes."
                    },
                    {
                        "type": "paragraph",
                        "text": "Jan: Craig, you realize that, we are trying to decide whether...drastic steps need to be taken...\nCraig: Look, I'm sorry - I didn't know!\nJan: Well, the point is that this doesn't exactly...bode well for your branch...\nCraig: You know what?! Michael made that stupid movie - he doesn't get in any trouble!...Maybe I should've slept with you too..."
                    }
                ],
                "images": []
            }
        ]
    },
    "coldOpens": [
        "It's Valentine's Day at Dunder-Mifflin and Pam says it's like grade school. "
    ],
    "storylines": [
        "Michael spends Valentine's Day at \"Corporate\" in New York City, which he describes as Scranton \"on steroids.\" Before the meeting with the new CFO begins, Michael spills the beans to the other branch managers that he and Jan \"hooked up.\" The CFO and Jan arrive, and the presentation of Josh Porter (Stamford) goes well. Michael shows a video titled \"The Faces of Scranton\" before reluctantly providing the financial information of the Scranton branch. Craig (\"Craiggers\") from the Albany branch is completely unprepared and attempts to cover for it by suggesting that \"maybe I should've slept with [Jan], too.\"",
        "Meanwhile, Angela gives Dwight a bobblehead doll of himself for Valentine’s Day, which he proclaims is the best gift he’s ever received. After consulting with Pam for advice, he gives Angela a key, presumably to his beet ranch home; she is visibly touched by this. Phyllis is inundated with gifts from her boyfriend Bob Vance, Vance Refrigeration, while Pam is irritated with Roy when the only thing he gives her for Valentine's Day is the promise of the \"best sex of [her] life.\" Jim is forced to witness Ryan turning Kelly down for a date after they hooked up the previous night.",
        "In a private conversation with Michael, Jan is convinced that her career is over, but Michael assures her that he will \"fix it.\" In an unusual moment of tact, Michael defuses the situation by explaining to the CFO that the whole thing was a bad joke (which Craig stupidly misinterpreted as the truth) and accepts responsibility for the situation. Jan plays along by accepting Michael's apology and agreeing to drop the matter. Before Michael leaves, Jan catches Michael by the elevator and kisses him, but groans when she realizes they were caught on camera."
    ],
    "quotes": [
        "Dwight: Women are like wolves. If you want a wolf, you have to trap it. You have to snare it. And then you have to tame it. Keep it happy. Care for it. Feed it. Lovingly, the way an animal deserves to be loved. And my animal deserves a lot of loving.",
        "Jan: Nervous? No, I'm not nervous - well, I guess I'd be lying if I didn't say I was a little nervous, um, the new CFO is judging me on this, too, and, uh, well, it is Michael, so...Yeah, I'm very nervous.",
        "Craig: Yeah, here's the deal - I did not understand that this was supposed to be a full-on, like, report, or what not...\nJan: I'm sorry, what did you think \"Financial Presentation\" meant?!\nCraig: I was under the impression that this was more of a...meet and greet-type deal...\nDavid Wallace: So, does that mean that you don't have the numbers on your branch?\nCraig: That is correct, yes.",
        "Jan: Craig, you realize that, we are trying to decide whether...drastic steps need to be taken...\nCraig: Look, I'm sorry - I didn't know!\nJan: Well, the point is that this doesn't exactly...bode well for your branch...\nCraig: You know what?! Michael made that stupid movie - he doesn't get in any trouble!...Maybe I should've slept with you too..."
    ]
}