{
    "season": 2,
    "title": "The Dundies",
    "episode": "1",
    "episodes": [
        1
    ],
    "coldOpens": [
        "None "
    ],
    "storylines": [
        "It's time for \"The Dundies\", Michael's annual embarrassing awards show for the Dunder-Mifflin Scranton employees, which takes place at the local Chili's restaurant. He thinks they love the awards and his comedy act, but in fact, they're dreaded.",
        "Phyllis, Pam, and Kelly chat and giggle by the water cooler. Dwight asks them what the joke is, and learns that somebody wrote something on the ladies' room wall about Michael. He demands to know what it is, but the women won't tell. Dwight's attempts to determine what is written on the wall are embarrassingly unsuccessful.",
        "Jan tells Michael that corporate will not fund the party, which breaks his hopes of a drunken show. Michael invites friends and family to the show to quiet rumors.",
        "Michael asks Pam to go through the old Dundies footage for highlights. From an earlier Dundies, we see Michael award Pam the \"World's Longest Engagement\" award. Jim tries to convince Michael to give Pam a different award this year.",
        "The awards begin with Michael attempting to perform a rap, but he can't keep up with the lyrics. Oscars sums up the Dundies \"as like a kid's birthday party, where there's nothing for you to do, but the kid's having a good time.\" As everyone prepares to order, Michael tells them they have to pay for their meals and drinks. Michael's jokes fall flat; Dwight's contributions also are not helpful. Darryl and Roy, concluding that the awards are lame, leave early, taking Pam with them. In the parking lot, Pam and Roy have an argument, and Pam returns to the awards show, just in time for Michael's caricature of a Chinese man named Ping.",
        "While Michael awards Dundies to various members of the office staff, Pam consumes a beer and two margaritas and shows signs of being drunk. As he sings another song, Michael gets heckled by some other customers. Humiliated, Michael decides to wrap it up, but an intoxicated Pam (along with Jim) encourages him to finish the show, which he does. Pam braces herself for her annual \"World's Longest Engagement\" award, but is relieved to get the \"Whitest Sneakers\" award. Pam thanks Michael and, after an emotional acceptance speech, drunkenly kisses Jim on the lips.",
        "As Jim recaps the Dundies for the documentary camera, Pam drunkenly falls off her stool. Dwight springs into action, but his assistance is not taken seriously by anyone. In a talking-head interview, the manager of the Chili's restaurant explains that Pam is no longer welcome at the restaurant chain due to her behavior.",
        "While waiting for Angela to arrive (Pam is drunk herself), Pam admits to Jim that it was in fact she who wrote the graffiti on the ladies' room wall. She also begins to ask Jim a question, but stops herself when she notices the cameras. Jim helps Pam into Angela's car and smiles contentedly as he watches them leave."
    ],
    "quotes": [
        [
            {
                "speaker": "Dwight",
                "content": " Excuse me, everyone, could I have your attention please. I just wanted to say that the women in this office are terrible. Especially the ones who wrote that stuff about Michael on the bathroom wall. Having a bathroom is a privilege. It is called a ladies room for a reason. And if you cannot behave like ladies, well then you are not going to have a bathroom."
            }
        ],
        [
            {
                "speaker": "Oscar",
                "content": " The Dundies are kind of like a kid's birthday party, and you go, and there's really nothing for you to do there, but the kid's having a really good time, so you're, you're kinda there, that's...that's kinda what it's like."
            }
        ],
        [
            {
                "speaker": "Ryan",
                "content": " What am I gonna do with the award? Nothing...I don't know what I'm gonna do...That's the least of my concerns right now."
            }
        ],
        [
            {
                "speaker": "Jim",
                "content": " What a great year for the Dundies! We got to see Ping...and, we learned Michael's true feelings for Ryan, which was touching...and, we heard Michael change the lyrics to a number of classic songs - which, for me, has ruined them for life!"
            }
        ],
        [
            {
                "speaker": "Pam",
                "content": " God gave me this Dundie. I feel God in this Chili’s tonight."
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " And now... to someone who quietly goes about their job, but always seems to land the biggest accounts..."
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " ...the \"Busiest Beaver\" award goes to Phyllis Lapin."
            },
            {
                "content": "[Everybody starts clapping, Phyllis gets out of her booth and makes her way to Michael, she gives Jim a high five along the way]"
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " Yeah, way to go Phyllis. Nice work, per usual."
            }
        ],
        [
            {
                "speaker": "Phyllis",
                "content": " This says \"Bushiest Beaver\"."
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " What? I told them busiest...idiots."
            }
        ],
        [
            {
                "speaker": "Phyllis",
                "content": " It's, it's fine."
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " Well, we'll fix it up. You don't have to display that."
            }
        ]
    ]
}