{
    "season": 2,
    "title": "Christmas Party",
    "episode": "10",
    "episodes": [
        10
    ],
    "coldOpens": [
        "Michael gets a Christmas Tree for the office, but it is too big, leading to it breaking into the ceiling. "
    ],
    "storylines": [
        "The Scranton branch celebrates Christmas. Michael and Dwight bring in a huge Christmas tree in preparation for the office party. It's too tall to fit, so Michael recommends they cut off the top and sell it to charity.",
        "Ryan is drafted onto the Party Planning Committee. Michael interrupts to make sure they double everything and gives them extra money. He informs the documentary crew that he received a Christmas bonus of \"3,000 g's\" ($3,000) for coming under budget due to firing Devon. He wants to serve liquor at the party, but Pam reminds him that Corporate does not allow alcohol at company parties.",
        "Dwight informs the employees to put their Secret Santa presents under the tree. Toby got a poster of babies dressed as jazz musicians paying instruments for Angela, Oscar knows nothing about Creed but thinks he's Irish so got him a shamrock keychain, and Kevin, who drew his own name for Secret Santa and didn't tell anybody, reveals he got something for himself. Jim has gotten Pam for the first time, bought her a teapot and filled it with little mementos as inside jokes. He also has a card for her, since Christmas is the time to tell people how you really feel.",
        "Michael tries to get people to tell him who they got. Jim reminds him it's supposed to be secret. Michael ignores him and reveals that he got Ryan.",
        "The gift exchange starts off reasonably well. Oscar gets a shower radio from Kelly. Jim gets an old shirt from Creed (Creed forgot about the exchange and pulled the shirt out of his closet at the last minute). When Ryan opens his gift from Michael, he finds a $400 video iPod. He knows how much it cost because Michael left the tag on it. Michael brushes it off as just being a generous giver, but the other employees are concerned at the huge disparity between the iPod and the other gifts. Pam opens Jim's gift. He starts to open the lid to show her the contents and explain them when Michael demands his own gift.",
        "Michael's magnanimity only lasts as long as it takes for him to open Phyllis' gift to him: a home-made oven mitt. He storms out of the party circle, visibly upset. For the cameras, he expresses his belief that the cost of the gift reflects the level of one's affection for the person receiving the gift. This oven mitt isn't worth anything. And, after all, he got Ryan an iPod.",
        "When he returns, he decides the exchange is going to turn into a Yankee Swap where people can steal other gifts. This doesn't work well at all. The gifts were bought for specific people based on the tastes of those people. For example, a pretty decorated name plate that says Kelly on it. (Stanley: \"It's for Kelly\")",
        "Angela frets to the camera how much work goes into planning a party like this and how unfair it is for Michael to come in and make sudden changes. She bursts into tears.",
        "Kelly gets Angela's baby poster and hates it. Angela steals it back. Kevin makes sure he gets his foot bath. The iPod's expense makes it the most popular of the gifts which starts to cause resentment among the employees. Jim's disturbed when Pam takes the iPod over stealing back the teapot. Worse, Michael is obnoxious when it comes to the oven mitt, loudly hoping no one steals it from him. Seeing how distressed Phyllis is, Meredith steals it from Michael out of pity. Michael nearly jumps for joy and brags about how effective reverse psychology is. Phyllis abruptly leaves.",
        "Michael asks what she's so upset about. Pam points out that it was pretty obvious he didn't like his present. The gifts were not chosen with a Yankee Swap in mind. Stanley grouses about how Michael should have just bought a $20 gift like everybody else.",
        "Michael blurts out that he was just trying to spread some Christmas joy since he got a big bonus for Christmas. They ask him how much it was. He tries to be cagey, but isn't smart enough to pull it off. In disgust, the employees break off into their own small groups and the exchange is over.",
        "Michael says \"Happy Birthday, Jesus. Sorry your party's so lame!\"",
        "Michael goes out to buy 15 bottles of vodka for $166.41, the clerk assures him will cause 20 people to get plastered, Jim tries to get the teapot back from Dwight who plans to use it to clear out his nostrils, because he gets sinus infections.",
        "Pam shows Roy her iPod. He claims he was going to get her one, but now doesn't have to. She asks him what he will get her now. He mumbles, \"I don't know, like a sweater or something.\"",
        "Michael returns with the vodka and says, \"Uh oh, looks like Santa's been a little naughty\". Todd Packer shows up already drunk and eventually passes out in a chair. Phyllis introduces everyone to her new beau, Bob Vance, who greets everyone with \"Bob Vance, Vance Refrigeration\". Ryan mirthfully asks him what line of work he's in.",
        "Jim approaches Pam's desk to find out that she traded the iPod for the teapot. He tells her that the gift has \"bonus gifts\" and she pulls the little items out, such as his yearbook photo, a condiment packet, a mini-golf pencil she'd used once. While Pam's distracted, Jim secretly pulls out the card and slides it into his back pocket.",
        "Kevin puts photo copies of his own butt around the office.",
        "A drunk Kelly kisses Dwight, who tells her it was inappropriate and that it's a \"man's job\" to make the first move. Angela, already having had a trying evening, takes her wrath out on the Christmas ornaments by smashing them outside by the dumpster and screaming.",
        "The others leave to meet at Poor Richard's. Roy and Ryan help Packer out of the office because he is so wasted. While Michael gathers his things, a completely inebriated Meredith enters his office and takes off her top. He sort of gasps, stares for a moment, quickly takes a picture of her, and leaves."
    ],
    "quotes": [
        [
            {
                "speaker": "Michael",
                "content": " Presents are the best way to show someone how much you care. It's like this tangible thing that you can point to and say, \"Hey, man, I love you this many dollars worth.\""
            }
        ],
        [
            {
                "speaker": "Dwight",
                "content": " First present, Oscar."
            }
        ],
        [
            {
                "speaker": "Oscar",
                "content": " Shower radio. Neat."
            }
        ],
        [
            {
                "speaker": "Kelly",
                "content": " Oh good. That was from me."
            }
        ],
        [
            {
                "speaker": "Oscar",
                "content": " Thanks, Kelly. You know I've been meaning to..."
            }
        ],
        [
            {
                "speaker": "Dwight",
                "content": " Okay, okay. Let's keep moving on. Jim."
            }
        ],
        [
            {
                "speaker": "Creed",
                "content": " That's from me."
            }
        ],
        [
            {
                "speaker": "Jim",
                "content": " Great. Where'd you get it?"
            }
        ],
        [
            {
                "speaker": "Creed",
                "content": " I don't know. It was so long ago."
            }
        ],
        [
            {
                "speaker": "Jim",
                "content": " He obviously forgot to get me something. So he went into his closet and dug out this little number, and then threw it in a bag."
            }
        ],
        [
            {
                "speaker": "Creed",
                "content": " Yep. That's exactly what happened"
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " So Phyllis is basically saying \"Hey Michael, I know you did a lot to help out the office this year, but I only care about you a homemade oven mitt's worth.\" I gave Ryan an iPod."
            }
        ],
        [
            {
                "speaker": "Kelly",
                "content": " I will steal the iPod."
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " In addition to these paintball pellots, your gift includes two paintball lessons with Dwight Schrute."
            }
        ],
        [
            {
                "speaker": "Dwight",
                "content": " You and me, Michael. Yes."
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " Who wants to take paintball lessons? How is that better than an iPod?"
            }
        ],
        [
            {
                "speaker": "Dwight",
                "content": " I never said it was better than an iPod. (Michael pulls off Dwight's elf ears and throws them at his face) (In the talking head) Michael keeps bragging about his iPod. But you know what? Two paintball lessons with someone as expierienced as I am is easily worth like two grand. Take that, Saddam."
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " Last gift, Kevin."
            }
        ],
        [
            {
                "speaker": "Kevin",
                "content": " I want the footbath. That's the thing I bought myself. I'm really psyched to use it. Maybe I should've taken the iPod. Oh shoot."
            }
        ],
        [
            {
                "speaker": "Dwight",
                "content": " Yankee Swap is like Machevelli meets....Christmas."
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " Uh oh. Looks like Santa was a little naughty."
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " Now you're the expert. Is this enough to get 20 people plastered?"
            }
        ],
        [
            {
                "speaker": "Liquor Store Clerk",
                "content": " 15 bottles of vodka? Yea, that should do it."
            }
        ]
    ]
}