{
    "season": 2,
    "title": "Sexual Harassment",
    "episode": "2",
    "episodes": [
        2
    ],
    "episodeDetails": {
        "sections": [
            {
                "title": "Sexual Harassment",
                "level": 1,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "\"Sexual Harassment\" is the second episode of the second season of The Office and the 8th overall. It was written by B.J. Novak and directed by Ken Kwapis. It first aired on September 27, 2005. It was viewed by 7.13 million people."
                    }
                ],
                "images": []
            },
            {
                "title": "Synopsis",
                "level": 2,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Michael declares himself \"King of Forwards\" because he is a master of forwarding what he considers to be funny email to the rest of the office. Michael's \"best friend forever\" Todd Packer arrives and shares crude and sexist gossip about an upper management scandal, which continues to offend the staff. Ryan is called upon to drive Packer around town because of Packer's \"DUI situation\". Meanwhile, Pam waits with anticipation for her mother to arrive from out of town."
                    },
                    {
                        "type": "paragraph",
                        "text": "Toby privately informs Michael that their CFO resigned because of sexual harassment. Consequently, he has been asked by Corporate to hold a five-minute review of the company's sexual harassment policies. Michael interprets this as Corporate cracking down on his inappropriate jokes and is upset that this will put a damper on his easy-going office environment by forcing everybody to \"scrutinize every little thing we say and do all day.\" His indignation rises to outrage when he learns that Corporate is sending down a lawyer to talk to Michael."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael goes down to the warehouse to find some dirty jokes that he can use to remind the staff how great jokes can be, but he ends up being sexually harassed himself and runs away in embarrassment. Upstairs, Toby's presentation goes well, and Pam asks everyone to keep it clean when her mother arrives. Just as Toby is wrapping up, Michael arrives with a blow-up sex doll. He makes a speech on not losing the sexual humor around the office, but fails to get the support of the employees."
                    },
                    {
                        "type": "paragraph",
                        "text": "For laughs, Michael and the warehouse staff watch the sexual harassment video in the conference room. Meanwhile, Dwight asks Toby questions about the female anatomy. Just as Michael shares a crude remark about the video with the rest of the staff, Jan and the lawyer arrive from Corporate."
                    },
                    {
                        "type": "paragraph",
                        "text": "Todd Packer returns to the office as Michael meets with Jan and the lawyer, upset that their crackdown on his inappropriate e-mail forwarding means that he basically can't say anything in the office at all. In a talking head interview, Michael defensively explains that as the King of Forwards, he's just forwarding the jokes; he didn't write them and therefore cannot be held responsible for their content. He elaborates, \"You wouldn't arrest a guy who's just delivering drugs from one guy to another.\" Michael emerges from the meeting to announce that he can no longer be friends with his staff and that he will talk only about work. As a result, he will never tell another joke again. Jim goads Michael into breaking his vow immediately."
                    },
                    {
                        "type": "paragraph",
                        "text": "Jan calls Michael back into his office for another meeting as Michael's \"free speech\" lawyer arrives. Jan explains that as the corporate lawyer, Mr. O'Malley's job is protect the company and upper-level management, including Michael. Michael is instantly relieved that he's not in trouble."
                    },
                    {
                        "type": "paragraph",
                        "text": "Just as Michael throws away the sex doll, Pam's mother arrives and after Roy leaves, she asks in whispers (and is shushed by an embarrassed Pam) which one is Jim. Todd Packer shares some more inappropriate jokes with the employees and Michael tries to draw the line, but points the blame at Kevin. He gets teased by Packer and ends up saying how beautiful Phyllis is and saying the only thing he's worried about \"is gettin' a boner.\""
                    }
                ],
                "images": []
            },
            {
                "title": "Deleted scenes",
                "level": 2,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "The Season Two DVD contains a number of deleted scenes from this episode."
                    },
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Michael is baffled by a casual compliment from Pam.",
                                "elements": []
                            },
                            {
                                "text": "Dwight warns Jim not to drink directly from his soda can due to the risk of cross-contamination.",
                                "elements": []
                            },
                            {
                                "text": "Kevin receives a doctored celebrity photo via e-mail.",
                                "elements": []
                            },
                            {
                                "text": "Dwight carefully washes a soda can.",
                                "elements": []
                            },
                            {
                                "text": "Extension of Michael taking over Toby's sexual harassment training.",
                                "elements": []
                            },
                            {
                                "text": "In a talking head interview, Michael bad-mouths Toby.",
                                "elements": []
                            },
                            {
                                "text": "Pam teases Jim by apologizing for sending instant messages with the winking-face emoticon, concerned that it might be sexual harassment. Jim responds that he has retained the angry-face icon as his attorney.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Trivia",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Packer's car occupies two spaces when parked, commonly recognised as a jerk move.",
                                "elements": []
                            },
                            {
                                "text": "Jan plays with her cell phone a lot in this episode. In the DVD commentary, Melora Hardin explains that the prop team gave her a RAZR phone (a novel gadget at the time), and she couldn't stop playing with it.",
                                "elements": []
                            },
                            {
                                "text": "When Michael tells Jim to check his email, Michael's email is in the spam folder. Apparently, Jim registers emails from Michael as spam.",
                                "elements": []
                            },
                            {
                                "text": "The instructional video was filmed in the writers' offices.",
                                "elements": []
                            },
                            {
                                "text": "Writer B.J. Novak says that the lines \"That's what she said\" and \"What has two thumbs and...? This guy\" are things he heard in college.",
                                "elements": []
                            },
                            {
                                "text": "During Toby's talking head regarding Dwight's questions about female anatomy, all the candy bars in the vending machine behind him have been turned backwards, so that the names are not visible (though they appear to include M&Ms and Hershey bars).",
                                "elements": []
                            },
                            {
                                "text": "When the camera shows a close up of Kevin's computer screen, his list of e-mails shows Pam's last name spelled \"Beasly\", not \"Beesly\" like later established. It also shows Dwight's last name as \"Shrute\" instead of \"Schrute.\"",
                                "elements": []
                            },
                            {
                                "text": "It's also interesting to note that Kevin's computer contains two different e-mails with the subject line \"Copier isn't working\" from Ryan Howard. Since the more recent e-mail doesn't have the prefix \"Re:\" (as do other e-mails in the inbox), it suggests the copier was either broken twice, or Ryan felt like complaining a second time. Kevin also has an e-mail from \"Dwight Shrute\" titled \"FWD: I found this on the internet;\" at this point, Michael had not yet asked Dwight for the link to the \"monkey sex video\" - meaning Dwight would have forwarded it on his own already.",
                                "elements": []
                            },
                            {
                                "text": "This would be the first appearance of Stanley's daughter Melissa Hudson (even though she only appears in a photo).",
                                "elements": []
                            },
                            {
                                "text": "Debut of Michael's catchphrase \"That's what she said\".",
                                "elements": []
                            },
                            {
                                "text": "It is revealed that Packer's license is suspended because of a DUI.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Continuity",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "When the camera shows a close up of Kevin's computer screen, his list of e-mails shows Pam's last name spelled \"Beasly\", not \"Beesly\" like later established, unless that they were trying to make Kevin look like he wasn't good at spelling like he did with Dwight's surname (putting Shrute instead of Schrute).",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Cultural references",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Michael Jackson is a pop singer who has multiple times been accused of child molestation. In the 1990s, a series of sex abuse scandals involving Roman Catholic priests became prominent in the news. Michael combines the two in his joke.",
                                "elements": []
                            },
                            {
                                "text": "Friends is a television comedy that ran from 1994 to 2004.",
                                "elements": [
                                    {
                                        "text": "Chandler is sarcastic.",
                                        "elements": []
                                    },
                                    {
                                        "text": "Joey is dim-witted but has enormous success with women.",
                                        "elements": []
                                    },
                                    {
                                        "text": "Rachel is attractive but emotionally immature.",
                                        "elements": []
                                    },
                                    {
                                        "text": "Kramer is the \"wacky neighbor\" from the show Seinfeld.",
                                        "elements": []
                                    }
                                ]
                            },
                            {
                                "text": "This episode contains, not surprisingly, several slang terms for sex, most of them crude. Packer jokes that he boned Michael's mother, Darryl claims to have banged the woman in the video, Michael tells a story of how Packer did a set of twins, and Randall the CFO was nailing his secretary.",
                                "elements": []
                            },
                            {
                                "text": "Michael says Buckle up. It's going to be a bumpy one!, a botched version of the line \"Fasten your seat belts. It's going to be a bumpy night.\" from the movie All About Eve (ranked #9 on the American Film Institute's 100 best movie quotes).",
                                "elements": []
                            },
                            {
                                "text": "Michael says Forward it like it's hot in the style of the Snoop Dogg song Drop It Like It's Hot, but he mistakenly identifies the song as \"old school\" hip-hop, despite it being released a mere year before the episode aired.",
                                "elements": []
                            },
                            {
                                "text": "DUI stands for Driving while Under the Influence, known as drink-driving in British English.",
                                "elements": []
                            },
                            {
                                "text": "Michael tells a joke about a lady of the evening (a prostitute) who gives a customer crabs (the crab louse parasite). The joke is a pun on crabs the parasite and crabs the animal.",
                                "elements": []
                            },
                            {
                                "text": "Queers R Us and Boys R Us are puns on toy store chain Toys \"R\" Us. Business and package are slang for the male groin.",
                                "elements": []
                            },
                            {
                                "text": "MILF is crude slang for Mother I'd like to F---;.",
                                "elements": []
                            },
                            {
                                "text": "To make out is to kiss for an extended period of time.",
                                "elements": []
                            },
                            {
                                "text": "The hairstyles and fashion in the instructional video is from the 1980s.",
                                "elements": []
                            },
                            {
                                "text": "Mo Money Mo Problems is a hip hop song by Notorious B.I.G.",
                                "elements": []
                            },
                            {
                                "text": "A perfect 10 is someone who is so attractive they would rate 10 points on a scale from 1 to 10. The term entered common usage as the result of the movie 10.",
                                "elements": []
                            },
                            {
                                "text": "The academic year in the United States runs from September to June. In Pennsylvania, a child must have reached age 4 years 7 months prior to the first day of school. Children who begin school under the age of 5 are informally referred to as having a late birthday, and they are the youngest students in class.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Cast",
                "level": 2,
                "content": [],
                "images": []
            },
            {
                "title": "Main Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Steve Carell as Michael Scott",
                                "elements": []
                            },
                            {
                                "text": "Rainn Wilson as Dwight Schrute",
                                "elements": []
                            },
                            {
                                "text": "John Krasinski as Jim Halpert",
                                "elements": []
                            },
                            {
                                "text": "Jenna Fischer as Pam Beesly",
                                "elements": []
                            },
                            {
                                "text": "B.J. Novak as Ryan Howard",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Recurring Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "David Koechner as Todd Packer",
                                "elements": []
                            },
                            {
                                "text": "Melora Hardin as Jan Levenson",
                                "elements": []
                            },
                            {
                                "text": "Leslie David Baker as Stanley Hudson",
                                "elements": []
                            },
                            {
                                "text": "Brian Baumgartner as Kevin Malone",
                                "elements": []
                            },
                            {
                                "text": "Kate Flannery as Meredith Palmer",
                                "elements": []
                            },
                            {
                                "text": "Mindy Kaling as Kelly Kapoor",
                                "elements": []
                            },
                            {
                                "text": "Angela Kinsey as Angela Martin",
                                "elements": []
                            },
                            {
                                "text": "Paul Lieberstein as Toby Flenderson",
                                "elements": []
                            },
                            {
                                "text": "Oscar Nunez as Oscar Martinez",
                                "elements": []
                            },
                            {
                                "text": "Phyllis Smith as Phyllis Lapin",
                                "elements": []
                            },
                            {
                                "text": "Craig Robinson as Darryl Philbin",
                                "elements": []
                            },
                            {
                                "text": "David Denman as Roy Anderson",
                                "elements": []
                            },
                            {
                                "text": "Karly Rothenberg as Madge",
                                "elements": []
                            },
                            {
                                "text": "Creed Bratton (actor) as Creed Bratton (Uncredited)",
                                "elements": []
                            },
                            {
                                "text": "Devon Abner as Devon White (Uncredited)",
                                "elements": []
                            },
                            {
                                "text": "Calvin Tenner as Calvin (Uncredited)",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Guest Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Shannon Cochran as Mrs. Beesly",
                                "elements": []
                            },
                            {
                                "text": "R.F. Daley as Mr. O'Malley",
                                "elements": []
                            },
                            {
                                "text": "Dennis Garber as James P. Albini",
                                "elements": []
                            },
                            {
                                "text": "Melinda Chilton as The Natural Redhead",
                                "elements": []
                            },
                            {
                                "text": "Andrew Donnelly as Mike",
                                "elements": []
                            },
                            {
                                "text": "Keith Valcourt as Ted",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            }
        ]
    },
    "quotesDetails": {
        "sections": [
            {
                "title": "Sexual Harassment Quotes",
                "level": 1,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Michael: Toby is in HR which means he works for Corporate, so he's really not a part of our family. Also, he's divorced, so he's really not a part of his family."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael: I just want you to know that, uh, this is not my decision, but from here on out, we can no longer be friends...And when we talk about things here, we may only discuss, um, work-associated things...and, uh, you can consider this my retirement from comedy...And in the future, if I want to say something funny, or witty, or do an impression, I will no longer ever do any of those things.\nJim: Does that include \"That's what she said?\"\nMichael: Yes...\nJim: Wow, that is really hard...You really think you can go all day long?... Well, you always left me satisfied and smiling, so...\nMichael: That's what she said!"
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael: Times have changed a little. And even though we're still a family here at Dunder-Mifflin, families grow. And at some point, the daddy can't take a bath with the kids anymore. I am upper management. And it would be inappropriate for me to take a bath with Pam as much as I might want to.\nPam: He said what?!?!?!"
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael: Guys, wondering if I could get your help for something. I am looking for a new joke to tell. And it needs to be just killer. And it does not need to be clean. So, what you got?\nDarryl: Like, a joke? a knock knock joke?\nMichael: Yeah, no. I mean better, better than that. The type of stuff you guys tell all day.\nDarryl: Well, those all some awful tight pants you have on. Where did you get them, like Queers R Us?\nMichael: Oh, alright alright."
                    }
                ],
                "images": []
            }
        ]
    },
    "coldOpens": [
        "None "
    ],
    "storylines": [
        "Michael declares himself \"King of Forwards\" because he is a master of forwarding what he considers to be funny email to the rest of the office. Michael's \"best friend forever\" Todd Packer arrives and shares crude and sexist gossip about an upper management scandal, which continues to offend the staff. Ryan is called upon to drive Packer around town because of Packer's \"DUI situation\". Meanwhile, Pam waits with anticipation for her mother to arrive from out of town.",
        "Toby privately informs Michael that their CFO resigned because of sexual harassment. Consequently, he has been asked by Corporate to hold a five-minute review of the company's sexual harassment policies. Michael interprets this as Corporate cracking down on his inappropriate jokes and is upset that this will put a damper on his easy-going office environment by forcing everybody to \"scrutinize every little thing we say and do all day.\" His indignation rises to outrage when he learns that Corporate is sending down a lawyer to talk to Michael.",
        "Michael goes down to the warehouse to find some dirty jokes that he can use to remind the staff how great jokes can be, but he ends up being sexually harassed himself and runs away in embarrassment. Upstairs, Toby's presentation goes well, and Pam asks everyone to keep it clean when her mother arrives. Just as Toby is wrapping up, Michael arrives with a blow-up sex doll. He makes a speech on not losing the sexual humor around the office, but fails to get the support of the employees.",
        "For laughs, Michael and the warehouse staff watch the sexual harassment video in the conference room. Meanwhile, Dwight asks Toby questions about the female anatomy. Just as Michael shares a crude remark about the video with the rest of the staff, Jan and the lawyer arrive from Corporate.",
        "Todd Packer returns to the office as Michael meets with Jan and the lawyer, upset that their crackdown on his inappropriate e-mail forwarding means that he basically can't say anything in the office at all. In a talking head interview, Michael defensively explains that as the King of Forwards, he's just forwarding the jokes; he didn't write them and therefore cannot be held responsible for their content. He elaborates, \"You wouldn't arrest a guy who's just delivering drugs from one guy to another.\" Michael emerges from the meeting to announce that he can no longer be friends with his staff and that he will talk only about work. As a result, he will never tell another joke again. Jim goads Michael into breaking his vow immediately.",
        "Jan calls Michael back into his office for another meeting as Michael's \"free speech\" lawyer arrives. Jan explains that as the corporate lawyer, Mr. O'Malley's job is protect the company and upper-level management, including Michael. Michael is instantly relieved that he's not in trouble.",
        "Just as Michael throws away the sex doll, Pam's mother arrives and after Roy leaves, she asks in whispers (and is shushed by an embarrassed Pam) which one is Jim. Todd Packer shares some more inappropriate jokes with the employees and Michael tries to draw the line, but points the blame at Kevin. He gets teased by Packer and ends up saying how beautiful Phyllis is and saying the only thing he's worried about \"is gettin' a boner.\""
    ],
    "quotes": [
        "Michael: Toby is in HR which means he works for Corporate, so he's really not a part of our family. Also, he's divorced, so he's really not a part of his family.",
        "Michael: I just want you to know that, uh, this is not my decision, but from here on out, we can no longer be friends...And when we talk about things here, we may only discuss, um, work-associated things...and, uh, you can consider this my retirement from comedy...And in the future, if I want to say something funny, or witty, or do an impression, I will no longer ever do any of those things.\nJim: Does that include \"That's what she said?\"\nMichael: Yes...\nJim: Wow, that is really hard...You really think you can go all day long?... Well, you always left me satisfied and smiling, so...\nMichael: That's what she said!",
        "Michael: Times have changed a little. And even though we're still a family here at Dunder-Mifflin, families grow. And at some point, the daddy can't take a bath with the kids anymore. I am upper management. And it would be inappropriate for me to take a bath with Pam as much as I might want to.\nPam: He said what?!?!?!",
        "Michael: Guys, wondering if I could get your help for something. I am looking for a new joke to tell. And it needs to be just killer. And it does not need to be clean. So, what you got?\nDarryl: Like, a joke? a knock knock joke?\nMichael: Yeah, no. I mean better, better than that. The type of stuff you guys tell all day.\nDarryl: Well, those all some awful tight pants you have on. Where did you get them, like Queers R Us?\nMichael: Oh, alright alright."
    ]
}