{
    "season": 2,
    "title": "Sexual Harassment",
    "episode": "2",
    "episodes": [
        2
    ],
    "coldOpens": [
        "None "
    ],
    "storylines": [
        "Michael declares himself \"King of Forwards\" because he is a master of forwarding what he considers to be funny email to the rest of the office. Michael's \"best friend forever\" Todd Packer arrives and shares crude and sexist gossip about an upper management scandal, which continues to offend the staff. Ryan is called upon to drive Packer around town because of Packer's \"DUI situation\". Meanwhile, Pam waits with anticipation for her mother to arrive from out of town.",
        "Toby privately informs Michael that their CFO resigned because of sexual harassment. Consequently, he has been asked by Corporate to hold a five-minute review of the company's sexual harassment policies. Michael interprets this as Corporate cracking down on his inappropriate jokes and is upset that this will put a damper on his easy-going office environment by forcing everybody to \"scrutinize every little thing we say and do all day.\" His indignation rises to outrage when he learns that Corporate is sending down a lawyer to talk to Michael.",
        "Michael goes down to the warehouse to find some dirty jokes that he can use to remind the staff how great jokes can be, but he ends up being sexually harassed himself and runs away in embarrassment. Upstairs, Toby's presentation goes well, and Pam asks everyone to keep it clean when her mother arrives. Just as Toby is wrapping up, Michael arrives with a blow-up sex doll. He makes a speech on not losing the sexual humor around the office, but fails to get the support of the employees.",
        "For laughs, Michael and the warehouse staff watch the sexual harassment video in the conference room. Meanwhile, Dwight asks Toby questions about the female anatomy. Just as Michael shares a crude remark about the video with the rest of the staff, Jan and the lawyer arrive from Corporate.",
        "Todd Packer returns to the office as Michael meets with Jan and the lawyer, upset that their crackdown on his inappropriate e-mail forwarding means that he basically can't say anything in the office at all. In a talking head interview, Michael defensively explains that as the King of Forwards, he's just forwarding the jokes; he didn't write them and therefore cannot be held responsible for their content. He elaborates, \"You wouldn't arrest a guy who's just delivering drugs from one guy to another.\" Michael emerges from the meeting to announce that he can no longer be friends with his staff and that he will talk only about work. As a result, he will never tell another joke again. Jim goads Michael into breaking his vow immediately.",
        "Jan calls Michael back into his office for another meeting as Michael's \"free speech\" lawyer arrives. Jan explains that as the corporate lawyer, Mr. O'Malley's job is protect the company and upper-level management, including Michael. Michael is instantly relieved that he's not in trouble.",
        "Just as Michael throws away the sex doll, Pam's mother arrives and after Roy leaves, she asks in whispers (and is shushed by an embarrassed Pam) which one is Jim. Todd Packer shares some more inappropriate jokes with the employees and Michael tries to draw the line, but points the blame at Kevin. He gets teased by Packer and ends up saying how beautiful Phyllis is and saying the only thing he's worried about \"is gettin' a boner.\""
    ],
    "quotes": [
        [
            {
                "speaker": "Michael",
                "content": " Toby is in HR which means he works for Corporate, so he's really not a part of our family. Also, he's divorced, so he's really not a part of his family."
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " I just want you to know that, uh, this is not my decision, but from here on out, we can no longer be friends...And when we talk about things here, we may only discuss, um, work-associated things...and, uh, you can consider this my retirement from comedy...And in the future, if I want to say something funny, or witty, or do an impression, I will no longer ever do any of those things."
            },
            {
                "speaker": "Jim",
                "content": " Does that include \"That's what she said?\""
            },
            {
                "speaker": "Michael",
                "content": " Yes..."
            },
            {
                "speaker": "Jim",
                "content": " Wow, that is really hard...You really think you can go all day long?... Well, you always left me satisfied and smiling, so..."
            },
            {
                "speaker": "Michael",
                "content": " That's what she said!"
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " Times have changed a little. And even though we're still a family here at Dunder-Mifflin, families grow. And at some point, the daddy can't take a bath with the kids anymore. I am upper management. And it would be inappropriate for me to take a bath with Pam as much as I might want to."
            },
            {
                "speaker": "Pam",
                "content": " He said what?!?!?!"
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " Guys, wondering if I could get your help for something. I am looking for a new joke to tell. And it needs to be just killer. And it does not need to be clean. So, what you got?"
            },
            {
                "speaker": "Darryl",
                "content": " Like, a joke? a knock knock joke?"
            },
            {
                "speaker": "Michael",
                "content": " Yeah, no. I mean better, better than that. The type of stuff you guys tell all day."
            },
            {
                "speaker": "Darryl",
                "content": " Well, those all some awful tight pants you have on. Where did you get them, like Queers R Us?"
            },
            {
                "speaker": "Michael",
                "content": " Oh, alright alright."
            }
        ]
    ]
}