{
    "season": 2,
    "title": "Conflict Resolution",
    "episode": "21",
    "episodes": [
        21
    ],
    "coldOpens": [
        "Pam is still making wedding preparations and Phyllis tells her she has received her 'save the date.' Angela says she doesn't have hers yet. "
    ],
    "storylines": [
        "Angela discovers she has not been invited to Pam's wedding. I.D. pictures are also being taken in the office, following Dwight's appointment as Honorary Security Advisor of the office park in Drug Testing. Oscar complains to Human Resources Director Toby about Angela's baby poster. When Michael overhears the discussion, he tells Toby he wants to try to resolve the conflict himself. Using a manual, he decides that Oscar will wear a T-shirt of the poster so that Angela can look at it, but Oscar won't have to.",
        "Michael takes every other unresolved office complaint from Toby (by force) to try and resolve them himself with disastrous results ahead. Michael notes to his pleasure that there are no complaints filed against him, but Toby shows the camera a separate file in a locked drawer specifically for complaints against Michael.",
        "Pam hand delivers her \"save the date\" card to Angela. Michael starts reading the (confidential) complaints out loud in front of the office and the employees start feeling both angry and awkward at the complaints made by and against them. Pam is angry about a complaint against her for planning her wedding during office hours, which she blames Angela for making. Due to a prank by Jim, Dwight's security I.D. badge labels him as a security threat and his middle name is typed as \"Fart\" instead of \"Kurt\".",
        "Dwight storms off and makes another complaint to Toby, but he discovers his complaints about Jim were never filed by Toby and just sat in a box under his desk. Dwight demands Michael take action against Jim. Shortly after, Dwight begins looking up potential job openings in other Dunder-Mifflin branches to verbally taunt Jim (which seems to work by Jim's irritated facial expression).",
        "Michael locks Dwight and Jim together in a room for a \"cage match\", where they're not allowed to leave until they come to an understanding. As Jim explains each prank he pulled on Dwight, he starts to realize how unfunny they are when they're listed back to back and feels regret at how he spends his time in the office. At this point, tensions are high in the office and no one speaks to one another. Michael tries to resolve them by getting the I.D. photographer to get a group shot of the staff.",
        "As Michael attempts to get one good group shot (at $20 a piece), Jim confesses to Pam that it was he who registered the complaint about Pam's wedding planning. The following day, he leaves a message on Pam's voicemail stating he won't be in because he has a doctor's appointment in the city, but we see that he is actually seeing Jan for a sales position at the Dunder Mifflin Stamford branch. Toby is seen storing the papers full of the conflicts in the warehouse."
    ],
    "quotes": [
        [
            {
                "speaker": "Dwight",
                "content": " I.D. badges are long overdue. Security in this office park is a joke. Last year, I came to work with my spud gun in a duffel bag. I sat at my desk all day, with a rifle that shoots potatoes at sixty pounds per square inch. Can you imagine if I was deranged?"
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " Okay, so Dwight, in your own words - [reads from complaint paper] \"Someone replaced all my pens and pencils with crayons. I suspect Jim Halpert.\" [flips to another paper] \"Everyone has called me 'Dwayne' all day. I think Jim Halpert paid them to.\""
            }
        ],
        [
            {
                "speaker": "Jim",
                "content": " [laughs] Yes! Five bucks each. And it was totally worth it."
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " [reading] \"This morning, I found a bloody glove in my desk drawer and Jim Halpert tried to convince me I committed murder. I think he may be the real murderer.\" [flips to another paper] \"Jim Halpert said there was an abandoned infant in the woman's room. When I went to save the child, I saw Meredith on the can.\" Gah. \"This morning, I knocked myself in the head with the phone.\""
            }
        ],
        [
            {
                "speaker": "Jim",
                "content": " That actually took a while. I had to put, uh, more and more nickels into his handset, till he got used to the weight, and then I just... took 'em all out."
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " [reading] \"Every time I typed my name, it said 'Diapers'.\""
            }
        ],
        [
            {
                "speaker": "Jim",
                "content": " Just a simple macro. You know, these actually don't sound that funny one after another. But he does deserve it, though."
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " \"By the end of the day, my desk was about two feet closer to the copier.\""
            }
        ],
        [
            {
                "speaker": "Jim",
                "content": " Yeah, I just moved it an inch every time he went to the bathroom. And that's how I spent my entire day that day."
            }
        ]
    ]
}