{
    "season": 2,
    "title": "Drug Testing",
    "episode": "20",
    "episodes": [
        20
    ],
    "coldOpens": [
        "Dwight finds drugs in the parking lot and starts a huge investigation. Jim explains that \"Dwight finding drugs is worse than anyone actually doing drugs.\" "
    ],
    "storylines": [
        "Dwight finds half of a joint in the parking lot of Dunder Mifflin and takes advantage of his volunteer sheriff deputy status by interviewing the staff to get to the bottom of it. Meanwhile, Jim does an impression of Stanley and gets caught. When he and Pam speak at the same time (impersonating Stanley's response), Pam calls \"jinx\" so Jim can't talk until he buys her a Coke, which isn't an issue until he discovers the vending machine is sold out. When Dwight sets up urine testing, Michael worries that a \"clove cigarette\" he smoked at an Alicia Keys concert will show up.",
        "Michael holds an anti-drug meeting for the entire office, where he over-expresses his hatred of drugs. He tries to get out of the testing, but Dwight continues to insist that he must take part. Michael pressures Dwight for a cup of his \"clean\" urine, but Angela is against the idea. Jim continues to hold up his end of the jinx. Pam continues to tease him, until she gets to the point where she says, \"you can tell me anything\", which creates an awkward silence. Michael passes his drug test (with Dwight's urine); Dwight turns in his volunteer badge over his actions. Pam buys Jim his Coke, which he buys off of her so she can find out what's been happening with Dwight the whole day. Michael feels guilty, so he makes Dwight an \"Honorary Security Advisor\" for Dunder Mifflin Scranton. Jim wonders aloud what Dwight gets out of his relationship with Michael, while the camera focuses on him and Pam, suggesting that the two have a similarly confusing relationship."
    ],
    "quotes": [
        [
            {
                "speaker": "Jim",
                "content": " So, yesterday, Dwight found half a joint in the parking lot - which is unfortunate because, as it turns out, Dwight finding drugs is more dangerous than most people using drugs."
            }
        ],
        [
            {
                "content": "Dwight I didn't become a Lackawanna volunteer sheriff's deputy to make friends... and by the way I haven't."
            }
        ],
        [
            {
                "speaker": "Ryan",
                "content": " I don't think Michael's ever done drugs...I don't know if anyone's ever offered him any..."
            }
        ],
        [
            {
                "speaker": "Dwight",
                "content": " Oscar visited Mexico when he was five to attend his great-grandmother's funeral. What does that mean to a United States law enforcement officer? He's a potential drug mule."
            }
        ],
        [
            {
                "speaker": "Dwight",
                "content": " Do you know what this is?"
            },
            {
                "speaker": "Phyllis",
                "content": " Yes, it's marijuana."
            },
            {
                "speaker": "Dwight",
                "content": " How do you know that?"
            },
            {
                "speaker": "Phyllis",
                "content": " It's labeled."
            }
        ],
        [
            {
                "speaker": "Creed",
                "content": " That is Northern Lights cannabis indica."
            },
            {
                "speaker": "Dwight",
                "content": " No...it's marijuana."
            }
        ],
        [
            {
                "speaker": "Jim",
                "content": " I'm just saying...that you can't be sure that it wasn't you."
            },
            {
                "speaker": "Dwight",
                "content": " That's ridiculous - of course it wasn't me!"
            },
            {
                "speaker": "Jim",
                "content": " Marijuana is a memory loss drug, so maybe you just don't remember..."
            },
            {
                "speaker": "Dwight",
                "content": " I would remember!"
            },
            {
                "speaker": "Jim",
                "content": " Well how could you if it just erased your memory?"
            },
            {
                "speaker": "Dwight",
                "content": " That's not how it works!"
            },
            {
                "speaker": "Jim",
                "content": " Now, how do you know how it works?"
            },
            {
                "speaker": "Dwight",
                "content": " Knock it off - I'm interviewing you!"
            },
            {
                "speaker": "Jim",
                "content": " No! You said I'd be conducting the interview when I walked in here - now exactly how much pot did you smoke?!"
            }
        ],
        [
            {
                "speaker": "Jim",
                "content": " You look cute today, Dwight. "
            },
            {
                "speaker": "Dwight",
                "content": " Thanks, girl. "
            }
        ]
    ]
}