{
    "season": 2,
    "title": "Conflict Resolution",
    "episode": "21",
    "episodes": [
        21
    ],
    "episodeDetails": {
        "sections": [
            {
                "title": "Conflict Resolution",
                "level": 1,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "\"Conflict Resolution\" is the 21st episode of Season 2 of The Office and the 27th overall. It was written by Greg Daniels and directed by Charles McDougall. It first aired on May 4, 2006. It was viewed by 7.4 million people."
                    }
                ],
                "images": []
            },
            {
                "title": "Synopsis",
                "level": 2,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Angela discovers she has not been invited to Pam's wedding. I.D. pictures are also being taken in the office, following Dwight's appointment as Honorary Security Advisor of the office park in Drug Testing. Oscar complains to Human Resources Director Toby about Angela's baby poster. When Michael overhears the discussion, he tells Toby he wants to try to resolve the conflict himself. Using a manual, he decides that Oscar will wear a T-shirt of the poster so that Angela can look at it, but Oscar won't have to."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael takes every other unresolved office complaint from Toby (by force) to try and resolve them himself with disastrous results ahead. Michael notes to his pleasure that there are no complaints filed against him, but Toby shows the camera a separate file in a locked drawer specifically for complaints against Michael."
                    },
                    {
                        "type": "paragraph",
                        "text": "Pam hand delivers her \"save the date\" card to Angela. Michael starts reading the (confidential) complaints out loud in front of the office and the employees start feeling both angry and awkward at the complaints made by and against them. Pam is angry about a complaint against her for planning her wedding during office hours, which she blames Angela for making. Due to a prank by Jim, Dwight's security I.D. badge labels him as a security threat and his middle name is typed as \"Fart\" instead of \"Kurt\"."
                    },
                    {
                        "type": "paragraph",
                        "text": "Dwight storms off and makes another complaint to Toby, but he discovers his complaints about Jim were never filed by Toby and just sat in a box under his desk. Dwight demands Michael take action against Jim. Shortly after, Dwight begins looking up potential job openings in other Dunder-Mifflin branches to verbally taunt Jim (which seems to work by Jim's irritated facial expression)."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael locks Dwight and Jim together in a room for a \"cage match\", where they're not allowed to leave until they come to an understanding. As Jim explains each prank he pulled on Dwight, he starts to realize how unfunny they are when they're listed back to back and feels regret at how he spends his time in the office. At this point, tensions are high in the office and no one speaks to one another. Michael tries to resolve them by getting the I.D. photographer to get a group shot of the staff."
                    },
                    {
                        "type": "paragraph",
                        "text": "As Michael attempts to get one good group shot (at $20 a piece), Jim confesses to Pam that it was he who registered the complaint about Pam's wedding planning. The following day, he leaves a message on Pam's voicemail stating he won't be in because he has a doctor's appointment in the city, but we see that he is actually seeing Jan for a sales position at the Dunder Mifflin Stamford branch. Toby is seen storing the papers full of the conflicts in the warehouse."
                    }
                ],
                "images": []
            },
            {
                "title": "Trivia",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "The poster that Oscar is disturbed by was given to Angela by Toby in Christmas Party.",
                                "elements": []
                            },
                            {
                                "text": "Not only does Dwight's nametag indeed say \"Dwight Fart Schrute,\" it also says \"ASST. to the REGIONAL MANAGER\" - despite Dwight Having been promoted to \"assistant regional manager\" in the episode The Fight from earlier in the season. At the bottom, Dwight also appears to have signed his name as \"Dwight Fart Schrute,\" even though Dwight did not notice any of the errors until after Jim had laminated it. This would imply that Jim forged Dwight's signature.",
                                "elements": [
                                    {
                                        "text": "After Jim and Dwight's \"cage match\" conflict resolution, Dwight's I.D. is shown again. Although Dwight's name has been fixed to \"Dwight K. Schrute\" (along with his signature), his title remains as \"ASST. to the REGIONAL MANAGER\" and his security level remains as \"SECURITY THREAT\".",
                                        "elements": []
                                    }
                                ]
                            },
                            {
                                "text": "Creed thinks his ID badge photo is a mugshot as people who have their mugshot photos taken stand on both sides.",
                                "elements": []
                            },
                            {
                                "text": "Kevin filed a complaint against Stanley, saying that he takes his Miracle Whip without asking. In the previous episode, Jim's impression of Stanley is, \"I like the tangy zip of Miracle Whip.\"",
                                "elements": []
                            },
                            {
                                "text": "Meredith complains that every morning the lights are too bright and everyone is too loud, implying that she is often hungover.",
                                "elements": []
                            },
                            {
                                "text": "Dwight's middle name is revealed as Kurt however Jim changes it to Fart on his ID badge as a joke.",
                                "elements": []
                            },
                            {
                                "text": "Pam refers to Dwight as \"Bobblehead Joe\", reffering to the bobblehead of himself that Angela gave him on Valentine's Day.",
                                "elements": []
                            },
                            {
                                "text": "Dwight immediately knows which box contains his complaints, although he has never seen the box.",
                                "elements": []
                            },
                            {
                                "text": "There are many full-time jobs available at Dunder Mifflin, which are shown in two shots of Dwight's computer. In Stamford, there is a position for Plant Manager and Sales Manager (which Dwight has highlighted, showing it requires 3–5 years of experience and a Bachelor's Degree). In New York, there is a Maintenance Engineer position. The second time Dwight's computer is shown, there appear to be many more jobs, which are not shown very clearly. Albany has three positions open, one of which appears to be for Comptroller and the other two being repeats for Regional Manager. Stamford has an additional position (IT Manager), Scranton has two (Warehouse Manager and Warehouse Staff 1), and Buffalo has one (which cannot be seen on the screen).",
                                "elements": []
                            },
                            {
                                "text": "When Michael starts reopening grievances, he mentions a Phyllis and Angela dispute. Angela responds, \"You already did me.\" The camera pans to Jim, who mouths \"That's what she said\" in time with Michael's quip.",
                                "elements": []
                            },
                            {
                                "text": "List of Dwight's grievances mentioned against Jim:",
                                "elements": [
                                    {
                                        "text": "Replaced all of Dwight's pens and pencils with crayons",
                                        "elements": []
                                    },
                                    {
                                        "text": "Jim paid everyone five dollars so they would call Dwight \"Dwayne\"",
                                        "elements": []
                                    },
                                    {
                                        "text": "Placed a bloody glove in Dwight's desk drawer and tried to convince him he committed murder",
                                        "elements": []
                                    },
                                    {
                                        "text": "Told Dwight there was an abandoned infant in the women's bathroom, thus tricking him into going to the bathroom and \"[seeing] Meredith on the can\"",
                                        "elements": []
                                    },
                                    {
                                        "text": "Dwight hit himself in the head with his phone (Jim kept putting nickels into the handset until Dwight got used to the weight; Jim then abruptly removed all of the nickels; Dwight went to pick up the phone, and believing the phone was heavy, pulled it very hard)",
                                        "elements": []
                                    },
                                    {
                                        "text": "Every time Dwight typed his name it came out as \"diapers\"",
                                        "elements": []
                                    },
                                    {
                                        "text": "By the end of the day, Dwight's desk was moved two feet closer to the copier",
                                        "elements": []
                                    },
                                    {
                                        "text": "Also in the episode, Jim said \"Dwight tried to kiss me. I didn't say anything because I'm not really sure how I feel about it.\"",
                                        "elements": [
                                            {
                                                "text": "Jim admits that his many pranks don't seem nearly as funny when listed in succession, but claims that Dwight does deserve it. The following season, in The Convention, when they meet for the first time since his transfer to Stamford, Jim says that, upon seeing Dwight again, he recognized their stupid and petty nature... \"then he spoke.\"",
                                                "elements": []
                                            }
                                        ]
                                    }
                                ]
                            },
                            {
                                "text": "The camera the photographer uses is a Canon 20D with an EF 20mm f/2.8 USM. During the group shot, he used an EF 24-105mm f/4L USM IS. Also, during the shoot for the ID cards, he used the built-in flash, but with the group picture, he had an external flash. The photographer is Scott Adsit who we have more recently seen as Pete Hornberger in another NBC show 30 Rock.",
                                "elements": []
                            }
                        ]
                    },
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Near the end of the episode, when the photographer is taking group pictures of the office staff, Michael says in voice-over that \"[i]t was really hard getting a good picture of fifteen people.\" There were only fourteen people being photographed, however.",
                                "elements": []
                            },
                            {
                                "text": "When asked to smile by the photographer while having his I.D. photo taken, Dwight mentions that he never smiles if he can help it.  He says that showing one's teeth is a sign of submission amongst primates.  In spite of this, he's shown baring his teeth and grimacing for the camera when the group photo is taken near the end of the episode.",
                                "elements": []
                            },
                            {
                                "text": "A humorous conversation transpires \"behind the scenes\" between Michael and Stanley, and possibly foreshadows Stanley's outburst in Did I Stutter? when Pam accuses Angela of complaining about her in-office wedding planning (Approximately 10 minutes and 50 seconds into the episode). If you listen closely, you can hear that the dialogue is:",
                                "elements": []
                            }
                        ]
                    },
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "When Angela holds up Pam's Save the Date, the address for the wedding is listed as \"TBA.\" Considering Michael's birthday is on March 15th and they sent out the Save the Dates to everyone else sometime after that, Pam and Roy have less than 2-3 months to find a venue. Furthermore, because this episode originally aired on May 4th, it could mean that they technically only have one month, further showing how their wedding isn't a top priority for either of them and foreshadows their eventual breakup.",
                                "elements": []
                            }
                        ]
                    },
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "The 5 styles of conflict resolution are:",
                                "elements": []
                            }
                        ]
                    },
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Lose-lose",
                                "elements": []
                            },
                            {
                                "text": "Win-lose",
                                "elements": []
                            },
                            {
                                "text": "Compromise",
                                "elements": []
                            },
                            {
                                "text": "Win-Win",
                                "elements": []
                            },
                            {
                                "text": "Win-Win-Win (\"The important difference here is with win-win-win we all win, me too. I win for having successfuly mediated a conflict at work.\") ",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Deleted scenes",
                "level": 2,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "The Season Two DVD contains a number of deleted scenes from this episode. Notable cut scenes include:"
                    },
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Dwight finds his desk encircled in police tape. Jim secretly calls Dwight's phone, but Dwight cannot answer because it would require him to cross the police tape.",
                                "elements": []
                            },
                            {
                                "text": "Michael explains that in real life, unlike television, some days are boring and uneventful.",
                                "elements": []
                            },
                            {
                                "text": "Dwight annoys the photographer in various ways.",
                                "elements": []
                            },
                            {
                                "text": "In talking head interviews, Michael explains that he hates it when people don't tell each other why they're angry. He gives as an example how he would repeatedly ask, \"What's wrong, Dad?\" without getting a response. Later, he tells a story about two women who claim to be the mother of the same baby but messes up the ending. In the conference room, he dedicates himself to resolving all the old cases \"before Toby can kill or rape another person\". Michael later expresses surprise that Dwight \"went postal\". He also claims credit for coming up with the \"cage match\" idea.",
                                "elements": []
                            },
                            {
                                "text": "Pam asks the photographer if he does weddings.",
                                "elements": []
                            },
                            {
                                "text": "Dwight gives Pam \"Level Red\" security clearance.",
                                "elements": []
                            },
                            {
                                "text": "Meredith and Kevin get their pictures taken.",
                                "elements": []
                            },
                            {
                                "text": "Phyllis, sore at Stanley, declines to forward a misdirected call to him.",
                                "elements": []
                            },
                            {
                                "text": "Hank hassles Dwight before letting him into the building, while meanwhile waving the other employees through. By the time Dwight clears security, he misses the elevator.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Cultural references",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Save the date is a colloquial term indicating that one will not schedule other activities for a particular day. It has become customary in the United States to send \"Save the Date\" cards to wedding guests in advance of the formal invitation.",
                                "elements": []
                            },
                            {
                                "text": "Fantastic Sam's is a chain of hair salons. The store nearest to Scranton is in Wilkes-Barre, approximately a half hour's drive away.",
                                "elements": []
                            },
                            {
                                "text": "A spud gun fires a potato from a plastic pipe via compressed air. People build them as a hobby.",
                                "elements": []
                            },
                            {
                                "text": "Creed's turn to the side suggests that he thinks he has been arrested. In the United States, people who have been arrested are photographed twice, one front view and one side view.",
                                "elements": []
                            },
                            {
                                "text": "A zip code is a postal code used for addressing mail.",
                                "elements": []
                            },
                            {
                                "text": "Miracle Whip is a brand of sandwich spread, similar to mayonnaise.",
                                "elements": []
                            },
                            {
                                "text": "A cage match is a type of fight staged in a cage by professional wrestlers.",
                                "elements": []
                            },
                            {
                                "text": "A bloody glove was a controversial piece of evidence in the murder trial of O. J. Simpson.",
                                "elements": []
                            },
                            {
                                "text": "A price gouger is a person who charges exorbitant prices.",
                                "elements": []
                            },
                            {
                                "text": "Photoshop is a computer program used for manipulating digital images.",
                                "elements": []
                            },
                            {
                                "text": "The Apprentice and Big Brother are two reality-based television programs.",
                                "elements": []
                            },
                            {
                                "text": "Michael's story about the two women and a baby is a botched retelling of Solomon's Baby, a story from the Bible (1 Kings).",
                                "elements": []
                            },
                            {
                                "text": "Cold Case is a television drama about a Philadelphia police division that investigates unsolved crimes. However, the title theme does not begin with a gong-like sound; that is from Law and Order.",
                                "elements": []
                            },
                            {
                                "text": "At the end of the episode, Toby stores the complaints box in the warehouse with hundreds of similar boxes. This pays homage to the endings of Raiders of the Lost Ark and Citizen Kane. This plot device is known as the Government Warehouse.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Cast",
                "level": 2,
                "content": [],
                "images": []
            },
            {
                "title": "Main Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Steve Carell as Michael Scott",
                                "elements": []
                            },
                            {
                                "text": "Rainn Wilson as Dwight Schrute",
                                "elements": []
                            },
                            {
                                "text": "John Krasinski as Jim Halpert",
                                "elements": []
                            },
                            {
                                "text": "Jenna Fischer as Pam Beesly",
                                "elements": []
                            },
                            {
                                "text": "B.J. Novak as Ryan Howard",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Supporting Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Melora Hardin as Jan Levenson",
                                "elements": []
                            },
                            {
                                "text": "Leslie David Baker as Stanley Hudson",
                                "elements": []
                            },
                            {
                                "text": "Brian Baumgartner as Kevin Malone",
                                "elements": []
                            },
                            {
                                "text": "Kate Flannery as Meredith Palmer",
                                "elements": []
                            },
                            {
                                "text": "Angela Kinsey as Angela Martin",
                                "elements": []
                            },
                            {
                                "text": "Oscar Nunez as Oscar Martinez",
                                "elements": []
                            },
                            {
                                "text": "Phyllis Smith as Phyllis Lapin",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Recurring Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Paul Lieberstein as Toby Flenderson",
                                "elements": []
                            },
                            {
                                "text": "Creed Bratton (actor) as Creed Bratton",
                                "elements": []
                            },
                            {
                                "text": "Mindy Kaling as Kelly Kapoor",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Guest Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Scott Adsit as The Photographer",
                                "elements": []
                            },
                            {
                                "text": "Vivianne Collins as Headquarters Receptionist",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            }
        ]
    },
    "quotesDetails": {
        "sections": [
            {
                "title": "Conflict Resolution Quotes",
                "level": 1,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Dwight: I.D. badges are long overdue. Security in this office park is a joke. Last year, I came to work with my spud gun in a duffel bag. I sat at my desk all day, with a rifle that shoots potatoes at sixty pounds per square inch. Can you imagine if I was deranged?"
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael: Okay, so Dwight, in your own words - [reads from complaint paper] \"Someone replaced all my pens and pencils with crayons. I suspect Jim Halpert.\" [flips to another paper] \"Everyone has called me 'Dwayne' all day. I think Jim Halpert paid them to.\""
                    },
                    {
                        "type": "paragraph",
                        "text": "Jim: [laughs] Yes! Five bucks each. And it was totally worth it."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael: [reading] \"This morning, I found a bloody glove in my desk drawer and Jim Halpert tried to convince me I committed murder. I think he may be the real murderer.\" [flips to another paper] \"Jim Halpert said there was an abandoned infant in the woman's room. When I went to save the child, I saw Meredith on the can.\" Gah. \"This morning, I knocked myself in the head with the phone.\""
                    },
                    {
                        "type": "paragraph",
                        "text": "Jim: That actually took a while. I had to put, uh, more and more nickels into his handset, till he got used to the weight, and then I just... took 'em all out."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael: [reading] \"Every time I typed my name, it said 'Diapers'.\""
                    },
                    {
                        "type": "paragraph",
                        "text": "Jim: Just a simple macro. You know, these actually don't sound that funny one after another. But he does deserve it, though."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael: \"By the end of the day, my desk was about two feet closer to the copier.\""
                    },
                    {
                        "type": "paragraph",
                        "text": "Jim: Yeah, I just moved it an inch every time he went to the bathroom. And that's how I spent my entire day that day."
                    }
                ],
                "images": []
            }
        ]
    },
    "coldOpens": [
        "Pam is still making wedding preparations and Phyllis tells her she has received her 'save the date.' Angela says she doesn't have hers yet. "
    ],
    "storylines": [
        "Angela discovers she has not been invited to Pam's wedding. I.D. pictures are also being taken in the office, following Dwight's appointment as Honorary Security Advisor of the office park in Drug Testing. Oscar complains to Human Resources Director Toby about Angela's baby poster. When Michael overhears the discussion, he tells Toby he wants to try to resolve the conflict himself. Using a manual, he decides that Oscar will wear a T-shirt of the poster so that Angela can look at it, but Oscar won't have to.",
        "Michael takes every other unresolved office complaint from Toby (by force) to try and resolve them himself with disastrous results ahead. Michael notes to his pleasure that there are no complaints filed against him, but Toby shows the camera a separate file in a locked drawer specifically for complaints against Michael.",
        "Pam hand delivers her \"save the date\" card to Angela. Michael starts reading the (confidential) complaints out loud in front of the office and the employees start feeling both angry and awkward at the complaints made by and against them. Pam is angry about a complaint against her for planning her wedding during office hours, which she blames Angela for making. Due to a prank by Jim, Dwight's security I.D. badge labels him as a security threat and his middle name is typed as \"Fart\" instead of \"Kurt\".",
        "Dwight storms off and makes another complaint to Toby, but he discovers his complaints about Jim were never filed by Toby and just sat in a box under his desk. Dwight demands Michael take action against Jim. Shortly after, Dwight begins looking up potential job openings in other Dunder-Mifflin branches to verbally taunt Jim (which seems to work by Jim's irritated facial expression).",
        "Michael locks Dwight and Jim together in a room for a \"cage match\", where they're not allowed to leave until they come to an understanding. As Jim explains each prank he pulled on Dwight, he starts to realize how unfunny they are when they're listed back to back and feels regret at how he spends his time in the office. At this point, tensions are high in the office and no one speaks to one another. Michael tries to resolve them by getting the I.D. photographer to get a group shot of the staff.",
        "As Michael attempts to get one good group shot (at $20 a piece), Jim confesses to Pam that it was he who registered the complaint about Pam's wedding planning. The following day, he leaves a message on Pam's voicemail stating he won't be in because he has a doctor's appointment in the city, but we see that he is actually seeing Jan for a sales position at the Dunder Mifflin Stamford branch. Toby is seen storing the papers full of the conflicts in the warehouse."
    ],
    "quotes": [
        "Dwight: I.D. badges are long overdue. Security in this office park is a joke. Last year, I came to work with my spud gun in a duffel bag. I sat at my desk all day, with a rifle that shoots potatoes at sixty pounds per square inch. Can you imagine if I was deranged?",
        "Michael: Okay, so Dwight, in your own words - [reads from complaint paper] \"Someone replaced all my pens and pencils with crayons. I suspect Jim Halpert.\" [flips to another paper] \"Everyone has called me 'Dwayne' all day. I think Jim Halpert paid them to.\"",
        "Jim: [laughs] Yes! Five bucks each. And it was totally worth it.",
        "Michael: [reading] \"This morning, I found a bloody glove in my desk drawer and Jim Halpert tried to convince me I committed murder. I think he may be the real murderer.\" [flips to another paper] \"Jim Halpert said there was an abandoned infant in the woman's room. When I went to save the child, I saw Meredith on the can.\" Gah. \"This morning, I knocked myself in the head with the phone.\"",
        "Jim: That actually took a while. I had to put, uh, more and more nickels into his handset, till he got used to the weight, and then I just... took 'em all out.",
        "Michael: [reading] \"Every time I typed my name, it said 'Diapers'.\"",
        "Jim: Just a simple macro. You know, these actually don't sound that funny one after another. But he does deserve it, though.",
        "Michael: \"By the end of the day, my desk was about two feet closer to the copier.\"",
        "Jim: Yeah, I just moved it an inch every time he went to the bathroom. And that's how I spent my entire day that day."
    ]
}