{
    "season": 2,
    "title": "Casino Night",
    "episode": "22",
    "episodes": [
        22
    ],
    "coldOpens": [
        "Jim convinces Dwight that he can move objects with his mind and Dwight begins to believe it when he moves a coat rack. Pam helps him by using an umbrella to pull the coat rack. "
    ],
    "storylines": [
        "The Dunder Mifflin warehouse is converted into a full-blown gambling hall for the Scranton Business Park's Casino Night. Jim \"proves\" to Dwight that he has telekinesis (with help from Pam). Michael invites Jan to the Casino Night, but she declines. Afterwards, he announces to the office that the employee with the highest chip count will get a mini-fridge and $500 to donate to the charity of their choice. Jim and Pam set out to watch horrible band demo tapes for Pam's wedding. Jim explains to the documentary crew that he met with Jan about the sales position in Stamford because he has \"no future here.\"",
        "Among the tapes, the two spot a Police cover band called Scrantonicity, in which Kevin is the lead singer and the drummer. Jim is all for this choice but Pam is embarrassed about it and prevents him from asking Kevin. Michael's real-estate agent Carol calls to set up an appointment to sign his insurance papers for his mortgage and he asks her to come to the festivities. In the middle of the call, Michael takes a call from Jan, who tells him that she has decided to come to the casino night after all. When he returns to Carol's call, she also accepts his invitation. Michael states that he has \"two queens\" for the Casino Night and that he is going to \"drop a deuce on everyone.\"",
        "Carol arrives at the warehouse. Dwight states that he is in charge of keeping Jan away from Carol. Creed reveals that he is a kleptomaniac, stealing chips, money, and various items from work and at Casino Night. Michael loses all of his money to Toby early in Texas hold 'em. Jan arrives and tells Michael she is okay with Carol. Dwight wins at craps and kisses Angela on the cheek. She slaps him and walks away with a grin on her face (Dwight has a smirk, too). Jim confronts Ryan about his relationship with Kelly, to which Ryan responds with a sheepish grin in the affirmative. Jim tries to check to see if Pam is bluffing in poker, which she isn't.",
        "At the bar, Jan and Carol share an awkward conversation. Jan asks Carol how long she and Michael have been in a relationship. Carol replies that it is their first date, to which Jan says condescendingly that Carol is a \"good sport\".",
        "After Kevin—who claims to be a professional card player—loses to the amateur Phyllis in poker (\"Look,\" she exclaims happily, \"I got all the clovers!\"), Roy approaches him and approves his band for the wedding (without talking to Pam about it), and when Kevin asks whether or not Pam had given her okay on the matter, Roy simply states \"Whatever, I'm in charge of the music.\". Jan and Jim share a scene outside, where she laments ever hooking up with Michael. She asks him if he has thought about the transfer, which he says he has. Jan suggests that he talk to someone in the office about it. Creed ends up winning the mini-fridge due to all the chips he has stolen, saying that it will be the first refrigerator he has owned.  Roy leaves the party early despite Pam's requests that he stay.",
        "Jim approaches Pam because he needs to talk to her, presumably to tell her about the possibility of him transferring to Stamford. Instead, he blurts out that he is in love with her. She asks why he is telling her, to which he replies that he wanted her to know. After a stunned pause, she states she cannot be with him. He tells her he wants to be more than friends, but she is sorry he \"misinterpreted things.\" With tears in his eyes, he states he is sorry he misinterpreted their friendship and discreetly wipes a tear from his cheek as he walks away.",
        "Jan leaves the party bitterly and when she gets to her car, she tosses an overnight bag angrily into the backseat. Michael is pleased \"the hero got the girl.\"",
        "Upstairs in the dark office area, Pam calls her mother to talk about what just happened with Jim, explaining that she does not know what to do. Jim enters the office, and Pam abruptly ends the phone conversation. He approaches her, and she starts to say something but Jim kisses her deeply on the lips, and she returns the kiss. The episode ends with them staring at each other in awkward confusion."
    ],
    "quotes": [
        [
            {
                "speaker": "Michael",
                "content": " Tonight the Scranton Business Park is having Casino Night and we are converting our warehouse into a full-blown gambling hall. And I know it's illegal in Pennsylvania, but it's for charity. And I consider myself a great philanderer. It's just... It's nice to know at the end of the day, I can look in the mirror and say, \"Michael, because of you, some little kid in the Congo has a belly full of rice this evening.\" Makes you feel good."
            }
        ],
        [
            {
                "speaker": "Pam",
                "content": " Hey."
            }
        ],
        [
            {
                "speaker": "Jim",
                "content": " Hey, how's it going?"
            }
        ],
        [
            {
                "speaker": "Pam",
                "content": " Good. Especially after I took all your money in poker."
            }
        ],
        [
            {
                "speaker": "Jim",
                "content": " [laughing] Yeah. Uh... Hey can I talk to you about something?"
            }
        ],
        [
            {
                "speaker": "Pam",
                "content": " About when you want to give me more of your money?"
            }
        ],
        [
            {
                "speaker": "Jim",
                "content": " No, I..."
            }
        ],
        [
            {
                "speaker": "Pam",
                "content": " Did you want to do that now? We can go inside. I'm feeling kind of good tonight."
            }
        ],
        [
            {
                "speaker": "Jim",
                "content": " I was just...um...I'm in love with you."
            }
        ],
        [
            {
                "speaker": "Pam",
                "content": " What?"
            }
        ],
        [
            {
                "speaker": "Jim",
                "content": " I'm really sorry if that's weird for you to hear, but I needed you to hear that. Probably not good timing, I know that, I just..."
            }
        ],
        [
            {
                "speaker": "Pam",
                "content": " What are you doing? What do you expect me to say to that?"
            }
        ],
        [
            {
                "speaker": "Jim",
                "content": " I just needed you to know. Once."
            }
        ],
        [
            {
                "speaker": "Pam",
                "content": " Well, I um...I...I can't."
            }
        ],
        [
            {
                "speaker": "Jim",
                "content": " Yeah."
            }
        ],
        [
            {
                "speaker": "Pam",
                "content": " You have no idea..."
            }
        ],
        [
            {
                "speaker": "Jim",
                "content": " Don't do that."
            }
        ],
        [
            {
                "speaker": "Pam",
                "content": " ...what your friendship means to me."
            }
        ],
        [
            {
                "speaker": "Jim",
                "content": " C'mon. I don't want to do that. I want to be more than that"
            }
        ],
        [
            {
                "speaker": "Pam",
                "content": " I can't. I'm really sorry...if you misinterpreted things. It's probably my fault."
            }
        ],
        [
            {
                "speaker": "Jim",
                "content": " Not your fault. I'm sorry I misinterpreted uh our friendship. (a tear rolls down his cheek)"
            }
        ],
        [
            {
                "speaker": "Pam",
                "content": " [looks at her engagement ring, sadly and awkwardly.]"
            }
        ],
        [
            {
                "speaker": "Creed",
                "content": " Thanks. I never owned a refrigerator."
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " Oh, and another fun thing. We - at the end of the night - are going to give the check to an actual group of Boy Scouts, right Toby? We're gonna..."
            }
        ],
        [
            {
                "speaker": "Toby",
                "content": " Actually, I didn't think it was appropriate to invite children since it's, uh, you know there's gambling and alcohol, and it's in our dangerous warehouse, and... it's a school night, and, you know, Hooters is catering, you know... is that... is that enough? Should I keep going?"
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " (to Toby) Why are you the way that you are? Honestly, every time I try to do something fun or exciting, you make it not that way. I hate so much about the things that you choose to be."
            }
        ]
    ]
}