{
    "season": 2,
    "title": "Casino Night",
    "episode": "22",
    "episodes": [
        22
    ],
    "episodeDetails": {
        "sections": [
            {
                "title": "Casino Night",
                "level": 1,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "\"Casino Night\" is the twenty-second episode of the second season of The Office and the 28th overall. It was written by Steve Carell and directed by Ken Kwapis. It first aired on May 11, 2006. It was viewed by 7.7 million people. It is the first \"supersized\" episode of the series, being 28 minutes in length instead of the standard 22 minutes."
                    }
                ],
                "images": []
            },
            {
                "title": "Plot",
                "level": 2,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "The Dunder Mifflin warehouse is converted into a full-blown gambling hall for the Scranton Business Park's Casino Night. Jim \"proves\" to Dwight that he has telekinesis (with help from Pam). Michael invites Jan to the Casino Night, but she declines. Afterwards, he announces to the office that the employee with the highest chip count will get a mini-fridge and $500 to donate to the charity of their choice. Jim and Pam set out to watch horrible band demo tapes for Pam's wedding. Jim explains to the documentary crew that he met with Jan about the sales position in Stamford because he has \"no future here.\""
                    },
                    {
                        "type": "paragraph",
                        "text": "Among the tapes, the two spot a Police cover band called Scrantonicity, in which Kevin is the lead singer and the drummer. Jim is all for this choice but Pam is embarrassed about it and prevents him from asking Kevin. Michael's real-estate agent Carol calls to set up an appointment to sign his insurance papers for his mortgage and he asks her to come to the festivities. In the middle of the call, Michael takes a call from Jan, who tells him that she has decided to come to the casino night after all. When he returns to Carol's call, she also accepts his invitation. Michael states that he has \"two queens\" for the Casino Night and that he is going to \"drop a deuce on everyone.\""
                    },
                    {
                        "type": "paragraph",
                        "text": "Carol arrives at the warehouse. Dwight states that he is in charge of keeping Jan away from Carol. Creed reveals that he is a kleptomaniac, stealing chips, money, and various items from work and at Casino Night. Michael loses all of his money to Toby early in Texas hold 'em. Jan arrives and tells Michael she is okay with Carol. Dwight wins at craps and kisses Angela on the cheek. She slaps him and walks away with a grin on her face (Dwight has a smirk, too). Jim confronts Ryan about his relationship with Kelly, to which Ryan responds with a sheepish grin in the affirmative. Jim tries to check to see if Pam is bluffing in poker, which she isn't."
                    },
                    {
                        "type": "paragraph",
                        "text": "At the bar, Jan and Carol share an awkward conversation. Jan asks Carol how long she and Michael have been in a relationship. Carol replies that it is their first date, to which Jan says condescendingly that Carol is a \"good sport\"."
                    },
                    {
                        "type": "paragraph",
                        "text": "After Kevin—who claims to be a professional card player—loses to the amateur Phyllis in poker (\"Look,\" she exclaims happily, \"I got all the clovers!\"), Roy approaches him and approves his band for the wedding (without talking to Pam about it), and when Kevin asks whether or not Pam had given her okay on the matter, Roy simply states \"Whatever, I'm in charge of the music.\". Jan and Jim share a scene outside, where she laments ever hooking up with Michael. She asks him if he has thought about the transfer, which he says he has. Jan suggests that he talk to someone in the office about it. Creed ends up winning the mini-fridge due to all the chips he has stolen, saying that it will be the first refrigerator he has owned.  Roy leaves the party early despite Pam's requests that he stay."
                    },
                    {
                        "type": "paragraph",
                        "text": "Jim approaches Pam because he needs to talk to her, presumably to tell her about the possibility of him transferring to Stamford. Instead, he blurts out that he is in love with her. She asks why he is telling her, to which he replies that he wanted her to know. After a stunned pause, she states she cannot be with him. He tells her he wants to be more than friends, but she is sorry he \"misinterpreted things.\" With tears in his eyes, he states he is sorry he misinterpreted their friendship and discreetly wipes a tear from his cheek as he walks away."
                    },
                    {
                        "type": "paragraph",
                        "text": "Jan leaves the party bitterly and when she gets to her car, she tosses an overnight bag angrily into the backseat. Michael is pleased \"the hero got the girl.\""
                    },
                    {
                        "type": "paragraph",
                        "text": "Upstairs in the dark office area, Pam calls her mother to talk about what just happened with Jim, explaining that she does not know what to do. Jim enters the office, and Pam abruptly ends the phone conversation. He approaches her, and she starts to say something but Jim kisses her deeply on the lips, and she returns the kiss. The episode ends with them staring at each other in awkward confusion."
                    }
                ],
                "images": [
                    {
                        "src": "https://vignette.wikia.nocookie.net/theoffice/images/f/fd/Iu-7.gif/revision/latest/scale-to-width-down/400?cb=20200213204023",
                        "caption": ""
                    }
                ]
            },
            {
                "title": "Trivia",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "The playing cards used during the poker games are \"Bicycle Rider Back\" brand, produced by the United States Playing Card Company. This is strange because the Rider back is uncommonly used in large or multiple games such as these, because of their expensive price when purchased in bulk. \"Bee\" brand playing cards, also produced by the United States Playing Card Company, are much more common (because of their cheap price) to a point where they are almost synonymous with public poker games, or poker games in film.",
                                "elements": [
                                    {
                                        "text": "Kevin, Dwight, and Jim all claim that they have a leg up in the casino night. Kevin says he won the 2002 $2,500 No-Limit Deuce-to-Seven-Draw Tournament at the World Series of Poker in Vegas. Dwight says he can \"read people\" (he says whenever Jim coughs, Jim has a good hand). And Jim claims he has telekinesis, which he can use in roulette.",
                                        "elements": []
                                    },
                                    {
                                        "text": "Coincidentally, all of these seem to be wrong, as Kevin sucks at Poker, Jim just coughs a lot (most likely to mess with Dwight), and Jim and Pam cooperated to show Dwight and the others that he has telekinetic powers.",
                                        "elements": []
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "When Pam calls her mother she is using Jim's phone.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Amusing details",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "In the opening talking head interview, Michael refers to himself as a \"great philanderer\" in reference to hosting the casino night for charity. The word he is looking for is \"philanthropist,\" which is a person dedicated to contributing to charitable efforts to promote human welfare. A \"philanderer\" is somebody who is known to have many sexual relationships with many different women over short periods of time.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Deleted scenes",
                "level": 2,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "The Season Two DVD contains a number of deleted scenes from this episode. Notable cut scenes include:"
                    },
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Michael calls a conference and asks for parts of speech for a homemade version of Dunder Mifflin Mad Libs.",
                                "elements": []
                            },
                            {
                                "text": "In separate talking head interviews, Dwight and Jim reveal the charities they've chosen.",
                                "elements": []
                            },
                            {
                                "text": "In a talking head interview, Dwight cautions that Jim should use his telekinetic powers wisely.",
                                "elements": []
                            },
                            {
                                "text": "Michael reassures Darryl that the company can reimburse for any damages to the warehouse. In a talking head interview, Michael admits that \"our numbers are down\" but that Jan is on his side.",
                                "elements": []
                            },
                            {
                                "text": "In a talking head interview, Pam admits that planning a wedding by herself is stressful.",
                                "elements": []
                            },
                            {
                                "text": "The casino dealer recognizes Meredith, who, embarrassed, admits that she doesn't remember people she's had sex with. The dealer explains, \"I'm your vet.\" He then adds, \"We had sex in the parking lot.\"",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Cultural References",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "David and Goliath is the Biblical tale of a young boy who defeats a giant.",
                                "elements": []
                            },
                            {
                                "text": "Eva Perón was the first lady of Argentina in the 1940s and 50's. César Chávez was an American labor activist in the 1950s through the 70's. There is no connection between them.",
                                "elements": []
                            },
                            {
                                "text": "Friends with privileges is most likely a mishearing of the phrase “friends with benefits,” which is colloquially considered slang for friends who also share a sexual relationship.",
                                "elements": []
                            },
                            {
                                "text": "The Boy Scouts of America is an organization for boys, building character via outdoor activities. Homosexuals are not allowed to hold positions within the organization, which may be the source of Oscar's objection. The Girl Scouts is a corresponding organization for girls. Girl Scouts are well known for selling cookies to raise money.",
                                "elements": []
                            },
                            {
                                "text": "The American Comic Relief charity organization raised money to provide health care for the homeless. It was revived in 2006 (after this episode aired) to raise money for the victims of Hurricane Katrina. (Coincidentally, an episode of the British The Office included a fundraiser for the British Comic Relief organization.)",
                                "elements": []
                            },
                            {
                                "text": "Kobe Bryant is a professional basketball player who in 2003 was charged with sexual assault. Upon admitting to the incident (which Bryant claimed was consensual), he bought his wife a $4 million diamond ring as an apology. The charges were ultimately dropped. His charitable foundation, devoted to benefiting children and preventing child abuse, was dissolved shortly before the alleged sexual assault took place.",
                                "elements": []
                            },
                            {
                                "text": "Hooters is a chain of restaurants featuring buxom waitresses.",
                                "elements": []
                            },
                            {
                                "text": "The fake band name Till Death Do Us Rock is a play on the vow Till death do us part, part of the traditional Christian wedding ceremony.",
                                "elements": []
                            },
                            {
                                "text": "KISS was a rock band from the 1970s whose members wore characteristic makeup and costumes.",
                                "elements": []
                            },
                            {
                                "text": "Negroes is a term for people from sub-Saharan Africa. After the Civil Rights movement in the United States, the term fell out of favor and is considered offensive by some. Darryl uses it ironically.",
                                "elements": []
                            },
                            {
                                "text": "Lollapalooza is an American music festival featuring three stages. (Later versions featured even more.)",
                                "elements": []
                            },
                            {
                                "text": "Scrantonicity is a play on the album Synchronicity, produced by the band The Police, whose songs Scrantonicity performs.",
                                "elements": []
                            },
                            {
                                "text": "Jan Levinson I presume? is a play on Dr. Livingstone I presume?, words uttered by explorer H. M. Stanley upon successfully finding David Livingstone in Africa.",
                                "elements": []
                            },
                            {
                                "text": "Dropping a deuce is slang for defecation. Michael means to say that he will \"drop a bomb\" on everyone, which means to reveal a big surprise.",
                                "elements": []
                            },
                            {
                                "text": "RE/MAX is the largest real estate agency in the United States.",
                                "elements": []
                            },
                            {
                                "text": "Chili's is a chain of casual dining restaurants.",
                                "elements": []
                            },
                            {
                                "text": "In his opening speech at casino night, Michael says \"Willkommen, Bienvenue, and welcome to Monte Carlo!\", similar to the opening number from the musical and film Cabaret which begins \"Wilkommen, Bienvenue, welcome, im cabaret, au cabaret, to cabaret!\" Michael adds, \"Leave all your preconceived notions about casinos at the door,\" echoing the famous line \"Leave your troubles outside!\"",
                                "elements": []
                            },
                            {
                                "text": "Let's Get It Started is a song by musical group Black Eyed Peas, which Michael mis-identifies as Black Eyed Crows, confusing it with the musical group The Black Crowes.",
                                "elements": []
                            },
                            {
                                "text": "To go all in is to bet all one's money. To take someone all in is to make a bet that forces an opponent to decide whether or not to go all in.",
                                "elements": []
                            },
                            {
                                "text": "A tell is an unconscious signal that betrays whether the player has a strong hand.",
                                "elements": []
                            },
                            {
                                "text": "Michael's explanation If luck weren't involved, I would always be winning is a paraphrase of professional poker player Phil Hellmuth who said, \"If there weren't luck involved, I would win every time.\"",
                                "elements": []
                            },
                            {
                                "text": "Craps is a dice-rolling game.",
                                "elements": []
                            },
                            {
                                "text": "To let it ride is to take the winnings of a bet and bet it again on the same thing.",
                                "elements": []
                            },
                            {
                                "text": "A cosmopolitan is a cocktail made with vodka, triple sec, and cranberry juice. Suiting Jan, it is more of a \"big city\" drink.",
                                "elements": []
                            },
                            {
                                "text": "A Seven and Seven is a cocktail made with Seagram's 7 whiskeys and 7-Up.",
                                "elements": []
                            },
                            {
                                "text": "In craps, the point is the number the person throwing the dice (the shooter) is trying to roll. The honor of blowing on dice for luck is traditionally given to the shooter's girlfriend (or any pretty girl).",
                                "elements": []
                            },
                            {
                                "text": "Dwight lists several hotel and motel chains. The Hyatt is a high-end hotel, Radisson is an upper-mid-range hotel, Best Western, and Holiday Inn are mid-range hotels, and Super 8 and Motel 6 are motel chains. There is a Radisson in downtown Scranton and a Super 8 and a Holiday Inn in nearby Dunmore, all reasonable choices for Jan. The nearest Best Western is in Wilkes-Barre, a less plausible choice. The nearest Motel 6 is in Binghamton, an hour's drive away, and nearest Hyatt is in Morristown, NJ, nearly two hours' drive away; both are unreasonable.",
                                "elements": []
                            },
                            {
                                "text": "Wilkes-Barre is a city approximately 30 minutes' drive from Scranton.",
                                "elements": []
                            },
                            {
                                "text": "Phyllis uses the term clovers, a children's term for the suit more formally known as clubs. A flush is a hand that consists of five cards all the same suit.",
                                "elements": []
                            },
                            {
                                "text": "Mad Libs is a children's game consisting of an incomplete story. Players fill in the words without knowing the story; the result is intended to be humorous. Office Depot is a large chain of office supply stores, and one of Dunder Mifflin's main competitors. The planet Caprica is the human home planet in the science fiction television series Battlestar Galactica. Cylons are the robotic enemy.",
                                "elements": []
                            },
                            {
                                "text": "Dwight's line \"With great power comes great responsibility\" is taken from the Spider-Man comics.",
                                "elements": []
                            },
                            {
                                "text": "Jim's story about his telekinetic powers and their use to him in gambling is a reference to The Prime Mover; episode 57 of the 1950s and '60s American sci-fi anthology series The Twilight Zone, where a man discovers that his business partner has had telekinetic powers from a young age, and manipulates him so that he may use his powers to succeed in gambling.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Cast",
                "level": 2,
                "content": [],
                "images": []
            },
            {
                "title": "Main Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Steve Carell as Michael Scott",
                                "elements": []
                            },
                            {
                                "text": "Rainn Wilson as Dwight Schrute",
                                "elements": []
                            },
                            {
                                "text": "John Krasinski as Jim Halpert",
                                "elements": []
                            },
                            {
                                "text": "Jenna Fischer as Pam Beesly",
                                "elements": []
                            },
                            {
                                "text": "B.J. Novak as Ryan Howard",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Supporting Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Melora Hardin as Jan Levenson",
                                "elements": []
                            },
                            {
                                "text": "David Denman as Roy Anderson",
                                "elements": []
                            },
                            {
                                "text": "Leslie David Baker as Stanley Hudson",
                                "elements": []
                            },
                            {
                                "text": "Brian Baumgartner as Kevin Malone",
                                "elements": []
                            },
                            {
                                "text": "Kate Flannery as Meredith Palmer",
                                "elements": []
                            },
                            {
                                "text": "Angela Kinsey as Angela Martin",
                                "elements": []
                            },
                            {
                                "text": "Oscar Nunez as Oscar Martinez",
                                "elements": []
                            },
                            {
                                "text": "Phyllis Smith as Phyllis Lapin",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Recurring Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Paul Lieberstein as Toby Flenderson",
                                "elements": []
                            },
                            {
                                "text": "Craig Robinson as Darryl Philbin",
                                "elements": []
                            },
                            {
                                "text": "Mindy Kaling as Kelly Kapoor",
                                "elements": []
                            },
                            {
                                "text": "Creed Bratton (actor) as Creed Bratton",
                                "elements": []
                            },
                            {
                                "text": "Nancy Walls as Carol Stills",
                                "elements": []
                            },
                            {
                                "text": "Bobby Ray Shafer as Bob Vance",
                                "elements": []
                            },
                            {
                                "text": "Marcus A. York as Billy Merchant",
                                "elements": []
                            },
                            {
                                "text": "Phillip Pickard as Philip (Uncredited)",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Guest Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Britain Spellings as Craps Dealer",
                                "elements": []
                            },
                            {
                                "text": "Bob Harrell",
                                "elements": []
                            },
                            {
                                "text": "Mike Kruzel",
                                "elements": []
                            },
                            {
                                "text": "Amanda Warren",
                                "elements": []
                            },
                            {
                                "text": "Bryan Spinelli",
                                "elements": []
                            },
                            {
                                "text": "Angelo Middione as Bass Player - Kevin's Garage Band (Uncredited)",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            }
        ]
    },
    "quotesDetails": {
        "sections": [
            {
                "title": "Casino Night Quotes",
                "level": 1,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Michael: Tonight the Scranton Business Park is having Casino Night and we are converting our warehouse into a full-blown gambling hall. And I know it's illegal in Pennsylvania, but it's for charity. And I consider myself a great philanderer. It's just... It's nice to know at the end of the day, I can look in the mirror and say, \"Michael, because of you, some little kid in the Congo has a belly full of rice this evening.\" Makes you feel good."
                    },
                    {
                        "type": "paragraph",
                        "text": "Pam: Hey."
                    },
                    {
                        "type": "paragraph",
                        "text": "Jim: Hey, how's it going?"
                    },
                    {
                        "type": "paragraph",
                        "text": "Pam: Good. Especially after I took all your money in poker."
                    },
                    {
                        "type": "paragraph",
                        "text": "Jim: [laughing] Yeah. Uh... Hey can I talk to you about something?"
                    },
                    {
                        "type": "paragraph",
                        "text": "Pam: About when you want to give me more of your money?"
                    },
                    {
                        "type": "paragraph",
                        "text": "Jim: No, I..."
                    },
                    {
                        "type": "paragraph",
                        "text": "Pam: Did you want to do that now? We can go inside. I'm feeling kind of good tonight."
                    },
                    {
                        "type": "paragraph",
                        "text": "Jim: I was just...um...I'm in love with you."
                    },
                    {
                        "type": "paragraph",
                        "text": "Pam: What?"
                    },
                    {
                        "type": "paragraph",
                        "text": "Jim: I'm really sorry if that's weird for you to hear, but I needed you to hear that. Probably not good timing, I know that, I just..."
                    },
                    {
                        "type": "paragraph",
                        "text": "Pam: What are you doing? What do you expect me to say to that?"
                    },
                    {
                        "type": "paragraph",
                        "text": "Jim: I just needed you to know. Once."
                    },
                    {
                        "type": "paragraph",
                        "text": "Pam: Well, I um...I...I can't."
                    },
                    {
                        "type": "paragraph",
                        "text": "Jim: Yeah."
                    },
                    {
                        "type": "paragraph",
                        "text": "Pam: You have no idea..."
                    },
                    {
                        "type": "paragraph",
                        "text": "Jim: Don't do that."
                    },
                    {
                        "type": "paragraph",
                        "text": "Pam: ...what your friendship means to me."
                    },
                    {
                        "type": "paragraph",
                        "text": "Jim: C'mon. I don't want to do that. I want to be more than that"
                    },
                    {
                        "type": "paragraph",
                        "text": "Pam: I can't. I'm really sorry...if you misinterpreted things. It's probably my fault."
                    },
                    {
                        "type": "paragraph",
                        "text": "Jim: Not your fault. I'm sorry I misinterpreted uh our friendship. (a tear rolls down his cheek)"
                    },
                    {
                        "type": "paragraph",
                        "text": "Pam: [looks at her engagement ring, sadly and awkwardly.]"
                    },
                    {
                        "type": "paragraph",
                        "text": "Creed: Thanks. I never owned a refrigerator."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael: Oh, and another fun thing. We - at the end of the night - are going to give the check to an actual group of Boy Scouts, right Toby? We're gonna..."
                    },
                    {
                        "type": "paragraph",
                        "text": "Toby: Actually, I didn't think it was appropriate to invite children since it's, uh, you know there's gambling and alcohol, and it's in our dangerous warehouse, and... it's a school night, and, you know, Hooters is catering, you know... is that... is that enough? Should I keep going?"
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael: (to Toby) Why are you the way that you are? Honestly, every time I try to do something fun or exciting, you make it not that way. I hate so much about the things that you choose to be."
                    }
                ],
                "images": []
            }
        ]
    },
    "coldOpens": [
        "Jim convinces Dwight that he can move objects with his mind and Dwight begins to believe it when he moves a coat rack. Pam helps him by using an umbrella to pull the coat rack. "
    ],
    "storylines": [
        "The Dunder Mifflin warehouse is converted into a full-blown gambling hall for the Scranton Business Park's Casino Night. Jim \"proves\" to Dwight that he has telekinesis (with help from Pam). Michael invites Jan to the Casino Night, but she declines. Afterwards, he announces to the office that the employee with the highest chip count will get a mini-fridge and $500 to donate to the charity of their choice. Jim and Pam set out to watch horrible band demo tapes for Pam's wedding. Jim explains to the documentary crew that he met with Jan about the sales position in Stamford because he has \"no future here.\"",
        "Among the tapes, the two spot a Police cover band called Scrantonicity, in which Kevin is the lead singer and the drummer. Jim is all for this choice but Pam is embarrassed about it and prevents him from asking Kevin. Michael's real-estate agent Carol calls to set up an appointment to sign his insurance papers for his mortgage and he asks her to come to the festivities. In the middle of the call, Michael takes a call from Jan, who tells him that she has decided to come to the casino night after all. When he returns to Carol's call, she also accepts his invitation. Michael states that he has \"two queens\" for the Casino Night and that he is going to \"drop a deuce on everyone.\"",
        "Carol arrives at the warehouse. Dwight states that he is in charge of keeping Jan away from Carol. Creed reveals that he is a kleptomaniac, stealing chips, money, and various items from work and at Casino Night. Michael loses all of his money to Toby early in Texas hold 'em. Jan arrives and tells Michael she is okay with Carol. Dwight wins at craps and kisses Angela on the cheek. She slaps him and walks away with a grin on her face (Dwight has a smirk, too). Jim confronts Ryan about his relationship with Kelly, to which Ryan responds with a sheepish grin in the affirmative. Jim tries to check to see if Pam is bluffing in poker, which she isn't.",
        "At the bar, Jan and Carol share an awkward conversation. Jan asks Carol how long she and Michael have been in a relationship. Carol replies that it is their first date, to which Jan says condescendingly that Carol is a \"good sport\".",
        "After Kevin—who claims to be a professional card player—loses to the amateur Phyllis in poker (\"Look,\" she exclaims happily, \"I got all the clovers!\"), Roy approaches him and approves his band for the wedding (without talking to Pam about it), and when Kevin asks whether or not Pam had given her okay on the matter, Roy simply states \"Whatever, I'm in charge of the music.\". Jan and Jim share a scene outside, where she laments ever hooking up with Michael. She asks him if he has thought about the transfer, which he says he has. Jan suggests that he talk to someone in the office about it. Creed ends up winning the mini-fridge due to all the chips he has stolen, saying that it will be the first refrigerator he has owned.  Roy leaves the party early despite Pam's requests that he stay.",
        "Jim approaches Pam because he needs to talk to her, presumably to tell her about the possibility of him transferring to Stamford. Instead, he blurts out that he is in love with her. She asks why he is telling her, to which he replies that he wanted her to know. After a stunned pause, she states she cannot be with him. He tells her he wants to be more than friends, but she is sorry he \"misinterpreted things.\" With tears in his eyes, he states he is sorry he misinterpreted their friendship and discreetly wipes a tear from his cheek as he walks away.",
        "Jan leaves the party bitterly and when she gets to her car, she tosses an overnight bag angrily into the backseat. Michael is pleased \"the hero got the girl.\"",
        "Upstairs in the dark office area, Pam calls her mother to talk about what just happened with Jim, explaining that she does not know what to do. Jim enters the office, and Pam abruptly ends the phone conversation. He approaches her, and she starts to say something but Jim kisses her deeply on the lips, and she returns the kiss. The episode ends with them staring at each other in awkward confusion."
    ],
    "quotes": [
        "Michael: Tonight the Scranton Business Park is having Casino Night and we are converting our warehouse into a full-blown gambling hall. And I know it's illegal in Pennsylvania, but it's for charity. And I consider myself a great philanderer. It's just... It's nice to know at the end of the day, I can look in the mirror and say, \"Michael, because of you, some little kid in the Congo has a belly full of rice this evening.\" Makes you feel good.",
        "Pam: Hey.",
        "Jim: Hey, how's it going?",
        "Pam: Good. Especially after I took all your money in poker.",
        "Jim: [laughing] Yeah. Uh... Hey can I talk to you about something?",
        "Pam: About when you want to give me more of your money?",
        "Jim: No, I...",
        "Pam: Did you want to do that now? We can go inside. I'm feeling kind of good tonight.",
        "Jim: I was just...um...I'm in love with you.",
        "Pam: What?",
        "Jim: I'm really sorry if that's weird for you to hear, but I needed you to hear that. Probably not good timing, I know that, I just...",
        "Pam: What are you doing? What do you expect me to say to that?",
        "Jim: I just needed you to know. Once.",
        "Pam: Well, I um...I...I can't.",
        "Jim: Yeah.",
        "Pam: You have no idea...",
        "Jim: Don't do that.",
        "Pam: ...what your friendship means to me.",
        "Jim: C'mon. I don't want to do that. I want to be more than that",
        "Pam: I can't. I'm really sorry...if you misinterpreted things. It's probably my fault.",
        "Jim: Not your fault. I'm sorry I misinterpreted uh our friendship. (a tear rolls down his cheek)",
        "Pam: [looks at her engagement ring, sadly and awkwardly.]",
        "Creed: Thanks. I never owned a refrigerator.",
        "Michael: Oh, and another fun thing. We - at the end of the night - are going to give the check to an actual group of Boy Scouts, right Toby? We're gonna...",
        "Toby: Actually, I didn't think it was appropriate to invite children since it's, uh, you know there's gambling and alcohol, and it's in our dangerous warehouse, and... it's a school night, and, you know, Hooters is catering, you know... is that... is that enough? Should I keep going?",
        "Michael: (to Toby) Why are you the way that you are? Honestly, every time I try to do something fun or exciting, you make it not that way. I hate so much about the things that you choose to be."
    ]
}