{
    "season": 2,
    "title": "Office Olympics",
    "episode": "3",
    "episodes": [
        3
    ],
    "coldOpens": [
        "Michael has Ryan get him a breakfast sandwich on the way in to the office. Michael said he needs Ryan to come in early for something, that \"something\" is Michael's breakfast sandwich. "
    ],
    "storylines": [
        "Ryan comes into work early at Michael's request, merely to bring him his breakfast. When Michael tells him the office is his for the next few hours, Ryan opts to spend those hours sleeping in his car until work starts.",
        "Michael announces that he will be becoming a homeowner. Jim \"dies\" of boredom, and to revive him, he and Pam try to throw things in Dwight's coffee mug. Michael prepares to leave to sign the final papers for his new condo and Dwight insists that he join him as a second voice, to which he reluctantly agrees. Michael assigns Pam to have the office work on the expense reports for the afternoon. Jim asks Oscar about the expense reports and notices material on his desk that reads \"2005 SEASON\" as well as a small scoreboard. Oscar explains that he and Kevin play a paper football game when Michael's out (or when they're bored). Jim joins in and Kevin explains the game is called \"Hate Ball\", since Angela hates when they play it. Other games they play are \"Who Can Put The Most M&Ms In Their Mouth?\" and \"Dunderball.\" Meanwhile, Michael admires his condo from the street, until he notices he's looking at the wrong house.",
        "At the condo, Michael's agent Carol introduces him to Bill, the head of the condo association and makes a Mr. Bill reference. Dwight talks about his 60-acre beet farm that he runs with his cousin Mose. He begins asking questions about the house, and Carol and Bill start to think that he and Michael are homosexual. Back at the office, Jim tries to get Stanley to join in the fun, but he outright refuses (although he is seen enjoying the games later). Michael shows the camera crew the master bedroom at the condo and starts bragging. Dwight starts to rain on his parade, bringing up the condo's weaknesses, which starts to worry Michael. In the office, Jim and Pam begin the opening ceremonies of the \"Games of the 1st Dunder Mifflin Olympiad\" in the lunch room. Jim explains they will be competing for medals made of gold, silver and bronze yogurt lids\" that Pam made herself. Angela is annoyed by the games.",
        "At the condo, Michael starts to regret his purchase when he realizes he got a 30-year mortgage and Dwight makes the situation sound even worse. Michael takes a breather before he signs the contract. Meanwhile, Jim and Pam explain the Flonkerton race (where full paper boxes are strapped to your feet) and Phyllis challenges Kevin. Michael starts complaining about the condo to Carol and demands a price reduction, but she explains he will lose $7,000 if he walks away, so he signs. Dwight and Michael laugh about the \"saps stuck at the office\" as we see Phyllis narrowly defeating Kevin in Flonkerton.",
        "At the condo, Michael tells Dwight he is going to \"let\" him move into his third bedroom and pay rent. Dwight starts asking Michael a series of questions, which become increasingly strange. In the office, Angela tells Pam about a game she plays called \"Pam Pong\", where she counts how many times Jim goes to Pam's desk. The questions continue at the condo, which pushes Michael to the point of revoking his offer, much to Dwight's relief. At the office, the employees gather around the elevator to bet who will arrive next and Ryan wins. Pam shows Jim a box of items for the closing ceremonies and Angela marks off another tally for \"Pam Pong\", to Pam's annoyance. Toby and Oscar race with full coffee mugs around the office, but the games immediately stop when Michael and Dwight return, much to Jim's disappointment.",
        "Things get quiet again. Jim fills out the expense reports, which only take five minutes. Ryan throws away Pam's medals which she sadly notices. Pam has 59 voicemails, but attends to Jim's insistence that the closing ceremonies will occur at 5pm. Jim brings out Michael to join in the ceremonies and gives him the gold medal in front of the entire staff for closing on his condo. Michael is moved to tears. A perplexed Dwight gets the silver medal. Jim gets the bronze. Pam plays the national anthem and releases the origami paper doves she made for the ceremonies. The employees smile and Michael wells up with tears."
    ],
    "quotes": [
        [
            {
                "speaker": "Dwight",
                "content": " I have been Michael's number two guy for about five years. And we make a great team. We're like one of those classic famous teams. He's like Mozart, and I'm like Mozart's friend. No. I'm like Butch Cassidy, and Michael is like Mozart. You try and hurt Mozart; you're going to get a bullet in your head courtesy of Butch Cassidy."
            }
        ],
        [
            {
                "speaker": "Carol",
                "content": " It's a very gay-friendly neighborhood."
            },
            {
                "speaker": "Michael",
                "content": " It's good to be accommodating of that."
            },
            {
                "speaker": "Dwight",
                "content": " Let's go check out the master bedroom."
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " I'm an early bird, and I'm a night owl. So I'm wise, and I have worms. Oh, breakfast."
            },
            {
                "speaker": "Ryan",
                "content": " I got your sausage, egg and cheese biscuit."
            },
            {
                "speaker": "Michael",
                "content": " Yummy, yummy. Thank you, Ryan."
            },
            {
                "speaker": "Ryan",
                "content": " What was the thing, ah, you needed me to come in early for?"
            },
            {
                "speaker": "Michael",
                "content": " Um. The sausage, egg, and cheese biscuit. But thank you. And why don't you take a couple hours. The office is yours. \"Home Alone,\" \"Risky Business.\" Take your pants off, run around. Whatever you gotta do."
            },
            {
                "speaker": "Ryan",
                "content": " I'm just going to take a nap in my car until work starts."
            },
            {
                "speaker": "Michael",
                "content": " Ok. [Removes biscuit, leaving only sausage, egg and cheese.] Healthier. Gotta watch those carbs."
            }
        ]
    ]
}