{
    "season": 2,
    "title": "Office Olympics",
    "episode": "3",
    "episodes": [
        3
    ],
    "episodeDetails": {
        "sections": [
            {
                "title": "Office Olympics",
                "level": 1,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "\"Office Olympics\" is the third episode of the second season of The Office and the 9th overall. It was written by Michael Schur and directed by Paul Feig. It first aired on October 4, 2005. It was viewed by 8.3 million people."
                    }
                ],
                "images": []
            },
            {
                "title": "Synopsis",
                "level": 2,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Ryan comes into work early at Michael's request, merely to bring him his breakfast. When Michael tells him the office is his for the next few hours, Ryan opts to spend those hours sleeping in his car until work starts."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael announces that he will be becoming a homeowner. Jim \"dies\" of boredom, and to revive him, he and Pam try to throw things in Dwight's coffee mug. Michael prepares to leave to sign the final papers for his new condo and Dwight insists that he join him as a second voice, to which he reluctantly agrees. Michael assigns Pam to have the office work on the expense reports for the afternoon. Jim asks Oscar about the expense reports and notices material on his desk that reads \"2005 SEASON\" as well as a small scoreboard. Oscar explains that he and Kevin play a paper football game when Michael's out (or when they're bored). Jim joins in and Kevin explains the game is called \"Hate Ball\", since Angela hates when they play it. Other games they play are \"Who Can Put The Most M&Ms In Their Mouth?\" and \"Dunderball.\" Meanwhile, Michael admires his condo from the street, until he notices he's looking at the wrong house."
                    },
                    {
                        "type": "paragraph",
                        "text": "At the condo, Michael's agent Carol introduces him to Bill, the head of the condo association and makes a Mr. Bill reference. Dwight talks about his 60-acre beet farm that he runs with his cousin Mose. He begins asking questions about the house, and Carol and Bill start to think that he and Michael are homosexual. Back at the office, Jim tries to get Stanley to join in the fun, but he outright refuses (although he is seen enjoying the games later). Michael shows the camera crew the master bedroom at the condo and starts bragging. Dwight starts to rain on his parade, bringing up the condo's weaknesses, which starts to worry Michael. In the office, Jim and Pam begin the opening ceremonies of the \"Games of the 1st Dunder Mifflin Olympiad\" in the lunch room. Jim explains they will be competing for medals made of gold, silver and bronze yogurt lids\" that Pam made herself. Angela is annoyed by the games."
                    },
                    {
                        "type": "paragraph",
                        "text": "At the condo, Michael starts to regret his purchase when he realizes he got a 30-year mortgage and Dwight makes the situation sound even worse. Michael takes a breather before he signs the contract. Meanwhile, Jim and Pam explain the Flonkerton race (where full paper boxes are strapped to your feet) and Phyllis challenges Kevin. Michael starts complaining about the condo to Carol and demands a price reduction, but she explains he will lose $7,000 if he walks away, so he signs. Dwight and Michael laugh about the \"saps stuck at the office\" as we see Phyllis narrowly defeating Kevin in Flonkerton."
                    },
                    {
                        "type": "paragraph",
                        "text": "At the condo, Michael tells Dwight he is going to \"let\" him move into his third bedroom and pay rent. Dwight starts asking Michael a series of questions, which become increasingly strange. In the office, Angela tells Pam about a game she plays called \"Pam Pong\", where she counts how many times Jim goes to Pam's desk. The questions continue at the condo, which pushes Michael to the point of revoking his offer, much to Dwight's relief. At the office, the employees gather around the elevator to bet who will arrive next and Ryan wins. Pam shows Jim a box of items for the closing ceremonies and Angela marks off another tally for \"Pam Pong\", to Pam's annoyance. Toby and Oscar race with full coffee mugs around the office, but the games immediately stop when Michael and Dwight return, much to Jim's disappointment."
                    },
                    {
                        "type": "paragraph",
                        "text": "Things get quiet again. Jim fills out the expense reports, which only take five minutes. Ryan throws away Pam's medals which she sadly notices. Pam has 59 voicemails, but attends to Jim's insistence that the closing ceremonies will occur at 5pm. Jim brings out Michael to join in the ceremonies and gives him the gold medal in front of the entire staff for closing on his condo. Michael is moved to tears. A perplexed Dwight gets the silver medal. Jim gets the bronze. Pam plays the national anthem and releases the origami paper doves she made for the ceremonies. The employees smile and Michael wells up with tears."
                    }
                ],
                "images": []
            },
            {
                "title": "Trivia",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Michael's real estate agent, Carol Stills, is portrayed by Steve Carell's wife Nancy Walls. Like Carell, Walls was also a correspondent for The Daily Show.",
                                "elements": []
                            },
                            {
                                "text": "This is the first episode to feature a cold open, a device which has been used in all episodes since with the exception of three episodes of Season 9 and the first half of Weight Loss.",
                                "elements": []
                            },
                            {
                                "text": "Dwight tells Michael that he may date a 55 year old woman, a foreshadow to when he dated Pam's mother, Helene.",
                                "elements": []
                            },
                            {
                                "text": "Michael points out the cable jack then moments later says he will place his T.V. on the opposite wall.",
                                "elements": []
                            },
                            {
                                "text": "It can be inferred that Ryan came in at 7:00 A.M. to give Michael his sandwich because of Michael's line to Ryan, \"Take a couple of hours, office is yours...\". The usual workday starts at 9:00 A.M., and the phrase \"couple of hours\" would normally mean two hours, so two hours before nine would be seven o'clock. In an interview with TV Guide, however, B.J. Novak confirmed that the scene took place around eight o'clock. ",
                                "elements": []
                            },
                            {
                                "text": "During the closing ceremonies, the workers set the podium with the 2nd place to the left of the 1st when, traditionally, it is located to the right. ",
                                "elements": []
                            },
                            {
                                "text": "During the scene in which Pam shows the box of paper doves to Jim, and the others are coming back into the office, Stanley walks past the camera two times. He walks by once behind Meredith, then after Pam looks at Angela, he passes again while speaking with Kelly. ",
                                "elements": []
                            },
                            {
                                "text": "The man shouting at his daughter to practice the cello sounds a lot like Brian Baumgartner in real life when he isn't doing the Kevin voice. It is entirely possible that they just had Baumgartner do this since his real life voice is different than Kevin's voice.",
                                "elements": []
                            },
                            {
                                "text": "As of this episode Michael is officially the owner of a condo.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Deleted scenes",
                "level": 2,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "The Season Two DVD will most likely contain a number of deleted scenes from this episode. Notable cut scenes include:"
                    },
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Jim found Dwight's wallet in the parking lot, and decides, on Pam's suggestion, to give the wallet back to Dwight intact and unchanged. Dwight suspiciously cancels all his credit cards.",
                                "elements": []
                            },
                            {
                                "text": "Oscar catches Kevin trying to expense a movie rental.",
                                "elements": []
                            },
                            {
                                "text": "Extension of the opening scene with Dwight in Michael's office. Michael shows Dwight the brochure for his condo.",
                                "elements": []
                            },
                            {
                                "text": "In a talking head interview, Michael explains that real estate ownership is the last thing that goes through a man's mind on his deathbed.",
                                "elements": []
                            },
                            {
                                "text": "Extension of Jim and Pam throwing things into Dwight's mug, which Pam calls Skeet Schruting.",
                                "elements": []
                            },
                            {
                                "text": "Michael waxes poetic before leaving with Dwight.",
                                "elements": []
                            },
                            {
                                "text": "Dwight has crime statistics for Michael's neighborhood. Michael talks with a neighbor (played by creator Greg Daniels), who is disturbed by Michael's chatter.",
                                "elements": []
                            },
                            {
                                "text": "Toby teaches Jim how to play Dunderball.",
                                "elements": []
                            },
                            {
                                "text": "Michael shows off the two microwave ovens in his kitchen before meeting Carol and Bill.",
                                "elements": []
                            },
                            {
                                "text": "Dwight inspects the condo.",
                                "elements": []
                            },
                            {
                                "text": "Phyllis denies playing any office games.",
                                "elements": []
                            },
                            {
                                "text": "Michael shows off his condo, and talks about his future plans to get married and have children. Dwight continues to find problems.",
                                "elements": []
                            },
                            {
                                "text": "In a talking head interview outside Michael's condo, Dwight demonstrates his keen sense of smell.",
                                "elements": []
                            },
                            {
                                "text": "Michael threatens to back out of the deal.",
                                "elements": []
                            },
                            {
                                "text": "Dwight finds his mug full of junk.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "References to previous episodes",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Michael once again reveals that he reads American Way (\"Hot Girl\").",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "References in later episodes",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "In \"The Job\", Pam puts one of the yogurt-lid medals, along with note asking \"Don't forget us when you're famous!\", in a folder Jim needs when he interviews for a position at the DM corporate offices in New York; seeing this, Jim, realizing that his heart is still in Scranton, withdraws from the potential promotion, and returns home to be with his true love, Pam - who is in the middle of a talking head accepting that Jim is most likely gone, and will never be returning, when he walks in on the camera crew to ask her on their first official date.",
                                "elements": []
                            },
                            {
                                "text": "In \"Finale\", Phyllis mentions Flonkerton and the Office Olympics when they're gathered in the office after the panel, and Creed mentions that he still has his yogurt-lid medal.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Cultural references",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Michael takes his bird analogy too far and says that he \"has worms\", unintentionally suggesting that he suffers from an intestinal parasite.",
                                "elements": []
                            },
                            {
                                "text": "Home Alone and Risky Business are movies notable for scenes in which the young lead character frolics in an empty house.",
                                "elements": []
                            },
                            {
                                "text": "Butch Cassidy was a train and bank robber from the 19th century.",
                                "elements": []
                            },
                            {
                                "text": "Maxim is a men's magazine; American Way is the in-flight magazine of American Airlines; Cracked was a satire magazine known for juvenile humor.",
                                "elements": []
                            },
                            {
                                "text": "The Terminator is a science fiction movie from 1984. The lead character notably wore sunglasses.",
                                "elements": []
                            },
                            {
                                "text": "Mr. Bill was a recurring sketch on Saturday Night Live from 1976 to 1980. Each episode ended with the title character screaming, \"Ohhhh, nooooooo!\"",
                                "elements": []
                            },
                            {
                                "text": "Pam Pong is a pun on the game ping pong.",
                                "elements": []
                            },
                            {
                                "text": "Jim assigns scores to Stanley and Phyllis from the first few letters of the word \"horse\". They are apparently playing a variation on the basketball game of the same name.",
                                "elements": []
                            },
                            {
                                "text": "The screeching sound Michael makes when he rescinds his offer to Dwight is an attempt to mimic the final buzzer of a basketball game.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Cast",
                "level": 2,
                "content": [],
                "images": []
            },
            {
                "title": "Main cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Steve Carell as Michael Scott",
                                "elements": []
                            },
                            {
                                "text": "Rainn Wilson as Dwight Schrute",
                                "elements": []
                            },
                            {
                                "text": "John Krasinski as Jim Halpert",
                                "elements": []
                            },
                            {
                                "text": "Jenna Fischer as Pam Beesly",
                                "elements": []
                            },
                            {
                                "text": "B.J. Novak as Ryan Howard",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Recurring cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Nancy Walls as Carol Stills",
                                "elements": []
                            },
                            {
                                "text": "Leslie David Baker as Stanley Hudson",
                                "elements": []
                            },
                            {
                                "text": "Brian Baumgartner as Kevin Malone",
                                "elements": []
                            },
                            {
                                "text": "Kate Flannery as Meredith Palmer",
                                "elements": []
                            },
                            {
                                "text": "Mindy Kaling as Kelly Kapoor",
                                "elements": []
                            },
                            {
                                "text": "Angela Kinsey as Angela Martin",
                                "elements": []
                            },
                            {
                                "text": "Paul Lieberstein as Toby Flenderson",
                                "elements": []
                            },
                            {
                                "text": "Oscar Nunez as Oscar Martinez",
                                "elements": []
                            },
                            {
                                "text": "Phyllis Smith as Phyllis Lapin",
                                "elements": []
                            },
                            {
                                "text": "Creed Bratton (actor) as Creed Bratton (Uncredited)",
                                "elements": []
                            },
                            {
                                "text": "Devon Abner as Devon White (Uncredited)",
                                "elements": []
                            },
                            {
                                "text": "Michael Schur as Mose Schrute (Uncredited)",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Guest cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Nancy Walls as Carol Stills",
                                "elements": []
                            },
                            {
                                "text": "John Harrington Bland as Bill",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            }
        ]
    },
    "quotesDetails": {
        "sections": [
            {
                "title": "Office Olympics Quotes",
                "level": 1,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Dwight: I have been Michael's number two guy for about five years. And we make a great team. We're like one of those classic famous teams. He's like Mozart, and I'm like Mozart's friend. No. I'm like Butch Cassidy, and Michael is like Mozart. You try and hurt Mozart; you're going to get a bullet in your head courtesy of Butch Cassidy."
                    },
                    {
                        "type": "paragraph",
                        "text": "Carol: It's a very gay-friendly neighborhood.\nMichael: It's good to be accommodating of that.\nDwight: Let's go check out the master bedroom."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael: I'm an early bird, and I'm a night owl. So I'm wise, and I have worms. Oh, breakfast.\nRyan: I got your sausage, egg and cheese biscuit.\nMichael: Yummy, yummy. Thank you, Ryan.\nRyan: What was the thing, ah, you needed me to come in early for?\nMichael: Um. The sausage, egg, and cheese biscuit. But thank you. And why don't you take a couple hours. The office is yours. \"Home Alone,\" \"Risky Business.\" Take your pants off, run around. Whatever you gotta do.\nRyan: I'm just going to take a nap in my car until work starts.\nMichael: Ok. [Removes biscuit, leaving only sausage, egg and cheese.] Healthier. Gotta watch those carbs."
                    }
                ],
                "images": []
            }
        ]
    },
    "coldOpens": [
        "Michael has Ryan get him a breakfast sandwich on the way in to the office. Michael said he needs Ryan to come in early for something, that \"something\" is Michael's breakfast sandwich. "
    ],
    "storylines": [
        "Ryan comes into work early at Michael's request, merely to bring him his breakfast. When Michael tells him the office is his for the next few hours, Ryan opts to spend those hours sleeping in his car until work starts.",
        "Michael announces that he will be becoming a homeowner. Jim \"dies\" of boredom, and to revive him, he and Pam try to throw things in Dwight's coffee mug. Michael prepares to leave to sign the final papers for his new condo and Dwight insists that he join him as a second voice, to which he reluctantly agrees. Michael assigns Pam to have the office work on the expense reports for the afternoon. Jim asks Oscar about the expense reports and notices material on his desk that reads \"2005 SEASON\" as well as a small scoreboard. Oscar explains that he and Kevin play a paper football game when Michael's out (or when they're bored). Jim joins in and Kevin explains the game is called \"Hate Ball\", since Angela hates when they play it. Other games they play are \"Who Can Put The Most M&Ms In Their Mouth?\" and \"Dunderball.\" Meanwhile, Michael admires his condo from the street, until he notices he's looking at the wrong house.",
        "At the condo, Michael's agent Carol introduces him to Bill, the head of the condo association and makes a Mr. Bill reference. Dwight talks about his 60-acre beet farm that he runs with his cousin Mose. He begins asking questions about the house, and Carol and Bill start to think that he and Michael are homosexual. Back at the office, Jim tries to get Stanley to join in the fun, but he outright refuses (although he is seen enjoying the games later). Michael shows the camera crew the master bedroom at the condo and starts bragging. Dwight starts to rain on his parade, bringing up the condo's weaknesses, which starts to worry Michael. In the office, Jim and Pam begin the opening ceremonies of the \"Games of the 1st Dunder Mifflin Olympiad\" in the lunch room. Jim explains they will be competing for medals made of gold, silver and bronze yogurt lids\" that Pam made herself. Angela is annoyed by the games.",
        "At the condo, Michael starts to regret his purchase when he realizes he got a 30-year mortgage and Dwight makes the situation sound even worse. Michael takes a breather before he signs the contract. Meanwhile, Jim and Pam explain the Flonkerton race (where full paper boxes are strapped to your feet) and Phyllis challenges Kevin. Michael starts complaining about the condo to Carol and demands a price reduction, but she explains he will lose $7,000 if he walks away, so he signs. Dwight and Michael laugh about the \"saps stuck at the office\" as we see Phyllis narrowly defeating Kevin in Flonkerton.",
        "At the condo, Michael tells Dwight he is going to \"let\" him move into his third bedroom and pay rent. Dwight starts asking Michael a series of questions, which become increasingly strange. In the office, Angela tells Pam about a game she plays called \"Pam Pong\", where she counts how many times Jim goes to Pam's desk. The questions continue at the condo, which pushes Michael to the point of revoking his offer, much to Dwight's relief. At the office, the employees gather around the elevator to bet who will arrive next and Ryan wins. Pam shows Jim a box of items for the closing ceremonies and Angela marks off another tally for \"Pam Pong\", to Pam's annoyance. Toby and Oscar race with full coffee mugs around the office, but the games immediately stop when Michael and Dwight return, much to Jim's disappointment.",
        "Things get quiet again. Jim fills out the expense reports, which only take five minutes. Ryan throws away Pam's medals which she sadly notices. Pam has 59 voicemails, but attends to Jim's insistence that the closing ceremonies will occur at 5pm. Jim brings out Michael to join in the ceremonies and gives him the gold medal in front of the entire staff for closing on his condo. Michael is moved to tears. A perplexed Dwight gets the silver medal. Jim gets the bronze. Pam plays the national anthem and releases the origami paper doves she made for the ceremonies. The employees smile and Michael wells up with tears."
    ],
    "quotes": [
        "Dwight: I have been Michael's number two guy for about five years. And we make a great team. We're like one of those classic famous teams. He's like Mozart, and I'm like Mozart's friend. No. I'm like Butch Cassidy, and Michael is like Mozart. You try and hurt Mozart; you're going to get a bullet in your head courtesy of Butch Cassidy.",
        "Carol: It's a very gay-friendly neighborhood.\nMichael: It's good to be accommodating of that.\nDwight: Let's go check out the master bedroom.",
        "Michael: I'm an early bird, and I'm a night owl. So I'm wise, and I have worms. Oh, breakfast.\nRyan: I got your sausage, egg and cheese biscuit.\nMichael: Yummy, yummy. Thank you, Ryan.\nRyan: What was the thing, ah, you needed me to come in early for?\nMichael: Um. The sausage, egg, and cheese biscuit. But thank you. And why don't you take a couple hours. The office is yours. \"Home Alone,\" \"Risky Business.\" Take your pants off, run around. Whatever you gotta do.\nRyan: I'm just going to take a nap in my car until work starts.\nMichael: Ok. [Removes biscuit, leaving only sausage, egg and cheese.] Healthier. Gotta watch those carbs."
    ]
}