{
    "season": 2,
    "title": "The Fire",
    "episode": "4",
    "episodes": [
        4
    ],
    "episodeDetails": {
        "sections": [
            {
                "title": "The Fire",
                "level": 1,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "\"The Fire\" is the fourth episode of the second season of The Office and the 10th overall. It was written by B.J. Novak and directed by Ken Kwapis. It first aired on October 11, 2005. It was viewed by 7.6 million people."
                    }
                ],
                "images": []
            },
            {
                "title": "Summary",
                "level": 2,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Pam transfers a call from Katy to Jim's desk and the two make lunch plans. In a talking head interview, Pam awkwardly explains that Jim and Katy (the purse saleswoman from the episode \"Hot Girl\") have started dating, Pam then asks Jim to give Katy the extension to his phone."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael gives Ryan a glowing checkpoint review. When Ryan expresses his interest in starting his own business someday, Michael takes it upon himself to teach Ryan the first of the ten rules of business. The fire alarm sounds, and while Dwight and Angela both attempt to take charge of the evacuation, Michael pushes others out of the way in his escape out of the building."
                    },
                    {
                        "type": "paragraph",
                        "text": "In a talking head interview, Ryan explains that he doesn't want to have a nickname or be known for anything at the office. Once everyone is safely outside, Jim begins a game of \"three books on a desert island\". At Dwight's turn, he misses the point of the exercise and asks for an axe and a hollowed-out book filled with survival gear."
                    },
                    {
                        "type": "paragraph",
                        "text": "Jim changes the topic from books to DVDs. In a joint talking head interview, Jim and Pam mock Meredith's choices, although Pam admits that she too likes Legally Blonde. Jim teases Pam for liking that movie."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael learns that Ryan is going to business school at night. Michael invites Ryan to quiz him but doesn't even understand the first question. In a talking head interview, Michael explains that he learned more about business from working at a fast-food restaurant than Ryan will ever learn in school. Dwight, still jealous of the attention Ryan is getting from Michael, attempts to bully the young employee but merely earns a scolding from Michael. Ryan becomes increasingly uncomfortable with Michael's friendliness."
                    },
                    {
                        "type": "paragraph",
                        "text": "Jim moves on to the next game, \"Who would you do?\", and Kevin instantly responds, \"Pam.\" Jim and Pam excuse themselves from the game to talk to Dwight, who is moping in his car. Pam suggests that Ryan would be impressed to learn that Dwight is a volunteer sheriff's deputy, and Jim tries to keep a straight face when he suggests that Dwight quit, \"and then that would stick it to both of them.\" Dwight thanks them for their concern but asks to be left alone."
                    },
                    {
                        "type": "paragraph",
                        "text": "Jim, Pam, Michael, Ryan and even Roy join the game of \"Who would you do?\" Roy answers \"that tight-ass Christian chick.\" Jim jokingly chooses Kevin, and Michael says, \"Well, I would definitely have sex with Ryan.\" When Michael mentions that he left his cell phone in the office, Dwight rushes back into the building to fetch it."
                    },
                    {
                        "type": "paragraph",
                        "text": "The women of the office continue playing \"Who would you do?\" Meredith: \"Jim.\" Phyllis: \"Definitely Jim.\" Kelly: \"Definitely, definitely Jim.\" Pam considers her response and says, \"Oscar's kind of cute.\" She also mentions that Toby is cute and the others groan in disapproval, except for Meredith, who nods and smiles."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael asks Ryan to call his cell phone to help Dwight find it. The phone rings. It's in Michael's pocket. Dwight emerges, coughing, from the building and reveals that the fire was started by Ryan, who left a cheese pita in the toaster-oven set to \"oven\" instead of \"toaster\". Dwight and Michael proceed to mock Ryan and dub him The Fire Guy."
                    },
                    {
                        "type": "paragraph",
                        "text": "Katy arrives for lunch and joins the DVD game. Her first movie: Legally Blonde."
                    },
                    {
                        "type": "paragraph",
                        "text": "The fire out, everybody heads back inside. Michael promises Ryan, \"I'll give you the rest of the ten tomorrow.\""
                    }
                ],
                "images": []
            },
            {
                "title": "Trivia/Goofs",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "According to the DVD commentary, this episode was originally intended to be the season opener, but NBC decided that The Dundies would be a better opening episode. Some story lines remain from the original episode order:",
                                "elements": [
                                    {
                                        "text": "Michael's man-crush on Ryan begins in this episode. It would explain why Michael awarded Ryan the Hottest in the Office Dundie award.",
                                        "elements": []
                                    },
                                    {
                                        "text": "The introduction of Katy as Jim's girlfriend flows more naturally from the immediately-preceding episode Hot Girl.",
                                        "elements": []
                                    }
                                ]
                            },
                            {
                                "text": "Michael running out of the burning building, pushing shoving everyone out of his way, is somewhat similar to a Seinfeld episode, also titled The Fire, where George Costanza starts pushing and shoving everyone out of his path when he hears a fire has started.",
                                "elements": []
                            },
                            {
                                "text": "The Lyrics Dwight sings towards the end are \"Joe McCarthy, Richard Nixon, Studebaker, Television, North Korea, South Korea, Marilyn Monroe--RYAN STARTED THE FIRE!!!!!\"",
                                "elements": []
                            },
                            {
                                "text": "As the camera pans out from Michael running out of the burning building, a microphone boom arm can briefly be seen at the top right of the screen; this is almost definitely unintentional as the purposeful revealing of the camera crew began only in Season 9.",
                                "elements": []
                            },
                            {
                                "text": "With the exception of the talking head interviews, most of the episode takes place outside because of the fire",
                                "elements": []
                            },
                            {
                                "text": "In the scene when Dwight, Michael, and Ryan are discussing business school, in the shot where Dwight begins roughousing with Ryan with a firetruck in the background, the camera pans slightly to the left and another camera can be seen briefly entering the frame.",
                                "elements": []
                            },
                            {
                                "text": "09:21 into the episode a camera crew and lighting set can be seen briefly before the camera zooms into Michael, Dwight and Ryan.",
                                "elements": []
                            },
                            {
                                "text": "When the fire bell goes off, Dwight asks Phyllis and Stanley \"Have you ever seen a burn victim?\" Dwight asked the same question when he conducted a fire drill in the Stress Relief episode in season 5.",
                                "elements": []
                            },
                            {
                                "text": "During the \"Who would you do?\" game, Oscar joins the other guys in immediately saying Pam's name, much to her annoyance. This contradicts Oscar's character in later seasons, not only because he is gay, but also because he is too sensitive to say something that would offend others in such a way. Alternatively, this scene could be explained by the fact that Oscar was still in the closet at the time, and was simply trying to fit in with the other straight men in the office.",
                                "elements": []
                            },
                            {
                                "text": "The fire in the kitchen was hot enough to apparently dry Dwight's shirt from the point he is dragging Kelly away to the following moment where he crawls to safety.",
                                "elements": []
                            },
                            {
                                "text": "The song \"Ryan started the fire\" is based off the song \"we didn't start the fire\".",
                                "elements": []
                            },
                            {
                                "text": "The windows at the front of the building seem cloudly/matte colored, but they're clear in any other episodes where the front of the building is shown.",
                                "elements": []
                            },
                            {
                                "text": "When playing Desert Island, Dwight says \"Question: Did my shoes come off in the plane crash?\" It would be impossible for him to store anything in his shoes with airport security.",
                                "elements": []
                            },
                            {
                                "text": "Early in the episode, Ryan says that he doesn’t want to be “a guy here”. By the end of the episode, he is deemed “The Fire Guy”.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Deleted scenes",
                "level": 2,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "The Season Two DVD contains a number of deleted scenes from this episode. Notable cut scenes include:"
                    },
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Jim sees a weather report of \"70 and clear\" on Pam's computer screen and is surprised when she tells him that is the current weather in Scranton. He then attempts to look out a window to see this, until realising there are no windows in the office.",
                                "elements": []
                            },
                            {
                                "text": "Several brief talking head interviews with Dwight, in which he confirms his position as Number Two behind Michael, admits to writing a book about Michael until Michael made him stop, and considers Michael's new friendship with Ryan.",
                                "elements": []
                            },
                            {
                                "text": "Michael and Dwight try to develop the list of ten pieces of business advice he promised to give Ryan.",
                                "elements": []
                            },
                            {
                                "text": "Dwight awkwardly tries to befriend Ryan.",
                                "elements": []
                            },
                            {
                                "text": "Kevin does some accounting and chuckles when he reaches the number 69.",
                                "elements": []
                            },
                            {
                                "text": "Talking-head interviews outside:",
                                "elements": [
                                    {
                                        "text": "Jim and Pam talk about how great it was when the teacher held class outside.",
                                        "elements": []
                                    },
                                    {
                                        "text": "Angela talks about how smoothly the building evacuation went, then breaks down crying.",
                                        "elements": []
                                    },
                                    {
                                        "text": "Alternate take of Michael justifying why he left the building first.",
                                        "elements": []
                                    },
                                    {
                                        "text": "Jim explains that he and Toby used to sit together, but Michael moved them because they talked too much.",
                                        "elements": []
                                    },
                                    {
                                        "text": "Michael describes the jobs he held when he was Ryan's age.",
                                        "elements": []
                                    }
                                ]
                            },
                            {
                                "text": "Toby and Kevin list their five favorite movies.",
                                "elements": []
                            },
                            {
                                "text": "Ryan tells Jim that his investment in business school is \"worth it,\" with the implication that it would allow him to quit his job at Dunder Mifflin.",
                                "elements": []
                            },
                            {
                                "text": "In a talking head interview, Michael gives a rambling answer to the question \"If you could change the life of one person, who would it be?\".",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Cultural references",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Mr. Miyagi is the karate master in the Karate Kid movie series. Yoda is the Jedi master in the Star Wars movie series. Fozzie Bear is a character from The Muppet Show. Frank Oz voiced both Yoda and Fozzie bear, thus the two characters voices similar enough that Ryan confused the two.",
                                "elements": []
                            },
                            {
                                "text": "Batman/Robin and The Lone Ranger/Tonto are two fictional crime-fighting duos. Bonto is a made-up name.",
                                "elements": []
                            },
                            {
                                "text": "Stat (short for statim =immediately) is medical jargon. Appended to a command, it means that the action should be performed immediately.",
                                "elements": []
                            },
                            {
                                "text": "Image is everything is the tag line to an ad campaign for Canon starring tennis player Andre Agassi.",
                                "elements": []
                            },
                            {
                                "text": "Dwight asks, \"Did my shoes come off in the plane crash?\" Dwight assumes that he is stranded on the island due to a plane crash, like the characters of the television program Lost.",
                                "elements": []
                            },
                            {
                                "text": "Michael confuses Stanley Kaplan with Sue Grafton. Kaplan is the founder of a company that produces test preparation materials. Grafton is known for her Kinsey Millhone series of mystery novels, whose titles follow the pattern \"A\" Is for Alibi, \"B\" Is for Burglar, etc. \"M\" Is for Murder (possibly a confused reference to the Hitchcock classic Dial M for Murder) and \"P\" Is for Phone are not among her titles. Sue Grafton is again referenced in the future episode Local Ad.",
                                "elements": []
                            },
                            {
                                "text": "Lebron James, Tracy McGrady, and Kobe Bryant are professional basketball players noted for beginning their NBA careers directly after high school.",
                                "elements": []
                            },
                            {
                                "text": "Bad Idea Jeans is a fake brand of blue jeans that was the subject of multiple parody advertisements on the sketch comedy program \"Saturday Night Live\".",
                                "elements": []
                            },
                            {
                                "text": "During the Desert Island game various prominent books and films are mentioned:",
                                "elements": [
                                    {
                                        "text": "Books: The Bible and The Purpose Driven Life (Angela); The Da Vinci Code (Phyllis); Physicians' Desk Reference, Harry Potter and the Sorcerer's Stone and Harry Potter and the Prisoner of Azkaban (Dwight)",
                                        "elements": []
                                    },
                                    {
                                        "text": "Films: Legends of the Fall, My Big Fat Greek Wedding, Legally Blonde, The Bridges of Madison County and Ghost (Meredith); Fargo, Edward Scissorhands, Dazed and Confused, The Breakfast Club and The Princess Bride (Pam); The Crow (Dwight).",
                                        "elements": []
                                    }
                                ]
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Cast",
                "level": 2,
                "content": [],
                "images": []
            },
            {
                "title": "Main Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Steve Carell as Michael Scott",
                                "elements": []
                            },
                            {
                                "text": "Rainn Wilson as Dwight Schrute",
                                "elements": []
                            },
                            {
                                "text": "John Krasinski as Jim Halpert",
                                "elements": []
                            },
                            {
                                "text": "Jenna Fischer as Pam Beesly",
                                "elements": []
                            },
                            {
                                "text": "B.J. Novak as Ryan Howard",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Recurring Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "David Denman as Roy Anderson",
                                "elements": []
                            },
                            {
                                "text": "Amy Adams as Katy",
                                "elements": []
                            },
                            {
                                "text": "Leslie David Baker as Stanley Hudson",
                                "elements": []
                            },
                            {
                                "text": "Brian Baumgartner as Kevin Malone",
                                "elements": []
                            },
                            {
                                "text": "Kate Flannery as Meredith Palmer",
                                "elements": []
                            },
                            {
                                "text": "Mindy Kaling as Kelly Kapoor",
                                "elements": []
                            },
                            {
                                "text": "Angela Kinsey as Angela Martin",
                                "elements": []
                            },
                            {
                                "text": "Paul Lieberstein as Toby Flenderson",
                                "elements": []
                            },
                            {
                                "text": "Oscar Nunez as Oscar Martinez",
                                "elements": []
                            },
                            {
                                "text": "Phyllis Smith as Phyllis Lapin",
                                "elements": []
                            },
                            {
                                "text": "Creed Bratton (actor) as Creed Bratton (Uncredited)",
                                "elements": []
                            },
                            {
                                "text": "Devon Abner as Devon White (Uncredited)",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Guest Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Shawn C. Sims as Security Guard (Uncredited)",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            }
        ]
    },
    "quotesDetails": {
        "sections": [
            {
                "title": "The Fire Quotes",
                "level": 1,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Dwight: Michael and I have a very special connection. He's like Batman, I'm like Robin. He's like the Lone Ranger, and I'm like Tonto. And it's not like there was the Lone Ranger, and Tonto, and Bonto."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael: When I was Ryan's age, I worked in a fast food restaurant, to save up money for school. And then I spe... lost it in a pyramid scheme. But I learned more about business, right then and there, than business school would ever teach me, or Ryan would ever teach me. "
                    }
                ],
                "images": []
            }
        ]
    },
    "coldOpens": [
        "Pam gets a call from Katy asking for Jim. Jealous, she tells him to give her the extension next time. "
    ],
    "storylines": [
        "Pam transfers a call from Katy to Jim's desk and the two make lunch plans. In a talking head interview, Pam awkwardly explains that Jim and Katy (the purse saleswoman from the episode \"Hot Girl\") have started dating, Pam then asks Jim to give Katy the extension to his phone.",
        "Michael gives Ryan a glowing checkpoint review. When Ryan expresses his interest in starting his own business someday, Michael takes it upon himself to teach Ryan the first of the ten rules of business. The fire alarm sounds, and while Dwight and Angela both attempt to take charge of the evacuation, Michael pushes others out of the way in his escape out of the building.",
        "In a talking head interview, Ryan explains that he doesn't want to have a nickname or be known for anything at the office. Once everyone is safely outside, Jim begins a game of \"three books on a desert island\". At Dwight's turn, he misses the point of the exercise and asks for an axe and a hollowed-out book filled with survival gear.",
        "Jim changes the topic from books to DVDs. In a joint talking head interview, Jim and Pam mock Meredith's choices, although Pam admits that she too likes Legally Blonde. Jim teases Pam for liking that movie.",
        "Michael learns that Ryan is going to business school at night. Michael invites Ryan to quiz him but doesn't even understand the first question. In a talking head interview, Michael explains that he learned more about business from working at a fast-food restaurant than Ryan will ever learn in school. Dwight, still jealous of the attention Ryan is getting from Michael, attempts to bully the young employee but merely earns a scolding from Michael. Ryan becomes increasingly uncomfortable with Michael's friendliness.",
        "Jim moves on to the next game, \"Who would you do?\", and Kevin instantly responds, \"Pam.\" Jim and Pam excuse themselves from the game to talk to Dwight, who is moping in his car. Pam suggests that Ryan would be impressed to learn that Dwight is a volunteer sheriff's deputy, and Jim tries to keep a straight face when he suggests that Dwight quit, \"and then that would stick it to both of them.\" Dwight thanks them for their concern but asks to be left alone.",
        "Jim, Pam, Michael, Ryan and even Roy join the game of \"Who would you do?\" Roy answers \"that tight-ass Christian chick.\" Jim jokingly chooses Kevin, and Michael says, \"Well, I would definitely have sex with Ryan.\" When Michael mentions that he left his cell phone in the office, Dwight rushes back into the building to fetch it.",
        "The women of the office continue playing \"Who would you do?\" Meredith: \"Jim.\" Phyllis: \"Definitely Jim.\" Kelly: \"Definitely, definitely Jim.\" Pam considers her response and says, \"Oscar's kind of cute.\" She also mentions that Toby is cute and the others groan in disapproval, except for Meredith, who nods and smiles.",
        "Michael asks Ryan to call his cell phone to help Dwight find it. The phone rings. It's in Michael's pocket. Dwight emerges, coughing, from the building and reveals that the fire was started by Ryan, who left a cheese pita in the toaster-oven set to \"oven\" instead of \"toaster\". Dwight and Michael proceed to mock Ryan and dub him The Fire Guy.",
        "Katy arrives for lunch and joins the DVD game. Her first movie: Legally Blonde.",
        "The fire out, everybody heads back inside. Michael promises Ryan, \"I'll give you the rest of the ten tomorrow.\""
    ],
    "quotes": [
        "Dwight: Michael and I have a very special connection. He's like Batman, I'm like Robin. He's like the Lone Ranger, and I'm like Tonto. And it's not like there was the Lone Ranger, and Tonto, and Bonto.",
        "Michael: When I was Ryan's age, I worked in a fast food restaurant, to save up money for school. And then I spe... lost it in a pyramid scheme. But I learned more about business, right then and there, than business school would ever teach me, or Ryan would ever teach me. "
    ]
}