{
    "season": 2,
    "title": "The Fire",
    "episode": "4",
    "episodes": [
        4
    ],
    "coldOpens": [
        "Pam gets a call from Katy asking for Jim. Jealous, she tells him to give her the extension next time. "
    ],
    "storylines": [
        "Pam transfers a call from Katy to Jim's desk and the two make lunch plans. In a talking head interview, Pam awkwardly explains that Jim and Katy (the purse saleswoman from the episode \"Hot Girl\") have started dating, Pam then asks Jim to give Katy the extension to his phone.",
        "Michael gives Ryan a glowing checkpoint review. When Ryan expresses his interest in starting his own business someday, Michael takes it upon himself to teach Ryan the first of the ten rules of business. The fire alarm sounds, and while Dwight and Angela both attempt to take charge of the evacuation, Michael pushes others out of the way in his escape out of the building.",
        "In a talking head interview, Ryan explains that he doesn't want to have a nickname or be known for anything at the office. Once everyone is safely outside, Jim begins a game of \"three books on a desert island\". At Dwight's turn, he misses the point of the exercise and asks for an axe and a hollowed-out book filled with survival gear.",
        "Jim changes the topic from books to DVDs. In a joint talking head interview, Jim and Pam mock Meredith's choices, although Pam admits that she too likes Legally Blonde. Jim teases Pam for liking that movie.",
        "Michael learns that Ryan is going to business school at night. Michael invites Ryan to quiz him but doesn't even understand the first question. In a talking head interview, Michael explains that he learned more about business from working at a fast-food restaurant than Ryan will ever learn in school. Dwight, still jealous of the attention Ryan is getting from Michael, attempts to bully the young employee but merely earns a scolding from Michael. Ryan becomes increasingly uncomfortable with Michael's friendliness.",
        "Jim moves on to the next game, \"Who would you do?\", and Kevin instantly responds, \"Pam.\" Jim and Pam excuse themselves from the game to talk to Dwight, who is moping in his car. Pam suggests that Ryan would be impressed to learn that Dwight is a volunteer sheriff's deputy, and Jim tries to keep a straight face when he suggests that Dwight quit, \"and then that would stick it to both of them.\" Dwight thanks them for their concern but asks to be left alone.",
        "Jim, Pam, Michael, Ryan and even Roy join the game of \"Who would you do?\" Roy answers \"that tight-ass Christian chick.\" Jim jokingly chooses Kevin, and Michael says, \"Well, I would definitely have sex with Ryan.\" When Michael mentions that he left his cell phone in the office, Dwight rushes back into the building to fetch it.",
        "The women of the office continue playing \"Who would you do?\" Meredith: \"Jim.\" Phyllis: \"Definitely Jim.\" Kelly: \"Definitely, definitely Jim.\" Pam considers her response and says, \"Oscar's kind of cute.\" She also mentions that Toby is cute and the others groan in disapproval, except for Meredith, who nods and smiles.",
        "Michael asks Ryan to call his cell phone to help Dwight find it. The phone rings. It's in Michael's pocket. Dwight emerges, coughing, from the building and reveals that the fire was started by Ryan, who left a cheese pita in the toaster-oven set to \"oven\" instead of \"toaster\". Dwight and Michael proceed to mock Ryan and dub him The Fire Guy.",
        "Katy arrives for lunch and joins the DVD game. Her first movie: Legally Blonde.",
        "The fire out, everybody heads back inside. Michael promises Ryan, \"I'll give you the rest of the ten tomorrow.\""
    ],
    "quotes": [
        [
            {
                "speaker": "Dwight",
                "content": " Michael and I have a very special connection. He's like Batman, I'm like Robin. He's like the Lone Ranger, and I'm like Tonto. And it's not like there was the Lone Ranger, and Tonto, and Bonto."
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " When I was Ryan's age, I worked in a fast food restaurant, to save up money for school. And then I spe... lost it in a pyramid scheme. But I learned more about business, right then and there, than business school would ever teach me, or Ryan would ever teach me. "
            }
        ]
    ]
}