{
    "season": 2,
    "title": "Halloween",
    "episode": "5",
    "episodes": [
        5
    ],
    "coldOpens": [
        "Michael has to provide Jan with the name of the employee he's firing. He tells her assistant that he'll get back to Jan with a name. Thinking he'd disconnected the line, he says he wishes he could fire the assistant, only to learn he hadn't disconnected the line and she heard him. "
    ],
    "storylines": [
        "When Michael enters the office, Pam tells him Jan has called. Michael knows it's because he was supposed to fire someone by the end of the month. So far, he has been putting it off hoping someone would quit, move, or die so he wouldn't have to do it. Of course, he has no idea who he is going to let go. Michael goes to the Accounting Department (Kevin, Angela, and Oscar) and asks them to find $50,000 in the budget (basically, a salary and benefits), who come to the conclusion that the Accounting Department has three people doing the work of two, but don't tell Michael. Dwight gets on Jim's nerves so he and Pam decide to post Dwight's resume on the web. Angela gets mad at Pam for bringing brownies instead of chips and dip to the office party. Dwight's resume gets a hit from a company in Maryland, so Jim plays Michael and gives Dwight a great reference. When the company, Cumberland Mills, calls Dwight to set up an interview, Dwight immediately ruins his chances by having a rather stern argument with the caller over the importance and relevance of martial arts.",
        "Pam thinks Jim should be the one to be getting better job offers and mentions to Jim that, given the salary and growth potential there, he should apply for the Cumberland Mills job. Jim is clearly hurt by the suggestion, thinking that perhaps Pam wouldn't care if he left. Pam tries to back-pedal but Jim makes clear his feelings. Michael tries to practice his firing skills with Jim, but doesn't fire him. Michael decides to fire Creed, after unsuccessfully trying to fire Pam and Stanley. Creed is unwilling to be fired so he talks Michael into letting Devon go, which he does. Devon retailiates by smashing a pumpkin on Michael's car. As Jim is leaving to go home, Pam apologises for pushing him into taking the Cumberland job and reassures him that she would 'blow her brains out' if he ever left. In a talking head, Jim brushes off the remark, saying that if Pam were the one leaving, he wouldn't necessarily blow his brains out...though he would take the Cumberland Mills job. At the end of the episode, we see a guilty Michael alone at home on Halloween, handing out candy to trick-or-treaters."
    ],
    "quotes": [
        [
            {
                "speaker": "Pam",
                "content": " I'm guessing Angela's the one in the neighborhood who gives the trick-or-treaters some toothbrushes. Pennies. Walnuts."
            }
        ],
        [
            {
                "speaker": "Jim",
                "content": " I'm really sorry, but I have to let you go, and it's purely budgetary; it's not personal."
            },
            {
                "speaker": "Michael Scott",
                "content": " AAAAHH! I'm gonna kill myself!"
            },
            {
                "speaker": "Jim",
                "content": " Wow."
            },
            {
                "speaker": "Michael Scott",
                "content": " I'm going to kill myself, and it's your fault!"
            },
            {
                "speaker": "Jim",
                "content": " That's an overreaction."
            }
        ],
        [
            {
                "speaker": "Dwight",
                "content": " [on the phone] So you got the fax? So why didn't you add it to the res... ? What do you mean? Of course martial arts training is relevant. Oh, excuse me! I know about a billion Asians that would beg to differ. Uh, yeah, I get a little frustrated when I'm dealing with incompetence. Well, you know what? You can go to hell, too. And I will see you there... burning. Fine! Okay... oh wait! So you'll let me know when you've made a decis... [stops and hangs up phone.]"
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " Yeah, I went hunting once. Shot the deer in the leg, had to kill it with a shovel. Took about an hour. Why do you ask?"
            }
        ]
    ]
}