{
    "season": 2,
    "title": "Halloween",
    "episode": "5",
    "episodes": [
        5
    ],
    "episodeDetails": {
        "sections": [
            {
                "title": "Halloween",
                "level": 1,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "\"Halloween\" is the fifth episode of the second season of The Office and the 11th overall. It was written by Greg Daniels and directed by Paul Feig. It first aired on October 18, 2005. It was viewed by 8 million people."
                    }
                ],
                "images": []
            },
            {
                "title": "Summary",
                "level": 2,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "When Michael enters the office, Pam tells him Jan has called. Michael knows it's because he was supposed to fire someone by the end of the month. So far, he has been putting it off hoping someone would quit, move, or die so he wouldn't have to do it. Of course, he has no idea who he is going to let go. Michael goes to the Accounting Department (Kevin, Angela, and Oscar) and asks them to find $50,000 in the budget (basically, a salary and benefits), who come to the conclusion that the Accounting Department has three people doing the work of two, but don't tell Michael. Dwight gets on Jim's nerves so he and Pam decide to post Dwight's resume on the web. Angela gets mad at Pam for bringing brownies instead of chips and dip to the office party. Dwight's resume gets a hit from a company in Maryland, so Jim plays Michael and gives Dwight a great reference. When the company, Cumberland Mills, calls Dwight to set up an interview, Dwight immediately ruins his chances by having a rather stern argument with the caller over the importance and relevance of martial arts."
                    },
                    {
                        "type": "paragraph",
                        "text": "Pam thinks Jim should be the one to be getting better job offers and mentions to Jim that, given the salary and growth potential there, he should apply for the Cumberland Mills job. Jim is clearly hurt by the suggestion, thinking that perhaps Pam wouldn't care if he left. Pam tries to back-pedal but Jim makes clear his feelings. Michael tries to practice his firing skills with Jim, but doesn't fire him. Michael decides to fire Creed, after unsuccessfully trying to fire Pam and Stanley. Creed is unwilling to be fired so he talks Michael into letting Devon go, which he does. Devon retailiates by smashing a pumpkin on Michael's car. As Jim is leaving to go home, Pam apologises for pushing him into taking the Cumberland job and reassures him that she would 'blow her brains out' if he ever left. In a talking head, Jim brushes off the remark, saying that if Pam were the one leaving, he wouldn't necessarily blow his brains out...though he would take the Cumberland Mills job. At the end of the episode, we see a guilty Michael alone at home on Halloween, handing out candy to trick-or-treaters."
                    }
                ],
                "images": []
            },
            {
                "title": "Trivia",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Dwight sends the supplement for his resume to \"Charles Weed\" (at Cumberland Mills).",
                                "elements": []
                            },
                            {
                                "text": "Michael tells Oscar he probably wishes he could wear his female costume all the time, possibly foreshadowing the fact that Oscar is gay.",
                                "elements": []
                            },
                            {
                                "text": "While Dwight was not one of the co-workers Devon invited to Poor Richard's after being fired, in \"Finale\" Dwight states that he likes Devon, and has re-hired him following Creed's \"death\".",
                                "elements": []
                            },
                            {
                                "text": "This is the only episode to feature a quote over the Deedle-Dee logo.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Deleted scenes",
                "level": 2,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "The Season Two DVD contains a number of deleted scenes from this episode. Notable cut scenes include:"
                    },
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Michael walks sadly through the office, unconvincingly reassuring everyone that \"everything's going to be fine.\"",
                                "elements": []
                            },
                            {
                                "text": "Toby asks Michael for the name of the employee that will be fired so he can start the paperwork. Michael tries to fire Toby.",
                                "elements": []
                            },
                            {
                                "text": "As Michael takes the elevator downstairs. Leo and Gino from Vance Refrigeration mug for the cameras. At the security desk, Michael unsuccessfully asks the guard to be available to subdue an employee that has \"gone postal.\" (He also tries to fire the guard.) Michael is determined to have made his decision by the time the elevator returns him to the second floor, but the door opens before he is ready.",
                                "elements": []
                            },
                            {
                                "text": "Michael's proposal that everyone take a 10% pay cut is not met with enthusiasm.",
                                "elements": []
                            },
                            {
                                "text": "Additional footage of Michael trying to fire Creed.",
                                "elements": []
                            },
                            {
                                "text": "Michael tells a long, rambling story about a deer hunting trip. The deer did not die instantly, and \"it's hard to hit another living thing in the face with a shovel for about an hour.\"",
                                "elements": []
                            },
                            {
                                "text": "Michael calls Jan, angry that he was forced to betray \"one of my best buddies.\"",
                                "elements": []
                            },
                            {
                                "text": "Michael sulks at the lame office Halloween party, along with those not invited to Poor Richard's by Devon (Dwight, Angela, and Creed).",
                                "elements": []
                            },
                            {
                                "text": "In a talking head interview, Dwight explains that he is destined to sell paper at Dunder Mifflin.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Cultural references",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "A Sith Lord is a type of warrior priest from the Star Wars movie franchise. Dwight later refers to characters Anakin Skywalker and Darth Vader from the same movie series.",
                                "elements": []
                            },
                            {
                                "text": "Kelly is dressed like Dorothy, the heroine of the movie The Wonderful Wizard of Oz.",
                                "elements": []
                            },
                            {
                                "text": "Bend It Like Beckham is, like Kelly says, \"the movie about the Indian girl who plays soccer.\"",
                                "elements": []
                            },
                            {
                                "text": "Monster.com is a web site devoted to job placement, Google is a search engine, and Craig's List is a free classified ad web site.",
                                "elements": []
                            },
                            {
                                "text": "Stanley says \"You're fired!\" in the style of Donald Trump, 45th President of The United States, his catch phrase from his time hosting the show The Apprentice.",
                                "elements": []
                            },
                            {
                                "text": "Cumberland Mills is a fictional paper company. The name may have been inspired by the Westvaco paper company in Cumberland, Maryland. Coincidentally, paper manufacturer Sappi has a factory in Cumberland Mills, Westbrook, Maine.",
                                "elements": []
                            },
                            {
                                "text": "Chili's and Poor Richard's previously appeared in the episode The Dundies.",
                                "elements": []
                            },
                            {
                                "text": "Janet Jackson's boob refers to a controversial Super Bowl halftime show in 2004 which accidentally exposed the singer's breast. Monica Lewinsky and the stained dress refer to the 1999 sex scandal involving then-president Bill Clinton. O.J. refers to former football great O. J. Simpson, whose 1995 murder trial garnered intense publicity.",
                                "elements": []
                            },
                            {
                                "text": "Sopranos style refers to the television series The Sopranos about a fictional Mafia family.",
                                "elements": []
                            },
                            {
                                "text": "The term going postal entered United States slang after a series of incidents in the 1980s and 1990s of postal service workers shooting and killing colleagues and members of the public. It can refer to workplace massacres, or, more generally, any violent outburst.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Cast",
                "level": 2,
                "content": [],
                "images": []
            },
            {
                "title": "Main Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Steve Carell as Michael Scott",
                                "elements": []
                            },
                            {
                                "text": "Rainn Wilson as Dwight Schrute",
                                "elements": []
                            },
                            {
                                "text": "John Krasinski as Jim Halpert",
                                "elements": []
                            },
                            {
                                "text": "Jenna Fischer as Pam Beesly",
                                "elements": []
                            },
                            {
                                "text": "B.J. Novak as Ryan Howard",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Recurring Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Creed Bratton (actor) as Creed Bratton",
                                "elements": []
                            },
                            {
                                "text": "Devon Abner as Devon White",
                                "elements": []
                            },
                            {
                                "text": "Leslie David Baker as Stanley Hudson",
                                "elements": []
                            },
                            {
                                "text": "Brian Baumgartner as Kevin Malone",
                                "elements": []
                            },
                            {
                                "text": "Kate Flannery as Meredith Palmer",
                                "elements": []
                            },
                            {
                                "text": "Mindy Kaling as Kelly Kapoor",
                                "elements": []
                            },
                            {
                                "text": "Angela Kinsey as Angela Martin",
                                "elements": []
                            },
                            {
                                "text": "Paul Lieberstein as Toby Flenderson",
                                "elements": []
                            },
                            {
                                "text": "Oscar Nunez as Oscar Martinez",
                                "elements": []
                            },
                            {
                                "text": "Phyllis Smith as Phyllis Lapin",
                                "elements": []
                            },
                            {
                                "text": "Hugh Dane as Hank Tate",
                                "elements": []
                            },
                            {
                                "text": "Lee Eisenberg as Gino (Deleted Scenes)",
                                "elements": []
                            },
                            {
                                "text": "Gene Stupnitsky as Leo (Deleted Scenes)",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Guest Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Ava Nisbet as Sherry",
                                "elements": []
                            },
                            {
                                "text": "George Gaus as Lion",
                                "elements": []
                            },
                            {
                                "text": "Annabelle Kopack as Fairy Princess",
                                "elements": []
                            },
                            {
                                "text": "Alec Zbornak as Bumble Bee",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            }
        ]
    },
    "quotesDetails": {
        "sections": [
            {
                "title": "Halloween Quotes",
                "level": 1,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Pam: I'm guessing Angela's the one in the neighborhood who gives the trick-or-treaters some toothbrushes. Pennies. Walnuts."
                    },
                    {
                        "type": "paragraph",
                        "text": "Jim: I'm really sorry, but I have to let you go, and it's purely budgetary; it's not personal.\nMichael Scott: AAAAHH! I'm gonna kill myself!\nJim: Wow.\nMichael Scott: I'm going to kill myself, and it's your fault!\nJim: That's an overreaction."
                    },
                    {
                        "type": "paragraph",
                        "text": "Dwight: [on the phone] So you got the fax? So why didn't you add it to the res... ? What do you mean? Of course martial arts training is relevant. Oh, excuse me! I know about a billion Asians that would beg to differ. Uh, yeah, I get a little frustrated when I'm dealing with incompetence. Well, you know what? You can go to hell, too. And I will see you there... burning. Fine! Okay... oh wait! So you'll let me know when you've made a decis... [stops and hangs up phone.]"
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael: Yeah, I went hunting once. Shot the deer in the leg, had to kill it with a shovel. Took about an hour. Why do you ask?"
                    }
                ],
                "images": []
            }
        ]
    },
    "coldOpens": [
        "Michael has to provide Jan with the name of the employee he's firing. He tells her assistant that he'll get back to Jan with a name. Thinking he'd disconnected the line, he says he wishes he could fire the assistant, only to learn he hadn't disconnected the line and she heard him. "
    ],
    "storylines": [
        "When Michael enters the office, Pam tells him Jan has called. Michael knows it's because he was supposed to fire someone by the end of the month. So far, he has been putting it off hoping someone would quit, move, or die so he wouldn't have to do it. Of course, he has no idea who he is going to let go. Michael goes to the Accounting Department (Kevin, Angela, and Oscar) and asks them to find $50,000 in the budget (basically, a salary and benefits), who come to the conclusion that the Accounting Department has three people doing the work of two, but don't tell Michael. Dwight gets on Jim's nerves so he and Pam decide to post Dwight's resume on the web. Angela gets mad at Pam for bringing brownies instead of chips and dip to the office party. Dwight's resume gets a hit from a company in Maryland, so Jim plays Michael and gives Dwight a great reference. When the company, Cumberland Mills, calls Dwight to set up an interview, Dwight immediately ruins his chances by having a rather stern argument with the caller over the importance and relevance of martial arts.",
        "Pam thinks Jim should be the one to be getting better job offers and mentions to Jim that, given the salary and growth potential there, he should apply for the Cumberland Mills job. Jim is clearly hurt by the suggestion, thinking that perhaps Pam wouldn't care if he left. Pam tries to back-pedal but Jim makes clear his feelings. Michael tries to practice his firing skills with Jim, but doesn't fire him. Michael decides to fire Creed, after unsuccessfully trying to fire Pam and Stanley. Creed is unwilling to be fired so he talks Michael into letting Devon go, which he does. Devon retailiates by smashing a pumpkin on Michael's car. As Jim is leaving to go home, Pam apologises for pushing him into taking the Cumberland job and reassures him that she would 'blow her brains out' if he ever left. In a talking head, Jim brushes off the remark, saying that if Pam were the one leaving, he wouldn't necessarily blow his brains out...though he would take the Cumberland Mills job. At the end of the episode, we see a guilty Michael alone at home on Halloween, handing out candy to trick-or-treaters."
    ],
    "quotes": [
        "Pam: I'm guessing Angela's the one in the neighborhood who gives the trick-or-treaters some toothbrushes. Pennies. Walnuts.",
        "Jim: I'm really sorry, but I have to let you go, and it's purely budgetary; it's not personal.\nMichael Scott: AAAAHH! I'm gonna kill myself!\nJim: Wow.\nMichael Scott: I'm going to kill myself, and it's your fault!\nJim: That's an overreaction.",
        "Dwight: [on the phone] So you got the fax? So why didn't you add it to the res... ? What do you mean? Of course martial arts training is relevant. Oh, excuse me! I know about a billion Asians that would beg to differ. Uh, yeah, I get a little frustrated when I'm dealing with incompetence. Well, you know what? You can go to hell, too. And I will see you there... burning. Fine! Okay... oh wait! So you'll let me know when you've made a decis... [stops and hangs up phone.]",
        "Michael: Yeah, I went hunting once. Shot the deer in the leg, had to kill it with a shovel. Took about an hour. Why do you ask?"
    ]
}