{
    "season": 2,
    "title": "The Fight",
    "episode": "6",
    "episodes": [
        6
    ],
    "coldOpens": [
        "Dwight's desk is missing because Jim hid it in the bathroom. Dwight goes into the bathroom, telling Kevin to wash his hands. "
    ],
    "storylines": [
        "After getting promoted to a purple belt, Dwight now as a \"senpai\" keep bragging about his new position on a dojo. Jim asks him if he can beat Michael, which Michael convinces both of them that he can beat Dwight, with Dwight responding they can't beat each other due to the fact that they are friends. However, the jokes turn into a rivalry, and later a joke fight, which results in Michael losing. Jim and Pam then work together to making Michael feeling humiliated, and convince both of them to do a rematch at Dwight's dojo. Both of Dwight and Michael agree. At the dojo, both of them start with horrible moves and childish behavior. However, Michael manages to win the rematch and humiliate Dwight. Michael then realizes that he made Dwight now hate him. As a result of the guilt, Michael decides to finally promote the humiliated Dwight to Assistant Regional Manager, with a 3-month probation period."
    ],
    "quotes": [
        [
            {
                "speaker": "Dwight",
                "content": " I come from a long line of fighters. My maternal grandfather was the toughest guy I ever knew. World War II veteran. Killed twenty men then spent the rest of the war in an Allied Prison Camp. My father battled blood pressure and obesity all his life. Different kind of fight."
            }
        ],
        [
            {
                "speaker": "Jim",
                "content": " We're all getting excited to see this fight...the Albany branch is working right through lunch - to prevent downsizing - but Michael? He decided to extend our lunch by an hour so that we could all go down to the dojo and watch him fight Dwight...Fight!...Fight...Fight!..."
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " Would I rather be feared or loved? Easy. Both. I want people to be afraid of how much they love me."
            }
        ]
    ]
}