{
    "season": 2,
    "title": "The Fight",
    "episode": "6",
    "episodes": [
        6
    ],
    "episodeDetails": {
        "sections": [
            {
                "title": "The Fight",
                "level": 1,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "\"The Fight\" is the sixth episode of the second season of The Office and the 12th overall. It was written by Lee Eisenberg and Gene Stupnitsky, and directed by Ken Kwapis. It first aired on November 1, 2005. It was viewed by 7.9 million people."
                    }
                ],
                "images": []
            },
            {
                "title": "Summary",
                "level": 2,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "After getting promoted to a purple belt, Dwight now as a \"senpai\" keep bragging about his new position on a dojo. Jim asks him if he can beat Michael, which Michael convinces both of them that he can beat Dwight, with Dwight responding they can't beat each other due to the fact that they are friends. However, the jokes turn into a rivalry, and later a joke fight, which results in Michael losing. Jim and Pam then work together to making Michael feeling humiliated, and convince both of them to do a rematch at Dwight's dojo. Both of Dwight and Michael agree. At the dojo, both of them start with horrible moves and childish behavior. However, Michael manages to win the rematch and humiliate Dwight. Michael then realizes that he made Dwight now hate him. As a result of the guilt, Michael decides to finally promote the humiliated Dwight to Assistant Regional Manager, with a 3-month probation period."
                    }
                ],
                "images": []
            },
            {
                "title": "Trivia(may be spoilers)",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Kevin comes out of the bathroom stall holding a scented candle. In a previous episode, \"The Dundies\", Kevin won a Dundie award in honor of the horrid smell he leaves behind after using the bathroom.",
                                "elements": []
                            },
                            {
                                "text": "Dwight tells Kevin to wash his hands in the cold open, however later in the series when he waters down the soap and is criticized for it, he says, \"Why do you even need to wash your hands? Are you really that bad at going to the bathroom?\" And when Pam tries to place hand sanitizing stations all over the office, Dwight advocates for placing hand \"de-sanitizing\" stations around instead, insisting that the human immune system shouldn't be coddled.",
                                "elements": []
                            },
                            {
                                "text": "Michael didn't actually win his fight with Dwight. halfway through, he broke the rule of no holding and scored his three points illegally. Thus, Dwight won, and Michael would have been disqualified. However, Michael, refusing to obey the sensei, and unable to accept the fact that Dwight is better, still claims he won and gloats about it for the rest of the episode. ",
                                "elements": []
                            },
                            {
                                "text": "It is revealed that Jim has a sister named Larissa as he has her listed as his emergency contact.",
                                "elements": []
                            },
                            {
                                "text": "In a talking head interview, Michael talks about friends who come to work late \"having dentist appointments that aren't dentist appointments.\" This hypothetical situation comes to pass in the future episode \"The Coup\".",
                                "elements": []
                            },
                            {
                                "text": "Dwight botches the phrase \"tit for tat\" by saying \"tit for tit\" instead. He made the same mistake in a previous episode, \"Diversity Day\", where Jim corrects him.",
                                "elements": []
                            },
                            {
                                "text": "According to the logos on Dwight's Dojo, the school is not supposed to be teaching Karate, but Tae Kwon Do, due to the World Taekwondo Federation logos (See picture). Additionally, the sparring gear that the training dummy adorned in the background is actually Tae Kwon Do sparring gear, not Karate, as the user usually isn't supposed to wear any gear, in Kumite, or \"full body contact\", although Shiai/Jyu Kumite, \"free sparring\", has the users wearing gear (gloves, mouthguards, leg padding, optional headguard).",
                                "elements": []
                            },
                            {
                                "text": "The actor who plays Sensei Ira, Lance Krall, is an actual martial art expert; he holds a third-degree black belt in Taekwondo, and in 1992, he was ranked the sixth best in the nation for his weight class.",
                                "elements": []
                            },
                            {
                                "text": "It is also interesting to note that in the episode's closing scene, not only is the staff laughing at Michael beating up Dwight but so is Dwight's Sensei.",
                                "elements": []
                            },
                            {
                                "text": "Dwight's use of \"senpai\" is (purposely) incorrect, it is an honorific to indicate someone of a higher rank. When talking to someone who is a higher rank than you (in this case, sensei), you do not call yourself \"senpai\".",
                                "elements": []
                            },
                            {
                                "text": "The address that Jim provides for his emergency contact who is presumably his mother is different from the address of when he purchases his parents home.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Deleted scenes",
                "level": 2,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Notable cut scenes include:"
                    },
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "At the dojo, Dwight's attempt at a kick fails miserably. Dwight is disciplined by sensei Ira when his pager goes off during class.",
                                "elements": []
                            },
                            {
                                "text": "In a talking head interview, Dwight explains that he has not bonded with his classmates. \"I'm not there to make friends. I'm here to attack people.\"",
                                "elements": []
                            },
                            {
                                "text": "An alternate take of the scene in which Jim asks Dwight whom he could take on in a fight.",
                                "elements": []
                            },
                            {
                                "text": "Angela accuses Oscar of eating her pudding snacks. Oscar denies it, as does Kevin. (Kevin snickers to the camera.)",
                                "elements": []
                            },
                            {
                                "text": "Kelly invites Meredith to Happy Hour. Meredith is unsure. \"I'm still recovering from last night... but maybe.\"",
                                "elements": []
                            },
                            {
                                "text": "Scenes at the dojo of Michael and Dwight putting on equipment, trying to psych each other out, and ultimately fighting like idiots.",
                                "elements": []
                            },
                            {
                                "text": "Ira introduces his young senpai Alyssa. In a talking head interview at the dojo, Dwight explains that Alyssa may technically be the senpai, but \"the only reason she got into regionals was because her competition was a bunch of thirteen-year-old girls.\"",
                                "elements": []
                            },
                            {
                                "text": "Michael brags about the fight to Stanley, who is more interested in Michael signing the purchase orders. Pam pointedly puts the forms on Michael's chair.",
                                "elements": []
                            },
                            {
                                "text": "In a talking head interview, Dwight explains that Michael has no honor and would be an outcast in Japan. \"Well, that's not totally true, because Asians worship chest hair.\"",
                                "elements": []
                            },
                            {
                                "text": "Michael delivers Pam \"part one\" of the forms, but it is just the emergency contact information.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Cultural references",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Jim plays the hotter/colder game with Dwight. In this children's game, warmer temperatures indicate that the player is closer to the target.",
                                "elements": []
                            },
                            {
                                "text": "Arigato gozaimashita and Hai, loosely translated, mean \"Thank you very much\" and \"Yes\", respectively, in Japanese.",
                                "elements": []
                            },
                            {
                                "text": "The Perfect Storm is a book and subsequent movie about a powerful storm that struck North America in 1991. It subsequently became used to refer to the disastrous effect of multiple events which coincide by chance.",
                                "elements": []
                            },
                            {
                                "text": "Michael sings I don't want to work. I want to bang on this mug all day to the tune of Bang the Drum All Day.",
                                "elements": []
                            },
                            {
                                "text": "Chillax is a slang term combining chill (meaning \"to relax\") and relax.",
                                "elements": []
                            },
                            {
                                "text": "Pam-M-S'ing is a pun on PMS (known as PMT in British English).",
                                "elements": []
                            },
                            {
                                "text": "Catch-22 is the title of a novel by Joseph Heller. The term refers to a no-win situation, although it is clear that Michael has no idea what it means.",
                                "elements": []
                            },
                            {
                                "text": "Michael Jackson's Wonderland is Michael's mistaken reference to Jackson's property the Neverland Ranch.",
                                "elements": []
                            },
                            {
                                "text": "Mike Tyson is a professional boxer with a high-pitched voice.",
                                "elements": []
                            },
                            {
                                "text": "A Jet is a member of one of the rival street gangs in the musical West Side Story. \"When you're a Jet, you're a Jet all the way\" is the opening line to The Jet Song. Jim snaps his fingers in the same way as the gang members.",
                                "elements": []
                            },
                            {
                                "text": "Bedtime for Bonzo is a movie notable primarily for its star, future president Ronald Reagan. Michael's use is nonsensical.",
                                "elements": []
                            },
                            {
                                "text": "You are the weakest link is the catchphrase from the game show Weakest Link.",
                                "elements": []
                            },
                            {
                                "text": "Queer Eye (originally Queer Eye for the Straight Guy) is a make-over reality television program featuring five openly gay men dispensing fashion and style advice.",
                                "elements": []
                            },
                            {
                                "text": "Armageddon is a 1998 science fiction action movie starring Bruce Willis.",
                                "elements": []
                            },
                            {
                                "text": "Tit for tit is an incorrect version of tit for tat, an expression meaning that one can respond to an offense in the same manner as the original offense. Dwight first uses this incorrectly in the Season 1 episode, Diversity Day.",
                                "elements": []
                            },
                            {
                                "text": "Michael's Two punches: me punching you and you hitting the floor is a botched quote from the classic 1985 movie The Breakfast Club. Actual quote: \"Two hits; me hitting you, you hitting the floor.\"",
                                "elements": []
                            },
                            {
                                "text": "Jim's \"Bring it\" is a challenge (short for \"bring it on\", a phrase used by Katy in Hot Girl).",
                                "elements": []
                            },
                            {
                                "text": "Jim mocks Pam by doubting her status as an Ultimate Fighter. The Ultimate Fighter is a reality television series in the form of a martial arts competition.",
                                "elements": []
                            },
                            {
                                "text": "Kevin's advice to sweep the leg comes from the movie The Karate Kid.",
                                "elements": []
                            },
                            {
                                "text": "Michael's \"You talkin' to me?\" is a line performed by Robert De Niro in the movie Taxi Driver. Michael misattributes it to Al Pacino in Raging Bull.",
                                "elements": []
                            },
                            {
                                "text": "Phone tag is a term applied to the phenomenon of two people trying to reach each other by phone but always missing each other.",
                                "elements": []
                            },
                            {
                                "text": "Although Dwight's martial arts style is Japanese Karate or \"Gōjū-ryū\" Karate, the dojo is obviously not Japanese, as the logos on the windows are actually logos belonging to the World Taekwondo Federation, which is in charge of hosting the Tae Kwon Do games of the Olympic games; Taekwondo itself is a Korean martial art.",
                                "elements": []
                            },
                            {
                                "text": "Adding to the above, the scoring mechanism used in the episode (one point for a clean hit to the body) is more similar to the scoring system for \"Jyu Kumite\" (free sparring) used in multiple styles of Karate, while the Taekwondo's point system relies on how many hits the contestants can land on their opponents in two minutes.",
                                "elements": []
                            },
                            {
                                "text": "Fudge packer is a rude term for a homosexual male.",
                                "elements": []
                            },
                            {
                                "text": "The Karate Kid is a 1984 movie about a boy who becomes an accomplished karate fighter. The Hilary Swank version is The Next Karate Kid, the fourth movie in the Karate Kid series, starring Swank as the first female student of sensei Miyagi.",
                                "elements": []
                            },
                            {
                                "text": "Michael suggests, \"Let's gangbang this thing,\" unaware that gangbang refers to a single person having sex with multiple partners in rapid succession.",
                                "elements": []
                            },
                            {
                                "text": "Michael poses a question at the end of the episode, about whether he would rather be feared or loved.  This comes from Machiavelli's \"The Prince \", which poses the same question of leaders.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Cast",
                "level": 2,
                "content": [],
                "images": []
            },
            {
                "title": "Main Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Steve Carell as Michael Scott",
                                "elements": []
                            },
                            {
                                "text": "Rainn Wilson as Dwight Schrute",
                                "elements": []
                            },
                            {
                                "text": "John Krasinski as Jim Halpert",
                                "elements": []
                            },
                            {
                                "text": "Jenna Fischer as Pam Beesly",
                                "elements": []
                            },
                            {
                                "text": "B.J. Novak as Ryan Howard",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Recurring Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Leslie David Baker as Stanley Hudson",
                                "elements": []
                            },
                            {
                                "text": "Brian Baumgartner as Kevin Malone",
                                "elements": []
                            },
                            {
                                "text": "Creed Bratton (actor) as Creed Bratton",
                                "elements": []
                            },
                            {
                                "text": "Kate Flannery as Meredith Palmer",
                                "elements": []
                            },
                            {
                                "text": "Mindy Kaling as Kelly Kapoor",
                                "elements": []
                            },
                            {
                                "text": "Angela Kinsey as Angela Martin",
                                "elements": []
                            },
                            {
                                "text": "Paul Lieberstein as Toby Flenderson",
                                "elements": []
                            },
                            {
                                "text": "Oscar Nunez as Oscar Martinez",
                                "elements": []
                            },
                            {
                                "text": "Phyllis Smith as Phyllis Lapin",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Guest Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Lance Krall as Sensei Ira",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            }
        ]
    },
    "quotesDetails": {
        "sections": [
            {
                "title": "The Fight Quotes",
                "level": 1,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Dwight: I come from a long line of fighters. My maternal grandfather was the toughest guy I ever knew. World War II veteran. Killed twenty men then spent the rest of the war in an Allied Prison Camp. My father battled blood pressure and obesity all his life. Different kind of fight."
                    },
                    {
                        "type": "paragraph",
                        "text": "Jim: We're all getting excited to see this fight...the Albany branch is working right through lunch - to prevent downsizing - but Michael? He decided to extend our lunch by an hour so that we could all go down to the dojo and watch him fight Dwight...Fight!...Fight...Fight!..."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael: Would I rather be feared or loved? Easy. Both. I want people to be afraid of how much they love me."
                    }
                ],
                "images": []
            }
        ]
    },
    "coldOpens": [
        "Dwight's desk is missing because Jim hid it in the bathroom. Dwight goes into the bathroom, telling Kevin to wash his hands. "
    ],
    "storylines": [
        "After getting promoted to a purple belt, Dwight now as a \"senpai\" keep bragging about his new position on a dojo. Jim asks him if he can beat Michael, which Michael convinces both of them that he can beat Dwight, with Dwight responding they can't beat each other due to the fact that they are friends. However, the jokes turn into a rivalry, and later a joke fight, which results in Michael losing. Jim and Pam then work together to making Michael feeling humiliated, and convince both of them to do a rematch at Dwight's dojo. Both of Dwight and Michael agree. At the dojo, both of them start with horrible moves and childish behavior. However, Michael manages to win the rematch and humiliate Dwight. Michael then realizes that he made Dwight now hate him. As a result of the guilt, Michael decides to finally promote the humiliated Dwight to Assistant Regional Manager, with a 3-month probation period."
    ],
    "quotes": [
        "Dwight: I come from a long line of fighters. My maternal grandfather was the toughest guy I ever knew. World War II veteran. Killed twenty men then spent the rest of the war in an Allied Prison Camp. My father battled blood pressure and obesity all his life. Different kind of fight.",
        "Jim: We're all getting excited to see this fight...the Albany branch is working right through lunch - to prevent downsizing - but Michael? He decided to extend our lunch by an hour so that we could all go down to the dojo and watch him fight Dwight...Fight!...Fight...Fight!...",
        "Michael: Would I rather be feared or loved? Easy. Both. I want people to be afraid of how much they love me."
    ]
}