{
    "season": 2,
    "title": "The Client",
    "episode": "7",
    "episodes": [
        7
    ],
    "coldOpens": [
        "Michael wears his casual jeans around the office and Ryan is forced to dry clean them. "
    ],
    "storylines": [
        "Michael and Jan take a client to Chili's for an important meeting. Jan is disgusted with Michael's antics and general refusal to talk business but discovers at the end of the day that there is a method to his madness when the client bonds with Michael, allowing him to close the deal. Afterwards in the parking lot, Michael and recently-divorced Jan share a kiss.",
        "Meanwhile, Pam finds a screenplay written by Michael, and Jim leads the office staff in a table read of the script. An editing error in the script reveals that Michael based the incompetent sidekick on Dwight, who quickly shuts down the exercise to invite everyone to set off fireworks outside. Jim and Pam break off their respective evening plans to enjoy an impromptu dinner on the roof and watch the firework show, followed by swaying to music on his iPod. The next day, Jim makes a joke about their \"first date\", and Pam is too quick to tell him bluntly it was not a date, and that swaying is not dancing. Jim makes a snide comment about Roy and Pam's first date, at which he left her at a hockey game. Pam is offended by his comment and walks away.",
        "The following morning, Dwight (who has slept in the office) and Angela independently observe Jan returning to her car (still parked at Dunder Mifflin), and word quickly travels around the office. Michael initially tells the documentary crew that \"nothing happened,\" that they talked for several hours before falling asleep, but his story gradually changes to imply that they did more than just talk. Jan calls, clearly regretful for what she did the previous evening, but Michael refuses to accept her change of heart."
    ],
    "quotes": [
        [
            {
                "speaker": "Michael",
                "content": " Jan Levinson-Gould. Jan is cold. If she was sitting across from you on a train and she wasn't moving, you might think she was dead."
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " Did somebody say \"baby back ribs\"? Hmmm? Hmmmmm?"
            }
        ],
        [
            {
                "speaker": "Jan",
                "content": " I don't think Christian has time for that."
            }
        ],
        [
            {
                "speaker": "Christian",
                "content": " I have time."
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " [singing] I want my baby back, baby back, baby back [Christian laughs]"
            }
        ],
        [
            {
                "speaker": "Michael and Christian",
                "content": " [singing] I want my baby back, baby back, baby back-"
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " [singing] Chili's baby back ribs... "
            }
        ]
    ]
}