{
    "season": 2,
    "title": "Performance Review",
    "episode": "8",
    "episodes": [
        8
    ],
    "coldOpens": [
        "Dwight tells Jim about his yoga ball and Jim then pops it with a pair of scissors. "
    ],
    "storylines": [
        "Michael gets a call from Jan who will be coming down to Scranton to do his performance review. She explains that there will be no other topics of discussion. Michael tells the camera that he and Jan mutually agreed that their relationship will remain professional.",
        "In the meantime, it's everyone else's performance review time, as well. Dwight tries to convince Jim to tell Michael that they should sell more of a product they don't sell at all. Jim won't fall for it and irritates Dwight by telling him he's going to ask for a pay decrease instead of a raise. Then, after hearing Dwight inadvertently mess up the day, Jim decides to spend the rest of the day convincing him it's Friday instead of Thursday.",
        "Michael plays back Jan's message during Pam's review, asking her opinion. Pam starts to explain that she believes Jan means she didn't want to talk about anything else. Michael feels bummed and decides to proceed with her review. Not wanting his bad mood to affect her salary, Pam quickly backpedals to state that she believes Jan is conflicted because they work together and doesn't want her relationship with Michael to be awkward.",
        "Stanley recommends that Michael focus on Jan's pauses as many women say more in their pauses. He even agrees that he learned all this wisdom \"on the ghetto\". He tells the camera this is all about his bonus.",
        "Jan calls back in response to Michael's many calls, interrupting Angela's highly-anticipated review. He tells her he needs closure on their relationship. She is adamant that they are not going to discuss anything else at their meeting. Michael realizes he needs more help so he asks Pam to get the suggestion box and get everyone in the conference room for a suggestion box meeting.",
        "Upon Jan's arrival, Michael continues to try to steer their conversation to personal issues. He can't seem to understand that her duties as his supervisor do not constitute a personal interest in him. Pam tells him that the employees are gathered for the suggestion box meeting. Jan decides to sit in on it.",
        "The suggestion box has clearly not been emptied in years. One question is about preparation for Y2K. Another appeal for mental health support is nixed when it's revealed that it was submitted by Tom, a former employee who left about a year ago. Phyllis mimes shooting oneself.",
        "Michael is particularly dismissive of the suggestions, especially when they become personal. He gets into rude arguments with some of the employees when they try to explain. He lectures them about how they don't want to have to do this tomorrow. Dwight agrees. After all, they don't want to come in on Saturday. Michael starts to wonder at that, then pulls another suggestion: Michael shouldn't sleep with his boss.",
        "Jan pulls Michael to his office where she can't understand what she has to do to convince him that they have no personal relationship. Dwight bursts in for his performance review, revealing that he takes no sick time and shows up on weekends and holidays using a copy of the building key. Jan expresses her concern that this is a serious offense. When Dwight insists on pitching himself, Jan takes a few minutes out in the hallway, refuses to answer the camera crew's questions, but does ask for a light for her cigarette.",
        "Finally, Jan emerges to tell Michael she's leaving. She and Alan, Dunder-Mifflin's CFO, will do Michael's performance review tomorrow by phone. Michael races to the elevator to try to get an understanding of what's happening. Jan explains in no uncertain terms that they are not in a relationship. Michael was very nice that evening after the Chili's meeting, letting her cry and encouraging her during this vulnerable time after her divorce, but that's all it was. She has no romantic feelings towards him. It's got nothing to do with his looks, but his personality is selfish and rude and annoying.",
        "Now that Michael knows it's not his looks, he's much happier. He tells the camera that Jan isn't ready for a relationship right now...still completely missing the point.",
        "The next day, Michael wanders into the sales department and asks where Dwight is. Jim hasn't seen him. Michael wanders off muttering about Dwight's claim to never miss work. Outside, Dwight, having realized it's not Saturday, after all, races inside, yelling his apologies."
    ],
    "quotes": [
        [
            {
                "speaker": "Angela",
                "content": " I actually look forward to performance reviews. I did the youth beauty pageant circuit. And I enjoyed that quite a bit. I really enjoy being judged. I believe I hold up very well to even severe scrutiny."
            }
        ],
        [
            {
                "speaker": "Pam",
                "content": " It's performance review day, company-wide. Last year, my performance review started with Michael asking me what my hopes and dreams were, and it ended with him telling me he could bench-press 190 pounds. So, I don't really know what to expect."
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " Let's keep going. Keep it going. Yep. What do we have here? We have somebody's piece of gum. Somebody put a piece of gum in there. This is not a, a garbage can, this is the future of our company. This is not a place for gum. I don't wanna have to read these tomorrow."
            },
            {
                "speaker": "Dwight",
                "content": " Yeah, who wants to come in on a Saturday?"
            },
            {
                "speaker": "Michael",
                "content": " Yeah, what? Uh, alright, next suggestion."
            },
            {
                "speaker": "Dwight",
                "content": " Next suggestion."
            },
            {
                "speaker": "Michael",
                "content": " \"Don't sl-\", ok, that's blank [Dwight picks up note] Don't, just put it-"
            },
            {
                "speaker": "Dwight",
                "content": " \"Don't sleep with your boss\"? Do you think this is referring to you boning Jan?"
            }
        ]
    ]
}