{
    "season": 2,
    "title": "Email Surveillance",
    "episode": "9",
    "episodes": [
        9
    ],
    "coldOpens": [
        "Michael freaks when he sees a man with a turban approach his office. He makes everyone cut off the lights and go silent. He later says, \"The IT tech guy and me did not get off to a great start.\""
    ],
    "storylines": [
        "Michael spies the IT guy walking across the parking lot and quickly runs into the office, (assuming that he's a terrorist) telling everyone to get down and be quiet. He turns out the light and their cover is blown by Kevin, who asks Michael questions. Michael explains that he and the IT guy, Sadiq, did not get off to a good start.",
        "Sadiq is setting up an email surveillance program so that employee emails can be monitored. Michael goes through a few and discovers that all the employees except for him have been invited to a BBQ at Jim's place.",
        "The employees learn that their emails will be monitored. After Pam overhears Dwight and Angela discussing deleting sensitive emails, she wonders if they are in a relationship.",
        "No one will admit to Michael that they are going to a party. Jim doesn't want Michael there because he wants the employees to feel free to have fun. Besides, his roommate doesn't believe Dwight actually exists. To get Dwight to stay quiet, he claimed the party was actually a surprise party for Michael.",
        "Finally, Michael decides he is just going to go to his Improv class. Michael's not very good at Improv. He repeatedly ruins his classmates' scenes by resorting to his sole character: a gun-wielding action hero. The teacher is unable to get him to cooperate. When the class goes to dinner together after their session, they do not include Michael. Instead, he crashes Jim's party.",
        "At the party, Jim conducts a tour of his house, and finds a distracted Pam in his bedroom. She looks at his yearbook, calling him dorky. Kelly doesn't want to talk about work. Angela is disgusted because Jim has offered no vegetarian food. Pam asks Phyllis if she knows of any office romances. Phyllis immediately asks if she's talking about herself and Jim. Stunned, Pam backs off.",
        "She tells the camera that, sometimes, people can just be friends and it doesn't mean there's anything else there. It's best not to make assumptions. She doesn't see Dwight's sandals intertwined with Angela's shoes in the background where they're clearly making out.",
        "When Michael arrives, Jim joins him in Karaoke."
    ],
    "quotes": [
        [
            {
                "speaker": "Pam",
                "content": " It's like squishing a spider under a book...It's gonna be really gross, but I have to look and make sure it's really dead...So, if you guys see anything..."
            }
        ],
        [
            {
                "speaker": "Dwight",
                "content": " I think one of the greatest things about modern America is the computerization of medical records. As a volunteer sheriff, I can look up anyone's psychiatric records or surgical histories. Yeast infections. There are a huge number of yeast infections in this county. Probably because we are down river from that old bread factory."
            }
        ],
        [
            {
                "speaker": "Jim",
                "content": " It's true - I'm having a party. I've got three cases of imported beer, a karaoke machine, and I didn't invite Michael...so, three ingredients for a great party. And it's nothing personal - I just think that, if he were there, people wouldn't be able to relax, you know, have fun - and my roommate wants to meet everybody, because I'm...pretty sure he thinks I'm making Dwight up...He is very real!"
            }
        ]
    ]
}