{
    "season": 2,
    "title": "Email Surveillance",
    "episode": "9",
    "episodes": [
        9
    ],
    "episodeDetails": {
        "sections": [
            {
                "title": "Email Surveillance",
                "level": 1,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "\"Email Surveillance\" is the ninth episode of the second season of The Office and the 15th overall. It was written by Jennifer Celotta and directed by Paul Feig. It first aired on November 22, 2005 and was viewed by 8.1 million people."
                    }
                ],
                "images": []
            },
            {
                "title": "Summary",
                "level": 2,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Michael spies the IT guy walking across the parking lot and quickly runs into the office, (assuming that he's a terrorist) telling everyone to get down and be quiet. He turns out the light and their cover is blown by Kevin, who asks Michael questions. Michael explains that he and the IT guy, Sadiq, did not get off to a good start."
                    },
                    {
                        "type": "paragraph",
                        "text": "Sadiq is setting up an email surveillance program so that employee emails can be monitored. Michael goes through a few and discovers that all the employees except for him have been invited to a BBQ at Jim's place."
                    },
                    {
                        "type": "paragraph",
                        "text": "The employees learn that their emails will be monitored. After Pam overhears Dwight and Angela discussing deleting sensitive emails, she wonders if they are in a relationship."
                    },
                    {
                        "type": "paragraph",
                        "text": "No one will admit to Michael that they are going to a party. Jim doesn't want Michael there because he wants the employees to feel free to have fun. Besides, his roommate doesn't believe Dwight actually exists. To get Dwight to stay quiet, he claimed the party was actually a surprise party for Michael."
                    },
                    {
                        "type": "paragraph",
                        "text": "Finally, Michael decides he is just going to go to his Improv class. Michael's not very good at Improv. He repeatedly ruins his classmates' scenes by resorting to his sole character: a gun-wielding action hero. The teacher is unable to get him to cooperate. When the class goes to dinner together after their session, they do not include Michael. Instead, he crashes Jim's party."
                    },
                    {
                        "type": "paragraph",
                        "text": "At the party, Jim conducts a tour of his house, and finds a distracted Pam in his bedroom. She looks at his yearbook, calling him dorky. Kelly doesn't want to talk about work. Angela is disgusted because Jim has offered no vegetarian food. Pam asks Phyllis if she knows of any office romances. Phyllis immediately asks if she's talking about herself and Jim. Stunned, Pam backs off."
                    },
                    {
                        "type": "paragraph",
                        "text": "She tells the camera that, sometimes, people can just be friends and it doesn't mean there's anything else there. It's best not to make assumptions. She doesn't see Dwight's sandals intertwined with Angela's shoes in the background where they're clearly making out."
                    },
                    {
                        "type": "paragraph",
                        "text": "When Michael arrives, Jim joins him in Karaoke."
                    }
                ],
                "images": []
            },
            {
                "title": "Trivia",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "When Jim and Pam are speaking in Jim's room at the BBQ, the video game Call of Duty: United Offensive, an expansion pack to Call of Duty, lies on Jim's desk. (It is best visible when Pam is looking at Jim's yearbook.) Toby plays the Xbox 360 version of Call of Duty 2, at 20:08 there is a clear shot of a WWII-era sniper rifle on each split section of the screen. Call of Duty plays a more prominent role in the third season episode \"The Coup\".",
                                "elements": []
                            },
                            {
                                "text": "When Michael is reading Jim's invitation, the date on the e-mail for the party is November 5, 2005, which was a Saturday, even though this episode takes place on a Friday. It was likely an error by the production staff or a liberty taken by the writers. This places this episode on November 4 or 5, 2005, depending on which of those scenarios is correct.",
                                "elements": []
                            },
                            {
                                "text": "One of Michael's improv partners is Ken Jeong who we have more recently seen in Community and The Hangover as Mr. Chow.",
                                "elements": []
                            },
                            {
                                "text": "When a cameraman helps Pam figure out if Dwight and Angela are secretly dating, it becomes the first time, and the only time until season 9, that the documentary crew bears a direct impact on the plot.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Deleted scenes",
                "level": 2,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Notable cut scenes include:"
                    },
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Michael tries to eliminate wasted e-mail space on computers, specifically by suggesting that Jim cancel a charge from Amazon rather than continue to contact them regarding an undelivered CD.",
                                "elements": []
                            },
                            {
                                "text": "Michael and Mary Beth argue following their improv scene",
                                "elements": []
                            },
                            {
                                "text": "Michael makes suggestions for an improv scene despite being asked not to.",
                                "elements": []
                            },
                            {
                                "text": "Kevin's mocking of Ryan by calling him the \"Fire Guy\" during grilling is taken to an obnoxious level.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Analysis",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Michael explains that he and Sadiq, the IT guy, \"did not get off to a great start,\" indicating that the two had never met before. Nevertheless, Sadiq attends Jim's barbecue, either an indication that Jim is quick to make friends or that Michael does not pay attention to the IT employees, as is brought up in later episodes.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Amusing details",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Michael arrives just as Kevin sings, \"Just turn around now, 'cause you're not welcome any more.\"",
                                "elements": []
                            }
                        ]
                    },
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Tacked to the cork board above Jim's desk at home is what appears to be a tiny doll dressed as a Dunder Mifflin warehouse employee hanging from a noose. Maybe Roy?",
                                "elements": []
                            },
                            {
                                "text": "The shirt that Creed is wearing in the background at Jim's party when Pam asks Phyllis about any possible office romances, is the same shirt he gives to Jim as Jim's Secret Santa in the following episode 'Christmas Party'.",
                                "elements": []
                            },
                            {
                                "text": "When Jim and Michael are singing Islands in the Stream, Jim winks at Pam during the part, \"Makin' love with each other.\"",
                                "elements": []
                            }
                        ]
                    },
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "The Directors make a point to show Dwight and Angela's shoes at Jim's BBQ, He shows off his Birkenstock, Angela says she got sap on her shoes and the camera pans down and shows her shoes. later in the episode the camera shows both of their feet together implying they are kissing or having sex. And we know it's them because we have seen their shoes earlier in the episode.",
                                "elements": []
                            },
                            {
                                "text": "\"Michael Scarn\" is Michael's ficticious Secret Agent character who appears in his movie, Threat Level Midnight.",
                                "elements": []
                            },
                            {
                                "text": "Even the IT Tech guy was invited to the party.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Goofs",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "In Meredith's e-vite that Michael opens, the \"Yes\" list says 14, but only 10 names are listed. When Michael reads off the names of attendees, he does not say (and the screen does not show) Joe, Mike and Matt - who all appeared the first time the e-vite was shown. This further reduces the \"Yes\" confirmations to 7.",
                                "elements": []
                            },
                            {
                                "text": "When Michael asks Dwight about his evening plans, Dwight's coat collar changes from flipped up to folded down.",
                                "elements": []
                            },
                            {
                                "text": "When Michael leaves the improv class, he does not wear a necktie, but he has one on when he arrives at Jim's party. It seems unlikely that he would put on a necktie to go to Jim's party, so this is probably a continuity error.",
                                "elements": []
                            },
                            {
                                "text": "The set decorators used the same poster in Jim's room and along the staircase.",
                                "elements": []
                            },
                            {
                                "text": "Michael mentions eating ramen noodles in college, but he never went to college. This may just be Michael lying, but in other episodes he seems more open about his lack of post-secondary education.",
                                "elements": []
                            },
                            {
                                "text": "A copy of Call of Duty is seen on Jim's desk at home. However, in \"The Coup,\" Jim indicates that he has never played the game before.",
                                "elements": []
                            },
                            {
                                "text": "We see a Guitar in Jim's room, and later in local ad (season 4 ep 5) Jim makes a Second Life account where he has a guitar slung across his back. When Pam said \"I did not know you played guitar\", he quickly changes the subject. Does Jim want to play guitar and never got around to it, or is he just embarrassed to let anyone know he plays guitar because he makes himself out to be a sports kind of guy?",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Cultural references",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Michael says Oil can in an impression of the Tin Man character from the movie The Wonderful Wizard of Oz.",
                                "elements": []
                            },
                            {
                                "text": "Big Brother is the personification of the surveillance state in George Orwell's dystopia 1984. Also from 1984, the direct quote \"I love Big Brother\"",
                                "elements": []
                            },
                            {
                                "text": "Battlestar Galactica is a science fiction television program.",
                                "elements": []
                            },
                            {
                                "text": "Michael shouts, Oooh, ooh, Mr. Kotter! in imitation of the character Horshack from the 1970s television comedy Welcome Back, Kotter.",
                                "elements": []
                            },
                            {
                                "text": "Bernie's Tavern is a pub in Scranton.",
                                "elements": []
                            },
                            {
                                "text": "Dale Earnhardt was an American race car driver.",
                                "elements": []
                            },
                            {
                                "text": "Amazon.com is a large Internet retailer.",
                                "elements": []
                            },
                            {
                                "text": "Cup Noodles or Cup of Noodles is a brand of instant, microwaveable ramen noodles.",
                                "elements": []
                            },
                            {
                                "text": "An e-vite is a form of invitation distributed by email.",
                                "elements": []
                            },
                            {
                                "text": "Michael says \"You too, Dwight?\" which could be a reference to Shakespeare's Julius Caesar and the famous quote, \"Et tu, Brute?\" as Michael's most loyal companion, Dwight, betrays him just as Brutus betrayed Caesar. Another Julius Caesar reference is made in \"Special Project.\"",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Cast",
                "level": 2,
                "content": [],
                "images": []
            },
            {
                "title": "Main cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Steve Carell as Michael Scott",
                                "elements": []
                            },
                            {
                                "text": "Rainn Wilson as Dwight Schrute",
                                "elements": []
                            },
                            {
                                "text": "John Krasinski as Jim Halpert",
                                "elements": []
                            },
                            {
                                "text": "Jenna Fischer as Pam Beesly",
                                "elements": []
                            },
                            {
                                "text": "B.J. Novak as Ryan Howard",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Recurring cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Leslie David Baker as Stanley Hudson",
                                "elements": []
                            },
                            {
                                "text": "Brian Baumgartner as Kevin Malone",
                                "elements": []
                            },
                            {
                                "text": "Kate Flannery as Meredith Palmer",
                                "elements": []
                            },
                            {
                                "text": "Mindy Kaling as Kelly Kapoor",
                                "elements": []
                            },
                            {
                                "text": "Angela Kinsey as Angela Martin",
                                "elements": []
                            },
                            {
                                "text": "Paul Lieberstein as Toby Flenderson",
                                "elements": []
                            },
                            {
                                "text": "Oscar Nunez as Oscar Martinez",
                                "elements": []
                            },
                            {
                                "text": "Phyllis Smith as Phyllis Lapin",
                                "elements": []
                            },
                            {
                                "text": "Creed Bratton (actor) as Creed Bratton (Uncredited)",
                                "elements": []
                            },
                            {
                                "text": "Omi Vaidya as Sadiq",
                                "elements": []
                            },
                            {
                                "text": "Trish Gates as Stacy",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Guest cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Jeffrey Muller as Mark",
                                "elements": []
                            },
                            {
                                "text": "Michael Naughton as Chris",
                                "elements": []
                            },
                            {
                                "text": "Jonathan Browning as Steve",
                                "elements": []
                            },
                            {
                                "text": "Ken Jeong as Bill",
                                "elements": []
                            },
                            {
                                "text": "Colleen Smith as Stephanie",
                                "elements": []
                            },
                            {
                                "text": "Anderson Reid as Dave",
                                "elements": []
                            },
                            {
                                "text": "Nikki McCauley",
                                "elements": []
                            },
                            {
                                "text": "Dee Ryan",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            }
        ]
    },
    "quotesDetails": {
        "sections": [
            {
                "title": "Email Surveillance Quotes",
                "level": 1,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Pam: It's like squishing a spider under a book...It's gonna be really gross, but I have to look and make sure it's really dead...So, if you guys see anything..."
                    },
                    {
                        "type": "paragraph",
                        "text": "Dwight: I think one of the greatest things about modern America is the computerization of medical records. As a volunteer sheriff, I can look up anyone's psychiatric records or surgical histories. Yeast infections. There are a huge number of yeast infections in this county. Probably because we are down river from that old bread factory."
                    },
                    {
                        "type": "paragraph",
                        "text": "Jim: It's true - I'm having a party. I've got three cases of imported beer, a karaoke machine, and I didn't invite Michael...so, three ingredients for a great party. And it's nothing personal - I just think that, if he were there, people wouldn't be able to relax, you know, have fun - and my roommate wants to meet everybody, because I'm...pretty sure he thinks I'm making Dwight up...He is very real!"
                    }
                ],
                "images": []
            }
        ]
    },
    "coldOpens": [
        "Michael freaks when he sees a man with a turban approach his office. He makes everyone cut off the lights and go silent. He later says, \"The IT tech guy and me did not get off to a great start.\""
    ],
    "storylines": [
        "Michael spies the IT guy walking across the parking lot and quickly runs into the office, (assuming that he's a terrorist) telling everyone to get down and be quiet. He turns out the light and their cover is blown by Kevin, who asks Michael questions. Michael explains that he and the IT guy, Sadiq, did not get off to a good start.",
        "Sadiq is setting up an email surveillance program so that employee emails can be monitored. Michael goes through a few and discovers that all the employees except for him have been invited to a BBQ at Jim's place.",
        "The employees learn that their emails will be monitored. After Pam overhears Dwight and Angela discussing deleting sensitive emails, she wonders if they are in a relationship.",
        "No one will admit to Michael that they are going to a party. Jim doesn't want Michael there because he wants the employees to feel free to have fun. Besides, his roommate doesn't believe Dwight actually exists. To get Dwight to stay quiet, he claimed the party was actually a surprise party for Michael.",
        "Finally, Michael decides he is just going to go to his Improv class. Michael's not very good at Improv. He repeatedly ruins his classmates' scenes by resorting to his sole character: a gun-wielding action hero. The teacher is unable to get him to cooperate. When the class goes to dinner together after their session, they do not include Michael. Instead, he crashes Jim's party.",
        "At the party, Jim conducts a tour of his house, and finds a distracted Pam in his bedroom. She looks at his yearbook, calling him dorky. Kelly doesn't want to talk about work. Angela is disgusted because Jim has offered no vegetarian food. Pam asks Phyllis if she knows of any office romances. Phyllis immediately asks if she's talking about herself and Jim. Stunned, Pam backs off.",
        "She tells the camera that, sometimes, people can just be friends and it doesn't mean there's anything else there. It's best not to make assumptions. She doesn't see Dwight's sandals intertwined with Angela's shoes in the background where they're clearly making out.",
        "When Michael arrives, Jim joins him in Karaoke."
    ],
    "quotes": [
        "Pam: It's like squishing a spider under a book...It's gonna be really gross, but I have to look and make sure it's really dead...So, if you guys see anything...",
        "Dwight: I think one of the greatest things about modern America is the computerization of medical records. As a volunteer sheriff, I can look up anyone's psychiatric records or surgical histories. Yeast infections. There are a huge number of yeast infections in this county. Probably because we are down river from that old bread factory.",
        "Jim: It's true - I'm having a party. I've got three cases of imported beer, a karaoke machine, and I didn't invite Michael...so, three ingredients for a great party. And it's nothing personal - I just think that, if he were there, people wouldn't be able to relax, you know, have fun - and my roommate wants to meet everybody, because I'm...pretty sure he thinks I'm making Dwight up...He is very real!"
    ]
}