{
    "season": 3,
    "title": "Cocktails",
    "episode": "17",
    "episodes": [
        17
    ],
    "coldOpens": [
        "Michael traps himself in chains and drops the key, but before he asked no one to help him. He can't get out. "
    ],
    "storylines": [
        "Before heading to the cocktail party, Michael decides to show off some trickery he learned at Magic Camp. His straitjacket escape ends with him on the floor of his office, squirming in an attempt to get free.",
        "Jan and Michael decide to reveal their relationship and go to the party as a couple. Jan reveals her lust for Michael over the phone, unaware that she is being heard by Dwight over the speakerphone. She makes Michael sign a \"love contract\" to keep their relationship from causing legal problems, and a very awkward night ensues. Jim, Karen, and Dwight also attend the party and Dwight spends the evening searching for flaws in the CFO's colonial house.",
        "The other office members go to Poor Richard's for happy hour. Roy tells Pam that he can't go because he is getting hammered with his brother, who is upset over money lost on some sold Jet Skis. Pam explains that they're going to a bar, and he must do more \"boyfriend\" things if he wants their relationship to last. He shows up at the bar to Pam's delight.",
        "At the party, Karen points out her ex-boyfriend to Jim. Dwight continues his inspection of the house checking for studs, testing smoke alarms, and questioning the CFO's son about a wooden chair.",
        "After becoming upset with Michael, Jan pulls him into a bathroom to \"satisfy her cravings,\" but Michael says she is behaving inappropriately. Jan gives up and storms out. Meanwhile, Karen points out a few more old boyfriends to Jim who is becoming concerned about Karen's past.",
        "At the bar, Pam shows off her new assertiveness when she tells the bartender about a mistake in the order. After being greeted warmly by five guests who look awfully young to be at a bar (which Oscar clearly notices), Creed explains his side job as a fake ID dealer, using a laminating machine stolen from the Sheriff's Department.",
        "Jim, who is becoming exceedingly bored, is finally saved by CFO David Wallace who asks him to come outside and shoot hoops. When Karen explains her past relationship with David, Jim finally becomes upset. Karen starts to giggle and reveals her prank to Jim who finds it amusing.",
        "At Poor Richard's Pam decides she needs to come clean with Roy if they are going to \"make it.\" When she starts to tell him about the casino night kiss with Jim he gets extremely angry and throws his glass against the wall. Pam leaves after telling Roy that the relationship is over, and Roy proceeds to trash the bar with his brother in an uncontrolled rage.",
        "On the ride back, Michael becomes upset when Jan reveals her reservations about their public relationship. When Michael begins to cry, Jan calms him by saying that she didn't mean it. Dwight pops up from the back seat to show his support for the couple.",
        "The episode ends on a tense note when Roy tells his brother, \"I'm going to kill Jim Halpert.\""
    ]
}