{
    "season": 3,
    "title": "Ben Franklin",
    "episode": "14",
    "episodes": [
        14
    ],
    "coldOpens": [
        "Michael makes a tape for his future son which Dwight tapes. When Michael needs to take off a bra, he asks Pam if she wants to, but does it to Dwight. Dwight suggests that Michael dies because his future son kills him. "
    ],
    "storylines": [
        "Michael films a video to be presented in the event of his death to his future unborn son. Dwight undermines Michael's efforts. Michael has planned two separate parties for Phyllis and Bob Vance. Michael announces Phyllis' wedding in six days, and declares that he is \"instituting Prima Nocta.\" Jim remembers the term from the movie Braveheart and confirms the real meaning of Michael's confusing statement using Wikipedia, revealing that it refers to the ancient custom of the king to deflower every bride in his kingdom on her wedding night. Michael apologizes for making the statement.",
        "Pam notices that Jim is tired, and Jim states in a talking-head interview that Karen and he have been talking over their relationship for the past five nights. In an odd conversation in the breakroom Pam tries to find out from Jim what's going on with Karen, and he confesses they've been staying up late talking. Having nothing else to say, she makes awkward, repeated suggestions that he catch up on his sleep. After Jim leaves, Pam chides herself for flirting so badly.",
        "Todd Packer arrives and, true to form, makes tasteless jokes about his belief that Jim is gay. Encountering Karen for the first time (and leering at her), he is shocked to learn that she is Jim's girlfriend. Packer is incensed that Michael has not hired a stripper for the bachelor party. Michael says he can't for fear of sexual harassment claims, but Packer convinces him that if he gets a male stripper for Phyllis's party, too, this will make everything all okay. (\"Separate but equal,\" says Packer confidently, and Michael thanks him for explaining the meaning of the term.)",
        "Michael delegates the work of finding the two strippers to Dwight and Jim. While Dwight successfully locates a stripper for Bob Vance's party, Jim decides to undermine Michael's potentially disastrous plan and orders a costumed historical lecturer for the women instead.",
        "Michael and Ryan visit a sex shop. Michael is overwhelmed, and Ryan states, \"he hasn't even said a word yet... just giggling.\" Upon their return, the lecturer for the women's party arrives. He is costumed as Benjamin Franklin, and Michael, under the impression that he's a male stripper, asks if he's wearing a thong. \"Ben Franklin\" is introduced to the women (with Michael laboring under the misapprehension that Franklin was a U.S. president), and Pam and Karen have fun gently heckling the impersonator.",
        "Outside the warehouse, Michael grills steaks on the same George Foreman grill on which he once burned his foot (\"The Injury\") but tells Ryan not to worry since he has \"cleaned all the foot off of it.\" Inside, Kevin attempts to organize a game of professional poker, while Michael advertises his steaks as \"his man-meat\". Dwight enthusiastically asks for some.",
        "After joking about Ben Franklin in the breakroom, Karen tells Pam that she has heard about her past involvement with Jim. Pam is startled, and asks what she means. Karen says she knows that Pam and Jim have kissed, but it's not a big deal, as \"it's just a kiss\". Catching a look from Pam, Karen suddenly asks if she's still interested in Jim, to which Pam absently replies \"oh yeah.\" Karen is taken aback, but Pam then quickly says she misunderstood Karen's question, and awkwardly tells Karen \"You should go out with Jim—you are going out with Jim. You're a great couple.\"",
        "The female stripper arrives, dressed as an office secretary. Roy claims in a talking-head that's he's \"not really into strippers,\" and that he instead finds Pam's art sexy. When groom-to-be Bob Vance refuses a lap-dance, Michael volunteers. The dance proceeds for a few seconds before Michael suddenly remembers he has a girlfriend and abruptly calls a halt and breaks up the party.",
        "Dwight makes the now-fully-clothed stripper, Elizabeth, answer phone calls in the office, because he has already paid her for three hours of work. She compliments a clearly distressed Angela about the baby poster she received in \"Christmas Party\".",
        "Michael goes to the stripper for advice as to whether he should tell Jan about his lap-dance. She replies, \"secret secrets are no fun, secret secrets hurt someone.\" Dwight claims that he is ninety-nine percent sure that the impersonator is not the real Ben Franklin, \"no matter what Jim says!\"",
        "The Ben Franklin impersonator reveals to Pam that his real name is Gordon in an unsuccessful attempt to hit on her. He also tells Michael to keep the lap dance a secret. Michael calls him a sleazebag. He then calls Jan out of a meeting to confess to her the aborted lap dance. A frustrated Jan tells him she's closer to firing him than dumping him. Michael seems to take this as good news.",
        "Pam and Jim have an understated confrontation in the break room which ends with Pam asking Ryan to set her up with some of his business-school buddies, in front of a visibly shocked Jim. Dwight grills Ben Franklin on his revolutionary-era knowledge, and Michael reflects that Ben Franklin turned out to be a creep while the stripper turned out to give great advice... advice that rhymed."
    ],
    "quotes": [
        [
            {
                "speaker": "Roy",
                "content": " I'm not really into strippers. You know what I find sexy? Pam's art. She's an artist and I appreciate that. It's very moving and sexy. The art.."
            }
        ]
    ]
}