{
    "season": 3,
    "title": "Back From Vacation",
    "episode": "11",
    "episodes": [
        11
    ],
    "episodeDetails": {
        "sections": [
            {
                "title": "Back From Vacation",
                "level": 1,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "\"Back From Vacation\" is the eleventh episode of the third season of The Office and the 40th overall. It was written by Justin Spitzer and directed by Julian Farino. It first aired on January 4, 2007."
                    }
                ],
                "images": []
            },
            {
                "title": "Summary",
                "level": 2,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Jim leads a meeting of the sales staff while Michael is away on vacation in Jamaica. Dwight turns on a portable tape recorder, explaining that Michael instructed him to record all meetings and type up transcripts. Jim jokes loudly to the recorder that Dwight is \"completely nude and is holding a plastic knife to Stanley's neck\", over Dwight's angered protest. Phyllis and Karen join in the teasing with their own absurd statements. Andy, however, takes the joke too far by shouting, \"I am now chopping off Phyllis' head with a chainsaw!\" He meekly adds a chainsaw sound effect."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael returns from his trip to Jamaica rejuvenated, unfazed by the news that Hannah quit while he was away and filed a complaint against the company. Stanley complains to Michael that his bonus check was $100 short and refuses to do any work until he gets the missing money."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael directs the Party Planning Committee to throw a luau-themed party in the warehouse to coincide with the postponed annual inventory project that evening. The committee initially objects, protesting that there is not enough time to plan."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael attempts to impart the lessons of his vacation, displaying to the staff a photograph of a sign in Jamaica reading: \"No shirt, no shoes, no problem\". An astounded Pam notices Jan in the margins of the photo and points it out to her colleagues. Michael states to the camera that Jan didn't want anyone to know they travelled together since it may get them both in trouble. He then reveals he and Jan had an affair in Jamaica."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael attempts to send another racy vacation photograph of himself and Jan as proof of the trip to Todd Packer but instead mistakenly sends it to \"packaging\". Warehouse supervisor Darryl receives and promptly forwards the photo to several other employees, and it quickly reaches the entire office. Mortified, Michael attempts damage control, avoiding Jan's phone calls and dodging inquiries from Toby."
                    },
                    {
                        "type": "paragraph",
                        "text": "Karen has been upset with Jim because he has expressed objections to the prospect of Karen moving into an apartment two blocks away in his neighborhood. When Pam asks Jim what is wrong, Jim reveals that he and Karen have been dating for a month and argues that living on the same street might be \"a little close.\" Pam convinces Jim that he is being unreasonable, and during the luau, Jim hands Karen a piece of paper that appears to be related to the house she wanted to rent. Karen is pleased, asking Jim, \"Are you sure?\" Karen privately thanks Pam for her help."
                    },
                    {
                        "type": "paragraph",
                        "text": "Pam tells the documentary crew that she was glad to help Jim, because she likes to help her friends. During inventory, however, Dwight walks in on Pam crying in private. Though Dwight appears to have good intentions, handing Pam a handkerchief and awkwardly trying to comfort her, he mistakes Pam's crying for PMS."
                    },
                    {
                        "type": "paragraph",
                        "text": "As the luau/inventory is held, Jan arrives at the office to speak with Michael in private. Without explicitly revealing whether or not she is aware of the image being sent throughout the email system, she confesses her attraction to him against all reason. She informs Michael that on her psychiatrist's advice, she has decided to give in to her self-destructive tendencies and continue their affair. She kisses Michael and instructs him to make an excuse to leave the office party so he can meet her at his condo. In a Jerry Maguire moment, Michael, dazed and surprised at Jan's assertiveness can only utter, \"Jan, You complete me.\" Jan looks stunned for a moment, and leaves."
                    },
                    {
                        "type": "paragraph",
                        "text": "Back in the warehouse, Pam and Roy joke about their failed engagement and Kevin takes home a large poster printout of the oversized vacation photograph produced earlier by warehouse personnel, stating that he will hang it at home since he doesn't have a lot of art."
                    }
                ],
                "images": []
            },
            {
                "title": "Deleted scenes",
                "level": 2,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "The Season Three DVD contains a number of deleted scenes."
                    },
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "In a talking head interview, Pam shows some postcards from Michael's past vacations. Michael put ten dollars worth of postage on his postcard from Jamaica.",
                                "elements": []
                            },
                            {
                                "text": "The documentary crew meet Michael at the airport. Michael sings the \"Banana Boat Song\" in the car and describes events from his vacation, including buying a \"chill pill\" from a man at the beach. \"And after I finished vomiting, I was more relaxed than I've ever been.\" In that scene, the car passes the front of a business building where the company name is written on the wall in big capital letters mentioning \"California\".",
                                "elements": []
                            },
                            {
                                "text": "Dwight complains to Michael about Jim's pranks while Michael was on vacation. Michael isn't interested.",
                                "elements": []
                            },
                            {
                                "text": "Michael has gifts for people in the office. For Dwight, a \"genuine Rastafarian wig\"; for Andy, a Milli Vanilli t-shirt; for Angela, a lei; for Pam, a coconut bra; and for Stanley, he jokes that he got him some \"ganja\", although it was really coffee. Creed then offers to get Stanley some real ganja.",
                                "elements": []
                            },
                            {
                                "text": "Jim asks Michael if he is stoned. Kevin thinks Michael looks like he has the munchies in the picture. Kelly says that she does, however, and heads for chocolate wafers.",
                                "elements": []
                            },
                            {
                                "text": "Dwight admits to having taken one vacation, but never again. Jim had his desk shipped to him in Roswell.",
                                "elements": []
                            },
                            {
                                "text": "Pam requires more evidence than seeing to believe that Michael and Jan went to Jamaica.",
                                "elements": []
                            },
                            {
                                "text": "Ryan notes that Michael is into Photoshopping, and shows an altered photograph where he and Michael were \"in Egypt.\"",
                                "elements": []
                            },
                            {
                                "text": "Stanley won't give Phyllis the list of exchanges for inventory until he has received his bonus check. In a talking head, Phyllis says that she likes Stanley but isn't always sure he reciprocates, which is okay, because she doesn't really like him.",
                                "elements": []
                            },
                            {
                                "text": "Michael unsuccessfully tries to guess Jan's email password.",
                                "elements": []
                            },
                            {
                                "text": "Michael calls America Online for a \"gobbler\" that would eat up emails.",
                                "elements": []
                            },
                            {
                                "text": "Jan is asked by an unnamed colleague about her vacation. She maintains the ruse that she was in Scottsdale, unaware that the colleague has a copy of Jamaica Jan Sun Princess on his computer screen. Jan sticks to her story in a talking head interview.",
                                "elements": []
                            },
                            {
                                "text": "Meredith explains that when a woman gets older, she'll go anywhere with anyone.",
                                "elements": []
                            },
                            {
                                "text": "Angela emphasizes that one's body is a temple. \"You can't just whore it out.\"",
                                "elements": []
                            },
                            {
                                "text": "As a result of his skin cancer scare (\"Michael's Birthday\"), Kevin just hopes Jan was wearing sunscreen, although he wishes that he could rub it on her.",
                                "elements": []
                            },
                            {
                                "text": "Dwight lists advantages and disadvantages of the Internet.",
                                "elements": []
                            },
                            {
                                "text": "Dwight talks about Spiderman and the internet's abilities to spread information.",
                                "elements": []
                            },
                            {
                                "text": "The phone rings on Stanley's desk. He does a crossword instead of picking up. Karen stops the call.",
                                "elements": []
                            },
                            {
                                "text": "To help motivate inventory, Dwight announces that he has hidden a deck of cards which can be redeemed for a soft drink. Meanwhile, Jim and Ryan play cards.",
                                "elements": []
                            },
                            {
                                "text": "Pam notes that inventory luau '07 is superior to disco audit '05.",
                                "elements": []
                            },
                            {
                                "text": "Ryan mentions that they are missing seven boxes of canary yellow copier paper. Roy takes the scanner and scans the same box seven times. \"Looks good to me.\" Ryan begins to use Roy's new inventory technique.",
                                "elements": []
                            },
                            {
                                "text": "Stanley says he doesn't want to miss the show when Jan comes.",
                                "elements": []
                            },
                            {
                                "text": "Kelly sings as she does inventory. Michael wants her to stop, but she can't help herself.",
                                "elements": []
                            },
                            {
                                "text": "Dwight and Andy get into a race stacking boxes, with Jim stuck in the middle of the craziness. Upon extrication, he and Pam observe the race in amusement.",
                                "elements": []
                            },
                            {
                                "text": "To get a better look at an upper shelf, Meredith climbs on a shelf, which falls and traps her.",
                                "elements": []
                            },
                            {
                                "text": "Michael gives Stanley his bonus in the form of a $1000 Jamaican dollar-bill, and mentions that the exchange rate is 65-to-1, although he is unclear which way it converts.",
                                "elements": []
                            },
                            {
                                "text": "Toby says he lived in Honolulu for a year. Kevin says that that means he's been to a real luau. Angela says that she tried her best given the short notice.",
                                "elements": []
                            },
                            {
                                "text": "Dwight notes that Creed is one short of the black medium-ball points. Creed replaces it, having presumably stolen it. He later says once an acquaintance and he cleaned the place out. The company blamed it on some kid.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Trivia",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "As of this episode, only two people (Andy & Karen) from the Stamford branch remain at the Scranton office.",
                                "elements": []
                            },
                            {
                                "text": "Ed Helms (Andy) once again shows his musical talent, this time by learning to play the steel drum after only an hour's worth of lessons.",
                                "elements": []
                            },
                            {
                                "text": "The object that Darryl finds is an iPod dock with speakers. Presumably it was lost during \"Casino Night\" when Darryl voiced concerns about something getting stolen during the event.",
                                "elements": []
                            },
                            {
                                "text": "This is the second episode of the series where Ryan has no dialogue.",
                                "elements": []
                            },
                            {
                                "text": "Michael states that his trip to Jamaica was his first time out of the country. Presumably, his trip to Canada in \"Business Trip\" was his second.",
                                "elements": []
                            },
                            {
                                "text": "Dwight removes his jacket, as if he were to give it to Pam to comfort her, but instead ties it around his waist, saying, \"It's hot in here.\"",
                                "elements": []
                            },
                            {
                                "text": "Toby says he got the email with the photo several times, including from his ex-wife (not a Dunder-Mifflin employee, which demonstrates how far and wide the nude Jan photo spread).",
                                "elements": []
                            },
                            {
                                "text": "This is one of the several times in the series where Jan says she's visiting her sister in Scottsdale to cover something up.",
                                "elements": []
                            },
                            {
                                "text": "Kevin has a sign on the wall next to his desk saying “DON’T EAT THE YELLOW SNOW.”",
                                "elements": []
                            },
                            {
                                "text": "This is the final episode to feature background character Luanne.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Cultural references",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Jim Carrey is an actor best known for comedic roles.",
                                "elements": []
                            },
                            {
                                "text": "The Muppet Babies is a children's television program featuring characters from \"The Muppet Show\" (including Animal) as babies.",
                                "elements": []
                            },
                            {
                                "text": "Hey mon is a stereotypical Jamaican greeting.",
                                "elements": []
                            },
                            {
                                "text": "The Cayman Islands is an island nation in the Caribbean. Many businesses are formally incorporated there due to its low taxes and light government regulation.",
                                "elements": []
                            },
                            {
                                "text": "A luau is a Hawaiian (not Jamaican) feast.",
                                "elements": []
                            },
                            {
                                "text": "The sign No shirt, no shoes, no problem is a play on the sign \"No shirt, no shoes, no service\" commonly seen in United States restaurants. Many health codes require shirts and shoes to be worn in food establishments. There happens to be a song titled No Shoes, No Shirt, No Problems, but the similarity is most likely just a coincidence.",
                                "elements": []
                            },
                            {
                                "text": "Todd Packer was in Hot-lanta, a nickname for Atlanta, Georgia.",
                                "elements": []
                            },
                            {
                                "text": "Montego Bay is a resort in Jamaica.",
                                "elements": []
                            },
                            {
                                "text": "Ice queen is a pejorative term for an attractive woman who rejects sexual advances.",
                                "elements": []
                            },
                            {
                                "text": "Maxim is a men's magazine.",
                                "elements": []
                            },
                            {
                                "text": "Booty is slang for the buttocks. To hit it is slang for \"to have sex with that person\".",
                                "elements": []
                            },
                            {
                                "text": "PG-13 is a movie rating in the United States. PG-13-rated movies are not recommended for viewers under age 13.",
                                "elements": []
                            },
                            {
                                "text": "A T1 line is a type of broadband Internet connection.",
                                "elements": []
                            },
                            {
                                "text": "The Day's Inn is a chain of budget hotels.",
                                "elements": []
                            },
                            {
                                "text": "PMS (known as PMT in British English) is short for \"Premenstrual syndrome\", a collection of adverse symptoms tied to a woman's menstrual cycle.",
                                "elements": []
                            },
                            {
                                "text": "Scottsdale is a city in Arizona. The climate there is hot and arid.",
                                "elements": []
                            },
                            {
                                "text": "Identity theft is a crime wherein someone obtains enough information about the victim to be able to impersonate them. The motive can vary, but financial fraud is a common reason.",
                                "elements": []
                            },
                            {
                                "text": "You complete me is a line from the climactic moment of the film Jerry Maguire.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Cast",
                "level": 2,
                "content": [],
                "images": []
            },
            {
                "title": "Main Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Steve Carell as Michael Scott",
                                "elements": []
                            },
                            {
                                "text": "Rainn Wilson as Dwight Schrute",
                                "elements": []
                            },
                            {
                                "text": "John Krasinski as Jim Halpert",
                                "elements": []
                            },
                            {
                                "text": "Jenna Fischer as Pam Beesly",
                                "elements": []
                            },
                            {
                                "text": "B.J. Novak as Ryan Howard",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Supporting Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Melora Hardin as Jan Levinson",
                                "elements": []
                            },
                            {
                                "text": "David Denman as Roy Anderson",
                                "elements": []
                            },
                            {
                                "text": "Leslie David Baker as Stanley Hudson",
                                "elements": []
                            },
                            {
                                "text": "Brian Baumgartner as Kevin Malone",
                                "elements": []
                            },
                            {
                                "text": "Kate Flannery as Meredith Palmer",
                                "elements": []
                            },
                            {
                                "text": "Mindy Kaling as Kelly Kapoor",
                                "elements": []
                            },
                            {
                                "text": "Angela Kinsey as Angela Martin",
                                "elements": []
                            },
                            {
                                "text": "Paul Lieberstein as Toby Flenderson",
                                "elements": []
                            },
                            {
                                "text": "Phyllis Smith as Phyllis Lapin",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Recurring Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Ed Helms as Andy Bernard",
                                "elements": []
                            },
                            {
                                "text": "Rashida Jones as Karen Filippelli",
                                "elements": []
                            },
                            {
                                "text": "Creed Bratton (actor) as Creed Bratton",
                                "elements": []
                            },
                            {
                                "text": "Craig Robinson as Darryl Philbin",
                                "elements": []
                            },
                            {
                                "text": "David Koechner as Todd Packer (Voice Only)",
                                "elements": []
                            },
                            {
                                "text": "Calvin Tenner as Calvin (Uncredited)",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "References",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "↑ Sparano, John. January 4, 2007. blog.myspace.com/index.cfm?fuseaction=blog.view&friendID=102409815&blogID=213736679 \"Back From Vacation\", MySpace.com",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            }
        ]
    },
    "quotesDetails": {
        "sections": [
            {
                "title": "Back From Vacation Quotes",
                "level": 1,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Karen: I still haven't found an apartment yet. I'm living in a hotel. Yesterday, I saw a \"for rent\" sign down the street from Jim and he said he didn't think it'd be such a good idea. He said it would be like we were living together. In different houses. Two blocks away."
                    },
                    {
                        "type": "paragraph",
                        "text": "Kevin: What am I going to do? [Refers to a large pictures of Jan and Michael] I'm gonna hang it up at home. I don't have a lot of art. [smirks]"
                    }
                ],
                "images": []
            }
        ]
    },
    "coldOpens": [
        "The salespeople make fun of Dwight when they are forced to record their meeting for Michael, who is on vacation. It ends up with Andy making a stupid remark of Dwight cutting Phyllis' head off. "
    ],
    "storylines": [
        "Jim leads a meeting of the sales staff while Michael is away on vacation in Jamaica. Dwight turns on a portable tape recorder, explaining that Michael instructed him to record all meetings and type up transcripts. Jim jokes loudly to the recorder that Dwight is \"completely nude and is holding a plastic knife to Stanley's neck\", over Dwight's angered protest. Phyllis and Karen join in the teasing with their own absurd statements. Andy, however, takes the joke too far by shouting, \"I am now chopping off Phyllis' head with a chainsaw!\" He meekly adds a chainsaw sound effect.",
        "Michael returns from his trip to Jamaica rejuvenated, unfazed by the news that Hannah quit while he was away and filed a complaint against the company. Stanley complains to Michael that his bonus check was $100 short and refuses to do any work until he gets the missing money.",
        "Michael directs the Party Planning Committee to throw a luau-themed party in the warehouse to coincide with the postponed annual inventory project that evening. The committee initially objects, protesting that there is not enough time to plan.",
        "Michael attempts to impart the lessons of his vacation, displaying to the staff a photograph of a sign in Jamaica reading: \"No shirt, no shoes, no problem\". An astounded Pam notices Jan in the margins of the photo and points it out to her colleagues. Michael states to the camera that Jan didn't want anyone to know they travelled together since it may get them both in trouble. He then reveals he and Jan had an affair in Jamaica.",
        "Michael attempts to send another racy vacation photograph of himself and Jan as proof of the trip to Todd Packer but instead mistakenly sends it to \"packaging\". Warehouse supervisor Darryl receives and promptly forwards the photo to several other employees, and it quickly reaches the entire office. Mortified, Michael attempts damage control, avoiding Jan's phone calls and dodging inquiries from Toby.",
        "Karen has been upset with Jim because he has expressed objections to the prospect of Karen moving into an apartment two blocks away in his neighborhood. When Pam asks Jim what is wrong, Jim reveals that he and Karen have been dating for a month and argues that living on the same street might be \"a little close.\" Pam convinces Jim that he is being unreasonable, and during the luau, Jim hands Karen a piece of paper that appears to be related to the house she wanted to rent. Karen is pleased, asking Jim, \"Are you sure?\" Karen privately thanks Pam for her help.",
        "Pam tells the documentary crew that she was glad to help Jim, because she likes to help her friends. During inventory, however, Dwight walks in on Pam crying in private. Though Dwight appears to have good intentions, handing Pam a handkerchief and awkwardly trying to comfort her, he mistakes Pam's crying for PMS.",
        "As the luau/inventory is held, Jan arrives at the office to speak with Michael in private. Without explicitly revealing whether or not she is aware of the image being sent throughout the email system, she confesses her attraction to him against all reason. She informs Michael that on her psychiatrist's advice, she has decided to give in to her self-destructive tendencies and continue their affair. She kisses Michael and instructs him to make an excuse to leave the office party so he can meet her at his condo. In a Jerry Maguire moment, Michael, dazed and surprised at Jan's assertiveness can only utter, \"Jan, You complete me.\" Jan looks stunned for a moment, and leaves.",
        "Back in the warehouse, Pam and Roy joke about their failed engagement and Kevin takes home a large poster printout of the oversized vacation photograph produced earlier by warehouse personnel, stating that he will hang it at home since he doesn't have a lot of art."
    ],
    "quotes": [
        "Karen: I still haven't found an apartment yet. I'm living in a hotel. Yesterday, I saw a \"for rent\" sign down the street from Jim and he said he didn't think it'd be such a good idea. He said it would be like we were living together. In different houses. Two blocks away.",
        "Kevin: What am I going to do? [Refers to a large pictures of Jan and Michael] I'm gonna hang it up at home. I don't have a lot of art. [smirks]"
    ]
}