{
    "season": 3,
    "title": "Cocktails",
    "episode": "17",
    "episodes": [
        17
    ],
    "episodeDetails": {
        "sections": [
            {
                "title": "Cocktails",
                "level": 1,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "\"Cocktails\" is the seventeenth episode of the third season of The Office and the 46th overall. It was written by Paul Lieberstein and directed by J.J. Abrams. It first aired on February 22, 2007. It was viewed by 8.3 million people."
                    }
                ],
                "images": []
            },
            {
                "title": "Synopsis",
                "level": 2,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Before heading to the cocktail party, Michael decides to show off some trickery he learned at Magic Camp. His straitjacket escape ends with him on the floor of his office, squirming in an attempt to get free."
                    },
                    {
                        "type": "paragraph",
                        "text": "Jan and Michael decide to reveal their relationship and go to the party as a couple. Jan reveals her lust for Michael over the phone, unaware that she is being heard by Dwight over the speakerphone. She makes Michael sign a \"love contract\" to keep their relationship from causing legal problems, and a very awkward night ensues. Jim, Karen, and Dwight also attend the party and Dwight spends the evening searching for flaws in the CFO's colonial house."
                    },
                    {
                        "type": "paragraph",
                        "text": "The other office members go to Poor Richard's for happy hour. Roy tells Pam that he can't go because he is getting hammered with his brother, who is upset over money lost on some sold Jet Skis. Pam explains that they're going to a bar, and he must do more \"boyfriend\" things if he wants their relationship to last. He shows up at the bar to Pam's delight."
                    },
                    {
                        "type": "paragraph",
                        "text": "At the party, Karen points out her ex-boyfriend to Jim. Dwight continues his inspection of the house checking for studs, testing smoke alarms, and questioning the CFO's son about a wooden chair."
                    },
                    {
                        "type": "paragraph",
                        "text": "After becoming upset with Michael, Jan pulls him into a bathroom to \"satisfy her cravings,\" but Michael says she is behaving inappropriately. Jan gives up and storms out. Meanwhile, Karen points out a few more old boyfriends to Jim who is becoming concerned about Karen's past."
                    },
                    {
                        "type": "paragraph",
                        "text": "At the bar, Pam shows off her new assertiveness when she tells the bartender about a mistake in the order. After being greeted warmly by five guests who look awfully young to be at a bar (which Oscar clearly notices), Creed explains his side job as a fake ID dealer, using a laminating machine stolen from the Sheriff's Department."
                    },
                    {
                        "type": "paragraph",
                        "text": "Jim, who is becoming exceedingly bored, is finally saved by CFO David Wallace who asks him to come outside and shoot hoops. When Karen explains her past relationship with David, Jim finally becomes upset. Karen starts to giggle and reveals her prank to Jim who finds it amusing."
                    },
                    {
                        "type": "paragraph",
                        "text": "At Poor Richard's Pam decides she needs to come clean with Roy if they are going to \"make it.\" When she starts to tell him about the casino night kiss with Jim he gets extremely angry and throws his glass against the wall. Pam leaves after telling Roy that the relationship is over, and Roy proceeds to trash the bar with his brother in an uncontrolled rage."
                    },
                    {
                        "type": "paragraph",
                        "text": "On the ride back, Michael becomes upset when Jan reveals her reservations about their public relationship. When Michael begins to cry, Jan calms him by saying that she didn't mean it. Dwight pops up from the back seat to show his support for the couple."
                    },
                    {
                        "type": "paragraph",
                        "text": "The episode ends on a tense note when Roy tells his brother, \"I'm going to kill Jim Halpert.\""
                    }
                ],
                "images": []
            },
            {
                "title": "Deleted scenes",
                "level": 2,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "The Season Three DVD contains a number of deleted scenes:"
                    },
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Karen explains how it is important for Jim to go to the party so the New York executives don't think everyone in Scranton is like Michael.",
                                "elements": []
                            },
                            {
                                "text": "Roy tells Pam to sign her painting of the office because it's important to know \"who paints what.\"",
                                "elements": []
                            },
                            {
                                "text": "Ryan asks Toby if he's going to Poor Richard's, Toby indicates he is not, and Ryan has not yet decided. Kelly pops her head over the partition and tells them that they are all going. After she returns to her desk, Ryan quietly asks Toby to confirm that there is a rule against dating coworkers. Toby says, \"I'm not doing your dirty work for you.\" Kelly shouts that she hears whispering.",
                                "elements": []
                            },
                            {
                                "text": "Jim advises Pam to wait until the managers have left before going to the bar. Pam mockingly replies, \"Yes, boss.\" Jim takes her response poorly.",
                                "elements": []
                            },
                            {
                                "text": "Oscar and Angela's appearance at Poor Richard's surprises Kevin, partially because Angela is a teetotaler. Oscar comments on the fatty chicken wings, and Angela agrees that \"this place is disgusting.\"",
                                "elements": []
                            },
                            {
                                "text": "The bartender greets \"Mer\" and names all the other people from the office, presumably based on Meredith's stories.",
                                "elements": []
                            },
                            {
                                "text": "While Toby attempts to win the stuffed duck, Stanley's daughter Melissa (\"Take Your Daughter to Work Day\") comes into the pub and strikes up a conversation with Ryan, who doesn't recognize her. Stanley notices and begins yelling at Ryan.",
                                "elements": []
                            },
                            {
                                "text": "Extensions of Michael's attempt to get Jim to carpool, the talking head interview with Jan, Dwight's upstairs house inspection, and his conversation with the CFO's son.",
                                "elements": []
                            },
                            {
                                "text": "In a talking head interview, Michael summarizes the day and shows his framed \"love contract.\"",
                                "elements": []
                            }
                        ]
                    },
                    {
                        "type": "paragraph",
                        "text": "NBC's Web site contains additional deleted scenes:"
                    },
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Michael again attempts to be affectionate with Jan during the party.",
                                "elements": []
                            },
                            {
                                "text": "Ryan tries to hide in the women's room but Stanley follows him in. (Extension of DVD deleted scene.)",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Trivia",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Phyllis Smith (Phyllis Vance) is credited but does not appear in this episode",
                                "elements": []
                            },
                            {
                                "text": "Owen Daniels, who plays David Wallace's son, is the son of producer Greg Daniels.[1]",
                                "elements": []
                            },
                            {
                                "text": "The CFO's house in this episode is not the same one seen in the episode \"Branch Closing\". This house has a circular drive in front, bay windows, and no relight next to the front door. The house in \"Branch Closing\" had a yard in front (no driveway), a relight on both sides of the front door, and windows flush with the front of the house.",
                                "elements": []
                            },
                            {
                                "text": "David Wallace says he was gifted a 20-year-old, single-malt scotch by Lee Iacocca. Iacocca's autobiography was ghostwritten by B.J. Novak's father, William Novak.",
                                "elements": []
                            },
                            {
                                "text": "Stanley's daughter Melissa makes her second appearance in the series appearing in a deleted scene in which she asks Ryan if she remembers him to which Ryan is scolded by Stanley once again.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Amusing details",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "When Roy goes on his rampage, Kevin has his fists up.",
                                "elements": []
                            },
                            {
                                "text": "Jan responds with \"not too good\" when Karen simply says hello, echoing her \"I'm great\" to Pam in \"Initiation\".",
                                "elements": []
                            },
                            {
                                "text": "After Jan and David go to talk, David's wife, Rachael, nearly runs into the camera.",
                                "elements": []
                            },
                            {
                                "text": "In the blooper reel, Steve Carell actually escapes the straightjacket trick.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Cultural references",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Michael misstates the adage The early bird gets the worm (Michael's Botched Phrases).",
                                "elements": []
                            },
                            {
                                "text": "A coming out party formally introduces a young woman to adult society.",
                                "elements": []
                            },
                            {
                                "text": "Poor Richard's Pub is a real pub in Scranton.",
                                "elements": []
                            },
                            {
                                "text": "Battlestar Galactica is a science fiction television program.",
                                "elements": []
                            },
                            {
                                "text": "Lee Iacocca rescued the Chrysler motor company from bankruptcy. The De Lorean automobile was produced by the De Lorean Motor Company, not Chrysler.",
                                "elements": []
                            },
                            {
                                "text": "Splenda is a brand of artificial sweetener.",
                                "elements": []
                            },
                            {
                                "text": "The game played at the bar is called Up Jenkins.",
                                "elements": []
                            },
                            {
                                "text": "Sandals is a chain of Caribbean resorts which caters to couples.",
                                "elements": []
                            },
                            {
                                "text": "No means please don't is a corruption of No means no, the catch phrase from a 1980's anti-rape awareness campaign.",
                                "elements": []
                            },
                            {
                                "text": "A house with a white picket fence is part of the idealized American dream. (Ketchup fights, on the other hand, are a Michael invention.)",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Cast",
                "level": 2,
                "content": [],
                "images": []
            },
            {
                "title": "Main Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Steve Carell as Michael Scott",
                                "elements": []
                            },
                            {
                                "text": "Rainn Wilson as Dwight Schrute",
                                "elements": []
                            },
                            {
                                "text": "John Krasinski as Jim Halpert",
                                "elements": []
                            },
                            {
                                "text": "Jenna Fischer as Pam Beesly",
                                "elements": []
                            },
                            {
                                "text": "B.J. Novak as Ryan Howard",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Supporting Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Melora Hardin as Jan Levinson",
                                "elements": []
                            },
                            {
                                "text": "David Denman as Roy Anderson",
                                "elements": []
                            },
                            {
                                "text": "Leslie David Baker as Stanley Hudson",
                                "elements": []
                            },
                            {
                                "text": "Brian Baumgartner as Kevin Malone",
                                "elements": []
                            },
                            {
                                "text": "Kate Flannery as Meredith Palmer",
                                "elements": []
                            },
                            {
                                "text": "Mindy Kaling as Kelly Kapoor",
                                "elements": []
                            },
                            {
                                "text": "Angela Kinsey as Angela Martin",
                                "elements": []
                            },
                            {
                                "text": "Paul Lieberstein as Toby Flenderson",
                                "elements": []
                            },
                            {
                                "text": "Oscar Nunez as Oscar Martinez",
                                "elements": []
                            },
                            {
                                "text": "Phyllis Smith as Phyllis Vance (credit only)",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Recurring Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Creed Bratton as Creed Bratton",
                                "elements": []
                            },
                            {
                                "text": "Rashida Jones as Karen Filippelli",
                                "elements": []
                            },
                            {
                                "text": "Andy Buckley as David Wallace",
                                "elements": []
                            },
                            {
                                "text": "Michael Patrick McGill as Kenny Anderson",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Guest Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Hannah Baker as Underage Kid #2",
                                "elements": []
                            },
                            {
                                "text": "Dan Cole as Dan Gore",
                                "elements": []
                            },
                            {
                                "text": "Owen Daniels as David Wallace's Son",
                                "elements": []
                            },
                            {
                                "text": "Michael David Kaiser as Underage Kid #1",
                                "elements": []
                            },
                            {
                                "text": "Stephen Mitchell as Waiter/Bartender",
                                "elements": []
                            },
                            {
                                "text": "Matt Prokop as Underage Kid #3",
                                "elements": []
                            },
                            {
                                "text": "Jean Villepique as Rachel Wallace",
                                "elements": []
                            },
                            {
                                "text": "Gregory Graham as Upset Bar Patron (Uncredited)",
                                "elements": []
                            },
                            {
                                "text": "James M. Halty as Bartender (Uncredited)",
                                "elements": []
                            },
                            {
                                "text": "Jazz Raycole as Melissa Hudson (Only in Deleted Scenes)",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            }
        ]
    },
    "quotesDetails": {
        "sections": [
            {
                "title": "Cocktails Quotes",
                "level": 1,
                "content": [],
                "images": []
            }
        ]
    },
    "coldOpens": [
        "Michael traps himself in chains and drops the key, but before he asked no one to help him. He can't get out. "
    ],
    "storylines": [
        "Before heading to the cocktail party, Michael decides to show off some trickery he learned at Magic Camp. His straitjacket escape ends with him on the floor of his office, squirming in an attempt to get free.",
        "Jan and Michael decide to reveal their relationship and go to the party as a couple. Jan reveals her lust for Michael over the phone, unaware that she is being heard by Dwight over the speakerphone. She makes Michael sign a \"love contract\" to keep their relationship from causing legal problems, and a very awkward night ensues. Jim, Karen, and Dwight also attend the party and Dwight spends the evening searching for flaws in the CFO's colonial house.",
        "The other office members go to Poor Richard's for happy hour. Roy tells Pam that he can't go because he is getting hammered with his brother, who is upset over money lost on some sold Jet Skis. Pam explains that they're going to a bar, and he must do more \"boyfriend\" things if he wants their relationship to last. He shows up at the bar to Pam's delight.",
        "At the party, Karen points out her ex-boyfriend to Jim. Dwight continues his inspection of the house checking for studs, testing smoke alarms, and questioning the CFO's son about a wooden chair.",
        "After becoming upset with Michael, Jan pulls him into a bathroom to \"satisfy her cravings,\" but Michael says she is behaving inappropriately. Jan gives up and storms out. Meanwhile, Karen points out a few more old boyfriends to Jim who is becoming concerned about Karen's past.",
        "At the bar, Pam shows off her new assertiveness when she tells the bartender about a mistake in the order. After being greeted warmly by five guests who look awfully young to be at a bar (which Oscar clearly notices), Creed explains his side job as a fake ID dealer, using a laminating machine stolen from the Sheriff's Department.",
        "Jim, who is becoming exceedingly bored, is finally saved by CFO David Wallace who asks him to come outside and shoot hoops. When Karen explains her past relationship with David, Jim finally becomes upset. Karen starts to giggle and reveals her prank to Jim who finds it amusing.",
        "At Poor Richard's Pam decides she needs to come clean with Roy if they are going to \"make it.\" When she starts to tell him about the casino night kiss with Jim he gets extremely angry and throws his glass against the wall. Pam leaves after telling Roy that the relationship is over, and Roy proceeds to trash the bar with his brother in an uncontrolled rage.",
        "On the ride back, Michael becomes upset when Jan reveals her reservations about their public relationship. When Michael begins to cry, Jan calms him by saying that she didn't mean it. Dwight pops up from the back seat to show his support for the couple.",
        "The episode ends on a tense note when Roy tells his brother, \"I'm going to kill Jim Halpert.\""
    ]
}