{
    "season": 3,
    "title": "A Benihana Christmas",
    "episode": "10/11",
    "episodes": [
        10,
        11
    ],
    "coldOpens": [
        "Dwight brings in a dead goose in the office and convinces Toby that they can eat it. Creed says it's crazy, but Phyllis wants to eat it. Pam is overly irritated and is told to lighten up. "
    ],
    "storylines": [
        "The Day of the Annual Christmas Party at Dunder Mifflin Scranton. Dwight enters the office with a goose that he accidentally struck with his car—which he proclaims to be a Christmas miracle—and plans to prepare it for the party. After initial objections to having a dead animal present, Toby allows Dwight to keep it as long as he cleans it in his car.",
        "When Michael arrives, we see Pam give him a gift bag. He mistakenly thinks it's from Pam but she explains it's from corporate headquarters.",
        "Carol receives her Christmas card from Michael and visits him to voice her disapproval of his Photoshopping himself into a two-year-old ski weekend photo with her children and former husband (Michael replaces her husband's face with his own). This, along with his marriage proposal (in the episode \"Diwali\"), pushes her over the edge, and she breaks off the relationship, leaving Michael (who has already booked a trip for the two of them to Sandals Resorts) heartbroken.",
        "Pam gives Jim her gift: she has been sending Dwight messages from the CIA for several months (including a request of Dwight to admit all the secrets he's sworn never to tell anyone) and she's going to let Jim decide the top secret mission that Dwight will go on. At first, Jim is clearly happy, but then turns down the gift, saying that he doesn't want to keep doing the same things he did before now that he is \"Number #2\" man in the branch and he has a chance to start over. Pam is obviously embarrassed and saddened that Jim turned down her gift to him.",
        "Dwight realizes that the office is one bathrobe-from-corporate short, and a depressed Michael \"solves\" the problem by telling Dwight to take Toby's.",
        "Angela and the rest of the office's party planning committee meet to discuss specifics about the day's festivities. Karen attempts to offer several party suggestions, and although they get support from other members, Angela immediately nixes all of her ideas. Karen is then asked to leave by Angela for having stupid ideas and does so after receiving no support from the other committee members.",
        "Stating to the camera that she does not know why she has been so cold with Karen, Pam apologizes for the events that transpired during the party planning meeting and the two decide to organize their own Margarita-Karaoke party. When they present this idea to Angela, she declares them to be invalid and asks Dwight get involved since he \"outranks\" Karen and Pam. Jim, being \"Number #2\", creates The Committee To Determine The Validity Of The Two Committees on the spot (consisting only of himself) and declares Pam and Karen's committee to be valid. While this goes on, Andy decides to take Michael out to help him forget about his troubles; Michael summons his \"entourage\" Jim, Ryan and Dwight to come along, though Ryan opts out with a long list of excuses he's prepared for such an invitation from Michael.",
        "Pam and Karen begin their party in the breakroom and Angela (after calling Dwight for permission) is quick to start her own in the conference room. After a few tense moments, Stanley stands up and goes to Pam and Karen's party; several other people follow him except for Kevin, Phyllis, and Hannah. Kevin tells the camera that he is mainly convinced to go because he has heard that Angela's party will have double-fudge brownies, and that outweighs the fact that Angela herself will be there. Michael, Andy, Jim, and Dwight arrive at a Benihana restaurant (which Michael refers to as \"Asian Hooters\"). Andy slides into a seat next to Michael and arranges the seating so Dwight is seated on the opposite end of the table and out of earshot of the conversation of the rest of the entourage. Andy convinces Michael to ask out his Japanese waitress after getting him slightly drunk. So drunk, in fact, that he actually steals meat from the plate of Justin Spitzer, which causes a quick chopstick-swordfight between them. Unable to hear these conversations, Dwight asks Jim to fill him in, but instead Jim tricks him into telling the waitress how to properly butcher a goose, which disgusts both the waitress and the others at the table - while initially attempting to explain himself, Jim finally smiles and admits that it was just the same as all the other pranks he'd pulled on Dwight. Meanwhile, the office is divided into two separate camps as Phyllis, Hannah and Kevin attend Angela's party while the rest of the staff are at Pam and Karen's. Ryan makes the discovery at the party that they do not have a power cord for their karaoke machine, but Darryl offers to get his synthesizer as an alternative. As he passes Phyllis to get the music out of his car, she asks him how they are doing over there and Darryl replies that they are having fun, encouraging Phyllis to join their party in the break room \"when your meeting is over\". Through Karen and Pam's party, Meredith is seen with a bottle of vodka in her hand, turning down the margaritas because they are \"too sweet\".",
        "Meanwhile, Angela's party proceeds to get more uncomfortable as Angela makes a dig at Kevin's weight, irritating him enough to drive him to the other party. When Michael, Andy, Jim, and Dwight return with two of the waitresses from Benihana, Michael finds Angela's party to be \"lame.\" Kevin uses this moment to escape. Angela is comforted by Dwight's attendance at her party (even though he went to the other party first) until Karen and Pam come in and inform Dwight that he's won the raffle from their party. Dwight wins walkie-talkies, which he uses later in the episode to communicate with Angela, using their pet names for one another, \"monkey\" and \"possum\".",
        "Pam notices how upset Angela is, and she and Karen make an offer to Angela to merge the two parties. Angela agrees and reveals that she stole the power cord for the karaoke machine. As everyone has fun singing, Michael—who is very drunk—confuses his date with Andy's since, as he states, \"all waitresses look alike.\" He goes into the kitchen where both the waitresses are and he discreetly tries to ask aloud where his one was and finally she acknowledges herself and he discreetly marks her arm with a marker.",
        "The two waitresses leave because they say the party \"blows\", and Michael offers his girl a trip to Sandals Jamaica, where he was going to take Carol. She says no since she has classes, although she does take a bike that Michael had intended to give to the charity toy drive.",
        "A depressed Michael sulks on the couch and Jim comes up and joins him. Jim gets Michael to laugh at the whole situation and lets him realize that what he had with the waitress was nothing more than a rebound. Jim then tells Michael that a rebound is a fun distraction, but when it is over, \"you're still thinking about the girl you're really after—the one who broke your heart\" (echoing Jim's relationship with Karen after his being rejected by Pam). The two sit in silence as they think.",
        "As the Christmas party ends, Angela sings karaoke, Pam gives Toby her robe from corporate that Dwight had taken, and Jim and Karen give each other the same Christmas gift (a DVD copy of Bridget Jones's: Edge of Reason), seeing which makes Pam sad. Later Pam receives a gift from Roy, which Jim sees. Michael makes a phone call to an unknown person (Who is later revealed to be Jan) to ask her to accompany him to Sandals; to Michael's surprise, the person says yes. Oscar and Gil return from their three-month vacation in Europe. Looking around, Oscar says \"Too soon\" and leaves.",
        "While Jim is leaving, he decides to go ahead and take Pam up on her \"gift\" offer from earlier. He tells Pam that Dwight will be summoned by the CIA to meet with them. Pam quickly looks up how much a bus ticket will cost, and when she mentions it will cost $75, Jim tells her that the CIA will be sending a helicopter instead. The next scene shows Dwight on the roof waiting for a helicopter. He then receives a text message reading, \"You have been compromised. Abort mission. Destroy phone.\" Dwight throws his phone off the roof and walks away."
    ],
    "quotes": [
        [
            {
                "speaker": "Dwight",
                "content": " Once I brought in a duck. To prepare for lunch. And, people got...upset. Apparently, they got attached to the duck, and didn't want to see it killed."
            }
        ],
        [
            {
                "speaker": "Dwight",
                "content": " He was already dead, and we Schrutes use every part of the goose. The meat has a delicious, smoky, rich flavor. Plus you can use the molten goose grease and save it in the refrigerator, thus saving you a trip to the store for a can of expensive goose grease."
            },
            {
                "speaker": "Jim",
                "content": " Wow...win-win."
            },
            {
                "speaker": "Dwight",
                "content": " Exactly! Thank you Jim..."
            },
            {
                "speaker": "Phyllis",
                "content": " I like goose...It's already dead - is it so crazy that we eat it?"
            },
            {
                "speaker": "Creed",
                "content": " That's crazy...It's crazy."
            }
        ],
        [
            {
                "speaker": "Jim",
                "content": " It's a bold move, to photoshop yourself into a picture with your girlfriend and her kids on a ski trip with their real father - but then again Michael's a bold guy...Is \"bold\" the right word?"
            }
        ],
        [
            {
                "speaker": "Pam",
                "content": " For the past few months, I've been sending Dwight letters from the CIA...They're considering him for a top-secret mission...This is where I made list every secret he promised he'd never, ever tell!...So, here's the gift - you get to decide what his top-secret mission is!"
            },
            {
                "speaker": "Jim",
                "content": " You know what, I really don't think I should be doing this stuff anymore though..."
            },
            {
                "speaker": "Pam",
                "content": " Oh...of course..."
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " We're going to Asian Hooters!"
            },
            {
                "speaker": "Ryan",
                "content": " I can't..."
            },
            {
                "speaker": "Michael",
                "content": " Why not?"
            },
            {
                "speaker": "Ryan",
                "content": " I'm not feeling so well...I've got a ton of work to do here...MSG allergy...peanut allergy...I just ate there last night..."
            },
            {
                "speaker": "Jim",
                "content": " Wow! Thanks for taking all the excuses, dude..."
            },
            {
                "speaker": "Ryan",
                "content": " Doctor's appointment...car trouble...planter warts...granddad fought in World War II...Use your head, man - I keep mine in here...Look alive, Halpert - welcome back!"
            }
        ],
        [
            {
                "speaker": "Kevin",
                "content": " I hear Angela's party will have double-fudge brownies...but it will also have Angela. So, double-fudge...Angela... Double fudge......Angela...Hmmmmmmm..."
            }
        ],
        [
            {
                "speaker": "Karen",
                "content": " Are we taking this too far? No, I don't think we're taking this far enough."
            },
            {
                "content": " (Pam shudders)"
            },
            {
                "speaker": "Karen",
                "content": " What?"
            },
            {
                "speaker": "Pam",
                "content": " You gave me goosebumps."
            }
        ],
        [
            {
                "speaker": "Jim",
                "content": " Oh, no, this is different! The CIA thing? That was a prank on Dwight, this is more like a, um...OK, it's pretty much the same thing!"
            }
        ],
        [
            {
                "speaker": "Jim",
                "content": " You just had a rebound...which, don't get me wrong, can be a really fun distraction...but when it's over, you're left thinking about the girl you really like, the one that broke your heart."
            }
        ],
        [
            {
                "speaker": "Jim",
                "content": " Goodnight, Pam."
            },
            {
                "speaker": "Pam",
                "content": " G'nite!"
            },
            {
                "speaker": "Jim",
                "content": " Oh, you know what? Sorry, I forgot to tell you - I intercepted a transmission earlier, and it seems that the CIA is gonna need Dwight down at their headquarters at Langley for training...and an ice cream social with the other agents."
            },
            {
                "speaker": "Pam",
                "content": " We should get him a bus ticket - to make his trip easier...It costs $75..."
            },
            {
                "speaker": "Jim",
                "content": " Well, maybe the CIA could send a helicopter!"
            }
        ]
    ]
}