{
    "season": 3,
    "title": "Business School",
    "episode": "16",
    "episodes": [
        16
    ],
    "coldOpens": [
        "Michael reminisces about the eighth grade because he is going to be the guest speaker at Ryan's business school - even though it will bump him up a full letter grade, Ryan is uneasy about bring Michael to school. "
    ],
    "storylines": [],
    "quotes": [
        [
            {
                "speaker": "Ryan",
                "content": " If you bring your boss to class, it automatically bumps you up a full letter grade. So...I'd be stupid not to do it…right?"
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " A boss is like a teacher. And I am like the cool teacher. Like Mr. Handell. Mr. Handell would hang out with us, and he would tell us awesome jokes. And he actually hooked up with one of the students. Um... and then like twelve other kids came forward. It was in all the papers. ... Really ruined eighth grade for us."
            }
        ],
        [
            {
                "speaker": "Kelly",
                "content": " What are you doing? You better not hurt that little bat!"
            },
            {
                "speaker": "Creed",
                "content": " Animals can't feel pain..."
            },
            {
                "speaker": "Kelly",
                "content": " Don't hurt that bat, Creed! It's a living thing with feelings and a family!"
            }
        ],
        [
            {
                "speaker": "Dwight",
                "content": " Whenever I'm about to do something, I think, \"Would an idiot do that?\" And if they would, I do not do that thing."
            }
        ],
        [
            {
                "speaker": "Angela",
                "content": " Poop is raining from the ceilings. Poop!"
            }
        ],
        [
            {
                "speaker": "Dwight",
                "content": " I don't have a lot of experience with vampires, but I have hunted werewolves. I shot one once. But by the time I got to it, it had turned back into my neighbor's dog."
            }
        ]
    ]
}