{
    "season": 3,
    "title": "Gay Witch Hunt",
    "episode": "1",
    "episodes": [
        1
    ],
    "coldOpens": [
        "Ryan explains that he was promoted and footage of Pam kissing Jim comes up. Dwight then pretends to cry because Jim is gone, but says he doesn't miss him. "
    ],
    "storylines": [
        "No longer a temp, Ryan accepts the sales position vacated when Jim transferred to the Stamford branch. Pam looks at Ryan sitting at Jim's former desk and flashes back to Pam and Jim's kiss prior to his transfer. In the flashback, Jim tells Pam he has wanted to do that \"for the longest time\" and Pam admits the same. She stops Jim from another kiss and tells him she's still getting married and they say their goodbyes. In an interview, Dwight feigns tears over Jim's transfer, before indicating he's glad to be rid of him.",
        "Michael calls Oscar \"faggy\" for preferring Shakespeare in Love to Die Hard. Michael is asked by Toby not to use such terms, but insists it is a harmless synonym for \"lame.\" (\"That's what 'faggy' means!\") Toby tells Michael that Oscar is homosexual and finds the word offensive.",
        "Michael approaches Oscar at the copy machine and loudly apologizes and invites him for a beer sometime. In a succession of short on-camera interviews, Oscar reveals that he is gay, Angela indicates she hates the whole idea of homosexuality and the jowls of Kevin's face jiggle as he is unable to manage anything but \"Oscar...is gay\" through his giggles.",
        "Meanwhile, in Stamford, Jim's transfer came with a promotion and a modern office where his desk includes a window view. Co-worker Andy, who sits at a desk in front of Jim, calls him \"Big Tuna\" in reference to his first-day lunch, a switch from his daily ham and cheese sandwich in Scranton. Co-worker Karen, who sits at the desk behind Jim, mocks him for repeatedly smirking at the camera and says she doesn't believe he's fitting in. Andy meanwhile, discusses how he doesn't feel threatened by Jim as he thinks he's an ambitious know-it-all, just as he brags about his wild college days at Cornell University.",
        "Back in Scranton, Roy brings Pam lunch in a short, awkward exchange. In an interview, Pam says she got cold feet, called off the wedding, ended the relationship, and moved into her own apartment. As a result, Roy and Pam are making the frozen wedding reception meals their lunch for the next five weeks.",
        "A disheveled Roy is seen in a mug shot as he recalls how being dumped led him into a downward spiral of weight gain, beard growth, and a drunk driving arrest. Roy claims he has recovered, laments mistreating Pam, and vows to win her back. Stanley's only comment on the breakup is that he gave the couple a toaster, was unable to return the discontinued model, and now has two toasters at home.",
        "Dwight and Michael worry about other homosexuals working in the office without their knowledge. Dwight recalls Jim mentioning \"gaydar\" being available for purchase online, though Dwight is skeptical because he believes Jim a liar. Nonetheless, the pair phones him in Stamford where Jim pretends to check the availability and reports that gaydar is sold out on the Internet. Also in Stamford, Jim recycles a prank he pulled on Dwight by encasing Andy's calculator in Jell-O, with different results: Andy gets violently upset and kicks a wastebasket as Jim silently returns to work, visibly terrified by Andy's reaction.",
        "Kelly approaches Oscar and tells him that he is \"so cool\" for being gay. Jan informs Michael that he has outed Oscar, a personal decision Michael had no business making while Toby points out that Oscar feels discriminated against by Angela. Employees gather around as Dwight looks at gay pornography at Michael's suggestion. Angela makes a homophobic comment which offends Oscar who bumps her as he walks past, sending Dwight into a brief frenzy.",
        "Michael calls an emergency meeting in the conference room and informs the assembled they are all \"homos—homo sapiens\". Pam looks to Ryan as she holds back shocked laughter (as she would have done with Jim), and is disappointed when he does not do the same, perhaps had hoped they would begin to have a friendship like Jim and Pam's had been. Michael tells Oscar to come out to the office formally, \"right here, however, you want\". Oscar does so reluctantly but unemotionally, concluding his confession with, \"whatever.\" Dwight demands that \"all the other office gays out themselves or I will do it for them.\"",
        "Dwight then implies Phyllis might be gay. Phyllis takes offense and announces that she is engaged to Bob Vance of Vance Refrigeration. Several employees congratulate her, and a surprised, jealous Michael says there is hope for everyone. Phyllis retorts that she and her friends thought Michael was gay when they were in high school together. Michael sheepishly defends his school-age sense of fashion. Creed, in an interview, states that while he's never deliberately made love to a man, it's possible that one \"slipped in\" during the 1960s.",
        "Oscar announces that he can no longer work at the branch and begins to leave, but Michael stops him and tries to hug him as a show of acceptance. Oscar blows up and calls Michael \"small,\" which silences the staff in discomfort and reduces Michael to tears. Oscar apologizes and allows the hug to happen. Believing the hug insufficient, Michael tells the staff to \"watch this, and burn this into your brains\", and kisses a struggling, reluctant Oscar on the mouth. Dwight, who was seemingly moved by Michael's actions, consequently attempts to kiss Oscar. In interviews, Dwight says he now believes Michael is gay. Michael says any two people who want to should be together. He concludes by saying, \"That's what she said...or he said.\" His facial expressions make it clear he believes he has said something profound.",
        "Pam looks longingly at Ryan's desk, as Jim simultaneously glances at an empty seat next to him as Mr. Brown directs a humorless diversity training in Stamford. Glancing through his office blinds, Michael sees Oscar catch a ride from Gil, and muses, \"Oscar's roommate...I wonder if he knows?\" Oscar reveals in an interview that Jan gave him three months paid vacation and use of a company car in exchange for signing an agreement not to sue the company about his botched outing. In Oscar's words, \"it pays to be gay.\"",
        "In the final moments, Dwight opens a package from Jim, a novelty \"gaydar\" machine fashioned from a metal detector and lettered with the prefixes \"Homo\", \"Bi\", and \"Hetero\". He confirms the device on Oscar but is dumbfounded when the device goes off as he inadvertently swipes it across his own belt buckle. Pam smiles to herself."
    ],
    "quotes": [
        [
            {
                "speaker": "Michael",
                "content": " No. No, it's not. I feel terrible about it. I have been calling people \"faggy\" since I was in junior high, and I have never made this mistake. If I don't know how to behave, it is because I am just so far the opposite way. You know? I'm just... I, I can't even imagine... the... thing. Maybe we could go out for a beer sometime. And you could tell me... how... you do that to another dude."
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " You don't call retarded people retards. It's bad taste. You call your friends retards when they're acting retarded."
            }
        ],
        [
            {
                "speaker": "Jim",
                "content": " I ate a tuna sandwich, on my first day. So, Andy started calling me Big Tuna. ...I don't think any of them actually know my real name."
            }
        ],
        [
            {
                "speaker": "Andy",
                "content": " Big Tuna is a super ambitious guy, you know? Cut your throat to get ahead kind of guy, but I mean I'm not threatened by him. I went to Cornell, you ever heard of it? [laughs] I graduated in four years. I never studied once. I was drunk the whole time, and I sang acapella group, \"Here Comes Treble.\""
            }
        ],
        [
            {
                "speaker": "Creed",
                "content": " I'm not offended by homosexuality. In the sixties, I made love to many many women, often outdoors, in the mud and the rain. And it was possible a man slipped in, and there would be no way of knowing."
            }
        ]
    ]
}