{
    "season": 3,
    "title": "Safety Training",
    "episode": "19",
    "episodes": [
        19
    ],
    "coldOpens": [
        "Andy comes back from anger management and requests to be called \"Drew.\" Dwight and Jim refuse, and Dwight explains that he is going to shun him for the next three years, like he was in his childhood for not saving tuna fish juice. "
    ],
    "storylines": [
        "Andy returns to the office after several weeks in anger management training, determined to make a fresh start with all the Dunder Mifflin employees. Meanwhile, it's safety training day in the office, and Michael and Dwight are on a mission to illuminate the true dangers of the workplace.",
        "Upon his return, Andy requests that the rest of the office refer to him as Drew. Dwight decides to shun Andy for three years. Michael takes the staff of the upper office into the warehouse to hear Darryl's presentation on warehouse safety. Darryl repeatedly reinforces that Michael is not allowed to operate the heavy machinery in the warehouse, and Michael only irritates the warehouse staff more by constantly interrupting Darryl, at which point, Lonnie insults Michael in front of everyone. In a talking head interview, Darryl reveals that he is on crutches because Michael pulled a ladder out from under him as a joke. The office and warehouse staff then head upstairs, where Toby reads office safety tips from a book as Michael frequently interrupts and insults him. Bored with the presentation and of Michael, the warehouse staff depart, and Michael and Darryl exchange words, with Darryl calling Michael's life and job completely safe like \"Nerf.\"",
        "Meanwhile, the entire office staff begins betting on various things, a trend started by Kevin, who is bored since March Madness has ended and he has nothing to bet on. On one bet, Jim, Kevin, Karen, and Oscar bet on how many jelly beans are in Pam's candy dish. Kevin loses to Jim and calls this unfair since Jim has spent \"hours\" standing at Pam's desk. A look of discomfort spreads across Karen's face when she hears this. Other bets include guessing how long Kelly can talk about Netflix (Ryan wins), how many times she says awesome (twelve times, Pam wins), how many romantic comedies she mentions (six times, Jim wins). The final bet is whether Creed will notice if someone switches his apple with a potato. Karen loses every bet and gets cleaned out.",
        "Offended by Darryl's comments, Michael decides to show them that working in an office is dangerous because the stress of office life can lead to depression and suicide. Michael plans to demonstrate the dangers of depression by jumping off the roof and secretly landing on a trampoline. However, when he and Dwight test the trampoline by tossing a watermelon, the watermelon bounces off, landing on Stanley's car, so they replace the trampoline with a bouncy castle. Dwight calls the office and warehouse staff to the parking lot, where they see Michael standing on the roof, talking about the dangers of depression. Initially, they do not take Michael seriously, but then they find the bouncy castle and realize that Michael is actually planning to jump, which will probably injure him badly. Darryl talks Michael out of his fake \"suicide attempt\", by convincing him that he is braver than Darryl.",
        "At the end of the day, Stanley is shocked when he sees his car covered in watermelon from Michael's test."
    ],
    "quotes": [
        [
            {
                "speaker": "Dwight",
                "content": " Yes, I have decided to shun Andy Bernard for the next three years. Which I'm looking forward to. It's an Amish technique. It's like slapping someone with silence. I was shunned from the age of four until my sixth birthday... for not saving the excess oil from a can of tuna."
            }
        ],
        [
            {
                "speaker": "Darryl",
                "content": " We do safety training every year...or after an accident...We've never made it a full year - this particular time, I was reaching for a supply box on the top shelf, when one office worker - who, jdjdshall...remain nameless - kicked the ladder out from under me and yelled..."
            },
            {
                "speaker": "Michael",
                "content": " \"Hey, Darrell, how's it hangin'?\""
            },
            {
                "speaker": "Darryl",
                "content": " ...And I fell and busted my ankle...I'm legitimately scared for my workers."
            }
        ],
        [
            {
                "speaker": "Pam",
                "content": " Jim wins!"
            },
            {
                "speaker": "Kevin",
                "content": " That is not fair - he has spent hours up here at reception, with you - hours and hours!"
            }
        ],
        [
            {
                "speaker": "Karen",
                "content": " I don't know this place as well as I thought I did - I'm getting cleaned out!"
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " My life!"
            },
            {
                "speaker": "Dwight",
                "content": " Michael - what's wrong?"
            },
            {
                "speaker": "Michael",
                "content": " Everything - the stress...of my modern office...has caused me to go into a depression!"
            },
            {
                "speaker": "Dwight",
                "content": " \"Depression\"? Isn't that just a fancy word for feeling bummed out?"
            },
            {
                "speaker": "Michael",
                "content": " Dwight, you ignorant slut!"
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " My life!"
            },
            {
                "speaker": "Dwight",
                "content": " Michael - what's wrong?"
            },
            {
                "speaker": "Michael",
                "content": " Everything is wrong, Dwight - the stress of my modern office...has made me depressed!"
            },
            {
                "speaker": "Dwight",
                "content": " \"Depressed\"? Isn't that just a fancy word for feeling bummed out?"
            },
            {
                "speaker": "Michael",
                "content": " Dwight, you ignorant slut!"
            },
            {
                "speaker": "Jim",
                "content": " Well, you know - the first performance was a little off...but I really think they hit their stride in the second show...might even bring my parents tomorrow, to the...matinee."
            }
        ],
        [
            {
                "speaker": "Pam",
                "content": " Oh, God...oh my God, he's gonna jump!"
            },
            {
                "speaker": "Jim",
                "content": " Oh...he's going to kill himself pretending to kill himself!"
            }
        ]
    ]
}