{
    "season": 3,
    "title": "Phyllis' Wedding",
    "episode": "15",
    "episodes": [
        15
    ],
    "episodeDetails": {
        "sections": [
            {
                "title": "Phyllis' Wedding",
                "level": 1,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "\"Phyllis' Wedding\" is the fifteenth episode of the third season of The Office and the 44th overall. It was written by Caroline Williams and directed by Ken Whittingham. It first aired on February 8, 2007. It was viewed by 8.8 million people."
                    }
                ],
                "images": []
            },
            {
                "title": "Deleted scenes",
                "level": 2,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "The Season Three DVD contains a number of deleted scenes. Notable cut scenes include:"
                    },
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Extension of the \"pungent\" scene. Michael opens Phyllis' door while Bob is outside, allowing him to see her before the wedding.",
                                "elements": []
                            },
                            {
                                "text": "In a talking head interview, Angela explains that she is offended by modern weddings.",
                                "elements": []
                            },
                            {
                                "text": "Phyllis tells Angela that she seated her next to someone special.",
                                "elements": []
                            },
                            {
                                "text": "In a talking head interview, Kevin discusses the women he has proposed to.",
                                "elements": []
                            },
                            {
                                "text": "When Pam points out to Phyllis that all her wedding ideas were stolen from Pam, Phyllis apologetically offers to make an announcement. Pam realizes she is being petty.",
                                "elements": []
                            },
                            {
                                "text": "Dwight checks names against the guest list, and Jim goads Dwight into also checking identification.",
                                "elements": []
                            },
                            {
                                "text": "Michael, for no apparent reason, tells Pam that \"This is Phyllis's day, not yours.\"",
                                "elements": []
                            },
                            {
                                "text": "Karen is addicted to her Blackberry.",
                                "elements": []
                            },
                            {
                                "text": "Angela meets Dennis, Phyllis's veterinarian, a very religious man. The two bond over feline leukemia.",
                                "elements": []
                            },
                            {
                                "text": "Michael asks one of Phyllis's bridesmaids for something he can use in his speech. She suggests, \"She hates her boss\" - which surprises Michael, since \"Angela's not her boss.\"",
                                "elements": []
                            },
                            {
                                "text": "Stanley and Teri don't appear to be enjoying themselves.",
                                "elements": []
                            },
                            {
                                "text": "In a talking head interview, Dwight describes how he knows Uncle Al was a wedding crasher.",
                                "elements": []
                            },
                            {
                                "text": "Michael takes Bob Vance's seat at the wedding table.",
                                "elements": []
                            },
                            {
                                "text": "Creed explains wedding traditions to Oscar.",
                                "elements": []
                            },
                            {
                                "text": "In a talking head interview, Oscar discusses gay marriage.",
                                "elements": []
                            },
                            {
                                "text": "Michael asks Phyllis how he can help. She tells him to go to his seat. Michael takes Toby's date's seat, and Michael asks Toby how much he paid for her. In a talking head interview, Toby expresses frustration that nobody believes that they met at the gym.",
                                "elements": []
                            },
                            {
                                "text": "Additional scenes of Michael's speech.",
                                "elements": []
                            },
                            {
                                "text": "In a talking head interview outside, Michael has a bitter imaginary telephone conversation with Phyllis.",
                                "elements": []
                            },
                            {
                                "text": "Dennis takes his leave of Angela and asks for her telephone number. Angela tells him she's not interested because she's already having intimate relations with someone. Dennis apologizes. \"Phyllis neglected to mention your promiscuity.\"",
                                "elements": []
                            },
                            {
                                "text": "Outside the reception hall, Michael talks to the minister who mistakes Michael for a spurned suitor.",
                                "elements": []
                            },
                            {
                                "text": "In a talking head interview, Michael explains why he didn't steal the minister's clothes to sneak back into the reception hall.",
                                "elements": []
                            },
                            {
                                "text": "Meredith and Kelly say goodbye to Pam.",
                                "elements": []
                            },
                            {
                                "text": "Michael sees Phyllis's father using a chair lift.",
                                "elements": []
                            },
                            {
                                "text": "In a talking head interview, Michael talks about Phyllis and Bob as the couple get into Bob's van.",
                                "elements": []
                            },
                            {
                                "text": "Michael rides the chair lift.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Trivia",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Stanley's disgust at Jim and Karen bringing a toaster as a wedding gift is a callback to the episode Gay Witch Hunt in which Stanley laments being stuck with an extra toaster after Pam cancelled the wedding and returned the wedding gift he gave them.",
                                "elements": []
                            },
                            {
                                "text": "When the priest says Bob Vance's name, he includes his company's name, \"Vance Refrigeration\". Bob does this as well when he introduces himself, and perhaps all the time, as he did so in Christmas Party.",
                                "elements": []
                            },
                            {
                                "text": "When Phyllis is tossing the bouquet, you can see Ryan hit the flowers away from Kelly. Catching the bouquet at a wedding traditionally means you're next to get married.",
                                "elements": []
                            },
                            {
                                "text": "Dwight mentions that his families marry while standing in their own grave this foreshadows his marriage to Angela where he does exactly that.",
                                "elements": []
                            },
                            {
                                "text": "Although Pam's middle name is later revealed to be \"Morgan\" in \"Did I Stutter?\" the middle name printed on her wedding invitation is \"Jane.\"",
                                "elements": []
                            },
                            {
                                "text": "Jim reveals Bob's full name to be Robert, however in the wedding the officiant calls him \"Bob Vance, Vance Refrigeration.\"",
                                "elements": []
                            },
                            {
                                "text": "Michael confuses \"wedding\" with \"welding\" and then \"metals\" with \"medals.\"",
                                "elements": []
                            },
                            {
                                "text": "Michael's speech appears to be written on a series of napkins.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Cultural references",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Altoid is a brand of breath mint.",
                                "elements": []
                            },
                            {
                                "text": "Jim employs classical conditioning, a phenomenon first described by scientist Ivan Pavlov.",
                                "elements": []
                            },
                            {
                                "text": "Always a bridesmaid, never a bride is a saying which means that a person always gets close to but never achieves her life goal. Michael applies the saying literally.",
                                "elements": []
                            },
                            {
                                "text": "In Western tradition, the wedding is the responsibility of the bride's family. Phyllis opts for a traditional white wedding. Giving away the bride is a symbolic gesture traditionally performed by the bride's father in which he escorts the bride to the altar. The ringbearer is typically a young boy. The color white represents purity of heart and, in popular culture, virginity. According to the tradition of tossing the bouquet, the woman who catches the bouquet will be the next to be married.",
                                "elements": []
                            },
                            {
                                "text": "Wedding Crashers is a 2005 comedy film about two men who attend weddings uninvited (\"crash\") to meet women.",
                                "elements": []
                            },
                            {
                                "text": "Michael's speech confuses \"wedding\" with \"welding\" and \"metals\" with \"medals\".",
                                "elements": []
                            },
                            {
                                "text": "The Princess Bride is an adventure comedy. Michael begins to quote a line from the movie.",
                                "elements": []
                            },
                            {
                                "text": "In the early 2000s, it became fashionable to nickname a celebrity couple by combining the names of the two people. The first couple for which this was done was Ben Affleck and Jennifer Lopez, resulting in the nickname \"Bennifer\".",
                                "elements": []
                            },
                            {
                                "text": "Easy Rider was a 1969 movie about a pair of adventure-seeking motorcyclists. Michael's use of the term carries a sexual connotation.",
                                "elements": []
                            },
                            {
                                "text": "The Boston Celtics are a professional basketball team. Robert Parish played on the team during the early 1980s.",
                                "elements": []
                            },
                            {
                                "text": "Let them eat cake is popularly attributed not to former British Prime Minister Margaret Thatcher but rather to Marie Antoinette.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Connections to Previous Episodes",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Dwight wears the same tuxedo he wore in Casino Night. The tuxedo served as burial clothing for his grandfather.",
                                "elements": [
                                    {
                                        "text": "Stanley also wears the same bowtie he wears in Casino Night.",
                                        "elements": []
                                    }
                                ]
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Cast",
                "level": 2,
                "content": [],
                "images": []
            },
            {
                "title": "Main Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Steve Carell as Michael Scott",
                                "elements": []
                            },
                            {
                                "text": "Rainn Wilson as Dwight Schrute",
                                "elements": []
                            },
                            {
                                "text": "John Krasinski as Jim Halpert",
                                "elements": []
                            },
                            {
                                "text": "Jenna Fischer as Pam Beesly",
                                "elements": []
                            },
                            {
                                "text": "B.J. Novak as Ryan Howard",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Supporting Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "David Denman as Roy Anderson",
                                "elements": []
                            },
                            {
                                "text": "Leslie David Baker as Stanley Hudson",
                                "elements": []
                            },
                            {
                                "text": "Brian Baumgartner as Kevin Malone",
                                "elements": []
                            },
                            {
                                "text": "Kate Flannery as Meredith Palmer",
                                "elements": []
                            },
                            {
                                "text": "Mindy Kaling as Kelly Kapoor",
                                "elements": []
                            },
                            {
                                "text": "Angela Kinsey as Angela Martin",
                                "elements": []
                            },
                            {
                                "text": "Paul Lieberstein as Toby Flenderson",
                                "elements": []
                            },
                            {
                                "text": "Oscar Nunez as Oscar Martinez",
                                "elements": []
                            },
                            {
                                "text": "Phyllis Smith as Phyllis Lapin",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Recurring Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Bobby Ray Shafer as Bob Vance",
                                "elements": []
                            },
                            {
                                "text": "Rashida Jones as Karen Filippelli",
                                "elements": []
                            },
                            {
                                "text": "Creed Bratton (actor) as Creed Bratton",
                                "elements": []
                            },
                            {
                                "text": "Joanne Carlsen as Terri Hudson",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Guest Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Hansford Rowe as Albert Lapin",
                                "elements": []
                            },
                            {
                                "text": "George Ives as Uncle Al",
                                "elements": []
                            },
                            {
                                "text": "Maile Flanagan as Phyllis' Sister",
                                "elements": []
                            },
                            {
                                "text": "Brian Douglas Hatton as Randy (the Best Man)",
                                "elements": []
                            },
                            {
                                "text": "Trish Gates as Stacy",
                                "elements": []
                            },
                            {
                                "text": "Rick Scarry as The Minister",
                                "elements": []
                            },
                            {
                                "text": "John F. Schaffer as The Photographer",
                                "elements": []
                            },
                            {
                                "text": "Cooper Thornton as Dennis",
                                "elements": []
                            },
                            {
                                "text": "Jake Kalendar as Young Michael Scott",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            }
        ]
    },
    "quotesDetails": {
        "sections": [
            {
                "title": "Phyllis' Wedding Quotes",
                "level": 1,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Dwight: The Schrutes have their own traditions. We usually marry standing in our own graves. Makes the funerals very romantic, but the weddings are a bleak affair."
                    }
                ],
                "images": []
            }
        ]
    },
    "coldOpens": [
        "Jim makes a Pavlov Experiment for Dwight, giving him altoids when he reboots his computer, until he expects to get one. Dwight is finally tricked. "
    ],
    "storylines": [],
    "quotes": [
        "Dwight: The Schrutes have their own traditions. We usually marry standing in our own graves. Makes the funerals very romantic, but the weddings are a bleak affair."
    ]
}