{
    "season": 3,
    "title": "Gay Witch Hunt",
    "episode": "1",
    "episodes": [
        1
    ],
    "episodeDetails": {
        "sections": [
            {
                "title": "Gay Witch Hunt",
                "level": 1,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "\"Gay Witch Hunt\" is the first episode of the third season of The Office and the 29th overall. It was written by Greg Daniels and directed by Ken Kwapis. It first aired on September 21, 2006. It was viewed by 9.1 million people."
                    }
                ],
                "images": []
            },
            {
                "title": "Plot",
                "level": 2,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "No longer a temp, Ryan accepts the sales position vacated when Jim transferred to the Stamford branch. Pam looks at Ryan sitting at Jim's former desk and flashes back to Pam and Jim's kiss prior to his transfer. In the flashback, Jim tells Pam he has wanted to do that \"for the longest time\" and Pam admits the same. She stops Jim from another kiss and tells him she's still getting married and they say their goodbyes. In an interview, Dwight feigns tears over Jim's transfer, before indicating he's glad to be rid of him."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael calls Oscar \"faggy\" for preferring Shakespeare in Love to Die Hard. Michael is asked by Toby not to use such terms, but insists it is a harmless synonym for \"lame.\" (\"That's what 'faggy' means!\") Toby tells Michael that Oscar is homosexual and finds the word offensive."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael approaches Oscar at the copy machine and loudly apologizes and invites him for a beer sometime. In a succession of short on-camera interviews, Oscar reveals that he is gay, Angela indicates she hates the whole idea of homosexuality and the jowls of Kevin's face jiggle as he is unable to manage anything but \"Oscar...is gay\" through his giggles."
                    },
                    {
                        "type": "paragraph",
                        "text": "Meanwhile, in Stamford, Jim's transfer came with a promotion and a modern office where his desk includes a window view. Co-worker Andy, who sits at a desk in front of Jim, calls him \"Big Tuna\" in reference to his first-day lunch, a switch from his daily ham and cheese sandwich in Scranton. Co-worker Karen, who sits at the desk behind Jim, mocks him for repeatedly smirking at the camera and says she doesn't believe he's fitting in. Andy meanwhile, discusses how he doesn't feel threatened by Jim as he thinks he's an ambitious know-it-all, just as he brags about his wild college days at Cornell University."
                    },
                    {
                        "type": "paragraph",
                        "text": "Back in Scranton, Roy brings Pam lunch in a short, awkward exchange. In an interview, Pam says she got cold feet, called off the wedding, ended the relationship, and moved into her own apartment. As a result, Roy and Pam are making the frozen wedding reception meals their lunch for the next five weeks."
                    },
                    {
                        "type": "paragraph",
                        "text": "A disheveled Roy is seen in a mug shot as he recalls how being dumped led him into a downward spiral of weight gain, beard growth, and a drunk driving arrest. Roy claims he has recovered, laments mistreating Pam, and vows to win her back. Stanley's only comment on the breakup is that he gave the couple a toaster, was unable to return the discontinued model, and now has two toasters at home."
                    },
                    {
                        "type": "paragraph",
                        "text": "Dwight and Michael worry about other homosexuals working in the office without their knowledge. Dwight recalls Jim mentioning \"gaydar\" being available for purchase online, though Dwight is skeptical because he believes Jim a liar. Nonetheless, the pair phones him in Stamford where Jim pretends to check the availability and reports that gaydar is sold out on the Internet. Also in Stamford, Jim recycles a prank he pulled on Dwight by encasing Andy's calculator in Jell-O, with different results: Andy gets violently upset and kicks a wastebasket as Jim silently returns to work, visibly terrified by Andy's reaction."
                    },
                    {
                        "type": "paragraph",
                        "text": "Kelly approaches Oscar and tells him that he is \"so cool\" for being gay. Jan informs Michael that he has outed Oscar, a personal decision Michael had no business making while Toby points out that Oscar feels discriminated against by Angela. Employees gather around as Dwight looks at gay pornography at Michael's suggestion. Angela makes a homophobic comment which offends Oscar who bumps her as he walks past, sending Dwight into a brief frenzy."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael calls an emergency meeting in the conference room and informs the assembled they are all \"homos—homo sapiens\". Pam looks to Ryan as she holds back shocked laughter (as she would have done with Jim), and is disappointed when he does not do the same, perhaps had hoped they would begin to have a friendship like Jim and Pam's had been. Michael tells Oscar to come out to the office formally, \"right here, however, you want\". Oscar does so reluctantly but unemotionally, concluding his confession with, \"whatever.\" Dwight demands that \"all the other office gays out themselves or I will do it for them.\""
                    },
                    {
                        "type": "paragraph",
                        "text": "Dwight then implies Phyllis might be gay. Phyllis takes offense and announces that she is engaged to Bob Vance of Vance Refrigeration. Several employees congratulate her, and a surprised, jealous Michael says there is hope for everyone. Phyllis retorts that she and her friends thought Michael was gay when they were in high school together. Michael sheepishly defends his school-age sense of fashion. Creed, in an interview, states that while he's never deliberately made love to a man, it's possible that one \"slipped in\" during the 1960s."
                    },
                    {
                        "type": "paragraph",
                        "text": "Oscar announces that he can no longer work at the branch and begins to leave, but Michael stops him and tries to hug him as a show of acceptance. Oscar blows up and calls Michael \"small,\" which silences the staff in discomfort and reduces Michael to tears. Oscar apologizes and allows the hug to happen. Believing the hug insufficient, Michael tells the staff to \"watch this, and burn this into your brains\", and kisses a struggling, reluctant Oscar on the mouth. Dwight, who was seemingly moved by Michael's actions, consequently attempts to kiss Oscar. In interviews, Dwight says he now believes Michael is gay. Michael says any two people who want to should be together. He concludes by saying, \"That's what she said...or he said.\" His facial expressions make it clear he believes he has said something profound."
                    },
                    {
                        "type": "paragraph",
                        "text": "Pam looks longingly at Ryan's desk, as Jim simultaneously glances at an empty seat next to him as Mr. Brown directs a humorless diversity training in Stamford. Glancing through his office blinds, Michael sees Oscar catch a ride from Gil, and muses, \"Oscar's roommate...I wonder if he knows?\" Oscar reveals in an interview that Jan gave him three months paid vacation and use of a company car in exchange for signing an agreement not to sue the company about his botched outing. In Oscar's words, \"it pays to be gay.\""
                    },
                    {
                        "type": "paragraph",
                        "text": "In the final moments, Dwight opens a package from Jim, a novelty \"gaydar\" machine fashioned from a metal detector and lettered with the prefixes \"Homo\", \"Bi\", and \"Hetero\". He confirms the device on Oscar but is dumbfounded when the device goes off as he inadvertently swipes it across his own belt buckle. Pam smiles to herself."
                    }
                ],
                "images": []
            },
            {
                "title": "Deleted scenes",
                "level": 2,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "The Third Season DVD contains a number of deleted scenes:"
                    },
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Andy shows off his vertical leap for Jim.",
                                "elements": []
                            },
                            {
                                "text": "Jan, on speakerphone, demands to know what Michael's plans are for the day. In a talking head interview, Michael explains that every day begins with him reporting to Jan on what he intends to accomplish and ends with him reporting on what he did accomplish. \"It's voluntary, really, even though she makes me.\" Over scenes from the episode \"Casino Night\", Michael explains that Jan is struggling to get over him. Meanwhile, he and Carol have gone on seven dates. On the phone, Jan suspects Michael is on the toilet and tells him to call her back once he is done.",
                                "elements": []
                            },
                            {
                                "text": "Jim is distracted by Hannah's breast pump. Karen walks past and tells her, \"Nobody wants to see your udder.\"",
                                "elements": []
                            },
                            {
                                "text": "In a talking head interview, Dwight explains that his father taught him how to spot a gay person.",
                                "elements": []
                            },
                            {
                                "text": "Jan asks Michael for progress on his plans for the day. Dwight interrupts and asks for permission to remove the filters from the office Internet connection.",
                                "elements": []
                            },
                            {
                                "text": "In a talking head interview, Michael admits he's never known a gay person before.",
                                "elements": []
                            },
                            {
                                "text": "In a talking head interview, Dwight discusses the fate of a gay bull on the farm.",
                                "elements": []
                            },
                            {
                                "text": "Michael wonders aloud whether a person could be gay without knowing it.",
                                "elements": []
                            },
                            {
                                "text": "In a talking head interview, Dwight expresses his belief that gay people should wear a patch on their clothes to identify themselves.",
                                "elements": []
                            },
                            {
                                "text": "Dwight investigates whether Stanley is gay.",
                                "elements": []
                            },
                            {
                                "text": "Andy asks Jim to recommend a travel route and gloats when Jim's answer is suboptimal.",
                                "elements": []
                            },
                            {
                                "text": "In a talking head interview, Karen is bitter that she didn't get the Assistant Regional Manager job.",
                                "elements": []
                            },
                            {
                                "text": "In a talking head interview, Jim explains he likes having a boss he can respect.",
                                "elements": []
                            },
                            {
                                "text": "Jim complains to Karen that whenever he tries to call an outside number, he gets somebody talking in Chinese. Karen taunts Jim in Chinese, and Josh suggests that somebody programmed his phone to speed-dial Hong Kong. Jim begins to tell Karen about the pranks he played on Dwight, but Karen rudely yawns in his face. When Karen calls Jim Josh's assistant, Jim begins to correct her with his proper title, then realizes that he's doing exactly what he mocked Dwight for doing.",
                                "elements": []
                            },
                            {
                                "text": "Pam will be spending the evening painting her apartment. Michael tries to be supportive but his efforts are not helpful. In a talking head interview, Pam angrily complains, \"What do I think? I think everybody should stay out of everybody's personal business.\"",
                                "elements": []
                            },
                            {
                                "text": "Michael uses a notepad to cover his crotch when he talks with Oscar and covers his butt when he walks away.",
                                "elements": []
                            },
                            {
                                "text": "In a talking head interview, Oscar explains that he told Michael he was gay at his job interview, but Michael thought he was joking.",
                                "elements": []
                            },
                            {
                                "text": "In a talking head interview, Meredith frustratedly asks, \"Why are all the best-looking single men always gay?\"",
                                "elements": []
                            },
                            {
                                "text": "In a talking head interview, Michael is baffled why gay men have so many female friends when they have no use for them.",
                                "elements": []
                            },
                            {
                                "text": "In a talking head interview, Dwight explains that his uncle is a fudge packer. He works at a chocolate factory in Hershey.",
                                "elements": []
                            }
                        ]
                    },
                    {
                        "type": "paragraph",
                        "text": "An additional deleted scene is available online:"
                    },
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Andy asks Jim if he's ever googled Google. Jim promptly does so, but Andy, upset, explains that he was supposed to ponder it, not do it and that he ruined the fun.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Pranks",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Jim apparently told Dwight sometime in the past about the availability of \"gaydar\" online. When Michael and Dwight call Jim to inquire about it, Jim tells them it is \"sold out\". Later in the episode, Dwight receives a package containing a \"gaydar\" (actually a hand-held metal detector with \"HOMO BI HETERO\" branding) that beeps at Oscar and also when Dwight points it himself (because of his metal belt).",
                                "elements": []
                            },
                            {
                                "text": "Jim places Andy's calculator in Jello, a homage to a similar prank played on Dwight and Michael in the pilot. Andy's reaction is the first indication of his anger management problem.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "References to Other Episodes",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "At the end of this episode when Jim is in the conference room at Stamford and is looking at the empty chair next to him and smiling, you can hear in the background Mr. Brown giving his HERO speech. Mr. Brown appeared in Diversity Day.",
                                "elements": []
                            },
                            {
                                "text": "In this episode, Pam has a flashback to the episode Casino Night.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Trivia",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "The shooting draft script of this episode was 33 pages.",
                                "elements": []
                            },
                            {
                                "text": "As of this episode, Mindy Kaling (Kelly Kapoor) and Paul Lieberstein (Toby Flenderson) are credited as part of the main cast.",
                                "elements": []
                            },
                            {
                                "text": "The word \"gay\" is said 35 times.",
                                "elements": []
                            },
                            {
                                "text": "This episode marks one of the few times that Toby is seen wearing a suit jacket that isn't tan/brown colored. In this episode, his jacket is grey.",
                                "elements": []
                            },
                            {
                                "text": "This is the first time Andy brags about his Ivy League education. In real life, John Krasinski actually attended an Ivy League school, having graduated from Brown University in 2001.",
                                "elements": []
                            },
                            {
                                "text": "Kelly is visibly excited about Michael and Oscar kissing.",
                                "elements": []
                            },
                            {
                                "text": "The man doing diversity training at the Stamford branch is the same man who does it at the Scranton Branch in Diversity Day, and he uses the same \"HERO\" acronym.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Behind the scenes",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Jenna Fischer stated that the kiss between Oscar and Michael was completely improvised by Steve Carell, therefore the looks of shock and confusion in the conference room were real.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Cultural References",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Faggie is the adjectival form of fag, an offensive term for homosexual men. Like gay, it is used as an insult unaware of its sexual meaning. Retard is another insult, branding someone as mentally retarded. Toby's suggested alternative insult lame can be construed as offensive to people who cannot walk.",
                                "elements": []
                            },
                            {
                                "text": "Shakespeare in Love is a 1998 romantic comedy. Die Hard is a 1988 action movie. Both films have received large amounts of praise, with each being considered the quintessential film in their genres.",
                                "elements": []
                            },
                            {
                                "text": "Cornell is a prestigious private university, a member of the Ivy League. Students are expected to graduate in four years.",
                                "elements": []
                            },
                            {
                                "text": "Here Comes Treble is a pun on the phrase here comes trouble, used to describe the arrival of a person known to be the source of problems. There is no group at Cornell called \"Here Come Treble\", though there is a female a cappella group called \"Nothing But Treble\".",
                                "elements": []
                            },
                            {
                                "text": "Gaydar is a term used to describe some people's claimed ability to sense whether people are homosexual. The word is a blend of gay and radar. Part of the joke is that Dwight believes it to be an actual device.",
                                "elements": []
                            },
                            {
                                "text": "Sharper Image and Brookstone are retail chains that sell primarily electronic gadgets.",
                                "elements": []
                            },
                            {
                                "text": "Sir Ian McKellen is an openly gay British actor and an advocate for gay rights. Amusingly, Oscar compares himself to McKellan, and McKellen has been nominated for an Oscar.",
                                "elements": []
                            },
                            {
                                "text": "Will & Grace is a television comedy about a gay man and a straight woman who are good friends. The show also features a flamboyantly gay sidekick. Musician Harry Connick, Jr. played a recurring character on the program.",
                                "elements": []
                            },
                            {
                                "text": "The L Word is a television drama about a group of lesbians. Queer as Folk (which Michael misstates as \"Queer as F—\") is a television drama about a group of gay men.",
                                "elements": []
                            },
                            {
                                "text": "In a deleted scene, Dwight states that those who are gay should wear patches identifying them as such, also saying he would not discriminate them. He is seemingly oblivious to the fact that this is similar to the anti-Semitic yellow badge which was worn by Jews during the Middle Ages and famously during the Nazi era.",
                                "elements": []
                            },
                            {
                                "text": "Coming out, short for coming out of the closet, is the act of revealing oneself publically to be gay. To out people is to reveal them as gay without their permission (short for forcing someone out of the closet).",
                                "elements": []
                            },
                            {
                                "text": "Gay pride is a movement that works to remove the stigma associated with homosexuality. Parades are common.",
                                "elements": []
                            },
                            {
                                "text": "The pop-ups that Dwight complains about are pop-up advertisements; i.e., Web advertisements that open in a separate window. Porn sites are notorious for having lots of them.",
                                "elements": []
                            },
                            {
                                "text": "The rainbow flag is a symbol of the Gay Pride movement.",
                                "elements": []
                            },
                            {
                                "text": "To Put a matter to bed means to resolve an issue conclusively.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Cast",
                "level": 2,
                "content": [],
                "images": []
            },
            {
                "title": "Main Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Steve Carell as Michael Scott",
                                "elements": []
                            },
                            {
                                "text": "Rainn Wilson as Dwight Schrute",
                                "elements": []
                            },
                            {
                                "text": "John Krasinski as Jim Halpert",
                                "elements": []
                            },
                            {
                                "text": "Jenna Fischer as Pam Beesly",
                                "elements": []
                            },
                            {
                                "text": "B.J. Novak as Ryan Howard",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Supporting Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Melora Hardin as Jan Levenson",
                                "elements": []
                            },
                            {
                                "text": "David Denman as Roy Anderson",
                                "elements": []
                            },
                            {
                                "text": "Leslie David Baker as Stanley Hudson",
                                "elements": []
                            },
                            {
                                "text": "Brian Baumgartner as Kevin Malone",
                                "elements": []
                            },
                            {
                                "text": "Kate Flannery as Meredith Palmer",
                                "elements": []
                            },
                            {
                                "text": "Mindy Kaling as Kelly Kapoor",
                                "elements": []
                            },
                            {
                                "text": "Angela Kinsey as Angela Martin",
                                "elements": []
                            },
                            {
                                "text": "Paul Lieberstein as Toby Flenderson",
                                "elements": []
                            },
                            {
                                "text": "Oscar Nunez as Oscar Martinez",
                                "elements": []
                            },
                            {
                                "text": "Phyllis Smith as Phyllis Lapin",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Recurring Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Ed Helms as Andy Bernard",
                                "elements": []
                            },
                            {
                                "text": "Rashida Jones as Karen Filippelli",
                                "elements": []
                            },
                            {
                                "text": "Creed Bratton (actor) as Creed Bratton",
                                "elements": []
                            },
                            {
                                "text": "Charles Esten as Josh Porter",
                                "elements": []
                            },
                            {
                                "text": "Tom W. Chick as Gil",
                                "elements": []
                            },
                            {
                                "text": "Larry Wilmore as Mr. Brown",
                                "elements": []
                            },
                            {
                                "text": "Ursula Burton as Hannah Smoterich-Barr (Deleted Scenes)",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Guest Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Kayla Mae Maloney as Jocelyn (Uncredited)",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "References",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "↑ Flannery, Kate. September 21, 2006. The Season 3 Premiere, TVGuide.com",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            }
        ]
    },
    "quotesDetails": {
        "sections": [
            {
                "title": "Gay Witch Hunt Quotes",
                "level": 1,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Michael: No. No, it's not. I feel terrible about it. I have been calling people \"faggy\" since I was in junior high, and I have never made this mistake. If I don't know how to behave, it is because I am just so far the opposite way. You know? I'm just... I, I can't even imagine... the... thing. Maybe we could go out for a beer sometime. And you could tell me... how... you do that to another dude."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael: You don't call retarded people retards. It's bad taste. You call your friends retards when they're acting retarded."
                    },
                    {
                        "type": "paragraph",
                        "text": "Jim: I ate a tuna sandwich, on my first day. So, Andy started calling me Big Tuna. ...I don't think any of them actually know my real name."
                    },
                    {
                        "type": "paragraph",
                        "text": "Andy: Big Tuna is a super ambitious guy, you know? Cut your throat to get ahead kind of guy, but I mean I'm not threatened by him. I went to Cornell, you ever heard of it? [laughs] I graduated in four years. I never studied once. I was drunk the whole time, and I sang acapella group, \"Here Comes Treble.\""
                    },
                    {
                        "type": "paragraph",
                        "text": "Creed: I'm not offended by homosexuality. In the sixties, I made love to many many women, often outdoors, in the mud and the rain. And it was possible a man slipped in, and there would be no way of knowing."
                    }
                ],
                "images": []
            }
        ]
    },
    "coldOpens": [
        "Ryan explains that he was promoted and footage of Pam kissing Jim comes up. Dwight then pretends to cry because Jim is gone, but says he doesn't miss him. "
    ],
    "storylines": [
        "No longer a temp, Ryan accepts the sales position vacated when Jim transferred to the Stamford branch. Pam looks at Ryan sitting at Jim's former desk and flashes back to Pam and Jim's kiss prior to his transfer. In the flashback, Jim tells Pam he has wanted to do that \"for the longest time\" and Pam admits the same. She stops Jim from another kiss and tells him she's still getting married and they say their goodbyes. In an interview, Dwight feigns tears over Jim's transfer, before indicating he's glad to be rid of him.",
        "Michael calls Oscar \"faggy\" for preferring Shakespeare in Love to Die Hard. Michael is asked by Toby not to use such terms, but insists it is a harmless synonym for \"lame.\" (\"That's what 'faggy' means!\") Toby tells Michael that Oscar is homosexual and finds the word offensive.",
        "Michael approaches Oscar at the copy machine and loudly apologizes and invites him for a beer sometime. In a succession of short on-camera interviews, Oscar reveals that he is gay, Angela indicates she hates the whole idea of homosexuality and the jowls of Kevin's face jiggle as he is unable to manage anything but \"Oscar...is gay\" through his giggles.",
        "Meanwhile, in Stamford, Jim's transfer came with a promotion and a modern office where his desk includes a window view. Co-worker Andy, who sits at a desk in front of Jim, calls him \"Big Tuna\" in reference to his first-day lunch, a switch from his daily ham and cheese sandwich in Scranton. Co-worker Karen, who sits at the desk behind Jim, mocks him for repeatedly smirking at the camera and says she doesn't believe he's fitting in. Andy meanwhile, discusses how he doesn't feel threatened by Jim as he thinks he's an ambitious know-it-all, just as he brags about his wild college days at Cornell University.",
        "Back in Scranton, Roy brings Pam lunch in a short, awkward exchange. In an interview, Pam says she got cold feet, called off the wedding, ended the relationship, and moved into her own apartment. As a result, Roy and Pam are making the frozen wedding reception meals their lunch for the next five weeks.",
        "A disheveled Roy is seen in a mug shot as he recalls how being dumped led him into a downward spiral of weight gain, beard growth, and a drunk driving arrest. Roy claims he has recovered, laments mistreating Pam, and vows to win her back. Stanley's only comment on the breakup is that he gave the couple a toaster, was unable to return the discontinued model, and now has two toasters at home.",
        "Dwight and Michael worry about other homosexuals working in the office without their knowledge. Dwight recalls Jim mentioning \"gaydar\" being available for purchase online, though Dwight is skeptical because he believes Jim a liar. Nonetheless, the pair phones him in Stamford where Jim pretends to check the availability and reports that gaydar is sold out on the Internet. Also in Stamford, Jim recycles a prank he pulled on Dwight by encasing Andy's calculator in Jell-O, with different results: Andy gets violently upset and kicks a wastebasket as Jim silently returns to work, visibly terrified by Andy's reaction.",
        "Kelly approaches Oscar and tells him that he is \"so cool\" for being gay. Jan informs Michael that he has outed Oscar, a personal decision Michael had no business making while Toby points out that Oscar feels discriminated against by Angela. Employees gather around as Dwight looks at gay pornography at Michael's suggestion. Angela makes a homophobic comment which offends Oscar who bumps her as he walks past, sending Dwight into a brief frenzy.",
        "Michael calls an emergency meeting in the conference room and informs the assembled they are all \"homos—homo sapiens\". Pam looks to Ryan as she holds back shocked laughter (as she would have done with Jim), and is disappointed when he does not do the same, perhaps had hoped they would begin to have a friendship like Jim and Pam's had been. Michael tells Oscar to come out to the office formally, \"right here, however, you want\". Oscar does so reluctantly but unemotionally, concluding his confession with, \"whatever.\" Dwight demands that \"all the other office gays out themselves or I will do it for them.\"",
        "Dwight then implies Phyllis might be gay. Phyllis takes offense and announces that she is engaged to Bob Vance of Vance Refrigeration. Several employees congratulate her, and a surprised, jealous Michael says there is hope for everyone. Phyllis retorts that she and her friends thought Michael was gay when they were in high school together. Michael sheepishly defends his school-age sense of fashion. Creed, in an interview, states that while he's never deliberately made love to a man, it's possible that one \"slipped in\" during the 1960s.",
        "Oscar announces that he can no longer work at the branch and begins to leave, but Michael stops him and tries to hug him as a show of acceptance. Oscar blows up and calls Michael \"small,\" which silences the staff in discomfort and reduces Michael to tears. Oscar apologizes and allows the hug to happen. Believing the hug insufficient, Michael tells the staff to \"watch this, and burn this into your brains\", and kisses a struggling, reluctant Oscar on the mouth. Dwight, who was seemingly moved by Michael's actions, consequently attempts to kiss Oscar. In interviews, Dwight says he now believes Michael is gay. Michael says any two people who want to should be together. He concludes by saying, \"That's what she said...or he said.\" His facial expressions make it clear he believes he has said something profound.",
        "Pam looks longingly at Ryan's desk, as Jim simultaneously glances at an empty seat next to him as Mr. Brown directs a humorless diversity training in Stamford. Glancing through his office blinds, Michael sees Oscar catch a ride from Gil, and muses, \"Oscar's roommate...I wonder if he knows?\" Oscar reveals in an interview that Jan gave him three months paid vacation and use of a company car in exchange for signing an agreement not to sue the company about his botched outing. In Oscar's words, \"it pays to be gay.\"",
        "In the final moments, Dwight opens a package from Jim, a novelty \"gaydar\" machine fashioned from a metal detector and lettered with the prefixes \"Homo\", \"Bi\", and \"Hetero\". He confirms the device on Oscar but is dumbfounded when the device goes off as he inadvertently swipes it across his own belt buckle. Pam smiles to herself."
    ],
    "quotes": [
        "Michael: No. No, it's not. I feel terrible about it. I have been calling people \"faggy\" since I was in junior high, and I have never made this mistake. If I don't know how to behave, it is because I am just so far the opposite way. You know? I'm just... I, I can't even imagine... the... thing. Maybe we could go out for a beer sometime. And you could tell me... how... you do that to another dude.",
        "Michael: You don't call retarded people retards. It's bad taste. You call your friends retards when they're acting retarded.",
        "Jim: I ate a tuna sandwich, on my first day. So, Andy started calling me Big Tuna. ...I don't think any of them actually know my real name.",
        "Andy: Big Tuna is a super ambitious guy, you know? Cut your throat to get ahead kind of guy, but I mean I'm not threatened by him. I went to Cornell, you ever heard of it? [laughs] I graduated in four years. I never studied once. I was drunk the whole time, and I sang acapella group, \"Here Comes Treble.\"",
        "Creed: I'm not offended by homosexuality. In the sixties, I made love to many many women, often outdoors, in the mud and the rain. And it was possible a man slipped in, and there would be no way of knowing."
    ]
}