{
    "season": 3,
    "title": "Business School",
    "episode": "16",
    "episodes": [
        16
    ],
    "episodeDetails": {
        "sections": [
            {
                "title": "Business School",
                "level": 1,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "\"Business School\" is the sixteenth episode of the third season of The Office and the 45th overall. It was written by Brent Forrester and directed by Joss Whedon. It first aired on February 15, 2007. It was viewed by 8.8 million people."
                    }
                ],
                "images": []
            },
            {
                "title": "Synopsis",
                "level": 2,
                "content": [],
                "images": []
            },
            {
                "title": "Plans for the day",
                "level": 3,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Michael demands an explanation for Kevin's tardiness but cuts off the accountant in the middle of his near-death skid story to announce that he will be the \"special lecturer emeritus\" in Ryan's emerging enterprises class. Ryan reveals in his talking head that if you bring your boss to class, it will automatically bump you up to another letter grade. He is shown to be rather reluctant about inviting Michael. Michael, in his own talking head, compares himself to a \"cool\" teacher from his childhood, who would tell jokes and hang out with the students, before revealing that the man was a pedophile."
                    },
                    {
                        "type": "paragraph",
                        "text": "As Michael packs his supplies for his speaking, Michael asks Dwight what was the most inspiring thing he has said to him. Dwight responds by saying \"Don't be an idiot.\" In an interview, Dwight explains that whenever he is about to do something, he wonders \"Would an idiot do that? And if they would, I do not do that thing.\""
                    },
                    {
                        "type": "paragraph",
                        "text": "En route to the campus, Michael ponders the possibility of the students throwing their hats following his speech so that he may use a \"great line\" he came up with: \"May your hats fly as high as your dreams.\" Ryan explains that it would be out of context as no one is graduating. Michael calls Ryan a \"spaz\" and tickles him causing the young man to swerve."
                    },
                    {
                        "type": "paragraph",
                        "text": "Back in the office, Roy tells Pam that he can't wait for Pam's art show, which is being held at the school where Pam and her classmates learn art. She reveals she's dating Roy again after their eight-month split from each other. Jim dismisses the matter: \"Pam's with Roy, I'm with Karen, Brangelina's with Frangelina.\""
                    }
                ],
                "images": []
            },
            {
                "title": "Michael's presentation",
                "level": 3,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Strolling through campus, Michael \"remembers\" all the fun he would have had in college. Spotting a threesome tossing a Frisbee, he declares something about getting his \"friz on,\" then he runs into the game, snags the disc, and wildly tosses it in a direction where no one is standing."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael cannot hear Ryan's introduction, wherein Ryan explains how Dunder Mifflin is a dying company. Michael accompanies his entrance with a Brandenburg concerto playing from a boombox and begins his speech by ripping the pages out of a student's expensive textbook. Michael illustrates his description of how to start a business with a series of candy bars, throwing them to the incredulous audience."
                    },
                    {
                        "type": "paragraph",
                        "text": "Ryan redirects the speech into a question-and-answer session. Michael solemnly states that \"real business is done on paper,\" and tells the students to write that fact down. The audience quickly complies by typing it on their laptops."
                    },
                    {
                        "type": "paragraph",
                        "text": "The Q&A session intensifies, with students wondering aloud how a small business could survive against the \"five Goliaths\" of the paper industry. Michael defends his company, commenting at the students' inability to understand the situation based upon their age and lack of experience. He also states that the United States faces \"five goliaths\" as well but only states four: Al-Qaeda, Global Warming, sex predators, and mercury poisoning. When a student uses Ryan's prediction of Dunder Mifflin's obsolescence as proof of his point, Michael is shocked to hear that Ryan had made such a statement. He informs the room that Ryan still hasn't made a sale, started a fire in his attempt to make a cheese pita, and \"a lot of people think he's a tease.\" He heads for the exit, shouting, \"Ryan doesn't know anything, and neither do any of you. So suck on that!\""
                    },
                    {
                        "type": "paragraph",
                        "text": "In the car ride home, Michael tells Ryan to clean out his desk. Ryan has mixed feelings when he learns that he is simply being relocated to the annex... right next to Kelly. Michael then comments to Ryan that \"... a good manager doesn't fire people, he hires people and inspires people... people will never go out of business\". The words of wisdom surprise Ryan."
                    },
                    {
                        "type": "paragraph",
                        "text": "Kelly is ecstatic Ryan is moving to the desk beside her, but he tells her that it's only temporary and tells her not to freak out. Nevertheless, she remains excited."
                    }
                ],
                "images": []
            },
            {
                "title": "Bat games",
                "level": 3,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Dwight spots animal droppings on the carpet. He peeks above the ceiling tiles and initially concludes that there is a bird stuck in the air vents, but is surprised to discover that it is actually a bat. The bat escapes, and everyone panics (except for Jim, Oscar, and a somewhat amused Creed). Kelly and Meredith scream, Kevin runs into the camera, Pam hides near the coat rack, Karen hides under her desk, and Angela falls flat on the floor and prays. Stanley heads home (with a very dry \"Good-bye\") as Dwight shuts the bat in a conference room. Angela puts on a clear plastic rain bonnet so the bat won't poop on her head."
                    },
                    {
                        "type": "paragraph",
                        "text": "Jim calls animal control and tells Dwight that it won't be at the office until 6 p.m. As Jim and Dwight talk, Jim tells Dwight that he doesn't feel good. He tells Dwight he might have been bitten by the bat and implies he might be turning into a vampire. Dwight looks on in confusion. Jim and Karen continue pranking Dwight, speaking in slow, deliberate tones. In one incident, Jim says that Karen's \"ice cold\" slice of garlic bread burns him, and later he claims to be blinded by the bright light reflecting off of Angela's cross."
                    },
                    {
                        "type": "paragraph",
                        "text": "Dwight says, if a vampire bat was in the U.S., it would make sense that it came from a \"–sylvania\", like Pennsylvania. He continues by saying Jim may not turn into a vampire but is carrying the vampiric germ. As the day progresses, Dwight teams up with Creed to take down the bat. Kelly protests their attempts to kill it, claiming that it is a living creature with feelings \"and a family.\" Dwight and Creed's first attempt is unsuccessful, as the bat flies out of the conference room and into the break room, whereupon Kelly changes her tune to \"KILL IT!\" as it comes near her. When the day ends, everyone leaves the office, except for Meredith, who is stuck in the women's restroom. Jim leaves as though he's a vampire, shielding himself from the sun with his overcoat. Dwight finally gets the bat. Dwight then charges into the break room with a garbage bag. The bat lands on Meredith's head and Dwight traps the bat in the bag along with Meredith's head. After much struggle, he manages to get the bat off of her."
                    }
                ],
                "images": []
            },
            {
                "title": "Art show",
                "level": 3,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Previously, in the office, when Pam asks Kelly to come to her art show, Kelly feigns excitement about attending. Toby states that he would like to go, but his daughter has a play that night. In a rare display of emotion, he expresses extreme disappointment at having to miss Pam's show to the point of maligning his daughter, but Pam tells him he should go to the play. At the art show, Roy appears with his brother and gleefully points out the fact that he brought another guest while no one else from Dunder Mifflin had shown up. Roy quickly leaves with his brother and Pam says she'll just drive herself home. Roy asks her to drive to his place. Oscar's boyfriend, Gil, criticizes her work as unimaginative \"motel art\". At the end of the night, Michael arrives and is impressed with her work. He zeroes in on her portrait of the office building and insists on buying it to hang in the office, telling Pam he is proud of her. His words visibly touch Pam, and she hugs him in thanks. Later, he hangs the picture in the office, stating that the portrait would not have been made possible without the use of paper... unless the image had been taken by a camera."
                    }
                ],
                "images": []
            },
            {
                "title": "Deleted scenes",
                "level": 2,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "The Season Three DVD contains a number of deleted scenes. Notable cut scenes include:"
                    },
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "In a talking head interview, Michael responds to the adage \"Those who can't do, teach.\"",
                                "elements": []
                            },
                            {
                                "text": "Jim delivers Michael several books, including a digest of business terms and a CliffsNotes on business economics. Michael asks if there's a summary book, and Jim explains, \"Those are the books that sum up the other books.\" Michael reads from his sales diary, particularly a chapter of Wisdoms: \"Don't do what I say. Say what I do.\" \"Mistakes are just successes that you mess up.\"",
                                "elements": []
                            },
                            {
                                "text": "Creed has some papers for Phyllis. Stanley tells him she's on her honeymoon and won't be back for six weeks, but Creed says he'll wait, and sits on her desk.",
                                "elements": []
                            },
                            {
                                "text": "Meredith attempts to gossip unsuccessfully with Angela and Oscar on why Pam and Roy got back together at Phyllis' Wedding. She uses highly suggestive hand gestures, and her explanation is nearly entirely bleeped out.",
                                "elements": []
                            },
                            {
                                "text": "Michael abandons his plan to have the students stand on their desks.",
                                "elements": []
                            },
                            {
                                "text": "In a talking head interview, Michael shows the documentary crew his plan for getting his ideas across. \"Kids love candy bars.\"",
                                "elements": []
                            },
                            {
                                "text": "Michael addresses the students as if they were children, pointing out, for example, that if they had a business selling stickers, they would need to sell the stickers for more than they paid for them.",
                                "elements": []
                            },
                            {
                                "text": "Michael responds to questions from students.",
                                "elements": []
                            },
                            {
                                "text": "In the kitchen area, Karen notices the flier for Pam's art show and attempts to pull it down, but quickly reconsiders when Oscar walks in.",
                                "elements": []
                            },
                            {
                                "text": "In a talking head interview, Dwight asks, \"What is a leader?\" Jim told him he never heard of the word, but he knew what a ladder was. Dwight calls Jim an ignoramus.",
                                "elements": []
                            },
                            {
                                "text": "While trapped in the bathroom Meredith yells, \"I really want to come out.\" Dwight tells her she brought it on herself, and to \"light a match.\"",
                                "elements": []
                            },
                            {
                                "text": "While leaving, Angela tells Kelly this is what happens with the power of prayer. Kelly asks her if she prayed for the bat incident. Angela responds with \"in a general sense.\"",
                                "elements": []
                            },
                            {
                                "text": "At the art show, Roy's brother suggests he could join Pam and Roy and rent the cabin by the lake. But since Denise left him, he should only pay a third.",
                                "elements": []
                            }
                        ]
                    },
                    {
                        "type": "paragraph",
                        "text": "NBC's Web site contains deleted scenes not included on the DVD:"
                    },
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Stanley proclaims he will have six weeks in paradise too, with Phyllis on her honeymoon. He moves a stack of his own papers to her desk.",
                                "elements": []
                            },
                            {
                                "text": "Michael is asked by a business school student, \"How much of Dunder Mifflin's profits are put back into research and development?\" Michael responds with gibberish, and calls the question \"Gobbledygook.\"",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Trivia",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Phyllis Smith (Phyllis Vance) is credited but does not appear in this episode likely because she is on her honeymoon with Bob.",
                                "elements": []
                            },
                            {
                                "text": "After her \"stop, drop, and roll\", Angela prayed quietly, \"God, This is Angela Martin, please don’t let that stupid thing come anywhere near me.\"",
                                "elements": []
                            },
                            {
                                "text": "Episode director Joss Whedon was not satisfied with the art produced for Pam's art show. He held up production for an hour while they made new art.[1]",
                                "elements": []
                            },
                            {
                                "text": "Just nine days after airing, events from this episode were referenced on Saturday Night Live. Rainn Wilson was the host, and during his opening monologue, he took the audience on a backstage tour to prove that SNL was nothing like The Office, only to find the cast looking and acting like the show's characters; Kristen Wiig, as \"Pam\", answering phones, informs him that she also paints pictures, and shows off her painting of 30 Rockefeller Center, the New York skyscraper where the show is filmed.",
                                "elements": []
                            },
                            {
                                "text": "Dwight catches the bat by putting a garbage bag over Meredith's head which leads to her getting rabies.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Amusing details",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Michael packs a copy of Donald Trump's Think Like a Billionaire and an oversized deck of playing cards for his talk.",
                                "elements": []
                            }
                        ]
                    },
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "When Jim is talking to Dwight about going home early, Dwight slowly covers his neck in order to protect himself from the \"vampiric germ\".",
                                "elements": []
                            },
                            {
                                "text": "Pam's art show is called \"Artists for Art\".",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Cultural references",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Michael gives Kevin a pop quiz, a term for an unannounced test.",
                                "elements": []
                            },
                            {
                                "text": "Michael thinks he is a visiting professor special lecturer emeritus at Ryan's business school. The term emeritus is an honorific bestowed upon a retired professor.",
                                "elements": []
                            },
                            {
                                "text": "In the United States grading system, the A is the highest grade, followed by B, C, D, and F (fail). Ryan says that bringing Michael will raise his grade by a full letter grade, for example, improving a \"C\" to a \"B\".",
                                "elements": []
                            },
                            {
                                "text": "Michael's teacher Mr. Handel hooked up with a student, slang for having sex. Eighth-grade students are approximately 13 years old.",
                                "elements": []
                            },
                            {
                                "text": "A college roadshow is a performance that travels from college to college.",
                                "elements": []
                            },
                            {
                                "text": "To bring one's A game is slang for to make one's best effort.",
                                "elements": []
                            },
                            {
                                "text": "Throwing one's hat into the air is a traditional graduation ritual, particularly in military school.",
                                "elements": []
                            },
                            {
                                "text": "In the mid-2000s, it became fashionable to nickname a celebrity couple by combining the names of the two people. Brangelina is a nickname for the couple Brad Pitt and Angelina Jolie. Frangelina is a made-up name.",
                                "elements": []
                            },
                            {
                                "text": "Frisbee is a brand of flying disc toy. Getting one's friz on is a made-up phrase, a snowclone of \"Getting one's X on\".",
                                "elements": []
                            },
                            {
                                "text": "The Teaching Company produces lectures on audio CD.",
                                "elements": []
                            },
                            {
                                "text": "Thingamajig, whoosiewhatsie, and whatchamacallit are nonsense placeholder words. Whatchamacallit, PayDay, 100 Grand Bar, Snickers (whose catchphrase is Snickers really satisfies), and Chunky are real candy bars.",
                                "elements": []
                            },
                            {
                                "text": "A PlayStation is a video game console; Beanie Babies are a brand of stuffed animal which was a fad of the late 1990s.",
                                "elements": []
                            },
                            {
                                "text": "A student asks how far the Herfindahl index has declined since the merger (possibly referring to Scranton's merger with Stamford, though this is unclear). The Herfindahl index measures a company's market concentration in an industry; a decline in the index indicates increased competition in an industry. The question, however, doesn't make much sense. Mergers typically increase the index, since the consolidation of companies decreases competition within an industry. Also, the index is only a measurement of companies' market share in an industry, so if the question does in fact refer to the merger of the Stamford and Scranton branches, it would have no relevance to the Herfindahl index.",
                                "elements": []
                            },
                            {
                                "text": "The Herfindahl index is an economic metric. Michael responds with Polack-says-what index, using an ethnic slur for Polish people; he reinforces this by calling the student Kowalski, a common Polish surname.",
                                "elements": []
                            },
                            {
                                "text": "David and Goliath is the Biblical tale of a young boy who defeats a giant.",
                                "elements": []
                            },
                            {
                                "text": "In a deleted scene, Meredith is advised to light a match when she is trapped in the bathroom. It is commonly believed that lighting a match dispels the odor of flatulence. The television show MythBusters concluded that the smell of the burnt match merely masks the smell rather than eliminating it.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Cast",
                "level": 2,
                "content": [],
                "images": []
            },
            {
                "title": "Main cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Steve Carell as Michael Scott",
                                "elements": []
                            },
                            {
                                "text": "Rainn Wilson as Dwight Schrute",
                                "elements": []
                            },
                            {
                                "text": "John Krasinski as Jim Halpert",
                                "elements": []
                            },
                            {
                                "text": "Jenna Fischer as Pam Beesly",
                                "elements": []
                            },
                            {
                                "text": "B.J. Novak as Ryan Howard",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Supporting cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "David Denman as Roy Anderson",
                                "elements": []
                            },
                            {
                                "text": "Leslie David Baker as Stanley Hudson",
                                "elements": []
                            },
                            {
                                "text": "Brian Baumgartner as Kevin Malone",
                                "elements": []
                            },
                            {
                                "text": "Kate Flannery as Meredith Palmer",
                                "elements": []
                            },
                            {
                                "text": "Mindy Kaling as Kelly Kapoor",
                                "elements": []
                            },
                            {
                                "text": "Angela Kinsey as Angela Martin",
                                "elements": []
                            },
                            {
                                "text": "Paul Lieberstein as Toby Flenderson",
                                "elements": []
                            },
                            {
                                "text": "Oscar Nunez as Oscar Martinez",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Recurring cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Rashida Jones as Karen Filippelli",
                                "elements": []
                            },
                            {
                                "text": "Creed Bratton (actor) as Creed Bratton",
                                "elements": []
                            },
                            {
                                "text": "Tom W. Chick as Gil",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Guest cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Michael Patrick McGill as Kenny Anderson",
                                "elements": []
                            },
                            {
                                "text": "Nathan Blank as Business School Student",
                                "elements": []
                            },
                            {
                                "text": "Matthew Brent as Business School Student",
                                "elements": []
                            },
                            {
                                "text": "David Daskal as Business School Student (Uncredited)",
                                "elements": []
                            },
                            {
                                "text": "Charlie Hirsch",
                                "elements": []
                            },
                            {
                                "text": "Jonathan Hughes",
                                "elements": []
                            },
                            {
                                "text": "Elizabeth Moore",
                                "elements": []
                            },
                            {
                                "text": "Mike Park",
                                "elements": []
                            },
                            {
                                "text": "Jeremy Should",
                                "elements": []
                            },
                            {
                                "text": "Annie Weirich",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            }
        ]
    },
    "quotesDetails": {
        "sections": [
            {
                "title": "Business School Quotes",
                "level": 1,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Ryan: If you bring your boss to class, it automatically bumps you up a full letter grade. So...I'd be stupid not to do it…right?"
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael: A boss is like a teacher. And I am like the cool teacher. Like Mr. Handell. Mr. Handell would hang out with us, and he would tell us awesome jokes. And he actually hooked up with one of the students. Um... and then like twelve other kids came forward. It was in all the papers. ... Really ruined eighth grade for us."
                    },
                    {
                        "type": "paragraph",
                        "text": "Kelly: What are you doing? You better not hurt that little bat!\nCreed: Animals can't feel pain...\nKelly: Don't hurt that bat, Creed! It's a living thing with feelings and a family!"
                    },
                    {
                        "type": "paragraph",
                        "text": "Dwight: Whenever I'm about to do something, I think, \"Would an idiot do that?\" And if they would, I do not do that thing."
                    },
                    {
                        "type": "paragraph",
                        "text": "Angela: Poop is raining from the ceilings. Poop!"
                    },
                    {
                        "type": "paragraph",
                        "text": "Dwight: I don't have a lot of experience with vampires, but I have hunted werewolves. I shot one once. But by the time I got to it, it had turned back into my neighbor's dog."
                    }
                ],
                "images": []
            }
        ]
    },
    "coldOpens": [
        "Michael reminisces about the eighth grade because he is going to be the guest speaker at Ryan's business school - even though it will bump him up a full letter grade, Ryan is uneasy about bring Michael to school. "
    ],
    "storylines": [],
    "quotes": [
        "Ryan: If you bring your boss to class, it automatically bumps you up a full letter grade. So...I'd be stupid not to do it…right?",
        "Michael: A boss is like a teacher. And I am like the cool teacher. Like Mr. Handell. Mr. Handell would hang out with us, and he would tell us awesome jokes. And he actually hooked up with one of the students. Um... and then like twelve other kids came forward. It was in all the papers. ... Really ruined eighth grade for us.",
        "Kelly: What are you doing? You better not hurt that little bat!\nCreed: Animals can't feel pain...\nKelly: Don't hurt that bat, Creed! It's a living thing with feelings and a family!",
        "Dwight: Whenever I'm about to do something, I think, \"Would an idiot do that?\" And if they would, I do not do that thing.",
        "Angela: Poop is raining from the ceilings. Poop!",
        "Dwight: I don't have a lot of experience with vampires, but I have hunted werewolves. I shot one once. But by the time I got to it, it had turned back into my neighbor's dog."
    ]
}