{
    "season": 3,
    "title": "The Job",
    "episode": "23",
    "episodes": [
        23
    ],
    "coldOpens": [
        "Michael goes to New York only to realize his interview is tomorrow. Michael calls Pam telling her, that he'll be three hours late. "
    ],
    "storylines": [
        "Michael is overconfident that he will be getting the corporate job. He has sold his condo on eBay and names Dwight as his successor as Regional Manager. Back in Scranton, Oscar, Kelly and Stanley poke fun at Pam's speech at the beach (in \"Beach Games\") (Creed also claims to have documented the speech on the website he created with Ryan's help, but in a talking head Ryan reveals that the \"blog\" is actually a Microsoft Word document, as he had been unwilling to expose humanity to the innermost workings of Creed's mind), but Pam insists the evening was an important milestone in her life and reveals that she and Jim had privately agreed to try to mend their friendship. Pam explains to Karen that she is not sorry about what she said, but does regret putting Karen in such an awkward position.",
        "In an attempt to win Michael back, Jan arrives at the office telling him that she's been more confident and better than ever after taking a vacation. In a panic, Michael consults the women of the office. Pam tells him to be strong and to not get back together with her. Michael attempts to reject Jan's request, but reverses himself immediately when he sees that Jan had a breast augmentation. Soon after, Jim and Karen leave to spend the night in New York City before their interviews. Karen tells Jim that if either of them gets the job, both should move to New York. She promises to do so, but is met with awkward silence when she asks Jim to reciprocate. Back in Scranton, Dwight begins his new regime, assigning Andy the role of his No. 2. Not surprisingly. Dwight's new motivational tool \"Schrute Bucks\" is not popular. He and Andy repaint the walls of Dwight's new office black in order to instill fear.",
        "During his interview at Corporate, Michael learns from CFO David Wallace that he is interviewing for the job currently held by Jan, who will be fired. Michael immediately tells Jan, who storms into Wallace's office while he's interviewing Karen and has an emotional breakdown. Jan refuses to leave, and must be escorted out by security. As Michael leaves, Wallace tells him that he won't be getting the position. While being driven home by Michael, Jan begins to realize that she's ruined her career and ponders making their relationship her \"full-time job,\" much to Michael's visible discomfort.",
        "Karen leaves to meet friends for lunch, asking Jim to call her when his interview is finished. Jim's interview with David begins very well. When asked for his sales report numbers, Jim discovers Pam had slipped in an encouraging note along with a yogurt lid medal (a reference to a scene from \"Office Olympics\"). Jim, visibly distracted, stumbles through the rest of the interview until Wallace asks him where Jim thinks he will be in ten years. The scene flashes back to Jim and Pam's talk after her confession on the beach. He tells her why he left and how he feels that he has never really come back. She tells him that she wishes that he would. After the interview, Jim drives back to Scranton without Karen.",
        "In her interview, Pam says she is convinced Jim will be hired in New York. She reaffirms that she is fine with the way things worked out with her and Jim, and that they just \"never got the timing right.\" Her interview is interrupted when Jim bursts in and asks her if she is available that evening for dinner. Pam, who is caught completely off-guard, answers, \"Yes.\" Jim replies, \"All right, then it's a date,\" and leaves just as quickly as he arrived. Pam smiles with tears in her eyes.",
        "The episode and season end with Wallace offering the job over the phone to Ryan, despite the fact that in the previous episode \"Business School\" Michael said that Ryan had never made a sale. Wallace indicates that Ryan's MBA was a key factor. A gleeful Ryan accepts and says without missing a beat to a nosy Kelly: \"You and I are done.\""
    ],
    "quotes": [
        [
            {
                "speaker": "Jim",
                "content": " Karen suggested that I...get a haircut for the interview tomorrow, so I could look...presentable, and not, as she so lovingly puts it, homeless."
            }
        ],
        [
            {
                "speaker": "Oscar",
                "content": " Hey Pam, I've been meaning to say something to you - I really miss our friendship."
            },
            {
                "speaker": "Stanley",
                "content": " I've never heard you talk that much - I thought it was Kelly!"
            },
            {
                "speaker": "Kelly",
                "content": " Are you kidding? I would never have done that - it was Patheticville - no offense, Pam."
            },
            {
                "speaker": "Meredith",
                "content": " You know what? Don't even worry about it - everyone was so drunk, I bet no one even remembers what you said."
            },
            {
                "speaker": "Creed",
                "content": " I remember. I blogged the whole thing!"
            }
        ],
        [
            {
                "speaker": "Creed",
                "content": " www.creedthoughts.gov.www/creedthoughts - check it out!"
            },
            {
                "speaker": "Ryan",
                "content": " Last year, Creed asked me how to set up a blog. Wanting to protect the world from being exposed to Creed's brain, I...opened up a Word document on his computer and put an address at the top. I've read some of it - even for the internet, it's...pretty shocking."
            }
        ],
        [
            {
                "speaker": "Dwight",
                "content": " How would you like to spend the night with the Regional Manager of Dunder-Mifflin Scranton?"
            },
            {
                "speaker": "Angela",
                "content": " No, Dwight, I don't care if that's how they consolidated power in Ancient Rome..."
            },
            {
                "speaker": "Dwight",
                "content": " No, no, no...not Michael - me! I'm taking his job!"
            },
            {
                "speaker": "Angela",
                "content": " Not now!...Goodbye, Kelly Kapoor!"
            }
        ],
        [
            {
                "speaker": "Dwight",
                "content": " Once I'm officially Regional Manager my first order of business will be to demote Jim Halpert. So I will need a new number two. My ideal choice? Jack Bauer. But he is unavailable. Fictional. And overqualified."
            }
        ],
        [
            {
                "speaker": "Meredith",
                "content": " I would never do that, waste of money...in my experience, guys are way more attracted to the back of you than to the front."
            },
            {
                "speaker": "Kevin",
                "content": " I love fake boobs! Oftentimes, you find them on strippers."
            },
            {
                "speaker": "Creed",
                "content": " I find it offensive. Au natural, baby, that's how I like 'em - swing low, sweet chariots."
            }
        ],
        [
            {
                "speaker": "David Wallace",
                "content": " What do you think about Michael Scott?"
            },
            {
                "speaker": "Karen",
                "content": " He's a very nice man, and he's very well suited for the job he has now."
            },
            {
                "speaker": "David Wallace",
                "content": " This is off the record..."
            },
            {
                "speaker": "Karen",
                "content": " He would be a disaster!"
            }
        ],
        [
            {
                "speaker": "Pam",
                "content": " I haven't heard anything. But I bet Jim got the job - I mean, why wouldn't he? He's totally qualified, and smart, everyone loves him, and...if he never comes back again? That's OK - we're friends, and I'm sure we'll stay friends. We just, we never got the timing right, you know? I shot him down, and then, he did the same to me, and...but you know what? It's OK. I'm totally fine everything is going to be totally..."
            },
            {
                "speaker": "Jim",
                "content": " Pam...are you free for dinner tonight?"
            },
            {
                "speaker": "Pam",
                "content": " Yes..."
            },
            {
                "speaker": "Jim",
                "content": " All right, then...it's a date!"
            },
            {
                "speaker": "Pam",
                "content": " I'm sorry -what was the question?"
            }
        ]
    ]
}