{
    "season": 3,
    "title": "Beach Games",
    "episode": "22",
    "episodes": [
        22
    ],
    "coldOpens": [
        "Michael gets a call from David Wallace telling him that he is up for a job at corporate. Michael tells him god will be with him. "
    ],
    "storylines": [
        "In the opening, Michael has started to feel sick shortly after being given some paperwork, to Dwight's worry; this is a chronic occurrence, according to Pam. Soon, Dunder Mifflin CFO David Wallace calls; Michael blindsides him with unsolicited, hollow bragging about having dumped Jan. David tells Michael that he's invited to interview in a week's time for a bigger job at corporate headquarters in New York City. To choose a possible replacement as Scranton's branch manager, Michael decides to turn a scheduled office-wide outing to the beach at Lake Scranton into a Survivor-like contest (which he's convinced will determine the best leader). Michael wants everyone to think of the outing as a day off — except for Pam, whom he directs to take detailed notes on each participant's behavior and skills. He takes all the employees with him except Toby, telling the camera that the beach trip also serves as the last great memory for the employees of their time spent with Michael—which Toby's very presence would ruin (for Michael).",
        "As they arrive, Michael starts the activities by selecting four employees \"at random\" to lead different \"tribes\": Jim, Dwight, Andy, and Stanley. The choices were actually deliberate, as they are Michael's considerations for his successor. He explains their pros and cons to the camera: Jim has a great personality but doesn't work hard (since he can finish a project in 30 minutes while the same project takes Michael all day); Dwight is enthusiastic but \"an idiot\"; Andy \"gets\" Michael, but he doesn't trust Andy; Stanley represents the \"amazing progress of African-Americans.\" They form different tribes: \"Team Gryffindor,\" led by Dwight, \"Team Voldemort,\" led by Jim and named in direct opposition to Dwight, \"Blue Team,\" led by Stanley, and \"Team U.S.A.,\" led by Andy.",
        "The activities begin with the employees oblivious to Michael's true intentions. In an egg race, Jim tricks a blindfolded Karen into stepping into the nearby lake; Dwight is overly commanding of Ryan; Andy can't stop Kelly from removing her blindfold, and Stanley sits out in his customary apathy. As Pam takes notes for him, Michael grows frustrated with the contestants' failure to stick to his plans. He has Pam prepare a hot dog eating contest (giving her about 10 minutes to prepare eight hundred wieners), but when the employees balk, an exasperated Michael reveals his upcoming interview, and that the winner of the games would replace him. Realizing Michael's seriousness, the four tribe leaders (except for Jim) decide to step up their efforts; even Stanley, since he would detest working for anyone else in the office. Andy wins the hot dog eating contest. Creed returns to the group after eating a raw fish which he caught with his bare hands, unaware that food was going to be provided by Michael.",
        "Privately, Dwight and Angela plan to sabotage events by having Angela, who is on Andy's team, pretend to mishear everything that Andy says. Michael reveals the next event to be mock sumo wrestling, using the large movement-limiting costumes common to amusement park-style, recreational sumo wrestling. Dwight emerges victorious, and, as planned, Angela pretends not to hear Andy's direction, even when he slips into the lake in his buoyant costume and begins drifting downstream. Away from the others, Karen and Jim phone headquarters, both making appointments for the same open interview that Michael was invited to. Also, in a talking head segment, Oscar states that he intends to break up with his partner, Gil. He adds that he may (with Angela's encouragement) experiment with heterosexual relationships, although it's not immediately clear if he is serious about that part.",
        "Michael reveals his final event: a walk across hot coals. He decides to walk across the coals himself, but ultimately never takes the first step after much procrastination. Shockingly, Pam wants to try the challenge herself, but Michael stops her since she is not one of the candidates, to her protest. He asks Jim to walk across the coals, but he refuses because he doesn't want to burn his feet. Dwight, in an attempt to both impress and blackmail Michael into giving him the position, steps onto the coals and says he will stay there until he gets the job, at which point his feet begin to burn, and he begins to collapse until he is practically lying on top of the coals in pain while the staff rushes to help him.",
        "Once Dwight is removed from the pit, Michael, again unhappy with the results thus far, announces a sudden death — \"Tribal Council\" — stand-up comedy event. Andy is still adrift in the water on his back before a light shines on him and he calls for help but is still ignored. Jim again declines to participate and reveals that he is going to New York City for the open interviews at corporate. Pam, still at the coals, decides to run across barefoot. Empowered by the experience, she interrupts the Tribal Council with her newfound confidence. She expresses her disappointment that (almost) no one attended her art show (months earlier) despite being invited, and that they sometimes act as if she doesn't exist. She then directs herself to Jim and publicly reveals that she called off her wedding because of him, explaining that she had plenty of reasons not to be with Roy, but ignored them until she met Jim. Saying that it's \"fine\" that he's with someone else now, she states that she simply misses him and the fun that they had as best friends before he left for the Stamford branch, and then decides she needs to walk in the water to cool her feet. While the rest of the staff sits in awkward silence, Michael is impressed but reiterates that he is looking for a replacement with sales experience.",
        "The episode ends with footage of the staff on the bus earlier that day, singing the theme song to The Flintstones with Michael providing sound effects before shouting \"WILMA!\" at the end of the song."
    ],
    "quotes": [
        [
            {
                "speaker": "Michael",
                "content": " What happens to a company if somebody takes their boss away? I will answer your question with a question. It's like what happens to a chicken when you take its head away. It dies. Unless you find a new head. I need to see which one of these people have the skills to be a chicken head."
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " Jim Halpert. Pros: smart, cool, good-looking - remind you of anybody you know? Cons? Not a hard worker - I can spend all day on a project, and he will finish the same project in a half an hour, so that should tell you something...Dwight is an obvious candidate for my job. He has the best sales record in the office, he loves the work - he is, however, an idiot...I'm also considering Stanley, because of all the good that black people have done, for America...Andy Bernard. Pros: he's classy, he gets me, he went to Cornell, I trust him. Cons? I don't really trust him."
            }
        ],
        [
            {
                "speaker": "Stanley",
                "content": " I would rather work for an upturned broom, with a bucket for a head, than work with somebody else in this office besides myself - game on!"
            }
        ],
        [
            {
                "speaker": "Oscar",
                "content": " If either of these guys are put in charge of the office, I will transfer to Albany. Gil can come if he wants - I'm kind of looking for a way out of that relationship anyway. I think I might try girls for a while - Angela thinks I can cross over."
            }
        ],
        [
            {
                "speaker": "Pam",
                "content": " Jim, I called off my wedding because of you...and now we're not even friends. And things are just, like, weird between us, and that sucks! And I miss you! You were my best friend before you went to Stamford, and I really miss you."
            }
        ]
    ]
}