{
    "season": 3,
    "title": "Beach Games",
    "episode": "22",
    "episodes": [
        22
    ],
    "episodeDetails": {
        "sections": [
            {
                "title": "Beach Games",
                "level": 1,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "\"Beach Games\" is the twenty-second episode of the third season of The Office and the 51st overall. It was written by Jennifer Celotta and Greg Daniels and also directed by Harold Ramis. It first aired on May 10, 2007 and was viewed by 7.2 million people."
                    }
                ],
                "images": []
            },
            {
                "title": "Synopsis",
                "level": 2,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "In the opening, Michael has started to feel sick shortly after being given some paperwork, to Dwight's worry; this is a chronic occurrence, according to Pam. Soon, Dunder Mifflin CFO David Wallace calls; Michael blindsides him with unsolicited, hollow bragging about having dumped Jan. David tells Michael that he's invited to interview in a week's time for a bigger job at corporate headquarters in New York City. To choose a possible replacement as Scranton's branch manager, Michael decides to turn a scheduled office-wide outing to the beach at Lake Scranton into a Survivor-like contest (which he's convinced will determine the best leader). Michael wants everyone to think of the outing as a day off — except for Pam, whom he directs to take detailed notes on each participant's behavior and skills. He takes all the employees with him except Toby, telling the camera that the beach trip also serves as the last great memory for the employees of their time spent with Michael—which Toby's very presence would ruin (for Michael)."
                    },
                    {
                        "type": "paragraph",
                        "text": "As they arrive, Michael starts the activities by selecting four employees \"at random\" to lead different \"tribes\": Jim, Dwight, Andy, and Stanley. The choices were actually deliberate, as they are Michael's considerations for his successor. He explains their pros and cons to the camera: Jim has a great personality but doesn't work hard (since he can finish a project in 30 minutes while the same project takes Michael all day); Dwight is enthusiastic but \"an idiot\"; Andy \"gets\" Michael, but he doesn't trust Andy; Stanley represents the \"amazing progress of African-Americans.\" They form different tribes: \"Team Gryffindor,\" led by Dwight, \"Team Voldemort,\" led by Jim and named in direct opposition to Dwight, \"Blue Team,\" led by Stanley, and \"Team U.S.A.,\" led by Andy."
                    },
                    {
                        "type": "paragraph",
                        "text": "The activities begin with the employees oblivious to Michael's true intentions. In an egg race, Jim tricks a blindfolded Karen into stepping into the nearby lake; Dwight is overly commanding of Ryan; Andy can't stop Kelly from removing her blindfold, and Stanley sits out in his customary apathy. As Pam takes notes for him, Michael grows frustrated with the contestants' failure to stick to his plans. He has Pam prepare a hot dog eating contest (giving her about 10 minutes to prepare eight hundred wieners), but when the employees balk, an exasperated Michael reveals his upcoming interview, and that the winner of the games would replace him. Realizing Michael's seriousness, the four tribe leaders (except for Jim) decide to step up their efforts; even Stanley, since he would detest working for anyone else in the office. Andy wins the hot dog eating contest. Creed returns to the group after eating a raw fish which he caught with his bare hands, unaware that food was going to be provided by Michael."
                    },
                    {
                        "type": "paragraph",
                        "text": "Privately, Dwight and Angela plan to sabotage events by having Angela, who is on Andy's team, pretend to mishear everything that Andy says. Michael reveals the next event to be mock sumo wrestling, using the large movement-limiting costumes common to amusement park-style, recreational sumo wrestling. Dwight emerges victorious, and, as planned, Angela pretends not to hear Andy's direction, even when he slips into the lake in his buoyant costume and begins drifting downstream. Away from the others, Karen and Jim phone headquarters, both making appointments for the same open interview that Michael was invited to. Also, in a talking head segment, Oscar states that he intends to break up with his partner, Gil. He adds that he may (with Angela's encouragement) experiment with heterosexual relationships, although it's not immediately clear if he is serious about that part."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael reveals his final event: a walk across hot coals. He decides to walk across the coals himself, but ultimately never takes the first step after much procrastination. Shockingly, Pam wants to try the challenge herself, but Michael stops her since she is not one of the candidates, to her protest. He asks Jim to walk across the coals, but he refuses because he doesn't want to burn his feet. Dwight, in an attempt to both impress and blackmail Michael into giving him the position, steps onto the coals and says he will stay there until he gets the job, at which point his feet begin to burn, and he begins to collapse until he is practically lying on top of the coals in pain while the staff rushes to help him."
                    },
                    {
                        "type": "paragraph",
                        "text": "Once Dwight is removed from the pit, Michael, again unhappy with the results thus far, announces a sudden death — \"Tribal Council\" — stand-up comedy event. Andy is still adrift in the water on his back before a light shines on him and he calls for help but is still ignored. Jim again declines to participate and reveals that he is going to New York City for the open interviews at corporate. Pam, still at the coals, decides to run across barefoot. Empowered by the experience, she interrupts the Tribal Council with her newfound confidence. She expresses her disappointment that (almost) no one attended her art show (months earlier) despite being invited, and that they sometimes act as if she doesn't exist. She then directs herself to Jim and publicly reveals that she called off her wedding because of him, explaining that she had plenty of reasons not to be with Roy, but ignored them until she met Jim. Saying that it's \"fine\" that he's with someone else now, she states that she simply misses him and the fun that they had as best friends before he left for the Stamford branch, and then decides she needs to walk in the water to cool her feet. While the rest of the staff sits in awkward silence, Michael is impressed but reiterates that he is looking for a replacement with sales experience."
                    },
                    {
                        "type": "paragraph",
                        "text": "The episode ends with footage of the staff on the bus earlier that day, singing the theme song to The Flintstones with Michael providing sound effects before shouting \"WILMA!\" at the end of the song."
                    }
                ],
                "images": []
            },
            {
                "title": "Deleted scenes",
                "level": 2,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "The Season Three DVD contains a number of deleted scenes. Notable cut scenes include:"
                    },
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Michael announces that the bus will be leaving soon, and Phyllis says Bob Vance was going to bring her. Michael doesn't allow this.",
                                "elements": []
                            },
                            {
                                "text": "Jim receives a call from David Wallace informing him of the job opening in the Corporate New York office.",
                                "elements": []
                            },
                            {
                                "text": "Meredith sees the \"No Alcohol\" sign on the party bus, runs off the bus to get her drink, and then races after the bus when it starts driving away without her, pounding on the front door until the driver stops and lets her on.",
                                "elements": []
                            },
                            {
                                "text": "Later on, Meredith says she needs to use a restroom. Michael says they're almost at the lake site, but Meredith yells for the bus to stop. When it does, she runs to the side of the road and squats down to pee. The camera cuts from her explicitly doing this to everyone on the bus carefully looking the other way—except for Creed, who watches her peeing and nods in approval.",
                                "elements": []
                            },
                            {
                                "text": "Michael inflates the sumo suit with his mouth while explaining how he intends to use it. He becomes light-headed and passes out.",
                                "elements": []
                            },
                            {
                                "text": "Michael asks Pam (who is busy cooking hot dogs) for her assessment of the egg race. When he criticizes her slow grilling pace, Pam says sharply \"There are 800 of them!\" and Michael shuts up and walks away from her.",
                                "elements": []
                            },
                            {
                                "text": "After Michael tells Phyllis to \"dip it in the water so it slides down your gullet more easily,\" everybody says in unison, \"That's what she said.\"",
                                "elements": []
                            },
                            {
                                "text": "Michael provides a running commentary on the hot dog eating contest.",
                                "elements": []
                            },
                            {
                                "text": "In a talking head interview, Phyllis believes Jim would be the best boss, \"plus, he's eye candy.\"",
                                "elements": []
                            },
                            {
                                "text": "Ryan offers to take Andy's place, but Michael won't have it.",
                                "elements": []
                            },
                            {
                                "text": "Andy flags down a passing car, but after getting close it drives away, with the driver presumably having seen that Andy is in a sumo suit.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Amusing details- Caution, here be spoilers",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Michael says, \"I personally have cooked up\" the hot dogs, even though it was Pam who did it.",
                                "elements": []
                            },
                            {
                                "text": "When Michael says \"I am deducting sixty points from Voldemort,\" Dwight becomes apprehensive upon hearing the name spoken out loud. (See \"Cultural References\" below for an explanation.)",
                                "elements": []
                            },
                            {
                                "text": "At the hot dog eating contest, when Michael tells Phyllis to \"dip it in the water so it can slide down your gullet more easily,\" everyone else sits silently. However, when a flashback to this scene is shown later in The Banker everyone simultaneously responds with, \"That's what she said!\" (which happened in a deleted scene).",
                                "elements": []
                            },
                            {
                                "text": "Even though he participated in the hot dog eating contest, Dwight later eats a sandwich when he challenges Andy to a sumo rematch.",
                                "elements": []
                            },
                            {
                                "text": "With the exception of Stanley, all of Michael's candidates to replace him eventually become manager at some point. Dwight in \"The Job\", \"Dwight K. Schrute, (Acting) Manager\" and \"Livin' the Dream\" through the rest of the series. Jim in \"Survivor Man\" and \"The Promotion\" through \"Manager and Salesman\", and Andy from \"The List\" to \"Get the Girl\" and then again from \"Free Family Portrait Studio\" to \"Livin' the Dream\".",
                                "elements": []
                            },
                            {
                                "text": "Toby's disappointment is clear when he realizes that he will miss out on seeing Pam in a two-piece swimsuit.",
                                "elements": []
                            },
                            {
                                "text": "When Dwight attacks Andy after their sumo-suit fight, it's clear that Ed Helms is laughing hysterically.",
                                "elements": []
                            },
                            {
                                "text": "When Meredith accidentally exposes her breasts to the camera it's possible to see that her nipples are covered by tape.",
                                "elements": []
                            },
                            {
                                "text": "While filming this episode, Rainn Wilson (Dwight) accidentally kicked sand into Leslie David Baker's (Stanley) eye. Baker had to be rushed to the hospital while he had his eye cleaned out, after being diagnosed with a scratched cornea.",
                                "elements": []
                            },
                            {
                                "text": "Before Pam walks the hot coals, she is seen feeling the heat of the coals, then when the camera cuts to Michael, the coal walk is shown in the background, but she is nowhere to be seen.",
                                "elements": []
                            },
                            {
                                "text": "In several shots, it's possible to see bra straps beneath Pam's top, even though her bikini top ties behind her neck.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Connections to previous episodes",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Michael mentions burning his foot in The Injury.",
                                "elements": []
                            },
                            {
                                "text": "Michael is wearing a shirt and hat with the word \"Sandals\" on it. This is a reference to his trip to Jamaica that we learn about in Back From Vacation.",
                                "elements": []
                            },
                            {
                                "text": "In Women's Appreciation, Michael wished for Pam to have courage.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Cultural references",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Michael asks, \"David Wallace, and Gromit?\" referring to Wallace and Gromit, the main characters in a series of animated films.",
                                "elements": []
                            },
                            {
                                "text": "Get your freak on is urban slang for having sex with someone. Michael appears not to know what it actually means.",
                                "elements": []
                            },
                            {
                                "text": "Michael tells Oscar, \"You can't swim in leather pants.\" Leather pants are a stereotypical gay article of clothing.",
                                "elements": []
                            },
                            {
                                "text": "Michael tells Oscar, \"I'm just yanking your chain,\" slang for \"I'm just harassing you.\" Michael eventually recognizes the double entendre.",
                                "elements": []
                            },
                            {
                                "text": "Michael wants Beach Day to be a memory \"after I have passed on.\" He inadvertently uses a euphemism for dying.",
                                "elements": []
                            },
                            {
                                "text": "The office staff sings The Gambler on the bus on the way to the beach.",
                                "elements": []
                            },
                            {
                                "text": "Michael tells Stanley to \"go to the back of the bus.\" He eventually realizes that forcing blacks to sit in the back of the bus was one of the injustices of the segregationist era. Rosa Parks famously stepped on a bus to defy this law, which was used by the media to spark the civil rights movement.",
                                "elements": []
                            },
                            {
                                "text": "As he gets off the bus, Michael says, \"Watch out for snakes!\" This line comes from the movie Eegah!, which had been spoofed by MST3K.",
                                "elements": []
                            },
                            {
                                "text": "Michael says that Beach Day consists of \"fourteen strangers who work together, but only one survivor,\" and breaks the group into four \"tribes\". Michael is inspired by the Survivor television series.",
                                "elements": []
                            },
                            {
                                "text": "Dwight names his team Gryffindor, the house to which fictional hero Harry Potter belongs. Jim responds by naming his team Voldemort, the name of the antagonist in the same book series. Jim further taunts Dwight by saying the name out loud, something which is taboo in the book series.",
                                "elements": []
                            },
                            {
                                "text": "Dwight says that the word sabotage is Dutch. The etymology of the word is disputed, but one of the possible sources is indeed the Netherlands.",
                                "elements": []
                            },
                            {
                                "text": "Bob Hope is a comedian from the mid-twentieth century. Amanda Bynes is a comedian from the 2000s & early 2010s. Her movie What a Girl Wants came out in 2003.",
                                "elements": []
                            },
                            {
                                "text": "Dwight attempts to tell the joke The Aristocrats but gives away the punch line at the beginning and misses the point of the joke by providing no details on the family's depraved act.",
                                "elements": []
                            },
                            {
                                "text": "The Flintstones sing-along at the end of the show recalls a scene in the movie Planes, Trains & Automobiles where John Candy's character leads a bus full of strangers in singing the song. In the DVD commentary, Ed Helms mentions that he chose the song specifically as a tribute to the movie.",
                                "elements": []
                            },
                            {
                                "text": "In a deleted scene, Michael says, \"We are off like a herd of turtles.\" This is a whimsical way of saying that they are finally on their way after many delays. He then attributes the phrase to talk show host Johnny Carson for no apparent reason.",
                                "elements": []
                            },
                            {
                                "text": "In a deleted scene, Michael says that he's choosing his apprentice, which is why he modeled the day after Survivor. The Apprentice is a reality television show in which contestants compete to work for Donald Trump.",
                                "elements": []
                            },
                            {
                                "text": "In a deleted scene, Phyllis calls Jim \"eye candy\", slang for an attractive person. She also lists a number of celebrities: George Clooney, Leonardo DiCaprio, and \"that British guy that got in trouble with the prostitute\" (a reference to Hugh Grant in his 1995 incident).",
                                "elements": []
                            },
                            {
                                "text": "In a deleted scene, Michael says that in the old days, finding the next king was done by seeing who could pull a sword out of a stone, referring to the legend of Excalibur.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Cast",
                "level": 2,
                "content": [],
                "images": []
            },
            {
                "title": "Main cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Steve Carell as Michael Scott",
                                "elements": []
                            },
                            {
                                "text": "Rainn Wilson as Dwight Schrute",
                                "elements": []
                            },
                            {
                                "text": "John Krasinski as Jim Halpert",
                                "elements": []
                            },
                            {
                                "text": "Jenna Fischer as Pam Beesly",
                                "elements": []
                            },
                            {
                                "text": "B.J. Novak as Ryan Howard",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Supporting cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Ed Helms as Andy Bernard",
                                "elements": []
                            },
                            {
                                "text": "Leslie David Baker as Stanley Hudson",
                                "elements": []
                            },
                            {
                                "text": "Brian Baumgartner as Kevin Malone",
                                "elements": []
                            },
                            {
                                "text": "Kate Flannery as Meredith Palmer",
                                "elements": []
                            },
                            {
                                "text": "Mindy Kaling as Kelly Kapoor",
                                "elements": []
                            },
                            {
                                "text": "Angela Kinsey as Angela Martin",
                                "elements": []
                            },
                            {
                                "text": "Paul Lieberstein as Toby Flenderson",
                                "elements": []
                            },
                            {
                                "text": "Oscar Nunez as Oscar Martinez",
                                "elements": []
                            },
                            {
                                "text": "Phyllis Smith as Phyllis Vance",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Recurring cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Rashida Jones as Karen Filippelli",
                                "elements": []
                            },
                            {
                                "text": "Creed Bratton (actor) as Creed Bratton",
                                "elements": []
                            },
                            {
                                "text": "Andy Buckley as David Wallace",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            }
        ]
    },
    "quotesDetails": {
        "sections": [
            {
                "title": "Beach Games Quotes",
                "level": 1,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Michael: What happens to a company if somebody takes their boss away? I will answer your question with a question. It's like what happens to a chicken when you take its head away. It dies. Unless you find a new head. I need to see which one of these people have the skills to be a chicken head."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael: Jim Halpert. Pros: smart, cool, good-looking - remind you of anybody you know? Cons? Not a hard worker - I can spend all day on a project, and he will finish the same project in a half an hour, so that should tell you something...Dwight is an obvious candidate for my job. He has the best sales record in the office, he loves the work - he is, however, an idiot...I'm also considering Stanley, because of all the good that black people have done, for America...Andy Bernard. Pros: he's classy, he gets me, he went to Cornell, I trust him. Cons? I don't really trust him."
                    },
                    {
                        "type": "paragraph",
                        "text": "Stanley: I would rather work for an upturned broom, with a bucket for a head, than work with somebody else in this office besides myself - game on!"
                    },
                    {
                        "type": "paragraph",
                        "text": "Oscar: If either of these guys are put in charge of the office, I will transfer to Albany. Gil can come if he wants - I'm kind of looking for a way out of that relationship anyway. I think I might try girls for a while - Angela thinks I can cross over."
                    },
                    {
                        "type": "paragraph",
                        "text": "Pam: Jim, I called off my wedding because of you...and now we're not even friends. And things are just, like, weird between us, and that sucks! And I miss you! You were my best friend before you went to Stamford, and I really miss you."
                    }
                ],
                "images": []
            }
        ]
    },
    "coldOpens": [
        "Michael gets a call from David Wallace telling him that he is up for a job at corporate. Michael tells him god will be with him. "
    ],
    "storylines": [
        "In the opening, Michael has started to feel sick shortly after being given some paperwork, to Dwight's worry; this is a chronic occurrence, according to Pam. Soon, Dunder Mifflin CFO David Wallace calls; Michael blindsides him with unsolicited, hollow bragging about having dumped Jan. David tells Michael that he's invited to interview in a week's time for a bigger job at corporate headquarters in New York City. To choose a possible replacement as Scranton's branch manager, Michael decides to turn a scheduled office-wide outing to the beach at Lake Scranton into a Survivor-like contest (which he's convinced will determine the best leader). Michael wants everyone to think of the outing as a day off — except for Pam, whom he directs to take detailed notes on each participant's behavior and skills. He takes all the employees with him except Toby, telling the camera that the beach trip also serves as the last great memory for the employees of their time spent with Michael—which Toby's very presence would ruin (for Michael).",
        "As they arrive, Michael starts the activities by selecting four employees \"at random\" to lead different \"tribes\": Jim, Dwight, Andy, and Stanley. The choices were actually deliberate, as they are Michael's considerations for his successor. He explains their pros and cons to the camera: Jim has a great personality but doesn't work hard (since he can finish a project in 30 minutes while the same project takes Michael all day); Dwight is enthusiastic but \"an idiot\"; Andy \"gets\" Michael, but he doesn't trust Andy; Stanley represents the \"amazing progress of African-Americans.\" They form different tribes: \"Team Gryffindor,\" led by Dwight, \"Team Voldemort,\" led by Jim and named in direct opposition to Dwight, \"Blue Team,\" led by Stanley, and \"Team U.S.A.,\" led by Andy.",
        "The activities begin with the employees oblivious to Michael's true intentions. In an egg race, Jim tricks a blindfolded Karen into stepping into the nearby lake; Dwight is overly commanding of Ryan; Andy can't stop Kelly from removing her blindfold, and Stanley sits out in his customary apathy. As Pam takes notes for him, Michael grows frustrated with the contestants' failure to stick to his plans. He has Pam prepare a hot dog eating contest (giving her about 10 minutes to prepare eight hundred wieners), but when the employees balk, an exasperated Michael reveals his upcoming interview, and that the winner of the games would replace him. Realizing Michael's seriousness, the four tribe leaders (except for Jim) decide to step up their efforts; even Stanley, since he would detest working for anyone else in the office. Andy wins the hot dog eating contest. Creed returns to the group after eating a raw fish which he caught with his bare hands, unaware that food was going to be provided by Michael.",
        "Privately, Dwight and Angela plan to sabotage events by having Angela, who is on Andy's team, pretend to mishear everything that Andy says. Michael reveals the next event to be mock sumo wrestling, using the large movement-limiting costumes common to amusement park-style, recreational sumo wrestling. Dwight emerges victorious, and, as planned, Angela pretends not to hear Andy's direction, even when he slips into the lake in his buoyant costume and begins drifting downstream. Away from the others, Karen and Jim phone headquarters, both making appointments for the same open interview that Michael was invited to. Also, in a talking head segment, Oscar states that he intends to break up with his partner, Gil. He adds that he may (with Angela's encouragement) experiment with heterosexual relationships, although it's not immediately clear if he is serious about that part.",
        "Michael reveals his final event: a walk across hot coals. He decides to walk across the coals himself, but ultimately never takes the first step after much procrastination. Shockingly, Pam wants to try the challenge herself, but Michael stops her since she is not one of the candidates, to her protest. He asks Jim to walk across the coals, but he refuses because he doesn't want to burn his feet. Dwight, in an attempt to both impress and blackmail Michael into giving him the position, steps onto the coals and says he will stay there until he gets the job, at which point his feet begin to burn, and he begins to collapse until he is practically lying on top of the coals in pain while the staff rushes to help him.",
        "Once Dwight is removed from the pit, Michael, again unhappy with the results thus far, announces a sudden death — \"Tribal Council\" — stand-up comedy event. Andy is still adrift in the water on his back before a light shines on him and he calls for help but is still ignored. Jim again declines to participate and reveals that he is going to New York City for the open interviews at corporate. Pam, still at the coals, decides to run across barefoot. Empowered by the experience, she interrupts the Tribal Council with her newfound confidence. She expresses her disappointment that (almost) no one attended her art show (months earlier) despite being invited, and that they sometimes act as if she doesn't exist. She then directs herself to Jim and publicly reveals that she called off her wedding because of him, explaining that she had plenty of reasons not to be with Roy, but ignored them until she met Jim. Saying that it's \"fine\" that he's with someone else now, she states that she simply misses him and the fun that they had as best friends before he left for the Stamford branch, and then decides she needs to walk in the water to cool her feet. While the rest of the staff sits in awkward silence, Michael is impressed but reiterates that he is looking for a replacement with sales experience.",
        "The episode ends with footage of the staff on the bus earlier that day, singing the theme song to The Flintstones with Michael providing sound effects before shouting \"WILMA!\" at the end of the song."
    ],
    "quotes": [
        "Michael: What happens to a company if somebody takes their boss away? I will answer your question with a question. It's like what happens to a chicken when you take its head away. It dies. Unless you find a new head. I need to see which one of these people have the skills to be a chicken head.",
        "Michael: Jim Halpert. Pros: smart, cool, good-looking - remind you of anybody you know? Cons? Not a hard worker - I can spend all day on a project, and he will finish the same project in a half an hour, so that should tell you something...Dwight is an obvious candidate for my job. He has the best sales record in the office, he loves the work - he is, however, an idiot...I'm also considering Stanley, because of all the good that black people have done, for America...Andy Bernard. Pros: he's classy, he gets me, he went to Cornell, I trust him. Cons? I don't really trust him.",
        "Stanley: I would rather work for an upturned broom, with a bucket for a head, than work with somebody else in this office besides myself - game on!",
        "Oscar: If either of these guys are put in charge of the office, I will transfer to Albany. Gil can come if he wants - I'm kind of looking for a way out of that relationship anyway. I think I might try girls for a while - Angela thinks I can cross over.",
        "Pam: Jim, I called off my wedding because of you...and now we're not even friends. And things are just, like, weird between us, and that sucks! And I miss you! You were my best friend before you went to Stamford, and I really miss you."
    ]
}