{
    "season": 3,
    "title": "Product Recall",
    "episode": "20",
    "episodes": [
        20
    ],
    "coldOpens": [
        "Jim pretends to be Dwight and brings in everything that Dwight would. Dwight goes into Michael's office after Jim imitates him going into Michael's office. "
    ],
    "storylines": [
        "Jim Halpert enters, dressed as Dwight Schrute. He explains that he accidentally found Dwight's glasses at a drug store for four dollars, and was unable to resist recreating the rest of Dwight's ensemble for a grand total of eleven dollars. Jim imitates Dwight's mannerisms and tone: \"Fact. Bears eat beets. Bears. Beets. Battlestar Galactica\" and Dwight starts to get upset: \"Identity theft is not a joke, Jim! Millions of families suffer every year!\" Jim screams \"Michael!\" and ran to his office. Dwight, very annoyed, did the exact same thing.",
        "Dunder Mifflin Scranton is thrown into damage control when some paper is released with an obscene watermark of a cartoon duck and mouse having sex. Michael addresses the media while Jim and Andy try to calm a school principal who used the affected paper to send out prom invitations. After arriving at the high school, Andy notices that his \"girlfriend\" is a student, and this ruins his day.",
        "Meanwhile, Kelly is entrusted with training the accountants, Oscar, Kevin, and Angela, to handle customer support calls. Angela is unable to sincerely apologize to customers for the company's mistake, while Oscar seems to handle the calls well and Kevin simply repeats his apology over and over again.",
        "Michael arranges for a customer to come to the office, so that he may apologize to her personally and present her with a novelty check for free paper. With the media present (a single reporter from the Scranton Times), Michael apologizes to the customer. However, she refuses his apology and asks for his resignation. Dwight attempts to defuse the situation by insisting that the cartoon sex appears consensual. Michael refuses to resign and angrily decides to give the check to someone else. He then decides to make an \"apology video,\" filmed by Pam, in which he reiterates the fact that the mistake was not his fault and that he has become an \"escape goat.\"",
        "Meanwhile, Creed, who as Quality Assurance failed to catch the error, maneuvers to ensure that he saves his own job (at the expense of an employee at the paper mill). He gets a farewell card for her and money from all the employees. On his way out, Creed pockets the money and tosses the card.",
        "Later, in the car, Jim cajoles Andy into singing \"The Lion Sleeps Tonight\" to cheer him up. In the closing, Dwight comes to work dressed as Jim and imitates him very poorly."
    ],
    "quotes": [
        [
            {
                "speaker": "Jim",
                "content": " Last week, I was in a drugstore, and I saw these glasses - uh, four dollars - and, it only cost me seven dollars to recreate the rest of the ensemble, and that's a grand total of...eleven dollars."
            }
        ],
        [
            {
                "speaker": "Creed",
                "content": " The only difference between me and a homeless man is this job. I will do whatever it takes to survive. Like I did... when I was a homeless man."
            }
        ],
        [
            {
                "speaker": "Andy",
                "content": " Why is my girlfriend here?!"
            },
            {
                "speaker": "Jim",
                "content": " Oh, is she that teacher in the white?"
            },
            {
                "speaker": "Andy",
                "content": " No, she's a...part-time frozen yogurt chef."
            },
            {
                "speaker": "Jim",
                "content": " Which one...is she?"
            },
            {
                "speaker": "Andy",
                "content": " The one in the green hoodie..."
            },
            {
                "speaker": "Jim",
                "content": " Wow."
            }
        ],
        [
            {
                "speaker": "Dwight",
                "content": " I grew up on a farm. I have seen animals having sex in every position imaginable. Goat on chicken. Chicken on goat. Couple of chickens doin' a goat, couple of pigs watching. Whoever drew this got it exactly right."
            }
        ]
    ]
}