{
    "season": 3,
    "title": "The Convention",
    "episode": "2",
    "episodes": [
        2
    ],
    "coldOpens": [
        "Michael wants to adopt a child because of watching Oprah. He asks Pam to look it up, but she doesn't, and Michael asks if in thirty years she will want to have a kid with him. Pam agrees. "
    ],
    "storylines": [
        "Michael asks Pam to research information so that he may adopt a Chinese baby, an idea stemming from Angelina Jolie's Oprah appearance. After Pam convinces him to hold off on the idea, Michael implies that he and Pam should conceive a baby together if neither of them has a child in ten years. Pam rejects the suggestion and his substitution of twenty years. She finally agrees to the scenario when Michael suggests thirty years.",
        "Michael and Dwight receive per diem money from Angela for their train trip to Philadelphia, Pennsylvania for the Northeastern Mid-Market Office Supply Convention. Ryan reviews Michael's checklist of his luggage for the trip, including three boxes of condoms and his white \"fun jeans\" which are folded on a hanger and wrapped in plastic. Angela is angry with Dwight for leaving when they had planned to spend time together.",
        "Kelly is excited for a double date she has arranged with herself, Ryan, Pam, and Kelly's neighbor, Alan, a cartoonist for the local newspaper. Kelly urges Pam not to sleep with Alan on the first date. Pam admits in an interview that she is nervous and has not been on a first date in nine years. Overhearing date chat, Michael suggests Pam wear her wedding dress as a joke, and Dwight chimes in that her veil should complete the ensemble. Pam steadfastly says she will wear the same clothes she wore to work that day, and Michael tells her to unbutton her top button to \"let those things breathe a little.\" Noting that Jim will be at the convention, Michael asks Pam if she wants him to relay a message, then teases her as she is only able to get out an, \"Um...\" before he cuts her off.",
        "Creed, having earlier seen Angela \"handing out some shekels\" to Michael and Dwight, wonders how he can \"get on that train\". After being told the cash is for the Philadelphia trip, he and Meredith bash the city of brotherly love. An indignant Angela storms out of the room despite earlier mentioning a Martin family phrase — \"The slow train from Philly\" — used to indicate a potential prostitute in the vicinity. She leaves behind a plate of food that Creed immediately begins to eat. He informs Meredith that \"Andrea is the office bitch\" and proceeds to introduce himself, apparently not recognizing Meredith from the many years they have worked together.",
        "In Philadelphia, Michael calls out \"traitor\" as a friendly greeting to Jim in the hotel lobby. Dwight asks him if he's made any sales and Jim says he has \"sold about $40,000\". Dwight believes the feat impossible, and then says he has done the same, though Michael shakes his head \"no\" in reference to the fact that Dwight has not done $40,000 in sales. (In a talking head, Jim admits that he thought he had matured beyond all of the \"stupid and petty\" antics he'd pulled — at which point Dwight opened his mouth; he then takes it upon himself to obtain a key to Dwight's hotel room.) Michael also converses briefly with Stamford regional manager Josh, who informs Michael that should his branch swallow the Scranton branch, he will find a position within his new Stamford branch for Michael. A cause for concern washes across Michael's face when he hears this. Michael also queries Jan about \"the 800-pound gorilla in the room,\" Carol. Saying that Jan must keep her hands off of him during the convention, Jan tells Michael to move away from her, and Michael thanks her for her cooperation. Angela secretly arrives at the convention incognito under the name \"Jane Doe\".",
        "Michael and Dwight meet Jerome Bettis, who is signing autographs at the convention, and appear to mistake him for Mr. T. Bettis is reluctant to commit to Michael's party in Room 308. Michael informs Dwight that Bettis is nicknamed \"The Bus\" because of the pro-footballer's fear of flight. During lunch, Michael updates Jim on the Scranton happenings including Ryan taking over Jim's position and desk. Jim sends his regards and Michael promises to phone him that afternoon with the sentiment. Jim begins to ask how a former co-worker is doing, but briefly hesitates before the name, eventually naming Toby. Michael responds by asking if Toby was why Jim left, or if he had considered bosses, leading to an inquiry as to what Jim thought of Josh compared to Michael. Jim states that it's not a competition.",
        "Michael assigns Dwight to dig up any dirt on Josh. Michael takes a work-related phone call from Pam, and Jim is surprised when Michael wishes her luck on her date. Dwight informs Michael his contact at the sheriff's office isn't volunteering this day.",
        "Michael promotes a Scranton v. Stamford paper airplane game at the Hammermill booth, but his plane crashes upon takeoff. Jim and Josh head off to other business and Michael brings the Hammermill salesperson to his room where he shares his emotions over Jim leaving his branch and discusses paper with the rep. As a result, Michael surprises the entire Dunder Mifflin contingent with the news he broke Staples' exclusive hold on Hammermill products and secured a deal with the company, impressing Jan. Michael even proceeds to tip the hotel waiter with his company per diem of $100 as just another way to try and impress Jan (which belittles her).",
        "Jim has Dwight's room key and walks in on Angela (whom he mistakes for a prostitute) and he immediately leaves the room. He is shocked by the experience and tries to think of someone to call to share the news.",
        "Back in the Scranton office, Kevin expresses to Toby his lust for Pam now that she has started dating again. Toby responds by pondering and eventually aborting asking her out. Phyllis suggests Pam order an expensive entree at dinner to show she's worth it. Stanley concludes an expensive dinner requires Pam to \"put out.\" which Phyllis agrees would happen.",
        "On the double date, Kelly looks to be the only one having a good time, chatting and shoving food into a fairly embarrassed Ryan's mouth. Pam is nervous and talks to her dull date who states that he gets his comic strip ideas from the world around him, or in a dream. On a napkin, he sketches a scene referencing the 2003 freedom fries controversy, and states that it works on many levels. He reveals people tell him not to be edgy in his cartoons, but it is the only way he knows. When Pam politely laughs, Alan appears to briefly look down her shirt, causing Pam to subtly button it higher.",
        "Jim arrives on the third floor to pulsating vocoder-based electronic music and finds Michael sitting and playing with convention swag by strobe light. He says people have been filtering in and out of the party. Jim asks for a drink, and as Michael serves him a Cosmo, says he realizes that their boss-employee friendship was brief but not something Jim wanted to keep. Jim tells him he did not leave because he is a bad boss and calls Michael a great boss, and he left after he laid himself on the line to Pam and she rejected him, twice.",
        "Now understanding of the situation, Michael says he will talk to Pam, which Jim insists he does not do. Michael also suggests that Jim talk to Roy, because Roy knows exactly how he is feeling. Jim says he might. He and Michael make up and their renewed friendship is announced to party guests from the Hammermill staff.",
        "Pam's date ends with Alan picking his teeth and telling her to bring her sketches next time. She informs the camera that she has not found a love connection.",
        "A final tidbit finds Michael and Dwight preparing the black light for the Room 308 party. The light reveals stains covering the walls, comforter and headboard. Dwight speculates the stains are blood, urine, or semen, and a disgusted Michael says he hopes they are urine."
    ],
    "quotes": [
        [
            {
                "speaker": "Angela",
                "content": " In the Martin family, we like to say, \"Looks like someone took the slow train from Philly.\" That's code for \"check out the slut.\""
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " Um... find out if there's a cheaper, less expensive baby out there, okay?"
            }
        ],
        [
            {
                "speaker": "Pam",
                "content": " You know, she also said the waiting list is like eight months."
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " Eight months?"
            }
        ],
        [
            {
                "speaker": "Pam",
                "content": " Yeah."
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " I don't even know if I'll want a baby in eight months."
            }
        ],
        [
            {
                "speaker": "Pam",
                "content": " Yeah, you probably won't"
            }
        ],
        [
            {
                "speaker": "Jim",
                "content": " You know, when I saw Dwight, I realized how stupid and petty all those pranks I pulled on him were...and then he spoke."
            }
        ]
    ]
}