{
    "season": 3,
    "title": "Women's Appreciation",
    "episode": "21",
    "episodes": [
        21
    ],
    "coldOpens": [
        "Dwight gives Jim a demerit and explains what happens after that. Jim tells him that he is going to give him a full \"disadulation\". "
    ],
    "storylines": [
        "Outrage breaks out in the office after Phyllis gets an unexpected eyeful from a male flasher in the parking lot. Michael tries to downplay the event with humor, questioning in particular why anyone would want to flash Phyllis. When that upsets the employees further, Michael sticks his finger outward through his fly and jokingly pretends that the flasher is back. After realizing that his jokes were horrible miscalculations, Michael overcompensates by verbally blasting the other men with self-righteous, fake-feminist indignance (to appear empathetic with the women).",
        "Next, he forces everyone into an impromptu seminar on the everyday prejudices that women face -- after deeming himself the most qualified to teach it. Oblivious, as usual, to his own biases, Michael makes several sexist verbal gaffes. Panicked, he tries to make it up to the women by offering to take them to the place that they, as women, would feel the most comfortable: the mall. Although they consider the offer extremely condescending, they ultimately decide that they'd rather go shopping than stay at the office.",
        "Dwight takes charge of the effort to find the flasher, and orders Pam to make a sketch of \"the pervert\". However, Phyllis says that she didn't get a good look his face, so Pam draws a picture of Dwight -- but, with a mustache and without glasses. An oblivious Dwight and a vengeful Andy dutifully set about posting fliers with the \"predator's\" face. Later Andy says he would like to take some of the fliers and post them near where he lives (close to a school).",
        "Michael's group outing to the mall comes as he is beginning to openly doubt his relationship with Jan, having received an aggressive \"booty call\" from her earlier that day (which her assistant Hunter dutifully agreed to put on her schedule). Over lunch at the food court, Michael eventually starts \"dishing\" about his romance with Jan, after his attempt to prod them into gossiping yields awkward silence. (Angela abruptly leaves, mostly out of moral outrage, but also to special order clothes for her embarrassingly undersized frame.)",
        "The women encourage him to weigh the pros and cons of his relationship. During the exercise he slowly reveals, with noticeable unease and shame, that Jan is sexually controlling in ways that humiliate him. Karen tries to give Michael reasons to stay and work things out with Jan. Pam insists that his relationship with Jan is unhealthy; an open rivalry between Karen and Pam begins to brew. Finally, Michael flatly states that he's not happy around Jan, and the women convince him that this particular \"con\" outweighs all of the \"pros.\"",
        "Pam is visibly pleased that her intuition won out over Karen's. To thank them for their advice, Michael treats the women to one item each at Victoria's Secret. Karen buys some sexy lingerie for her and Jim's six-month anniversary (which a depressed Pam sees as she buys a fuzzy bathrobe, which she plans to cut up into towels).",
        "Meanwhile, with the women out of the office, Kevin decides it is time to fulfill his fantasy of entering a women's bathroom. He discovers a plush waiting room inside. Later, while Kevin, Jim, Ryan, and Toby hang out in the women's room, Creed enters, and it is revealed that he uses the women's room to \"go number two\" (but has been caught and has had to pay for it). Ryan sheepishly admits to Jim that he'd asked Karen out, via e-mail, in the past.",
        "Jim, visibly caught off-guard, recovers and replies that Karen had already read it to him, and that \"she liked him as a friend.\"",
        "On the way back from the mall, Meredith's minivan breaks down, and Michael is unable to change the tire. Pam steps in and changes it herself. Upon returning to the office, Michael decides to call Jan and end their relationship. When he gets her voicemail, he leaves a message telling her he wants them to \"go on a little break, permanently.\" Before he can finish the message, Jan walks into his office, and Michael hangs up the phone, pretending he was speaking with a friend.",
        "Jan tells Michael that she feels badly about their earlier conversation, so she drove all the way from New York City to personally apologize. Michael, seeming touched but confused, accepts her apology. Her cell phone then buzzes, and Jan is initially pleased to see that she has a voicemail from Michael. Despite Michael's protests, she listens to it immediately. When she hears the message she hangs up the phone; looking hurt, she leaves Michael's office without a word.",
        "The episode ends with Jim giving Dwight a tip on the identity of the flasher. Jim tells him that he saw the pervert above the sink in the women's bathroom. Dwight storms into the bathroom, where a mustache has been drawn on one of the mirrors. Upon seeing his reflection line up with the mustache, Dwight realizes he was duped by Pam."
    ],
    "quotes": [
        [
            {
                "speaker": "Michael",
                "content": " Many women are confident drivers."
            }
        ],
        [
            {
                "speaker": "Dwight",
                "content": " If I could menstruate, I wouldn't have to deal with idiotic calendars anymore. I'd just be able to count down from my previous cycle. Plus, I'd be more in tune with the moon and the tides."
            }
        ],
        [
            {
                "speaker": "Phyllis",
                "content": " I think I just got flashed."
            }
        ],
        [
            {
                "speaker": "Creed",
                "content": " The guy was just hanging brain! I mean, what's all the fuss?"
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " Phyllis? Did this guy even see Pam? Or Karen...from behind?"
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " [to Toby] Prove it, let's see your penis."
            }
        ],
        [
            {
                "speaker": "Angela",
                "content": " Sometimes the clothes at Gap Kids can just be too flashy. So I'm forced to shop at the American Girl Store, and order clothes for large colonial dolls."
            }
        ],
        [
            {
                "speaker": "Dwight",
                "content": " [to Andy] That is because you're a preppy freak, the office pariah, and nobody likes you."
            }
        ],
        [
            {
                "speaker": "Andy",
                "content": " [Noticing Pam's sketch looks similar to Dwight] He looks like a real deviant."
            }
        ],
        [
            {
                "content": "Creed I'm a pretty normal guy. I do one weird thing. I like to go in the women's room for number two. I've been caught several times and I have paid dearly."
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " Any man who says he totally understands women is a fool. 'Cause they are un-understandable."
            }
        ]
    ]
}