{
    "season": 3,
    "title": "The Coup",
    "episode": "3",
    "episodes": [
        3
    ],
    "coldOpens": [
        "Pam makes popcorn because it is Movie Monday but no one wants it. "
    ],
    "storylines": [
        "Pam supervises microwave popcorn in progress in the breakroom as Michael complains of dire hunger. He pulls a DVD copy of Varsity Blues from his office safe and calls it the only cure for Monday blues. Pam explains in an interview that Michael began Movie Monday with training videos, and continued the tradition with an ill-received medical video, likely a birthing video, six repeats of a single episode of Entourage and finally a feature film in thirty-minute increments. Prior to the screening, Michael selects an excited Kevin to recite the previous action in the film, to bring the audience up to speed.",
        "Angela states her opposition to Movie Monday and indeed is the only staffer not in attendance when Jan pops into the branch unexpectedly. Jan scolds Michael despite his explanation that productivity increases following the screenings as employees must work harder due to the lost time.",
        "In interviews, Angela and Dwight both note that Jan seems to have a vendetta against Michael for his choosing Carol over her, and fear it might affect the prospects of the Scranton branch. Angela summons Dwight to the breakroom, where they speak in their traditional manner with their back to each other. Angela tells Dwight she fears for their jobs under Michael's leadership and tells Dwight to speak to Jan about taking over the branch. In the parking lot, Dwight reaches Jan on her cell phone one hour out of Scranton. She does not want to speak but listens when he says it concerns Michael. Dwight instructs her to shop at the nearby Liz Claiborne outlet store — which he has determined to be a favorite brand of hers — until he can reach her. In order to leave, he tells Michael he is visiting a new dentist who works far away, so he will be gone for about three hours.",
        "Jan and Dwight sit at a nearby diner where he orders two plates of waffles and begins to propose taking over the branch. Pouring syrup maniacally and proceeding to eat in a deliberate way for effect, he states that he could do the job better by firing half the staff, to whom he swears no loyalty since he doesn't care about any of his co-workers. As the meeting ends and Dwight sloppily devours his meal in front of her, he urges Jan to check out a new Ann Taylor outlet store nearby, as he has noticed that she is fond of the brand's earrings. Jan calls Michael, relays the entire meeting and demands he gets his branch under control.",
        "Meanwhile, the Stamford branch has its own distraction, the computer war game Call of Duty, being played under the guise of a team-building exercise. New to the game, Jim plays poorly and he mentions video games weren't played at his former office. He does, however, reveal a prank in which he and Pam hummed the same high note in the hopes of Dwight scheduling an appointment to have his hearing checked, an activity Pam dubbed \"pretendinitis\".",
        "Back in Scranton, Pam shops online for new clothes at Kelly's insistence. Upon the clothes' arrival, Kelly demands through chanting that Pam performs a lunchtime fashion show. Though Kelly, Phyllis, and Meredith compliment her on her clothes, Pam claims \"it's too much\" and considers returning them. Roy enters the breakroom and tells Pam she looks pretty. Kelly asks if that is his third soda of the day, to which he doesn't respond.",
        "In Stamford, Jim manages to kill a player, but the thrill is short-lived as he is told he's killed a teammate on the German side. As another game starts up, Josh calls Jim and Andy for an impromptu huddle about game strategy. Andy blames the defeat on \"the new guy,\" and as Jim reveals his use of a sniper rifle, both co-workers react in disgust, with Josh scolding Jim for using the weapon on an inappropriate map, and Andy claiming he is going to shoot Jim \"for real.\"",
        "Upon Dwight's return, a calm but clearly offended Michael initially tries to make him admit he didn't go to the dentist by feeding him M&M's and asking for the dentist's name, to which Dwight replies \"Crentist.\" When Michael notes how the name sounds strangely like \"dentist,\" Dwight reasons it may have been why he chose the profession. Later, Michael tells Dwight that Jan has called to demote him to Dwight's position as Assistant (to the) Regional Manager, and Dwight should be expecting a call from Corporate to take over as acting Regional Manager. Announcing it to the office, multiple people question Dwight's selection, and Kevin even expresses concern about Michael possibly losing his condo. Angela is the only one to congratulate Dwight, though later when she says in private that they could make a difference together, he corrects her to say as he would make a difference. Though Angela seems upset at first, she then smirks as Dwight offers her to be in charge of the female staff.",
        "Michael eventually reveals the trick when Dwight casually refuses the keys to Michael's Corporate Chrysler Sebring convertible and insults the vehicle due to its poor gas mileage and impracticality in Scranton's climate. Taking the remark personally, Michael blows up at Dwight after he refuses to take back what he said, especially after Dwight previously stated that he loved the car (a lie meant to appease Michael). In turn, Dwight begins to beg for his job and grovels at the floor for Michael's forgiveness, offering to do his laundry for a month, then a year, to which Michael responds he has a laundry machine. Michael then forgives him and tells him to \"Hug it out, bitch,\" which, Michael tells the camera, is what men say and do to each other after a fight (a reference to Michael's obsession with Entourage). Dwight returns quickly to being Michael's loyal right-hand man at the next Movie Monday, as Angela looks on in disappointment.",
        "Pam decides to return to dressing her usual way at work when Creed walks over to her desk, blatantly looks down her shirt and refuses to leave the area. Pam covers up with a sweater and decides to keep the clothes for outside of the office.",
        "Jim still can't get the hang of the game, and Karen catches him jumping in a corner trying to shoot with a smoke grenade. Karen tells the camera to \"look at how cute he is,\" before telling Jim to turn his character around. Requesting any last words, she shoots his character point blank. Jim then turns to the camera and whispers \"psychopath.\" At the end of the day, Jim pretends to throw a grenade towards her desk when leaving, to which she tosses a few paper clips in the resulting explosion. They laugh, and after he leaves, she still gives a slight wave and continues to stare at the exit.",
        "Deciding he still harbored resentment towards Dwight, Michael forces him to solemnly stand atop a box with a \"LIAR\" sign dangling from his neck, in addition to one year of indentured servitude as a launderer."
    ],
    "quotes": [
        [
            {
                "speaker": "Michael",
                "content": " Business is like a jungle. And I... am like a tiger. And Dwight is like a monkey, that stabs the tiger in the back with a stick. Does the tiger fire the monkey? Does the tiger transfer the monkey to another branch? Pun. There is no way of knowing what goes on inside the tiger's head. We don't have the technology."
            }
        ]
    ]
}