{
    "season": 3,
    "title": "Grief Counseling",
    "episode": "4",
    "episodes": [
        4
    ],
    "episodeDetails": {
        "sections": [
            {
                "title": "Grief Counseling",
                "level": 1,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "\"Grief Counseling\" is the fourth episode of the third season of The Office and the 32nd overall. It was written by Jennifer Celotta and directed by Roger Nygard. It first aired on October 12, 2006. It was viewed by 8.8 million people."
                    }
                ],
                "images": []
            },
            {
                "title": "Summary",
                "level": 2,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Michael feigns walking descending a staircase behind a stack of paper boxes under the guise of retrieving a pencil \"from the warehouse\" for a reluctant Ryan. An overzealous Dwight prompts a second go-around of the joke, and Pam keeps the joke alive, pleading for a cup of coffee, which Michael crawls to the breakroom to retrieve. In an interview, he likens himself to Bette Midler in For the Boys: \"Gotta keep the troops entertained.\" Upon his return crawl, Pam requests cream and sugar in her coffee of her now-exhausted boss."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael flips through his Rolodex and starts to flirt with Jan on the phone after she tells him \"We've lost Ed Truck.\" He is shaken to learn Jan hasn't lost a contact number, but that the former Scranton branch manager has died. Kelly and Phyllis console Michael after he breaks the news to a mostly unmoved staff. He announces he'll be in his office for consolation pop-ins, but with no takers he wanders to the reception desk and engulfs Pam in an awkward too-long hug, telling her Truck was \"almost 70, so ... circle of life.\""
                    },
                    {
                        "type": "paragraph",
                        "text": "Meanwhile at a staff meeting in Stamford, Karen irritates Josh when she neglects to compile a supply list for Fairfield County Schools. She is angered when Josh asks Jim to ensure she completes the task. Jim agrees and Andy calls him a suck-up in a barely disguised cough. In the Stamford breakroom, Karen is dismayed to learn the vending machine is out of salt and vinegar Herr's potato chips, and turns her meeting room ire on a friendly Jim, telling him her snack food needs do not fall under his authority. He counters that he does have that power, and no work shall be completed until the chips she requires are procured."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael makes a comment on Creed's age, but the mood changes when Creed mentions Truck was decapitated after flying down Route 6, drunk as a skunk and sliding his vehicle beneath an 18-wheeler. Dwight steals Michael's thunder with a blunt announcement of the latest news. Dwight receives only disgust from his \"Monkey\" when he asks her to pack his decapitated head on ice should that fate ever befall him. In an interview, Dwight explains he would like to be frozen, even in pieces, so that he may one day be reanimated with the knowledge to avoid the same death in the future."
                    },
                    {
                        "type": "paragraph",
                        "text": "On speakerphone with Jan, Michael laments the fact that the staff receives a whole day off in honor of Martin Luther King, Jr., \"and he didn't even work here.\" On his desk is a decade-old Dunder Mifflin newsletter with a full-color photo of Truck and a mulleted Michael above a headline reading \"Michael Scott achieves top sales honors for Third straight quarter.\" In lieu of a day off, Michael suggests a full-size statue of Truck with illuminated eyes and mobile arms. Jan finds the idea unrealistic and hangs up, but an ever-resourceful Dwight prepares a schematic of a 2/3 size Truck robot with a six-foot extension cord in case it were to gain self-awareness and turn against the staff."
                    },
                    {
                        "type": "paragraph",
                        "text": "Back in Stamford, Jim phones potential chip sources as Karen prepares to give up the search. Gentle taunting lures her back in as she assures him \"I am not a quitter.\" The pair mock Andy when he tries to horn in on their activity via inane suggestion."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael disgusts some employees by imagining the bloodbath Truck endured when his \"cappa was de-tated ... from his head.\" He summons the staff to a primitive grief counseling session involving a collapsible Hoberman Sphere ball. Expounding on his feeling at the loss of his beloved ex-boss, he says it \"feels like my heart has been dropped into a bucket of boiling tears and someone else is hitting my soul in the crotch with a frozen sledgehammer and a third guy is punching me in the griefbone, but no one hears me because I'm terribly, terribly alone.\""
                    },
                    {
                        "type": "paragraph",
                        "text": "Roy pulls Pam from the session under the pretense of addressing a problem with her car. In the parking lot, Pam and Roy have a banal chat about her car's airbags and he asks if she's \"still driving too fast.\" Upon her return to the grief session, she finds Michael had put the whole thing on hold because \"we wait for a family member.\" Stanley refuses to play Michael's grief game but Dwight gladly tells the group he resorbed another fetus while still in the womb, making him as strong as a man combined with a baby. Pam, Ryan, and Kevin tell progressively implausible stories based on movie plots, angering Michael when he realizes what they are doing."
                    },
                    {
                        "type": "paragraph",
                        "text": "Toby tells Michael death is a part of life, and uses an example of a bird that flew into a Dunder Mifflin first-floor window that morning. Mortified that Toby did not investigate the bird's health, Michael charges outside, picks up the deceased animal and attempts to resuscitate it via mouth-to-mouth, rebuking Dwight's pleas to drop the germ-ridden being."
                    },
                    {
                        "type": "paragraph",
                        "text": "When attempts to revive the bird fail, Michael schedules a 4 p.m. parking lot funeral for the bird and putting the kibosh on office productivity for the day, despite staff telling him that they all still have a lot of work to complete. Dwight breaks off the bird's beak in an attempt to stuff it through the pop-tab of an empty soda can. In an interview he comments on the resourcefulness of farm-dwellers such as himself and reveals his grandfather was reburied in an oil drum."
                    },
                    {
                        "type": "paragraph",
                        "text": "Pam fashions a makeshift coffin and reads a prepared speech that comforts Michael. She mentions that although the bird was an unknown among the staff, it surely did not die alone as it had the company of other birds, and likely wanted to get into Dunder Mifflin Scranton in order to serenade the staff with a song. Michael is noticeably moved from the speech as his eyes well with tears. Dwight interrupts her to state that the deceased was \"not a songbird.\" Pam accompanies Dwight who plays \"On the Wings of Love\" on his recorder. The coffin is placed in a box of shredded paper and set afire."
                    },
                    {
                        "type": "paragraph",
                        "text": "Karen finds a bag of Herr's on her desk and, in a voiceover, Jim says he traced the chips from the manufacturer to the distributor to the vending machine company to an adjacent office building."
                    },
                    {
                        "type": "paragraph",
                        "text": "Dwight extinguishes and stomps out the funeral pyre and coffin before ordering warehouse employees to \"get a broom, mush.\""
                    }
                ],
                "images": []
            },
            {
                "title": "Deleted scenes",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Hannah shows Jim pictures of her baby, including one of the baby and her husband naked in the tub.",
                                "elements": []
                            },
                            {
                                "text": "Extension of the scene in which Michael learns of Ed Truck's death. Michael is more preoccupied with the fact that he is the first person in the office to learn about Ed's death than with the death itself.",
                                "elements": []
                            },
                            {
                                "text": "Dwight instructs the staff to remove all evidence of Ed Truck. In a talking head interview, Dwight explains that the way to pay one's respects is to work to prevent whatever it was that killed the person. Dwight has ideas on how Ed's death could have been prevented.",
                                "elements": []
                            },
                            {
                                "text": "Michael announces that he has invited a grief counselor to come to the office, but the other office staff consider it a waste of time. Michael is upset to learn that Toby is a trained grief counselor.",
                                "elements": []
                            },
                            {
                                "text": "Roy visits Pam and laughs enthusiastically at her little jokes.",
                                "elements": []
                            },
                            {
                                "text": "Toby leads a grief counseling session, but since nobody appears to be affected by Ed's passing, Toby wraps it up. Michael is furious that Toby is giving up so easily. In a talking head interview, Michael calls Toby \"a plague on this company.\"",
                                "elements": []
                            },
                            {
                                "text": "In a talking head interview, Ryan explains that since he didn't know Ed Truck, he will spend the counseling session mentally planning his weekend. \"I think Ed would have wanted it that way.\"",
                                "elements": []
                            },
                            {
                                "text": "Michael begins his grief counseling session by telling everyone to loosen up, even take off their shoes if they wish. Kevin takes off his shoes, and Angela objects. In a talking head interview, Kevin explains that hyperhidrosis is a medical condition.",
                                "elements": []
                            },
                            {
                                "text": "Toby explains that the ball-throwing exercise is an approved technique... for brainstorming exercises.",
                                "elements": []
                            },
                            {
                                "text": "Extension of Pam and Roy's small talk in the parking lot.",
                                "elements": []
                            },
                            {
                                "text": "Michael morosely plays with a toy truck on his desk. The cab falls off.",
                                "elements": []
                            },
                            {
                                "text": "In a talking head interview, Pam explains that Michael has told her that Home Alone is the saddest movie ever because a boy is abandoned in his house.",
                                "elements": []
                            },
                            {
                                "text": "Michael and Dwight try unsuccessfully to dig a grave for the bird.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "References to Previous Episodes",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Dwight states he \"re-buried\" his grandfather in an old oil drum. This could be how he got the tuxedo he wore in Casino Night.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Goofs/Trivia",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "The entire episode, Michael grieves for Ed and gets angry when no one expresses true condolences. However, in The Carpet, Michael talks about Ed negatively and is rather short and dismissive when Ed tries to offer him advice. This doesn't seem to be a goof so much as Michael's character attention-seeking after the death of someone relatively close to him and who had his old job, rather than necessarily grieving for Ed Truck the man.",
                                "elements": []
                            },
                            {
                                "text": "It is unknown how Creed knew of the death of Ed Truck because Michael stated that it was news that corporate wanted to give him first. It is possible considering Creed is known for twisting facts that he simply made up the whole story as a pun on Ed losing his head to a truck (Head Truck). He also made up a similar story about Dwight being decapitated in The Return, further indicating that he might be lying about Ed.",
                                "elements": []
                            },
                            {
                                "text": "When Karen is at the vending machine, a bag of the chips she desires—Herr's Salt and Vinegar—can be seen along the left-hand side of the vending machine.",
                                "elements": []
                            },
                            {
                                "text": "The bird that is honored is a sparrow and not a songbird.",
                                "elements": [
                                    {
                                        "text": "After Pam said the bird might have tried to come inside to sing them a song Dwight corrects her saying that it wasn't a songbird.",
                                        "elements": []
                                    }
                                ]
                            },
                            {
                                "text": "During the funeral scene and just before Ryan started talking about his fish's funeral, there is a wide shot of the group in which B.J. Novak can be briefly seen grinning widely and glancing at the camera. This would neither be in Ryan's character or appropriate considering the circumstances.",
                                "elements": []
                            },
                            {
                                "text": "While talking to Jan, the camera briefly shows the same photo with Michael and Ed Truck from The Carpet, slowly covering up as something is being printed. In the same shot, what appears to be an envelope has Dunder Mifflin's address on it, but says \"SLAUGH\" instead of Slough.",
                                "elements": []
                            },
                            {
                                "text": "When Michael's phone is shown while talking to Jan, the date is shown as 09/01/06, and the caller ID says \"From 1006\" and gives Michael's phone 1026 - presumably meaning they use a working internal phone system for the show (with extensions 10XX). \"2:14\" is also displayed, separate from the date, which may be the elapsed time for the call.",
                                "elements": []
                            },
                            {
                                "text": "Luanne is seen in The Annex in this episode but does not appear at the bird funeral.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Cultural references",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "In the movie For the Boys, Bette Midler plays a singer and dancer who entertains soldiers in World War II.",
                                "elements": []
                            },
                            {
                                "text": "Herr's is a manufacturer of snack foods based in Pennsylvania.",
                                "elements": []
                            },
                            {
                                "text": "U.S. Route 6 passes through Scranton.",
                                "elements": []
                            },
                            {
                                "text": "Martin Luther King was a civil rights leader. His birthday is a federal holiday.",
                                "elements": []
                            },
                            {
                                "text": "The West Side Market is a grocery store in Stamford close to downtown.",
                                "elements": []
                            },
                            {
                                "text": "Pam's story follows the plot of the movie Million Dollar Baby. Ryan's story is The Lion King, and Kevin's is Weekend at Bernie's.",
                                "elements": []
                            },
                            {
                                "text": "You can't get diseases from a bird! At the time the episode was written, concern over a possible avian flu pandemic was growing in the public consciousness.",
                                "elements": []
                            },
                            {
                                "text": "Good grief! is an expression of exasperation and is a catch phrase of cartoon character Charlie Brown.",
                                "elements": []
                            },
                            {
                                "text": "The song Pam sings at the bird's funeral is On the Wings of Love by Jeffery Osbourne .",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Cast",
                "level": 2,
                "content": [],
                "images": []
            },
            {
                "title": "Main Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Steve Carell as Michael Scott",
                                "elements": []
                            },
                            {
                                "text": "Rainn Wilson as Dwight Schrute",
                                "elements": []
                            },
                            {
                                "text": "John Krasinski as Jim Halpert",
                                "elements": []
                            },
                            {
                                "text": "Jenna Fischer as Pam Beesly",
                                "elements": []
                            },
                            {
                                "text": "B.J. Novak as Ryan Howard",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Supporting Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Melora Hardin as Jan Levenson",
                                "elements": []
                            },
                            {
                                "text": "David Denman as Roy Anderson",
                                "elements": []
                            },
                            {
                                "text": "Leslie David Baker as Stanley Hudson",
                                "elements": []
                            },
                            {
                                "text": "Brian Baumgartner as Kevin Malone",
                                "elements": []
                            },
                            {
                                "text": "Kate Flannery as Meredith Palmer",
                                "elements": []
                            },
                            {
                                "text": "Mindy Kaling as Kelly Kapoor",
                                "elements": []
                            },
                            {
                                "text": "Angela Kinsey as Angela Martin",
                                "elements": []
                            },
                            {
                                "text": "Paul Lieberstein as Toby Flenderson",
                                "elements": []
                            },
                            {
                                "text": "Phyllis Smith as Phyllis Lapin",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Recurring Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Ed Helms as Andy Bernard",
                                "elements": []
                            },
                            {
                                "text": "Rashida Jones as Karen Filippelli",
                                "elements": []
                            },
                            {
                                "text": "Creed Bratton (actor) as Creed Bratton",
                                "elements": []
                            },
                            {
                                "text": "Charles Esten as Josh Porter",
                                "elements": []
                            },
                            {
                                "text": "Ursula Burton as Hannah Smoterich-Barr (Deleted Scenes)",
                                "elements": []
                            },
                            {
                                "text": "Calvin Tenner as Calvin (Uncredited)",
                                "elements": []
                            },
                            {
                                "text": "Phillip Pickard as Philip (Uncredited)",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            }
        ]
    },
    "quotesDetails": {
        "sections": [
            {
                "title": "Grief Counseling Quotes",
                "level": 1,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Dwight: When I die, I wanna be frozen. And if they have to freeze me in pieces, so be it. I will wake up stronger than ever because I will have used that time to figure out exactly why I died and what moves I could have used to defend myself better now that I know what hold he had me in."
                    },
                    {
                        "type": "paragraph",
                        "text": "Ryan: When I was five, my mom told me that my fish went to the hospital...in the toilet. And, it never came back, so...we had a funeral for it. And I remember thinking, \"I'm a little too old for this\" - and I was five."
                    },
                    {
                        "type": "paragraph",
                        "text": "Creed: Ed was decapitated."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael: What?"
                    },
                    {
                        "type": "paragraph",
                        "text": "Dwight: Really?"
                    },
                    {
                        "type": "paragraph",
                        "text": "Creed: He was drunk as a skunk, he was flying down Route 6. He slides under an 18 wheeler. Pop. It snaps right off."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael: Oh my God."
                    },
                    {
                        "type": "paragraph",
                        "text": "Dwight: That is the way to go. Instant death. Very smart."
                    },
                    {
                        "type": "paragraph",
                        "text": "Creed: You know a human can go on living for several hours after being decapitated."
                    },
                    {
                        "type": "paragraph",
                        "text": "Dwight: You're thinking of a chicken."
                    },
                    {
                        "type": "paragraph",
                        "text": "Creed: What did I say? "
                    }
                ],
                "images": []
            }
        ]
    },
    "coldOpens": [
        "Michael asks Ryan if he wants a pencil from the warehouse then walks to the 'warehouse' behind a stack of boxes. "
    ],
    "storylines": [
        "Michael feigns walking descending a staircase behind a stack of paper boxes under the guise of retrieving a pencil \"from the warehouse\" for a reluctant Ryan. An overzealous Dwight prompts a second go-around of the joke, and Pam keeps the joke alive, pleading for a cup of coffee, which Michael crawls to the breakroom to retrieve. In an interview, he likens himself to Bette Midler in For the Boys: \"Gotta keep the troops entertained.\" Upon his return crawl, Pam requests cream and sugar in her coffee of her now-exhausted boss.",
        "Michael flips through his Rolodex and starts to flirt with Jan on the phone after she tells him \"We've lost Ed Truck.\" He is shaken to learn Jan hasn't lost a contact number, but that the former Scranton branch manager has died. Kelly and Phyllis console Michael after he breaks the news to a mostly unmoved staff. He announces he'll be in his office for consolation pop-ins, but with no takers he wanders to the reception desk and engulfs Pam in an awkward too-long hug, telling her Truck was \"almost 70, so ... circle of life.\"",
        "Meanwhile at a staff meeting in Stamford, Karen irritates Josh when she neglects to compile a supply list for Fairfield County Schools. She is angered when Josh asks Jim to ensure she completes the task. Jim agrees and Andy calls him a suck-up in a barely disguised cough. In the Stamford breakroom, Karen is dismayed to learn the vending machine is out of salt and vinegar Herr's potato chips, and turns her meeting room ire on a friendly Jim, telling him her snack food needs do not fall under his authority. He counters that he does have that power, and no work shall be completed until the chips she requires are procured.",
        "Michael makes a comment on Creed's age, but the mood changes when Creed mentions Truck was decapitated after flying down Route 6, drunk as a skunk and sliding his vehicle beneath an 18-wheeler. Dwight steals Michael's thunder with a blunt announcement of the latest news. Dwight receives only disgust from his \"Monkey\" when he asks her to pack his decapitated head on ice should that fate ever befall him. In an interview, Dwight explains he would like to be frozen, even in pieces, so that he may one day be reanimated with the knowledge to avoid the same death in the future.",
        "On speakerphone with Jan, Michael laments the fact that the staff receives a whole day off in honor of Martin Luther King, Jr., \"and he didn't even work here.\" On his desk is a decade-old Dunder Mifflin newsletter with a full-color photo of Truck and a mulleted Michael above a headline reading \"Michael Scott achieves top sales honors for Third straight quarter.\" In lieu of a day off, Michael suggests a full-size statue of Truck with illuminated eyes and mobile arms. Jan finds the idea unrealistic and hangs up, but an ever-resourceful Dwight prepares a schematic of a 2/3 size Truck robot with a six-foot extension cord in case it were to gain self-awareness and turn against the staff.",
        "Back in Stamford, Jim phones potential chip sources as Karen prepares to give up the search. Gentle taunting lures her back in as she assures him \"I am not a quitter.\" The pair mock Andy when he tries to horn in on their activity via inane suggestion.",
        "Michael disgusts some employees by imagining the bloodbath Truck endured when his \"cappa was de-tated ... from his head.\" He summons the staff to a primitive grief counseling session involving a collapsible Hoberman Sphere ball. Expounding on his feeling at the loss of his beloved ex-boss, he says it \"feels like my heart has been dropped into a bucket of boiling tears and someone else is hitting my soul in the crotch with a frozen sledgehammer and a third guy is punching me in the griefbone, but no one hears me because I'm terribly, terribly alone.\"",
        "Roy pulls Pam from the session under the pretense of addressing a problem with her car. In the parking lot, Pam and Roy have a banal chat about her car's airbags and he asks if she's \"still driving too fast.\" Upon her return to the grief session, she finds Michael had put the whole thing on hold because \"we wait for a family member.\" Stanley refuses to play Michael's grief game but Dwight gladly tells the group he resorbed another fetus while still in the womb, making him as strong as a man combined with a baby. Pam, Ryan, and Kevin tell progressively implausible stories based on movie plots, angering Michael when he realizes what they are doing.",
        "Toby tells Michael death is a part of life, and uses an example of a bird that flew into a Dunder Mifflin first-floor window that morning. Mortified that Toby did not investigate the bird's health, Michael charges outside, picks up the deceased animal and attempts to resuscitate it via mouth-to-mouth, rebuking Dwight's pleas to drop the germ-ridden being.",
        "When attempts to revive the bird fail, Michael schedules a 4 p.m. parking lot funeral for the bird and putting the kibosh on office productivity for the day, despite staff telling him that they all still have a lot of work to complete. Dwight breaks off the bird's beak in an attempt to stuff it through the pop-tab of an empty soda can. In an interview he comments on the resourcefulness of farm-dwellers such as himself and reveals his grandfather was reburied in an oil drum.",
        "Pam fashions a makeshift coffin and reads a prepared speech that comforts Michael. She mentions that although the bird was an unknown among the staff, it surely did not die alone as it had the company of other birds, and likely wanted to get into Dunder Mifflin Scranton in order to serenade the staff with a song. Michael is noticeably moved from the speech as his eyes well with tears. Dwight interrupts her to state that the deceased was \"not a songbird.\" Pam accompanies Dwight who plays \"On the Wings of Love\" on his recorder. The coffin is placed in a box of shredded paper and set afire.",
        "Karen finds a bag of Herr's on her desk and, in a voiceover, Jim says he traced the chips from the manufacturer to the distributor to the vending machine company to an adjacent office building.",
        "Dwight extinguishes and stomps out the funeral pyre and coffin before ordering warehouse employees to \"get a broom, mush.\""
    ],
    "quotes": [
        "Dwight: When I die, I wanna be frozen. And if they have to freeze me in pieces, so be it. I will wake up stronger than ever because I will have used that time to figure out exactly why I died and what moves I could have used to defend myself better now that I know what hold he had me in.",
        "Ryan: When I was five, my mom told me that my fish went to the hospital...in the toilet. And, it never came back, so...we had a funeral for it. And I remember thinking, \"I'm a little too old for this\" - and I was five.",
        "Creed: Ed was decapitated.",
        "Michael: What?",
        "Dwight: Really?",
        "Creed: He was drunk as a skunk, he was flying down Route 6. He slides under an 18 wheeler. Pop. It snaps right off.",
        "Michael: Oh my God.",
        "Dwight: That is the way to go. Instant death. Very smart.",
        "Creed: You know a human can go on living for several hours after being decapitated.",
        "Dwight: You're thinking of a chicken.",
        "Creed: What did I say? "
    ]
}