{
    "season": 3,
    "title": "Initiation",
    "episode": "5",
    "episodes": [
        5
    ],
    "episodeDetails": {
        "sections": [
            {
                "title": "Initiation",
                "level": 1,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "\"Initiation\" is the fifth episode of the third season of The Office and the 33rd overall. It was written by B.J. Novak and directed by Randall Einhorn. It first aired on October 19, 2006."
                    }
                ],
                "images": []
            },
            {
                "title": "Synopsis",
                "level": 2,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Dwight abruptly begins to quiz Ryan with brain teasers, but becomes frustrated and screams \"Dammit!\" when Ryan recites answers to the puzzles, many before the full question is asked."
                    },
                    {
                        "type": "paragraph",
                        "text": "Jan questions Michael's productivity and presses him on his accomplishments during the previous workday. Michael says he \"worked, went home to his condo, and Carol came over, and we had sex.\" Jan instructs Pam to log Michael's hourly activity \"so we can analyze it at Corporate\". Jan walks out of the office as Pam begins to protest."
                    },
                    {
                        "type": "paragraph",
                        "text": "Dwight pesters Ryan about his excitement level for his first-ever sales call and informs the camera why he is so excited: Ryan has yet to make an ally within the office, and Dwight hopes to steer him clear of being a \"slacker-loser-wiseass like Jim\" and draft him in the \"Dwight army of champions.\" That afternoon, Dwight drives Ryan to a beet field, smirks to the cameraman in the backseat and tells Ryan \"Your journey begins now.\""
                    },
                    {
                        "type": "paragraph",
                        "text": "At Dunder Mifflin Stamford, Karen is disturbed to find her chair squeaks and accuses Jim of a chair swap. He protests that he simply switched them back after she made the original switch. Karen promises to switch chairs while he's away from his desk, so he vows not to stand and proves such by rolling to the copy machine."
                    },
                    {
                        "type": "paragraph",
                        "text": "On a phone call, Michael imitates Bill Cosby: \"I love Jell-O puddin' pops. My son Theo loves puddin' pops, too.\" Pam shows the camera \"Cosby Impression\" for the 10:00 hour in the log."
                    },
                    {
                        "type": "paragraph",
                        "text": "Dwight asks Ryan to take the beet seed from his palm. Ryan misses and Dwight asks him to try again. However, Ryan is faster and takes the seed leaving Dwight in an awkward position. After that, The Assistant Regional Manager asks Ryan to plant the beet seed. Dwight says to the young salesman \"just as you planted that seed, I shall plant my seed in you\" to which the young salesman says \"I don't think you know what you're saying.\" Dwight says the bad odor in the area is \"called bull crap\" and states that \"clients can smell it from a mile away\". Dwight suddenly announces he forgot something in his car and runs toward the vehicle, gets in and speeds away."
                    },
                    {
                        "type": "paragraph",
                        "text": "A loudspeaker announces free soft pretzels being given away in the lobby. Stanley and Michael immediately head for the door. In interviews, Stanley proclaims that pretzel day is his favorite day of the year, Pam admits it is a big deal for some people and Michael says he cannot be productive when there is one thing in his brain which he just can't get out, especially when that one thing is soft pretzels."
                    },
                    {
                        "type": "paragraph",
                        "text": "A long pretzel line peeves Michael and he and Stanley rebuff Phyllis' attempt to jump the line with Bob Vance of Vance Refrigeration; Stanley sees past his disdain for Michael and high-fives him. Pam asks Michael to use his time in line to authorize some checks, but he instead has her hold his place in line while he uses the restroom. She offers to brings him a pretzel if Michael returns to the office, but he explains that if she ordered his pretzel incorrectly \"then ... this whole thing's blown.\" Shown to the camera, the productivity log now reads \"Stood in Pretzel line\" for the noon hour."
                    },
                    {
                        "type": "paragraph",
                        "text": "Angry Ryan walks alone up a dirt road, muttering to himself. He knocks on a barn door, and Dwight jumps out: \"Congratulations, resourceful salesman! Welcome to Schrute Farm!\" Dwight then gives him his signature salute. Having passed Dwight's second challenge, Ryan sits in a Victorian-era wheelchair and Dwight assures him to \"Pay no attention to the spirits that haunt this hallowed ground!\""
                    },
                    {
                        "type": "paragraph",
                        "text": "Dwight quizzes Ryan about Dunder Mifflin, the death of company cofounder Robert Mifflin, the purpose of the DHARMA Initiative, and Michael's greatest fear, to which Ryan answers \"loneliness. Maybe women.\" Dwight responds: \"Wrong. He's not afraid of anything. Also I would have accepted snakes\"."
                    },
                    {
                        "type": "paragraph",
                        "text": "Dwight later states that one cannot sell if one has fear \"You must vanquish fear.\" Suddenly, Cousin Mose appears with the word \"Fear\" on his shirt in tape, and Dwight tells Ryan as his final test he must wrestle Mose to the ground. Ryan calls Dwight a freak and storms out, despite Dwight's protests and instructions to get inside a coffin. Mose remarks \"he seemed nice,\" and Dwight asks \"Where are all the animals?\""
                    },
                    {
                        "type": "paragraph",
                        "text": "At Stamford, Karen begins to continually squeak her chair. Jim quickly begins to sing the chorus of The Cardigans' \"Lovefool\", despite Karen's objections that the song is unfair retaliation and \"will be in her head all day.\" The camera pans to Andy, who is conducting and lip synching along with Jim's vocals, out of sight. In an interview, Andy completes the song's chorus — \"I don't care 'bout anything but you\" — and ponders the whereabouts of the band. Eventually the squeaky chair gets passed to Andy when he isn't in the room."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael finally arrives at the front of the line and orders \"The Works\" — a sweet pretzel with all 18 sweet toppings. Back upstairs, he plays energetic music, then suddenly emerges from his office and launches into a hyperactive, sugar-fueled speech filled with suggestions on improving office efficiency."
                    },
                    {
                        "type": "paragraph",
                        "text": "Inside his Trans Am, Dwight catches up with Ryan as he walks along the road, apologizes and displays gifts Mose sent, including fresh eggs, fatback bacon, and \"something he whittled,\" which appears to be a Venus of Willendorf figurine. After being pleaded with, Ryan gets in the car where Dwight explains that the lack of a friendship with Jim was the main impetus for the initiation ceremony. Dwight then begins to give Ryan sales-call pointers which Ryan tries to memorize. His final advice is for Ryan to \"K.I.S.S. — Keep It Simple Stupid.\""
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael sleeps face-down on his desk. Jan phones for him, but Pam says he's on a sales call."
                    },
                    {
                        "type": "paragraph",
                        "text": "A dejected Ryan walks out of the sales call as Dwight tries to cheer him up. Ryan gripes that the potential client told him to his face that they didn't like him. In retaliation, Ryan begins to throw Mose's eggs at the building and CEO reserved parking sign. Surprised at Ryan's initiative, Dwight joins him, shouting \"Oh no, no, no,\" until two security guards saunter out, at which point the pair peel out of the parking lot in Dwight's Firebird. They go to a bar and drink boilermakers, and as a result of the day's events, Dwight no longer calls Ryan \"Temp\" but instead uses his given name."
                    },
                    {
                        "type": "paragraph",
                        "text": "At the end of the work day, Pam realizes that Michael's antics helped him make a large sale. Having forgotten Kevin's phone extension, Jim calls Dunder Mifflin's main number, hoping to leave him a voicemail regarding a fantasy football issue. Pam answers and says she's staying late because of her new assignment to chronicle Michael's work day, a copy of which she promises to send to Jim. The pair enjoy a long chat about her tiny apartment and her scary solo movie night in which she rented 28 Days Later rather than 28 Days. They start to reconnect, but Ryan and Dwight, both exhausted, return to the office for a few seconds and she loudly says goodbye to the pair as they exit. Jim misconstrues the exclamation, and the pair hang up."
                    },
                    {
                        "type": "paragraph",
                        "text": "A satiated Stanley remarks in an interview that in 364 days, it will once again be Pretzel Day."
                    }
                ],
                "images": []
            },
            {
                "title": "Deleted scenes",
                "level": 2,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "The Season Three DVD contains a number of deleted scenes."
                    },
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Michael tells Jan that he can't keep an hourly log because sometimes he's in \"the zone\" and sometimes he's \"zoning out.\" Jan, quietly angry, tells Michael that his job is on the line. In a talking head interview, Pam explains: \"It's like Mommy and Daddy are fighting. Except Mommy outranks Daddy. And Mommy is way scarier.\"",
                                "elements": []
                            },
                            {
                                "text": "Dwight brings Ryan into Michael's office, telling Michael he will never be seeing the young employee again. \"I am bringing this boy home a full-grown man.\" Michael gives Ryan an uncomfortable hug, and Dwight tries to join in.",
                                "elements": []
                            },
                            {
                                "text": "In a talking head interview, Pam explains that if they find Ryan's body in a heavily-wooded area, Jim owes her $30. \"It's an old bet.\"",
                                "elements": []
                            },
                            {
                                "text": "Dwight takes Ryan to his locked car and tells Ryan that \"the key is inside you.\" Dwight produces the car key from Ryan's ear and looks to the camera, impressed with himself. He then gives Ryan sales advice.",
                                "elements": []
                            },
                            {
                                "text": "In a talking head interview, Ryan repeatedly reminds himself that Dwight is the top salesman at the company.",
                                "elements": []
                            },
                            {
                                "text": "At the farm, Dwight tries to impart sales advice and produces a beet seed from Ryan's ear.",
                                "elements": []
                            },
                            {
                                "text": "In a talking head interview, Ryan admits he learned a lot about beets.",
                                "elements": []
                            },
                            {
                                "text": "Michael reads his daily log to the documentary crew. Pam tries to help Michael focus on work.",
                                "elements": []
                            },
                            {
                                "text": "Ryan, abandoned in the beet field, tells the camera that just when he thinks he's hit rock bottom, \"the floor opens up like at a carnival ride,\" and he mimes falling down another level.",
                                "elements": []
                            },
                            {
                                "text": "Dwight takes Ryan through a wooded area to the graves of his ancestors and discovers an empty can. While Dwight shouts at two naked teenagers fleeing in the distance, Ryan mimes to the camera falling down another level.",
                                "elements": []
                            },
                            {
                                "text": "Stanley steals Kevin's pretzel.",
                                "elements": []
                            },
                            {
                                "text": "In a talking head interview, Stanley lists the four things he loves in his life.",
                                "elements": []
                            },
                            {
                                "text": "Stanley and Michael eat their pretzels. Michael doesn't understand the secret to the pretzels. \"They taste so good in my mouth.\" Stanley adds, \"That's what she said,\" and both of them crack up.",
                                "elements": []
                            }
                        ]
                    },
                    {
                        "type": "paragraph",
                        "text": "Additional deleted scenes are available on the NBC Web site:"
                    },
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Karen is dumbfounded that Jim didn't realize that the line \"Bueller?\" comes from the movie Ferris Bueller's Day Off. Andy adds, \"Ask me how bad I wanted to bone Jennifer Grey,\" and won't drop the subject. Watch the scene online",
                                "elements": []
                            },
                            {
                                "text": "In a talking head interview, Dwight explains that Ryan is like Ethan Hawke and he is \"the African-American\" from the movie Training Day. Watch the scene online",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Connections to earlier episodes",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "In Office Olympics, Dwight mentions that teenagers sometimes use the beet farm for sex.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Cultural References",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Getting to second base is adolescent slang based on the rules of baseball. The details vary, but second base is generally considered to be fondling.",
                                "elements": []
                            },
                            {
                                "text": "Michael's conversation with Mr. Coselli begins by playing with his name and calling him The Cos, the nickname for comedian Bill Cosby. He the proceeds to mimic the voice of one of Cosby's characters, Fat Albert, adding \"I love Jell-O Pudding Pops\" (Cosby recorded advertisements for the frozen treat). He then talked about \"my son Theo\", referring to the son of Cliff Huxtable, a character portrayed by Bill Cosby on the television sitcom The Cosby Show.",
                                "elements": []
                            },
                            {
                                "text": "Dwight tries to have Ryan snatch a beet seed from his hand in reference to Kung Fu.",
                                "elements": []
                            },
                            {
                                "text": "Kelly chatters with Michael in line about the plot to Lazy Sunday, a rap song performed on the sketch comedy program Saturday Night Live. Watch it here.",
                                "elements": []
                            },
                            {
                                "text": "Mary is a traditional girl's name and is also used pejoratively to indicate that a man is behaving like a girl. (The name Nancy is used in Britain for this same purpose.)",
                                "elements": []
                            },
                            {
                                "text": "Michael says I'll be back! in the style of Arnold Schwarzenegger's character in The Terminator.",
                                "elements": []
                            },
                            {
                                "text": "Dwight asks Ryan about the purpose of the DHARMA Initiative. This is a reference to an organization in the popular ABC Network series Lost.",
                                "elements": []
                            },
                            {
                                "text": "The item Mose whittled is a replica of the Venus of Willendorf.",
                                "elements": []
                            },
                            {
                                "text": "Deal or No Deal and Let's Make a Deal are game shows. What is the deal? is slang for \"What is the explanation?\" and is often used as an expression of frustration.",
                                "elements": []
                            },
                            {
                                "text": "The drink Ryan and Dwight have after the failed sales call is a Boilermaker. They employ the \"depth charge\" technique of dropping the shot into the beer glass and consuming the combined drink at one go.",
                                "elements": []
                            },
                            {
                                "text": "Fantasy Football is a game in which participants build a team of actual football players and earn points based on the performance of those players.",
                                "elements": []
                            },
                            {
                                "text": "Mavis Beacon is the fictional typing instructor in the Mavis Beacon Teaches Typing series of computer programs.",
                                "elements": []
                            },
                            {
                                "text": "In the movie 28 Days, Sandra Bullock plays a woman struggling against alcoholism. The movie 28 Days Later is a post-apocalyptic horror movie. Blockbuster is a chain of movie rental stores.",
                                "elements": []
                            },
                            {
                                "text": "When Michael reads his log in a deleted scene, he says, \"Light salad, three points.\" The Weight Watchers diet plan assigns points to various foods.",
                                "elements": []
                            },
                            {
                                "text": "Mose Schrute wrestling Ryan references the movie Batman Begins where Bruce Wayne masters fear and Batman battling the Scarecrow.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Trivia",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "One of the riddles Dwight poses to Ryan in the cold open is about a boy involved in a car accident who is the son of the doctor on call in the emergency room, and therefore cannot operate - even though his father was in the car and was also injured (the doctor is his mother). At the very end of the finale of the original BBC series, Tim (the character Jim is based on), along with Gareth (\"Dwight\"), is being asked this riddle by David Brent (\"Michael\") when Dawn (\"Pam\") returns to the party and kisses him for the first time.",
                                "elements": []
                            },
                            {
                                "text": "When Jim rolls his chair to the copy machine, there is a Stamford employee in the background dressed just like Jim who is chatting with the receptionist and playing with the candy bowl.",
                                "elements": []
                            },
                            {
                                "text": "The eighteen sweet pretzel toppings: sweet glaze, cinnamon sugar, chocolate, white chocolate, fudge, M&Ms, caramel dip, mint chip, chocolate chip, marshmallow, nuts, toffee nuts, coconuts, peanut butter drizzle, Oreos, sprinkles, cotton candy bits, and powdered sugar.",
                                "elements": []
                            },
                            {
                                "text": "Jim calls Pam at 5:20pm when it is still light out (see the window next to Jim's desk). By the time the conversation ends, it is dark. Sunset in Stamford at that time of year is around 6pm, and twilight lasts about a half hour, so it was at least 6:30pm, possibly later, when they finally stopped chatting. According to the DVD commentary, the conversation lasted three hours.",
                                "elements": []
                            },
                            {
                                "text": "On the DVD commentary, B.J. Novak says that a rattlesnake wrangler was brought to the set before they began shooting the outdoor sequences, and he found a rattlesnake right away. Novak suspects that the wrangler planted the snake.",
                                "elements": []
                            },
                            {
                                "text": "Pam offers to wait in line for Michael, but he says he has to order a very specific pretzel. Later, when he is at the front of the line, he orders a pretzel with everything on it.",
                                "elements": []
                            },
                            {
                                "text": "When Jim calls Pam at the end of the episode, Jim's nameplate can be found on Andy's desk instead. (Maybe as payback for the squeaky chair?)",
                                "elements": []
                            },
                            {
                                "text": "This is the first time Stanley respects Michael as opposed to being openly hostile towards him when he high fives Michael after sending Phyllis to the back of the line.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Cast",
                "level": 2,
                "content": [],
                "images": []
            },
            {
                "title": "Main Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Steve Carell as Michael Scott",
                                "elements": []
                            },
                            {
                                "text": "Rainn Wilson as Dwight Schrute",
                                "elements": []
                            },
                            {
                                "text": "John Krasinski as Jim Halpert",
                                "elements": []
                            },
                            {
                                "text": "Jenna Fischer as Pam Beesly",
                                "elements": []
                            },
                            {
                                "text": "B.J. Novak as Ryan Howard",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Supporting Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Melora Hardin as Jan Levenson",
                                "elements": []
                            },
                            {
                                "text": "Leslie David Baker as Stanley Hudson",
                                "elements": []
                            },
                            {
                                "text": "Brian Baumgartner as Kevin Malone",
                                "elements": []
                            },
                            {
                                "text": "Kate Flannery as Meredith Palmer",
                                "elements": []
                            },
                            {
                                "text": "Mindy Kaling as Kelly Kapoor",
                                "elements": []
                            },
                            {
                                "text": "Angela Kinsey as Angela Martin",
                                "elements": []
                            },
                            {
                                "text": "Paul Lieberstein as Toby Flenderson",
                                "elements": []
                            },
                            {
                                "text": "Phyllis Smith as Phyllis Lapin",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Recurring Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Ed Helms as Andy Bernard",
                                "elements": []
                            },
                            {
                                "text": "Rashida Jones as Karen Filippelli",
                                "elements": []
                            },
                            {
                                "text": "Creed Bratton (actor) as Creed Bratton",
                                "elements": []
                            },
                            {
                                "text": "Charles Esten as Josh Porter",
                                "elements": []
                            },
                            {
                                "text": "Michael Schur as Mose Schrute",
                                "elements": []
                            },
                            {
                                "text": "Bobby Ray Shafer as Bob Vance",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Guest Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Thomas F. Evans as Pretzel Vendor",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            }
        ]
    },
    "quotesDetails": {
        "sections": [
            {
                "title": "Initiation Quotes",
                "level": 1,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Stanley: I wake up every morning in a bed that's too small, drive my daughter to a school that's too expensive, and then I go to work to a job for which I get paid too little, but on Pretzel Day? Well, I like Pretzel Day."
                    }
                ],
                "images": []
            }
        ]
    },
    "coldOpens": [
        "Dwight keeps trying to trick Ryan with riddles. However, Ryan shuts Dwight down by answering before Dwight can get his answer out. "
    ],
    "storylines": [
        "Dwight abruptly begins to quiz Ryan with brain teasers, but becomes frustrated and screams \"Dammit!\" when Ryan recites answers to the puzzles, many before the full question is asked.",
        "Jan questions Michael's productivity and presses him on his accomplishments during the previous workday. Michael says he \"worked, went home to his condo, and Carol came over, and we had sex.\" Jan instructs Pam to log Michael's hourly activity \"so we can analyze it at Corporate\". Jan walks out of the office as Pam begins to protest.",
        "Dwight pesters Ryan about his excitement level for his first-ever sales call and informs the camera why he is so excited: Ryan has yet to make an ally within the office, and Dwight hopes to steer him clear of being a \"slacker-loser-wiseass like Jim\" and draft him in the \"Dwight army of champions.\" That afternoon, Dwight drives Ryan to a beet field, smirks to the cameraman in the backseat and tells Ryan \"Your journey begins now.\"",
        "At Dunder Mifflin Stamford, Karen is disturbed to find her chair squeaks and accuses Jim of a chair swap. He protests that he simply switched them back after she made the original switch. Karen promises to switch chairs while he's away from his desk, so he vows not to stand and proves such by rolling to the copy machine.",
        "On a phone call, Michael imitates Bill Cosby: \"I love Jell-O puddin' pops. My son Theo loves puddin' pops, too.\" Pam shows the camera \"Cosby Impression\" for the 10:00 hour in the log.",
        "Dwight asks Ryan to take the beet seed from his palm. Ryan misses and Dwight asks him to try again. However, Ryan is faster and takes the seed leaving Dwight in an awkward position. After that, The Assistant Regional Manager asks Ryan to plant the beet seed. Dwight says to the young salesman \"just as you planted that seed, I shall plant my seed in you\" to which the young salesman says \"I don't think you know what you're saying.\" Dwight says the bad odor in the area is \"called bull crap\" and states that \"clients can smell it from a mile away\". Dwight suddenly announces he forgot something in his car and runs toward the vehicle, gets in and speeds away.",
        "A loudspeaker announces free soft pretzels being given away in the lobby. Stanley and Michael immediately head for the door. In interviews, Stanley proclaims that pretzel day is his favorite day of the year, Pam admits it is a big deal for some people and Michael says he cannot be productive when there is one thing in his brain which he just can't get out, especially when that one thing is soft pretzels.",
        "A long pretzel line peeves Michael and he and Stanley rebuff Phyllis' attempt to jump the line with Bob Vance of Vance Refrigeration; Stanley sees past his disdain for Michael and high-fives him. Pam asks Michael to use his time in line to authorize some checks, but he instead has her hold his place in line while he uses the restroom. She offers to brings him a pretzel if Michael returns to the office, but he explains that if she ordered his pretzel incorrectly \"then ... this whole thing's blown.\" Shown to the camera, the productivity log now reads \"Stood in Pretzel line\" for the noon hour.",
        "Angry Ryan walks alone up a dirt road, muttering to himself. He knocks on a barn door, and Dwight jumps out: \"Congratulations, resourceful salesman! Welcome to Schrute Farm!\" Dwight then gives him his signature salute. Having passed Dwight's second challenge, Ryan sits in a Victorian-era wheelchair and Dwight assures him to \"Pay no attention to the spirits that haunt this hallowed ground!\"",
        "Dwight quizzes Ryan about Dunder Mifflin, the death of company cofounder Robert Mifflin, the purpose of the DHARMA Initiative, and Michael's greatest fear, to which Ryan answers \"loneliness. Maybe women.\" Dwight responds: \"Wrong. He's not afraid of anything. Also I would have accepted snakes\".",
        "Dwight later states that one cannot sell if one has fear \"You must vanquish fear.\" Suddenly, Cousin Mose appears with the word \"Fear\" on his shirt in tape, and Dwight tells Ryan as his final test he must wrestle Mose to the ground. Ryan calls Dwight a freak and storms out, despite Dwight's protests and instructions to get inside a coffin. Mose remarks \"he seemed nice,\" and Dwight asks \"Where are all the animals?\"",
        "At Stamford, Karen begins to continually squeak her chair. Jim quickly begins to sing the chorus of The Cardigans' \"Lovefool\", despite Karen's objections that the song is unfair retaliation and \"will be in her head all day.\" The camera pans to Andy, who is conducting and lip synching along with Jim's vocals, out of sight. In an interview, Andy completes the song's chorus — \"I don't care 'bout anything but you\" — and ponders the whereabouts of the band. Eventually the squeaky chair gets passed to Andy when he isn't in the room.",
        "Michael finally arrives at the front of the line and orders \"The Works\" — a sweet pretzel with all 18 sweet toppings. Back upstairs, he plays energetic music, then suddenly emerges from his office and launches into a hyperactive, sugar-fueled speech filled with suggestions on improving office efficiency.",
        "Inside his Trans Am, Dwight catches up with Ryan as he walks along the road, apologizes and displays gifts Mose sent, including fresh eggs, fatback bacon, and \"something he whittled,\" which appears to be a Venus of Willendorf figurine. After being pleaded with, Ryan gets in the car where Dwight explains that the lack of a friendship with Jim was the main impetus for the initiation ceremony. Dwight then begins to give Ryan sales-call pointers which Ryan tries to memorize. His final advice is for Ryan to \"K.I.S.S. — Keep It Simple Stupid.\"",
        "Michael sleeps face-down on his desk. Jan phones for him, but Pam says he's on a sales call.",
        "A dejected Ryan walks out of the sales call as Dwight tries to cheer him up. Ryan gripes that the potential client told him to his face that they didn't like him. In retaliation, Ryan begins to throw Mose's eggs at the building and CEO reserved parking sign. Surprised at Ryan's initiative, Dwight joins him, shouting \"Oh no, no, no,\" until two security guards saunter out, at which point the pair peel out of the parking lot in Dwight's Firebird. They go to a bar and drink boilermakers, and as a result of the day's events, Dwight no longer calls Ryan \"Temp\" but instead uses his given name.",
        "At the end of the work day, Pam realizes that Michael's antics helped him make a large sale. Having forgotten Kevin's phone extension, Jim calls Dunder Mifflin's main number, hoping to leave him a voicemail regarding a fantasy football issue. Pam answers and says she's staying late because of her new assignment to chronicle Michael's work day, a copy of which she promises to send to Jim. The pair enjoy a long chat about her tiny apartment and her scary solo movie night in which she rented 28 Days Later rather than 28 Days. They start to reconnect, but Ryan and Dwight, both exhausted, return to the office for a few seconds and she loudly says goodbye to the pair as they exit. Jim misconstrues the exclamation, and the pair hang up.",
        "A satiated Stanley remarks in an interview that in 364 days, it will once again be Pretzel Day."
    ],
    "quotes": [
        "Stanley: I wake up every morning in a bed that's too small, drive my daughter to a school that's too expensive, and then I go to work to a job for which I get paid too little, but on Pretzel Day? Well, I like Pretzel Day."
    ]
}