{
    "season": 3,
    "title": "Diwali",
    "episode": "6",
    "episodes": [
        6
    ],
    "coldOpens": [
        "Ryan is bought Indian Clothes causing Michael to make fun of him. However, when Pam points out that it's nice, Michael asks Kelly why she didn't get more for him. "
    ],
    "storylines": [
        "Kelly invites the entire staff to a celebration of Diwali, the Hindu Festival of Lights. Michael serves as the vocal supporter of such an event and believes it to be an Indian version of Halloween.",
        "A staff meeting is scheduled to enlighten staff members about Hindu culture. This is met with disgusted replies by Angela, excitement by Kevin (particularly after seeing illustrations in a kama sutra booklet distributed by Michael) and an uncomfortable Toby, who decides to end the meeting and takes away the booklets.",
        "Back in Stamford, Jim has decided to follow Josh's example and ride his bike to work. Meanwhile, Andy pulls out a bottle of Jägermeister and shot glasses to turn a late night of work into a drinking game, which Karen wins by pouring her shots into her wastebasket while the two men continue to down shots.",
        "Michael and Carol arrive at the Diwali festival in costume since Michael thought the celebration would be a \"costume party.\" Carol is a cheerleader and Michael is wearing his papier-mâché twin from Halloween 2005, which he quickly removes.",
        "Ryan, dressed in a kurta (traditional men's Indian attire), tries to acquaint himself with Kelly's family, which is met with giggling by Kelly's younger sisters, whom Ryan believes compared his looks to Zach Braff in their language (they say \"Kelly likes Zach Braff... \" in Hindi). and disapproval by Kelly's parents, who want to set her up with an Indian doctor. This only gets worse when Ryan speaks with her parents about his promotion at Dunder Mifflin and his plans to save money for travel and an Xbox. Dwight gets into the spirit of the festival and dons a red Kurta. Even Michael is shown dancing happily to the music.",
        "Initially reluctant to attend the festival, Pam decides to go and actually enjoys herself as she starts dancing along with the staff and the rest of the festivalgoers. A cleaned up Roy shows up in time to find Pam in the middle of the dancing crowd, with another man too, making him uncomfortable, and he silently exits the party.",
        "Michael has an enlightening conversation with Kelly's parents about Hindu marriage customs and suddenly interrupts the celebration to publicly propose to Carol. Uncomfortable, Carol declines his offer and leaves the room. Michael follows her out to the car, where they briefly talk; Carol citing that this is only their ninth date, while Michael states how much he likes her. Carol drives home, leaving Michael to find a ride.",
        "Meanwhile, Pam is surprised to find herself inspired by Michael's outgoing, romantic nature and she sends a text message to Jim. However, Jim is passed out on his desk and is unaware of the incoming message on his cell phone. As the Diwali festival winds down, a dejected Michael makes an attempt to kiss a disappointed Pam, who stops him and reluctantly agrees to drive him home, as long as he sits in the back seat. On the drive, he mentions the shoes he's wearing aren't his own.",
        "Back in Stamford, Karen leaves for the night, as Jim continues to lie face down on his desk and Andy is laid out on the floor, both completely inebriated. Jim asks Andy if he can get a ride but Andy says \"No way, dude,\" and begins to unfurl an inflatable mattress. He offers to share the \"roomy twin\" with Jim. Jim decides to ride his bike home but barely exits the front door when he crashes sideways into the bushes. An amused Karen laughs and offers Jim a ride home. He accepts immediately and crawls into her backseat leaving her to deal with his bicycle.",
        "Sometime during the party, Michael took the stage with Dwight behind him on guitar. Beginning by saying \"this is going out to Indians everywhere,\" he began a song as a tribute to \"one of the greats\" Mr. Adam Sandler. The lyrics are: \"Diwali is a festival of lights, let me tell you something, tonight has been.. one crazy night, so put on your saris, it's time to celebrate Diwali, everybody looks so jolly, but it's not Christmas, it's Diwali, the goddess of destruction Kali, stopped by to celebrate Diwali, don't invite any zombies, to our celebration of Diwali, along came Polly, to have some fun at Diwali, if you're Indian and you love to party, have a happy, happy, happy, happy Diwali.\" He then wished everybody a Happy Diwali and the crowd cheered."
    ],
    "quotes": [
        [
            {
                "speaker": "Michael",
                "content": " Now, a lot of people say that Kelly is one in a million and that's true, but it's also not true. Because, frankly, there are literally billions of people just like Kelly in the world. Here are some famous Indians: Subrahmanyan Chandrasekhar. He is a Nobel prize-winning physicist. Impressive. Apu from the Simpsons. Hilarious. Indian. M. Night Shyamalan- 'The Village', 'Unbreakable', 'Sixth Sense...\""
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " Oh, yuck. [spits out food]"
            }
        ],
        [
            {
                "speaker": "Carol",
                "content": " What? Too spicy?"
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " No. These s'mores are disgusting."
            }
        ],
        [
            {
                "speaker": "Carol",
                "content": " They're not s'mores. They're samosas."
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " Do you think they have any s'mores?"
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " All they are is chocolate, graham cracker, and marshmallow. How difficult would that have been?"
            }
        ],
        [
            {
                "speaker": "Carol",
                "content": " Are you okay?"
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " I'm going to be. [to DJ] Hi, I'm just going to get this for a sec... just a sec. [speaks in microphone] Um... everyone? I'm sorry, could I have your attention, please. Thank you. Ah-hah... Hi. Sorry. I just have an announcement to make. Um... okay. I have learned a lot about Indian culture tonight. But I have learned even more about love. And I know you're all thinking 'who is this crazy gringo and what is he talking about?' Well, I'm not crazy. Maybe I'm crazy in love. So without further ado, Carol? Carol Stills. I would like you to do me the honor of making me your husband. "
            }
        ],
        [
            {
                "speaker": "Crowd",
                "content": " Awww!"
            }
        ],
        [
            {
                "speaker": "Carol",
                "content": " Oh, Michael. "
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " What do you say?"
            }
        ],
        [
            {
                "speaker": "Carol",
                "content": " Can we talk about this in private?"
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " I didn't hear you. [laughs]"
            }
        ],
        [
            {
                "speaker": "Carol",
                "content": " [louder] Can we talk about this in private?"
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " [lowers microphone] Oh, you've got to be kidding me. Okay."
            }
        ]
    ]
}