{
    "season": 3,
    "title": "Diwali",
    "episode": "6",
    "episodes": [
        6
    ],
    "episodeDetails": {
        "sections": [
            {
                "title": "Diwali",
                "level": 1,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "\"Diwali\" is the sixth episode of the third season of The Office and the 34th overall. It was written by Mindy Kaling and directed by Miguel Arteta. It first aired on November 2, 2006. It was viewed by 8.8 million people."
                    }
                ],
                "images": []
            },
            {
                "title": "Synopsis",
                "level": 2,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Kelly invites the entire staff to a celebration of Diwali, the Hindu Festival of Lights. Michael serves as the vocal supporter of such an event and believes it to be an Indian version of Halloween."
                    },
                    {
                        "type": "paragraph",
                        "text": "A staff meeting is scheduled to enlighten staff members about Hindu culture. This is met with disgusted replies by Angela, excitement by Kevin (particularly after seeing illustrations in a kama sutra booklet distributed by Michael) and an uncomfortable Toby, who decides to end the meeting and takes away the booklets."
                    },
                    {
                        "type": "paragraph",
                        "text": "Back in Stamford, Jim has decided to follow Josh's example and ride his bike to work. Meanwhile, Andy pulls out a bottle of Jägermeister and shot glasses to turn a late night of work into a drinking game, which Karen wins by pouring her shots into her wastebasket while the two men continue to down shots."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael and Carol arrive at the Diwali festival in costume since Michael thought the celebration would be a \"costume party.\" Carol is a cheerleader and Michael is wearing his papier-mâché twin from Halloween 2005, which he quickly removes."
                    },
                    {
                        "type": "paragraph",
                        "text": "Ryan, dressed in a kurta (traditional men's Indian attire), tries to acquaint himself with Kelly's family, which is met with giggling by Kelly's younger sisters, whom Ryan believes compared his looks to Zach Braff in their language (they say \"Kelly likes Zach Braff... \" in Hindi). and disapproval by Kelly's parents, who want to set her up with an Indian doctor. This only gets worse when Ryan speaks with her parents about his promotion at Dunder Mifflin and his plans to save money for travel and an Xbox. Dwight gets into the spirit of the festival and dons a red Kurta. Even Michael is shown dancing happily to the music."
                    },
                    {
                        "type": "paragraph",
                        "text": "Initially reluctant to attend the festival, Pam decides to go and actually enjoys herself as she starts dancing along with the staff and the rest of the festivalgoers. A cleaned up Roy shows up in time to find Pam in the middle of the dancing crowd, with another man too, making him uncomfortable, and he silently exits the party."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael has an enlightening conversation with Kelly's parents about Hindu marriage customs and suddenly interrupts the celebration to publicly propose to Carol. Uncomfortable, Carol declines his offer and leaves the room. Michael follows her out to the car, where they briefly talk; Carol citing that this is only their ninth date, while Michael states how much he likes her. Carol drives home, leaving Michael to find a ride."
                    },
                    {
                        "type": "paragraph",
                        "text": "Meanwhile, Pam is surprised to find herself inspired by Michael's outgoing, romantic nature and she sends a text message to Jim. However, Jim is passed out on his desk and is unaware of the incoming message on his cell phone. As the Diwali festival winds down, a dejected Michael makes an attempt to kiss a disappointed Pam, who stops him and reluctantly agrees to drive him home, as long as he sits in the back seat. On the drive, he mentions the shoes he's wearing aren't his own."
                    },
                    {
                        "type": "paragraph",
                        "text": "Back in Stamford, Karen leaves for the night, as Jim continues to lie face down on his desk and Andy is laid out on the floor, both completely inebriated. Jim asks Andy if he can get a ride but Andy says \"No way, dude,\" and begins to unfurl an inflatable mattress. He offers to share the \"roomy twin\" with Jim. Jim decides to ride his bike home but barely exits the front door when he crashes sideways into the bushes. An amused Karen laughs and offers Jim a ride home. He accepts immediately and crawls into her backseat leaving her to deal with his bicycle."
                    },
                    {
                        "type": "paragraph",
                        "text": "Sometime during the party, Michael took the stage with Dwight behind him on guitar. Beginning by saying \"this is going out to Indians everywhere,\" he began a song as a tribute to \"one of the greats\" Mr. Adam Sandler. The lyrics are: \"Diwali is a festival of lights, let me tell you something, tonight has been.. one crazy night, so put on your saris, it's time to celebrate Diwali, everybody looks so jolly, but it's not Christmas, it's Diwali, the goddess of destruction Kali, stopped by to celebrate Diwali, don't invite any zombies, to our celebration of Diwali, along came Polly, to have some fun at Diwali, if you're Indian and you love to party, have a happy, happy, happy, happy Diwali.\" He then wished everybody a Happy Diwali and the crowd cheered."
                    }
                ],
                "images": []
            },
            {
                "title": "Deleted scenes",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "In a talking head interview, Pam explains that she understands that she should get out more, but is not convinced that a Diwali party is the right venue.",
                                "elements": []
                            },
                            {
                                "text": "Angela doesn't understand why the office is going to a party for a holiday that doesn't even exist.",
                                "elements": []
                            },
                            {
                                "text": "In a talking head interview, Angela explains that some people in the office are too obsessed with things Indian. The documentary filmmaker underscores this point with the moment from Christmas Party where Kelly kisses Dwight.",
                                "elements": []
                            },
                            {
                                "text": "In a talking head interview, Michael explains that as the boss, he must support all cultures and that certain people have been offended, and Diwali provides an opportunity to make it up to them. The documentary filmmaker underscores this point with the moment from Diversity Day where Kelly slaps Michael.",
                                "elements": []
                            },
                            {
                                "text": "Michael tires of Kelly's description of Diwali and demands an explanation in three words or less. \"An Indian Halloween.\" Jan is upset that Michael is letting everyone off work early to go to a party, and Michael acts shocked that Jan doesn't know what Diwali is - after Michael explains its cultural significance (surprising Jan, who had assumed Kelly was Muslim - to which Kelly, listening on the speakerphone, takes great offense), Jan has no problem allowing it, and castigates Michael for not mentioning it earlier, so the company could've contributed to the event in some form.",
                                "elements": []
                            },
                            {
                                "text": "In a talking head interview, Michael answers the question \"Are you excited about the Diwali party?\" by telling a rambling story about his original plans with Carol for a romantic evening.",
                                "elements": []
                            },
                            {
                                "text": "Dwight asks Ryan how much his kurta cost.",
                                "elements": []
                            },
                            {
                                "text": "Michael asks Pam to notify the office about his Diwali meeting and gets upset when Pam suggests that she isn't going to the party.",
                                "elements": []
                            },
                            {
                                "text": "At Michael's conference, he identifies Sir Ben Kingsley as responsible for the departure of the British from India. \"And then he became an actor, like Ronald Reagan.\" Pam points out to Michael that his shirt is buttoned wrong. In a talking head interview, Pam is frustrated that she can't share the moment with Jim.",
                                "elements": []
                            },
                            {
                                "text": "Dwight asks Pam if she's afraid Roy will attend the Diwali party with a new girlfriend, or maybe Roy will find a hot Indian girl, or maybe Dwight will. Angela overhears this remark.",
                                "elements": []
                            },
                            {
                                "text": "Andy tells the documentary camera that his fraternity name was \"Hubble\" for his ability to spot a party. It was better than his freshman nickname when he had a skin problem when his nickname was \"El Guapo\".",
                                "elements": []
                            },
                            {
                                "text": "Phyllis's curiosity about the food at the Diwali party annoys Stanley.",
                                "elements": []
                            },
                            {
                                "text": "In a talking head interview, Angela explains that as the head of the Party Planning Committee, she is obligated to attend all office parties, even one held in Hell.",
                                "elements": []
                            },
                            {
                                "text": "When the Stamford staff order sushi for dinner, Andy offers \"Big Tuna\" Jim the tuna, but Jim asks for the eel. Andy is puzzled.",
                                "elements": []
                            },
                            {
                                "text": "Kelly is overjoyed when Pam arrives and takes her to meet some cute guys.",
                                "elements": []
                            },
                            {
                                "text": "Carol introduces herself to Ryan, who is uncomfortable that she has learned so much about him from Michael.",
                                "elements": []
                            },
                            {
                                "text": "Pam talks with the young Indian doctor, who invites her to dance. Meanwhile, Dwight engages in a lightsaber battle with a young boy.",
                                "elements": []
                            },
                            {
                                "text": "Kevin mocks Michael after the failed proposal.",
                                "elements": []
                            },
                            {
                                "text": "In a talking head interview, Ryan says that he was at the Diwali party just for the free food. He takes off his kurta and can't find his shoes.",
                                "elements": []
                            },
                            {
                                "text": "Dwight stops Angela as she leaves the Diwali party. Angela is quietly upset at Dwight, who reassures his \"monkey\" that his interest in India is restricted to its culture. He then loudly announces that it is late and asks Angela if he can stop by Angela's house for some Pepto-Bismol. Angela smiles to herself, then spots Kelly and Ryan and scolds them for making out in public.",
                                "elements": []
                            },
                            {
                                "text": "Kevin appeals to Kelly's parents to hire his band for Diwali 2007.",
                                "elements": []
                            },
                            {
                                "text": "Michael loses at cards to an old Indian woman.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Trivia/Goofs",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Kelly's parents were played by Mindy Kaling's real parents.",
                                "elements": []
                            },
                            {
                                "text": "The dances in the episode were choreographed by Bollywood dance instructor Nakul Dev Mahajan and performed by his dance troupe, who struggled to dance more amateurishly in order to be more realistic to the story.[1]",
                                "elements": []
                            },
                            {
                                "text": "In the deleted scene on the DVD where Angela talks about Diwali not existing, the subtitles are wrong. Pam said \"The Hallmarks in India might\" whereas the subtitles say \"The Hallmarks in India mate\".",
                                "elements": []
                            },
                            {
                                "text": "When Michael was in Pam's car, he says, \"these are not my shoes\". In a deleted scene Ryan asks, \"where are my shoes\"? This would imply that Michael took Ryan's shoes.",
                                "elements": []
                            },
                            {
                                "text": "According to dialogue between Michael and Carol, Diwali is their ninth date, but in the episode Sex Ed, Carol claims Michael proposed to her on their fourth date. Some fans debunk this at the fact that Michael could have proposed twice.",
                                "elements": []
                            },
                            {
                                "text": "The building Jim comes out of looks nothing like the building that is shown when the scene switches to Stamford.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Cultural references",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Diwali is the Hindu Festival of Lights. Dwight's description is accurate. (Michael's is not.) A kurta is a traditional garment worn in India.",
                                "elements": []
                            },
                            {
                                "text": "A Yukon is a model of light truck.",
                                "elements": []
                            },
                            {
                                "text": "An appletini is a martini that substitutes apple juice (or similar) for vermouth.",
                                "elements": []
                            },
                            {
                                "text": "Sex and the City is a television program about four women living in New York City and their struggles with sex and romance.",
                                "elements": []
                            },
                            {
                                "text": "The movie Indiana Jones and the Temple of Doom (inaccurately) depicts monkey brains served at an Indian meal.",
                                "elements": []
                            },
                            {
                                "text": "Kwanzaa is a holiday celebrating African-American heritage.",
                                "elements": []
                            },
                            {
                                "text": "The Lord of the Rings is an epic fantasy novel made by J.R.R. Tolkien.",
                                "elements": []
                            },
                            {
                                "text": "Subrahmanyan Chandrasekhar is a Nobel prize-winning physicist. Apu is a caricature Indian character from the cartoon The Simpsons. M. Night Shyamalan is an award-winning film writer and director; he was born in India but grew up in the United States. The Village, Unbreakable, The Sixth Sense, and Signs are all Shyamalan movies. I see dead people is a line from the movie The Sixth Sense, and Dwight reveals the twist ending to the movie.",
                                "elements": []
                            },
                            {
                                "text": "An important element of the television comedy Cheers is the sexual tension between the two lead characters, Sam and Diane.",
                                "elements": []
                            },
                            {
                                "text": "Michael describes his visual aids as culturally explicit, a reworking of the euphemism sexually explicit.",
                                "elements": []
                            },
                            {
                                "text": "Michael confuses samosas (a traditional Indian food similar to a fried dumpling) with s'mores (a traditional American campfire food consisting of graham crackers, chocolate, and marshmallow).",
                                "elements": []
                            },
                            {
                                "text": "Michael asks Kelly's mother if \"she has to throw herself on a fire\" when her husband dies, referring to the ancient custom of Sati.",
                                "elements": []
                            },
                            {
                                "text": "Gringo is a Latin American (not Indian) term for foreigners. Within the Hispanic community in the United States, it is often applied pejoratively to Caucasian Americans.",
                                "elements": []
                            },
                            {
                                "text": "An Xbox is a video game console by Microsoft.",
                                "elements": []
                            },
                            {
                                "text": "Taxicab Confessions is a documentary series which surreptitiously records candid conversations with taxi passengers. At the end of the ride, the cameras are revealed and the passengers are asked to grant permission to use the footage in the documentary.",
                                "elements": []
                            },
                            {
                                "text": "Adam Sandler is a comedian best known for his work on Saturday Night Live. Michael's Diwali song is in the style of Sandler's popular Chanukah Song series.",
                                "elements": []
                            },
                            {
                                "text": "Claritin is a brand of antihistamine. A roofie (slang for the drug flunitrazepam) is a \"date rape\" drug; it has a sedative and hypnotic effect and also results in amnesia.",
                                "elements": []
                            },
                            {
                                "text": "Andy and Jim sing the song \"Closer to Fine\" by the Indigo Girls.",
                                "elements": []
                            },
                            {
                                "text": "Beyonce's hit song \"Crazy In Love\" was heard at the Diwali festival.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Cast",
                "level": 2,
                "content": [],
                "images": []
            },
            {
                "title": "Main Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Steve Carell as Michael Scott",
                                "elements": []
                            },
                            {
                                "text": "Rainn Wilson as Dwight Schrute",
                                "elements": []
                            },
                            {
                                "text": "John Krasinski as Jim Halpert",
                                "elements": []
                            },
                            {
                                "text": "Jenna Fischer as Pam Beesly",
                                "elements": []
                            },
                            {
                                "text": "B.J. Novak as Ryan Howard",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Supporting Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "David Denman as Roy Anderson",
                                "elements": []
                            },
                            {
                                "text": "Leslie David Baker as Stanley Hudson",
                                "elements": []
                            },
                            {
                                "text": "Brian Baumgartner as Kevin Malone",
                                "elements": []
                            },
                            {
                                "text": "Kate Flannery as Meredith Palmer",
                                "elements": []
                            },
                            {
                                "text": "Mindy Kaling as Kelly Kapoor",
                                "elements": []
                            },
                            {
                                "text": "Angela Kinsey as Angela Martin",
                                "elements": []
                            },
                            {
                                "text": "Paul Lieberstein as Toby Flenderson",
                                "elements": []
                            },
                            {
                                "text": "Phyllis Smith as Phyllis Lapin",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Recurring Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Ed Helms as Andy Bernard",
                                "elements": []
                            },
                            {
                                "text": "Rashida Jones as Karen Filippelli",
                                "elements": []
                            },
                            {
                                "text": "Charles Esten as Josh Porter",
                                "elements": []
                            },
                            {
                                "text": "Creed Bratton (actor) as Creed Bratton",
                                "elements": []
                            },
                            {
                                "text": "Nancy Walls as Carol Stills",
                                "elements": []
                            },
                            {
                                "text": "Mike Bruner as Tony Gardner",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Guest Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Tanveer Atwal as Rupa (Kelly's Sister)",
                                "elements": []
                            },
                            {
                                "text": "Ananya Kepper as Tiffany (Kelly's Sister)",
                                "elements": []
                            },
                            {
                                "text": "Avu Chokalingam as Kelly's Dad",
                                "elements": []
                            },
                            {
                                "text": "Swati Chokalingam as Kelly's Mom",
                                "elements": []
                            },
                            {
                                "text": "Jaysha Patel as Neepa (Kelly's Sister)",
                                "elements": []
                            },
                            {
                                "text": "Kunal Sharma as Food Server/Teenager #1",
                                "elements": []
                            },
                            {
                                "text": "Sunah Bilsted as Waitress",
                                "elements": []
                            },
                            {
                                "text": "Nakul Dev Mahajan as Dancer/Choreographer",
                                "elements": []
                            },
                            {
                                "text": "Varun Gurunath as Dancer",
                                "elements": []
                            },
                            {
                                "text": "Siddharth Jain as Dancer",
                                "elements": []
                            },
                            {
                                "text": "Anita Kapila as Dancer",
                                "elements": []
                            },
                            {
                                "text": "Sangita Sanyal as Dancer",
                                "elements": []
                            },
                            {
                                "text": "Karishma Sawhney as Dancer",
                                "elements": []
                            },
                            {
                                "text": "Rita Sehmi as Dancer",
                                "elements": []
                            },
                            {
                                "text": "Rohan Vora as Dancer",
                                "elements": []
                            },
                            {
                                "text": "Gagandeep Bedi",
                                "elements": []
                            },
                            {
                                "text": "Vali Chandrasekaran",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            }
        ]
    },
    "quotesDetails": {
        "sections": [
            {
                "title": "Diwali Quotes",
                "level": 1,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Michael: Now, a lot of people say that Kelly is one in a million and that's true, but it's also not true. Because, frankly, there are literally billions of people just like Kelly in the world. Here are some famous Indians: Subrahmanyan Chandrasekhar. He is a Nobel prize-winning physicist. Impressive. Apu from the Simpsons. Hilarious. Indian. M. Night Shyamalan- 'The Village', 'Unbreakable', 'Sixth Sense...\""
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael: Oh, yuck. [spits out food]"
                    },
                    {
                        "type": "paragraph",
                        "text": "Carol: What? Too spicy?"
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael: No. These s'mores are disgusting."
                    },
                    {
                        "type": "paragraph",
                        "text": "Carol: They're not s'mores. They're samosas."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael: Do you think they have any s'mores?"
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael: All they are is chocolate, graham cracker, and marshmallow. How difficult would that have been?"
                    },
                    {
                        "type": "paragraph",
                        "text": "Carol: Are you okay?"
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael: I'm going to be. [to DJ] Hi, I'm just going to get this for a sec... just a sec. [speaks in microphone] Um... everyone? I'm sorry, could I have your attention, please. Thank you. Ah-hah... Hi. Sorry. I just have an announcement to make. Um... okay. I have learned a lot about Indian culture tonight. But I have learned even more about love. And I know you're all thinking 'who is this crazy gringo and what is he talking about?' Well, I'm not crazy. Maybe I'm crazy in love. So without further ado, Carol? Carol Stills. I would like you to do me the honor of making me your husband. "
                    },
                    {
                        "type": "paragraph",
                        "text": "Crowd: Awww!"
                    },
                    {
                        "type": "paragraph",
                        "text": "Carol: Oh, Michael. "
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael: What do you say?"
                    },
                    {
                        "type": "paragraph",
                        "text": "Carol: Can we talk about this in private?"
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael: I didn't hear you. [laughs]"
                    },
                    {
                        "type": "paragraph",
                        "text": "Carol: [louder] Can we talk about this in private?"
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael: [lowers microphone] Oh, you've got to be kidding me. Okay."
                    }
                ],
                "images": []
            }
        ]
    },
    "coldOpens": [
        "Ryan is bought Indian Clothes causing Michael to make fun of him. However, when Pam points out that it's nice, Michael asks Kelly why she didn't get more for him. "
    ],
    "storylines": [
        "Kelly invites the entire staff to a celebration of Diwali, the Hindu Festival of Lights. Michael serves as the vocal supporter of such an event and believes it to be an Indian version of Halloween.",
        "A staff meeting is scheduled to enlighten staff members about Hindu culture. This is met with disgusted replies by Angela, excitement by Kevin (particularly after seeing illustrations in a kama sutra booklet distributed by Michael) and an uncomfortable Toby, who decides to end the meeting and takes away the booklets.",
        "Back in Stamford, Jim has decided to follow Josh's example and ride his bike to work. Meanwhile, Andy pulls out a bottle of Jägermeister and shot glasses to turn a late night of work into a drinking game, which Karen wins by pouring her shots into her wastebasket while the two men continue to down shots.",
        "Michael and Carol arrive at the Diwali festival in costume since Michael thought the celebration would be a \"costume party.\" Carol is a cheerleader and Michael is wearing his papier-mâché twin from Halloween 2005, which he quickly removes.",
        "Ryan, dressed in a kurta (traditional men's Indian attire), tries to acquaint himself with Kelly's family, which is met with giggling by Kelly's younger sisters, whom Ryan believes compared his looks to Zach Braff in their language (they say \"Kelly likes Zach Braff... \" in Hindi). and disapproval by Kelly's parents, who want to set her up with an Indian doctor. This only gets worse when Ryan speaks with her parents about his promotion at Dunder Mifflin and his plans to save money for travel and an Xbox. Dwight gets into the spirit of the festival and dons a red Kurta. Even Michael is shown dancing happily to the music.",
        "Initially reluctant to attend the festival, Pam decides to go and actually enjoys herself as she starts dancing along with the staff and the rest of the festivalgoers. A cleaned up Roy shows up in time to find Pam in the middle of the dancing crowd, with another man too, making him uncomfortable, and he silently exits the party.",
        "Michael has an enlightening conversation with Kelly's parents about Hindu marriage customs and suddenly interrupts the celebration to publicly propose to Carol. Uncomfortable, Carol declines his offer and leaves the room. Michael follows her out to the car, where they briefly talk; Carol citing that this is only their ninth date, while Michael states how much he likes her. Carol drives home, leaving Michael to find a ride.",
        "Meanwhile, Pam is surprised to find herself inspired by Michael's outgoing, romantic nature and she sends a text message to Jim. However, Jim is passed out on his desk and is unaware of the incoming message on his cell phone. As the Diwali festival winds down, a dejected Michael makes an attempt to kiss a disappointed Pam, who stops him and reluctantly agrees to drive him home, as long as he sits in the back seat. On the drive, he mentions the shoes he's wearing aren't his own.",
        "Back in Stamford, Karen leaves for the night, as Jim continues to lie face down on his desk and Andy is laid out on the floor, both completely inebriated. Jim asks Andy if he can get a ride but Andy says \"No way, dude,\" and begins to unfurl an inflatable mattress. He offers to share the \"roomy twin\" with Jim. Jim decides to ride his bike home but barely exits the front door when he crashes sideways into the bushes. An amused Karen laughs and offers Jim a ride home. He accepts immediately and crawls into her backseat leaving her to deal with his bicycle.",
        "Sometime during the party, Michael took the stage with Dwight behind him on guitar. Beginning by saying \"this is going out to Indians everywhere,\" he began a song as a tribute to \"one of the greats\" Mr. Adam Sandler. The lyrics are: \"Diwali is a festival of lights, let me tell you something, tonight has been.. one crazy night, so put on your saris, it's time to celebrate Diwali, everybody looks so jolly, but it's not Christmas, it's Diwali, the goddess of destruction Kali, stopped by to celebrate Diwali, don't invite any zombies, to our celebration of Diwali, along came Polly, to have some fun at Diwali, if you're Indian and you love to party, have a happy, happy, happy, happy Diwali.\" He then wished everybody a Happy Diwali and the crowd cheered."
    ],
    "quotes": [
        "Michael: Now, a lot of people say that Kelly is one in a million and that's true, but it's also not true. Because, frankly, there are literally billions of people just like Kelly in the world. Here are some famous Indians: Subrahmanyan Chandrasekhar. He is a Nobel prize-winning physicist. Impressive. Apu from the Simpsons. Hilarious. Indian. M. Night Shyamalan- 'The Village', 'Unbreakable', 'Sixth Sense...\"",
        "Michael: Oh, yuck. [spits out food]",
        "Carol: What? Too spicy?",
        "Michael: No. These s'mores are disgusting.",
        "Carol: They're not s'mores. They're samosas.",
        "Michael: Do you think they have any s'mores?",
        "Michael: All they are is chocolate, graham cracker, and marshmallow. How difficult would that have been?",
        "Carol: Are you okay?",
        "Michael: I'm going to be. [to DJ] Hi, I'm just going to get this for a sec... just a sec. [speaks in microphone] Um... everyone? I'm sorry, could I have your attention, please. Thank you. Ah-hah... Hi. Sorry. I just have an announcement to make. Um... okay. I have learned a lot about Indian culture tonight. But I have learned even more about love. And I know you're all thinking 'who is this crazy gringo and what is he talking about?' Well, I'm not crazy. Maybe I'm crazy in love. So without further ado, Carol? Carol Stills. I would like you to do me the honor of making me your husband. ",
        "Crowd: Awww!",
        "Carol: Oh, Michael. ",
        "Michael: What do you say?",
        "Carol: Can we talk about this in private?",
        "Michael: I didn't hear you. [laughs]",
        "Carol: [louder] Can we talk about this in private?",
        "Michael: [lowers microphone] Oh, you've got to be kidding me. Okay."
    ]
}