{
    "season": 3,
    "title": "Branch Closing",
    "episode": "7",
    "episodes": [
        7
    ],
    "episodeDetails": {
        "sections": [
            {
                "title": "Branch Closing",
                "level": 1,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "\"Branch Closing\" is the seventh episode of the third season of The Office and the 35th overall. It was written by Michael Schur and directed by Tucker Gates. It first aired on November 9, 2006 and was viewed by 8.1 million people. It is the first episode to have a \"Producer's Cut\" on NBC.com, with deleted scenes edited into the full episode and broadcast on the website."
                    }
                ],
                "images": []
            },
            {
                "title": "Summary",
                "level": 2,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "At the Stamford branch, Jim faxes Dwight a message from \"Future Dwight\" on stationery he stole before leaving Scranton. Dwight receives a fax warning that the coffee is poisoned and responds by dramatically knocking a mug of coffee out of Stanley's hand."
                    },
                    {
                        "type": "paragraph",
                        "text": "Jan informs Michael that the board has voted to close the Scranton branch. A small number of people will be transferred to Stamford while the rest (including Michael) will receive severance packages. Michael takes the news badly, and it isn't long before he spills the beans to the office prematurely."
                    },
                    {
                        "type": "paragraph",
                        "text": "Reactions to the news vary, as revealed in a series of talking head interviews. Stanley is thrilled and looks forward to retiring and traveling with his wife, Ryan notes the irony that the news is announced the day he receives his business cards, Angela calmly blames everyone, and a distraught Kelly threatens to kill herself if Ryan loses his job while she gets to keep hers, just like Romeo and Juliet (the Claire Danes version). Jim notes Scranton's closing with a tinge of disappointment, and Pam considers it a blessing in disguise, since she has started catching herself answering her home phone with \"Dunder Mifflin, this is Pam.\" Roy is unsure whether he wants to keep working at the warehouse if Pam leaves. But the warehouse workers are not in danger: The new warehouse owner Bob Vance (of Vance Refrigeration) offered to retain the warehouse crew."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael has a plan: He will confront the CFO at the New York office to get him to change his mind. As he and Dwight drive to New York, Michael learns that the CFO is out of the office for the day, so the confrontation will take place at the CFO's home instead."
                    },
                    {
                        "type": "paragraph",
                        "text": "In the break room, Ryan breaks up with Kelly, explaining that their relationship would not work out since they will no longer be working together. In a talking head interview, Ryan is pleased: He got valuable work experience, he will get a great recommendation letter from Michael, and he broke up with Kelly."
                    },
                    {
                        "type": "paragraph",
                        "text": "Amidst the celebration at the Stamford branch, Jan informs their branch manager Josh that he will be taking over the newly-formed division Dunder Mifflin Northeast, which will be all of the offices north of Stamford. Josh turns down the offer, however, revealing that he has leveraged the situation to obtain a senior management position at Dunder Mifflin's main competitor Staples. This throws the entire restructuring into disarray. Jim remarks in a talking head interview, \"Say what you will about Michael Scott, but he would never do that.\""
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael and Dwight arrive at the CFO's residence to find nobody home. While waiting for the CFO to return, Dwight helps Michael develop \"an attack plan\" and they rehearse what Michael will say."
                    },
                    {
                        "type": "paragraph",
                        "text": "Jan returns to the conference room and informs Jim that the new plan is for Scranton to absorb Stamford. She offers Jim the number two position at the Scranton branch, but Jim is unsure, as he has unresolved personal issues at the Scranton branch (which Jan assumes are due to Michael). Karen and Jim discuss the situation, and Karen says that if asked, she would go to Scranton. Jim is still undecided but suggests that Karen investigate job opportunities in New York rather than moving to Scranton. As for Andy, he creates a mess in the break room in frustration."
                    },
                    {
                        "type": "paragraph",
                        "text": "Jan returns to the Scranton branch, only to find chaos: Michael is gone, Stanley happily packs up his things, and Ryan flings his new business cards into the air. Demanding an explanation, Jan learns that Michael had told them of the branch's closing, at which point she informs them that their branch is not closing after all. With the exception of Stanley, the office is relieved that their jobs are safe. (Even Kevin and Angela embrace upon hearing the news.) They decide to go out to celebrate. Pam anxiously asks Jan whether anyone from Stamford is coming back to Scranton. Kelly is thrilled that she and Ryan don't have to break up now that their jobs are safe."
                    },
                    {
                        "type": "paragraph",
                        "text": "While Pam justifies in a talking head interview that keeping her job saves her the trouble of adjusting to a new one, Jim agonizes over whether he should return to Scranton or not. He informs Karen that he has decided to accept the position and suggests that she go there if offered a job. In a talking head interview, Karen admits that she is glad he said it, because even though she does not think he is into her, she is kind of into him."
                    },
                    {
                        "type": "paragraph",
                        "text": "Night has fallen, and Michael and Dwight continue to wait for the CFO to come home. Pam calls Michael's cell phone to let him know that the Scranton branch is safe, but he refuses to answer calls from the office until he can give them \"good news.\" As it gets later, Michael gets more and more despondent. While Dwight steps away to check his voicemail, Michael, talking to himself, finally accepts defeat, lying on the sidewalk and bitterly accepting his failure - only to be interrupted by a scream from Dwight, who tells him that the Scranton branch has been saved. As the reality of this statement finally sinks in, the pair joyfully celebrate their success, unsure exactly how they accomplished it."
                    },
                    {
                        "type": "paragraph",
                        "text": "As he heads home from work, Toby tells the documentary crew that he dreamed of selling his house, moving to Costa Rica, and learning how to surf, plans which had to be put on hold when the Scranton branch was saved. \"Costa Rica will still be there... when I'm 65.\" which happens (not permanently) in the episode Goodbye, Toby ."
                    }
                ],
                "images": []
            },
            {
                "title": "Producer's cut",
                "level": 2,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "In subplots, Meredith seeks a potential paramour based on a deal she once made to get physical with a coworker on the final day of employ, and Creed sells the electronics and furniture from his area of the office."
                    },
                    {
                        "type": "paragraph",
                        "text": "Meredith first believes that she makes the future sexual liaison pact with Michael, but he says it is not so. Toby is equally unhelpful on the matter. Finally, Gary Trundle, Meredith's former coworker from another branch's warehouse, calls to remind her of a deal he had made with her long ago. Meredith asks him to be at her place in 20 minutes. She confirms the closing to Gary even though she knows that the decision to close has been reversed, initially telling him the truth before cutting herself off to plan the rendezvous."
                    },
                    {
                        "type": "paragraph",
                        "text": "Dwight searches through the CFO's garbage outside his home, learning that he is rich (as he has a satellite TV bill) and drinks coffee, \"possibly to disguise the smell of cocaine.\""
                    },
                    {
                        "type": "paragraph",
                        "text": "Pam's line about the closing being a blessing has been changed from her being able to no longer answer her home phone \"Dunder Mifflin, this is Pam\" to her fantasy about quitting."
                    },
                    {
                        "type": "paragraph",
                        "text": "Jim's line about his theory that Scranton would close \"because Michael sold the building for magic beans\" is changed to an awkward high school reunion that ends up with everyone moving in with him."
                    },
                    {
                        "type": "paragraph",
                        "text": "Andy asks Jim what he's going to do if he should get laid off. When Jim asks Andy, he says that Cornell has a great alumni network and he might go back there to teach. Jim then asks where he went to college, mocking Andy's frequent reference to his alma mater."
                    },
                    {
                        "type": "paragraph",
                        "text": "In an extended scene, we find out that Ryan and Kelly's relationship may be more than it seems. Kelly appears to have a strange power over Ryan. He claims he \"can't explain\" the attraction and why they remain together."
                    },
                    {
                        "type": "paragraph",
                        "text": "Creed takes pictures of office property on his desk and advertises the items online. He makes several deals throughout the day and ultimately earns $1,200 selling Dunder Mifflin property from a branch now scheduled to remain open (giving proper context to Kevin's line, which remained in the aired version, that Creed would be paying for the post-work celebration at Poor Richard's)."
                    }
                ],
                "images": []
            },
            {
                "title": "Amusing Details",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Most of the office is aware that a few will be transferred to Dunder Mifflin Stamford and that the rest will be given severance even though Michael never communicated this to them.",
                                "elements": []
                            },
                            {
                                "text": "Stanley packs up his things even though it is mentioned that the process of closing a branch takes a little while.",
                                "elements": []
                            },
                            {
                                "text": "When Jim pesters Josh about people transferring to the Stamford branch, Josh becomes noticeably uncomfortable and says \"You know, nothing's definite, and frankly I wouldn't worry about it,\" to which Jim replies, \"What is that supposed to mean?\" This foreshadows Josh soon departing the company because he leveraged his new title into a senior management position at Staples, which ruins the company's plans for the Stamford branch to absorb the Scranton branch.",
                                "elements": [
                                    {
                                        "text": "Josh also repeatedly tells the Stamford employees to not worry about the rumors of the Scranton branch shutting down and Stamford becoming Dunder Mifflin Northeast, because he would soon ruin the plan.",
                                        "elements": []
                                    }
                                ]
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Connections to other Episodes",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "In The Office: The Accountants it’s revealed that Angela has a crush on Roy, this is also unsubtly hinted at in this episode.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Cultural references",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Michael sings Just call me Levinson in the morning to the chorus of the song \"Angel of the Morning\". The actual lyrics are \"Just call me angel of the morning, angel.\"",
                                "elements": []
                            },
                            {
                                "text": "Romeo and Juliet is a tragic romance by William Shakespeare. The Claire Danes version is the 1996 movie Romeo + Juliet, a modernization of the classic play.",
                                "elements": []
                            },
                            {
                                "text": "In the children's story Jack and the Beanstalk, the protagonist Jack sells the family cow for a handful of magic beans.",
                                "elements": []
                            },
                            {
                                "text": "\"Don't Know What You Got (Till It's Gone)\" is a song by the rock group Cinderella.",
                                "elements": []
                            },
                            {
                                "text": "Shotgun is a protocol for determining who sits in the front passenger seat.",
                                "elements": []
                            },
                            {
                                "text": "Michael’s ringtone is \"My Humps\" by The Black Eyed Peas.",
                                "elements": []
                            },
                            {
                                "text": "Michael Moore is a film documentarian with an aggressive, confrontational style. His documentary Bowling for Columbine deals with the culture of guns and violence in the United States. The movie Kingpin is a 1996 comedy. Coincidentally, the lead character in the movie is from Scranton.",
                                "elements": []
                            },
                            {
                                "text": "Staples is a retail chain of office supplies, positioned within the show as one of Dunder Mifflin's largest competitors.",
                                "elements": []
                            },
                            {
                                "text": "DJ's is a Scranton restaurant that features chicken wings. Cuginos is a small Italian restaurant in nearby Dunmore. Cooper's is a seafood restaurant in Scranton.",
                                "elements": []
                            },
                            {
                                "text": "Poor Richard's Pub is a pub in Scranton.",
                                "elements": []
                            },
                            {
                                "text": "65 years is the standard retirement age in the United States.",
                                "elements": []
                            },
                            {
                                "text": "Pam's P.S. in Kelly's company directory, \"What a long, strange trip it's been\", is the climatic refrain of the song \"Truckin'\" by the Grateful Dead.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Cast",
                "level": 2,
                "content": [],
                "images": []
            },
            {
                "title": "Main cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Steve Carell as Michael Scott",
                                "elements": []
                            },
                            {
                                "text": "Rainn Wilson as Dwight Schrute",
                                "elements": []
                            },
                            {
                                "text": "John Krasinski as Jim Halpert",
                                "elements": []
                            },
                            {
                                "text": "Jenna Fischer as Pam Beesly",
                                "elements": []
                            },
                            {
                                "text": "B.J. Novak as Ryan Howard",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Supporting cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "David Denman as Roy Anderson",
                                "elements": []
                            },
                            {
                                "text": "Melora Hardin as Jan Levenson",
                                "elements": []
                            },
                            {
                                "text": "Leslie David Baker as Stanley Hudson",
                                "elements": []
                            },
                            {
                                "text": "Brian Baumgartner as Kevin Malone",
                                "elements": []
                            },
                            {
                                "text": "Kate Flannery as Meredith Palmer",
                                "elements": []
                            },
                            {
                                "text": "Mindy Kaling as Kelly Kapoor",
                                "elements": []
                            },
                            {
                                "text": "Angela Kinsey as Angela Martin",
                                "elements": []
                            },
                            {
                                "text": "Paul Lieberstein as Toby Flenderson",
                                "elements": []
                            },
                            {
                                "text": "Phyllis Smith as Phyllis Lapin",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Recurring cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Ed Helms as Andy Bernard",
                                "elements": []
                            },
                            {
                                "text": "Rashida Jones as Karen Filippelli",
                                "elements": []
                            },
                            {
                                "text": "Charles Esten as Josh Porter",
                                "elements": []
                            },
                            {
                                "text": "Creed Bratton (actor) as Creed Bratton",
                                "elements": []
                            },
                            {
                                "text": "Craig Robinson as Darryl Philbin",
                                "elements": []
                            },
                            {
                                "text": "Calvin Tenner as Calvin (Uncredited)",
                                "elements": []
                            },
                            {
                                "text": "Philip Pickard as Philip (Uncredited)",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Guest cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Skyler Caleb as CPU Guy (Producer's Cut)",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            }
        ]
    },
    "quotesDetails": {
        "sections": [
            {
                "title": "Branch Closing Quotes",
                "level": 1,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Jim: I don't have a ton of contact with the Scranton branch, but, before I left, I took a box of Dwight's stationery, so, from time to time, I send Dwight faxes. From himself. From the future.\"Dwight, at 8 A.M. today, someone poisons the coffee. Do not drink the coffee. More instructions will follow. Cordially, Future Dwight.\""
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael: It is...an outrage, that's all. It's...They are making a huge, huge mistake. Let's see Josh replace these people. Let's see Josh find another Stanley. You think Stanleys grow on trees? Well, they don't - there is no Stanley Tree. You think the world is crawling with Phyllises? Show me that farm...with Phyllises and Kevins...sprouting up all over the place, ripe for the plucking...Show me that farm."
                    },
                    {
                        "type": "paragraph",
                        "text": "Ryan: It makes perfect sense that it would happen today - because I just received this in the mail: a thousand business cards with this address and phone number!"
                    },
                    {
                        "type": "paragraph",
                        "text": "Angela: I don't want to blame anyone in particular...I think everyone's to blame."
                    },
                    {
                        "type": "paragraph",
                        "text": "Kelly: If I could just say - if Ryan is laid off, I will kill myself! Like Romeo and Juliet...the Claire Danes one."
                    },
                    {
                        "type": "paragraph",
                        "text": "Stanley: I couldn't be happier - I'm gonna take the severance and retire, my wife and I are gonna travel...I really couldn't be happier!"
                    },
                    {
                        "type": "paragraph",
                        "text": "Ryan: This...kinda worked out perfectly for me. I got some good experience, Michael's gonna write me a great recommendation, and as far as me and Kelly goes, it's...for the best."
                    },
                    {
                        "type": "paragraph",
                        "text": "Jim: Say what you will about Michael Scott, but he would never do that."
                    },
                    {
                        "type": "paragraph",
                        "text": "Jan: What's going on here?\nPhyllis: We know the branch is closing - Michael told us.\nJan: Oh, God...OK - you know what, everybody? I'm sure there is a better way to do this, but I've driven something like 400 miles today and I'm completely exhausted, so, I'm just gonna tell you - your branch is not closing, Stamford is closing - for the time being, it seems that all of your jobs are safe."
                    },
                    {
                        "type": "paragraph",
                        "text": "Dwight: Who is it?\nMichael: The office.\nDwight: You gonna get it?\nMichael: No. Not until I have some good news for them...(unaware the call delivered the \"good news\" he was holding out for)...Not until I have some good news."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael: This was such a stupid idea - I am so stupid - I am such a stupid idiot. I let everybody down, everybody hates me, I lost everybody's jobs - nobody likes me anymore!\nDwight: Oh my God!\nMichael: What?\nDwight: Stamford is closed! Michael, we're not closed, Stamford is closed! Stamford is closed...\nMichael: We did it? We did it...\nDwight: We did it!\nTogether: WE DID IT!"
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael: How did we do it?\nDwight: I don't know - I have no idea...\nMichael: I don't understand..."
                    }
                ],
                "images": []
            }
        ]
    },
    "coldOpens": [
        "Dwight gets letters from Future Dwight as a prank from Jim in Stamford and rushes to save Stanley from being poisoned by his coffee. "
    ],
    "storylines": [
        "At the Stamford branch, Jim faxes Dwight a message from \"Future Dwight\" on stationery he stole before leaving Scranton. Dwight receives a fax warning that the coffee is poisoned and responds by dramatically knocking a mug of coffee out of Stanley's hand.",
        "Jan informs Michael that the board has voted to close the Scranton branch. A small number of people will be transferred to Stamford while the rest (including Michael) will receive severance packages. Michael takes the news badly, and it isn't long before he spills the beans to the office prematurely.",
        "Reactions to the news vary, as revealed in a series of talking head interviews. Stanley is thrilled and looks forward to retiring and traveling with his wife, Ryan notes the irony that the news is announced the day he receives his business cards, Angela calmly blames everyone, and a distraught Kelly threatens to kill herself if Ryan loses his job while she gets to keep hers, just like Romeo and Juliet (the Claire Danes version). Jim notes Scranton's closing with a tinge of disappointment, and Pam considers it a blessing in disguise, since she has started catching herself answering her home phone with \"Dunder Mifflin, this is Pam.\" Roy is unsure whether he wants to keep working at the warehouse if Pam leaves. But the warehouse workers are not in danger: The new warehouse owner Bob Vance (of Vance Refrigeration) offered to retain the warehouse crew.",
        "Michael has a plan: He will confront the CFO at the New York office to get him to change his mind. As he and Dwight drive to New York, Michael learns that the CFO is out of the office for the day, so the confrontation will take place at the CFO's home instead.",
        "In the break room, Ryan breaks up with Kelly, explaining that their relationship would not work out since they will no longer be working together. In a talking head interview, Ryan is pleased: He got valuable work experience, he will get a great recommendation letter from Michael, and he broke up with Kelly.",
        "Amidst the celebration at the Stamford branch, Jan informs their branch manager Josh that he will be taking over the newly-formed division Dunder Mifflin Northeast, which will be all of the offices north of Stamford. Josh turns down the offer, however, revealing that he has leveraged the situation to obtain a senior management position at Dunder Mifflin's main competitor Staples. This throws the entire restructuring into disarray. Jim remarks in a talking head interview, \"Say what you will about Michael Scott, but he would never do that.\"",
        "Michael and Dwight arrive at the CFO's residence to find nobody home. While waiting for the CFO to return, Dwight helps Michael develop \"an attack plan\" and they rehearse what Michael will say.",
        "Jan returns to the conference room and informs Jim that the new plan is for Scranton to absorb Stamford. She offers Jim the number two position at the Scranton branch, but Jim is unsure, as he has unresolved personal issues at the Scranton branch (which Jan assumes are due to Michael). Karen and Jim discuss the situation, and Karen says that if asked, she would go to Scranton. Jim is still undecided but suggests that Karen investigate job opportunities in New York rather than moving to Scranton. As for Andy, he creates a mess in the break room in frustration.",
        "Jan returns to the Scranton branch, only to find chaos: Michael is gone, Stanley happily packs up his things, and Ryan flings his new business cards into the air. Demanding an explanation, Jan learns that Michael had told them of the branch's closing, at which point she informs them that their branch is not closing after all. With the exception of Stanley, the office is relieved that their jobs are safe. (Even Kevin and Angela embrace upon hearing the news.) They decide to go out to celebrate. Pam anxiously asks Jan whether anyone from Stamford is coming back to Scranton. Kelly is thrilled that she and Ryan don't have to break up now that their jobs are safe.",
        "While Pam justifies in a talking head interview that keeping her job saves her the trouble of adjusting to a new one, Jim agonizes over whether he should return to Scranton or not. He informs Karen that he has decided to accept the position and suggests that she go there if offered a job. In a talking head interview, Karen admits that she is glad he said it, because even though she does not think he is into her, she is kind of into him.",
        "Night has fallen, and Michael and Dwight continue to wait for the CFO to come home. Pam calls Michael's cell phone to let him know that the Scranton branch is safe, but he refuses to answer calls from the office until he can give them \"good news.\" As it gets later, Michael gets more and more despondent. While Dwight steps away to check his voicemail, Michael, talking to himself, finally accepts defeat, lying on the sidewalk and bitterly accepting his failure - only to be interrupted by a scream from Dwight, who tells him that the Scranton branch has been saved. As the reality of this statement finally sinks in, the pair joyfully celebrate their success, unsure exactly how they accomplished it.",
        "As he heads home from work, Toby tells the documentary crew that he dreamed of selling his house, moving to Costa Rica, and learning how to surf, plans which had to be put on hold when the Scranton branch was saved. \"Costa Rica will still be there... when I'm 65.\" which happens (not permanently) in the episode Goodbye, Toby ."
    ],
    "quotes": [
        "Jim: I don't have a ton of contact with the Scranton branch, but, before I left, I took a box of Dwight's stationery, so, from time to time, I send Dwight faxes. From himself. From the future.\"Dwight, at 8 A.M. today, someone poisons the coffee. Do not drink the coffee. More instructions will follow. Cordially, Future Dwight.\"",
        "Michael: It is...an outrage, that's all. It's...They are making a huge, huge mistake. Let's see Josh replace these people. Let's see Josh find another Stanley. You think Stanleys grow on trees? Well, they don't - there is no Stanley Tree. You think the world is crawling with Phyllises? Show me that farm...with Phyllises and Kevins...sprouting up all over the place, ripe for the plucking...Show me that farm.",
        "Ryan: It makes perfect sense that it would happen today - because I just received this in the mail: a thousand business cards with this address and phone number!",
        "Angela: I don't want to blame anyone in particular...I think everyone's to blame.",
        "Kelly: If I could just say - if Ryan is laid off, I will kill myself! Like Romeo and Juliet...the Claire Danes one.",
        "Stanley: I couldn't be happier - I'm gonna take the severance and retire, my wife and I are gonna travel...I really couldn't be happier!",
        "Ryan: This...kinda worked out perfectly for me. I got some good experience, Michael's gonna write me a great recommendation, and as far as me and Kelly goes, it's...for the best.",
        "Jim: Say what you will about Michael Scott, but he would never do that.",
        "Jan: What's going on here?\nPhyllis: We know the branch is closing - Michael told us.\nJan: Oh, God...OK - you know what, everybody? I'm sure there is a better way to do this, but I've driven something like 400 miles today and I'm completely exhausted, so, I'm just gonna tell you - your branch is not closing, Stamford is closing - for the time being, it seems that all of your jobs are safe.",
        "Dwight: Who is it?\nMichael: The office.\nDwight: You gonna get it?\nMichael: No. Not until I have some good news for them...(unaware the call delivered the \"good news\" he was holding out for)...Not until I have some good news.",
        "Michael: This was such a stupid idea - I am so stupid - I am such a stupid idiot. I let everybody down, everybody hates me, I lost everybody's jobs - nobody likes me anymore!\nDwight: Oh my God!\nMichael: What?\nDwight: Stamford is closed! Michael, we're not closed, Stamford is closed! Stamford is closed...\nMichael: We did it? We did it...\nDwight: We did it!\nTogether: WE DID IT!",
        "Michael: How did we do it?\nDwight: I don't know - I have no idea...\nMichael: I don't understand..."
    ]
}