{
    "season": 3,
    "title": "Branch Closing",
    "episode": "7",
    "episodes": [
        7
    ],
    "coldOpens": [
        "Dwight gets letters from Future Dwight as a prank from Jim in Stamford and rushes to save Stanley from being poisoned by his coffee. "
    ],
    "storylines": [
        "At the Stamford branch, Jim faxes Dwight a message from \"Future Dwight\" on stationery he stole before leaving Scranton. Dwight receives a fax warning that the coffee is poisoned and responds by dramatically knocking a mug of coffee out of Stanley's hand.",
        "Jan informs Michael that the board has voted to close the Scranton branch. A small number of people will be transferred to Stamford while the rest (including Michael) will receive severance packages. Michael takes the news badly, and it isn't long before he spills the beans to the office prematurely.",
        "Reactions to the news vary, as revealed in a series of talking head interviews. Stanley is thrilled and looks forward to retiring and traveling with his wife, Ryan notes the irony that the news is announced the day he receives his business cards, Angela calmly blames everyone, and a distraught Kelly threatens to kill herself if Ryan loses his job while she gets to keep hers, just like Romeo and Juliet (the Claire Danes version). Jim notes Scranton's closing with a tinge of disappointment, and Pam considers it a blessing in disguise, since she has started catching herself answering her home phone with \"Dunder Mifflin, this is Pam.\" Roy is unsure whether he wants to keep working at the warehouse if Pam leaves. But the warehouse workers are not in danger: The new warehouse owner Bob Vance (of Vance Refrigeration) offered to retain the warehouse crew.",
        "Michael has a plan: He will confront the CFO at the New York office to get him to change his mind. As he and Dwight drive to New York, Michael learns that the CFO is out of the office for the day, so the confrontation will take place at the CFO's home instead.",
        "In the break room, Ryan breaks up with Kelly, explaining that their relationship would not work out since they will no longer be working together. In a talking head interview, Ryan is pleased: He got valuable work experience, he will get a great recommendation letter from Michael, and he broke up with Kelly.",
        "Amidst the celebration at the Stamford branch, Jan informs their branch manager Josh that he will be taking over the newly-formed division Dunder Mifflin Northeast, which will be all of the offices north of Stamford. Josh turns down the offer, however, revealing that he has leveraged the situation to obtain a senior management position at Dunder Mifflin's main competitor Staples. This throws the entire restructuring into disarray. Jim remarks in a talking head interview, \"Say what you will about Michael Scott, but he would never do that.\"",
        "Michael and Dwight arrive at the CFO's residence to find nobody home. While waiting for the CFO to return, Dwight helps Michael develop \"an attack plan\" and they rehearse what Michael will say.",
        "Jan returns to the conference room and informs Jim that the new plan is for Scranton to absorb Stamford. She offers Jim the number two position at the Scranton branch, but Jim is unsure, as he has unresolved personal issues at the Scranton branch (which Jan assumes are due to Michael). Karen and Jim discuss the situation, and Karen says that if asked, she would go to Scranton. Jim is still undecided but suggests that Karen investigate job opportunities in New York rather than moving to Scranton. As for Andy, he creates a mess in the break room in frustration.",
        "Jan returns to the Scranton branch, only to find chaos: Michael is gone, Stanley happily packs up his things, and Ryan flings his new business cards into the air. Demanding an explanation, Jan learns that Michael had told them of the branch's closing, at which point she informs them that their branch is not closing after all. With the exception of Stanley, the office is relieved that their jobs are safe. (Even Kevin and Angela embrace upon hearing the news.) They decide to go out to celebrate. Pam anxiously asks Jan whether anyone from Stamford is coming back to Scranton. Kelly is thrilled that she and Ryan don't have to break up now that their jobs are safe.",
        "While Pam justifies in a talking head interview that keeping her job saves her the trouble of adjusting to a new one, Jim agonizes over whether he should return to Scranton or not. He informs Karen that he has decided to accept the position and suggests that she go there if offered a job. In a talking head interview, Karen admits that she is glad he said it, because even though she does not think he is into her, she is kind of into him.",
        "Night has fallen, and Michael and Dwight continue to wait for the CFO to come home. Pam calls Michael's cell phone to let him know that the Scranton branch is safe, but he refuses to answer calls from the office until he can give them \"good news.\" As it gets later, Michael gets more and more despondent. While Dwight steps away to check his voicemail, Michael, talking to himself, finally accepts defeat, lying on the sidewalk and bitterly accepting his failure - only to be interrupted by a scream from Dwight, who tells him that the Scranton branch has been saved. As the reality of this statement finally sinks in, the pair joyfully celebrate their success, unsure exactly how they accomplished it.",
        "As he heads home from work, Toby tells the documentary crew that he dreamed of selling his house, moving to Costa Rica, and learning how to surf, plans which had to be put on hold when the Scranton branch was saved. \"Costa Rica will still be there... when I'm 65.\" which happens (not permanently) in the episode Goodbye, Toby ."
    ],
    "quotes": [
        [
            {
                "speaker": "Jim",
                "content": " I don't have a ton of contact with the Scranton branch, but, before I left, I took a box of Dwight's stationery, so, from time to time, I send Dwight faxes. From himself. From the future.\"Dwight, at 8 A.M. today, someone poisons the coffee. Do not drink the coffee. More instructions will follow. Cordially, Future Dwight.\""
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " It is...an outrage, that's all. It's...They are making a huge, huge mistake. Let's see Josh replace these people. Let's see Josh find another Stanley. You think Stanleys grow on trees? Well, they don't - there is no Stanley Tree. You think the world is crawling with Phyllises? Show me that farm...with Phyllises and Kevins...sprouting up all over the place, ripe for the plucking...Show me that farm."
            }
        ],
        [
            {
                "speaker": "Ryan",
                "content": " It makes perfect sense that it would happen today - because I just received this in the mail: a thousand business cards with this address and phone number!"
            }
        ],
        [
            {
                "speaker": "Angela",
                "content": " I don't want to blame anyone in particular...I think everyone's to blame."
            }
        ],
        [
            {
                "speaker": "Kelly",
                "content": " If I could just say - if Ryan is laid off, I will kill myself! Like Romeo and Juliet...the Claire Danes one."
            }
        ],
        [
            {
                "speaker": "Stanley",
                "content": " I couldn't be happier - I'm gonna take the severance and retire, my wife and I are gonna travel...I really couldn't be happier!"
            }
        ],
        [
            {
                "speaker": "Ryan",
                "content": " This...kinda worked out perfectly for me. I got some good experience, Michael's gonna write me a great recommendation, and as far as me and Kelly goes, it's...for the best."
            }
        ],
        [
            {
                "speaker": "Jim",
                "content": " Say what you will about Michael Scott, but he would never do that."
            }
        ],
        [
            {
                "speaker": "Jan",
                "content": " What's going on here?"
            },
            {
                "speaker": "Phyllis",
                "content": " We know the branch is closing - Michael told us."
            },
            {
                "speaker": "Jan",
                "content": " Oh, God...OK - you know what, everybody? I'm sure there is a better way to do this, but I've driven something like 400 miles today and I'm completely exhausted, so, I'm just gonna tell you - your branch is not closing, Stamford is closing - for the time being, it seems that all of your jobs are safe."
            }
        ],
        [
            {
                "speaker": "Dwight",
                "content": " Who is it?"
            },
            {
                "speaker": "Michael",
                "content": " The office."
            },
            {
                "speaker": "Dwight",
                "content": " You gonna get it?"
            },
            {
                "speaker": "Michael",
                "content": " No. Not until I have some good news for them...(unaware the call delivered the \"good news\" he was holding out for)...Not until I have some good news."
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " This was such a stupid idea - I am so stupid - I am such a stupid idiot. I let everybody down, everybody hates me, I lost everybody's jobs - nobody likes me anymore!"
            },
            {
                "speaker": "Dwight",
                "content": " Oh my God!"
            },
            {
                "speaker": "Michael",
                "content": " What?"
            },
            {
                "speaker": "Dwight",
                "content": " Stamford is closed! Michael, we're not closed, Stamford is closed! Stamford is closed..."
            },
            {
                "speaker": "Michael",
                "content": " We did it? We did it..."
            },
            {
                "speaker": "Dwight",
                "content": " We did it!"
            },
            {
                "speaker": "Together",
                "content": " WE DID IT!"
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " How did we do it?"
            },
            {
                "speaker": "Dwight",
                "content": " I don't know - I have no idea..."
            },
            {
                "speaker": "Michael",
                "content": " I don't understand..."
            }
        ]
    ]
}