{
    "season": 3,
    "title": "The Merger",
    "episode": "8",
    "episodes": [
        8
    ],
    "coldOpens": [
        "The Stamford branch packs up their belongings, with Andy pressing Jim for the goods on Michael. Pam \"times\" how fast Dwight can run with a thermometer when Toby tells Pam that he finished a marathon, and Dwight says he could run faster than Toby. "
    ],
    "storylines": [
        "Pam congratulates Toby on a road race but Dwight questions the merit of the accomplishment and says he could finish a mile faster on a skateboard. He brags that he outran a black pepper snake just last week and reveals in an interview that his speed falls between that of \"a snake and a mongoose ... and a panther.\" Outside, Dwight stretches as he plans to run around the building in his suit and dress shoes. Pam purportedly times him but admits her \"stopwatch\" is a digital thermometer and goes inside.",
        "In Stamford, the office is being packed up in anticipation of the move to Scranton. Jim high-fives Karen and briefly wears a paper hat reading \"Stamford R.I.P.\" made by Andy, and a stack of the hats are seen in a recycling bin. Andy questions Jim about his new supervisor, Michael Scott, but Jim plays it close to the chest. Andy threatens to crush Jim if he gets in his way and rolls away with a PC from Josh Porter's office.",
        "Pam returns with two paper grocery bags full of supplies. Michael instructs her to arrange the conference room \"as though you are trying to impress an older man way out of your league.\" In an interview, she professes excitement over the merger of Stamford employees into the Scranton branch, including the return of her old friend Jim. Kevin is given the job of shredding the company documents from Stamford, which he relishes. As he demonstrates the power of his shredder from Staples, Kevin gets carried away and accidentally shreds his credit card. As Michael is putting nameplates on the ex-Stamford employee's desks Dwight suggests that they fire Tony Gardner to consolidate power. In an interview, Dwight says that he would have been good as the Japanese soldier who chose which prisoner to execute once a new batch of prisoners arrived.",
        "In a parking lot interview next to his Nissan Xterra, Andy proclaims he'll be the No. 2 man in Scranton in six weeks time through \"name repetition, personality mirroring and never breaking off a handshake.\" Indeed, he echoes Michael's \"Aloha\" greeting and refers to his \"nifty gifty\" bag, which contains mostly pencils and coupons to local Scranton \"hot spots\". Pam is sitting at her desk fascinated by their semi-awkward conversation. Michael admits during a talking head that he is fond of Andy and thinks he has a likable way about him. Jim walks in the door, and Pam is obviously extremely smitten to see him since she hasn't seen him in a long time, and still has feelings for him. Meanwhile, Dwight instructs Jim not to mess with him, as he is older and wiser. Jim gapes at Dwight's forehead, freaking him out.",
        "Dwight introduces himself to Andy and each man believes the other shall report to him in the office hierarchy. Andy mentions his title contains the word 'director' which outranks a 'manager' on a film set and questions Dwight if he knows anything about film. Dwight states he knows everything about film since he has seen over 240 of them. Jim goes over to say \"hi\" to Toby and is then somewhat confused when Toby invites him to \"pound\" it.  An elated Kelly hugs Jim and informs him there is a lot she must catch him up on and proceeds to tell him about the babies Tom Cruise & Katie Holmes and Brad Pitt & Angelina Jolie had. Jim then asks Kelly what's new with her and she replies, \"I just told you.\"",
        "Michael plans an orientation in the \"banquet hall\", but stops Meredith from drinking champagne, and beseeches Kelly not to eat the snacks, telling her to treat it like beef. When informed she eats beef, he says to treat it like poisoned beef, because the snacks are for guests. In a familiar manner, Karen gives Jim a stick of gum and Pam notices. Michael plays a videotape he has created called \"Lazy Scranton\" featuring himself and Dwight rhyming over the music of Saturday Night Live's \"Lazy Sunday\". Jim says the video treat reminds him of his orientation film: \"The Scranton Witch Project.\" The viewer is shown a brief clip of that film, which features Michael illuminated by a flashlight saying he \"gets so scared when people don't label their personal food.\" While it is clear that everyone is bored, Michael says that he thought the video would be an \"A\" or an \"A+\"; then, he remembered that there is an \"A++\".",
        "In the coffee room, Pam notes that Jim has purchased a bottle of water from the vending machine instead of grape soda that he used to frequently purchase while at Scranton. Jim simply replies \"I'm evolving, Pam.\" which to note, his sleeves are buttoned up. Pam then questions when Jim is going to tell her everything and if he is interested to go for a coffee after work. Jim replies not tonight since he is still settling in and then Michael walks in the room, making things more awkward.",
        "In a series of vignettes, Stamford transplants are distracted by their new Scranton coworkers: Ryan by Hannah's open use of a breast pump; Karen by Phyllis's perfume from metropolitan Orlando; Martin by Creed's feet-up, boisterous phone conversation. In an interview, Stanley questions the audacity of \"these new people\" and mentions he's silently sat downwind from Phyllis's stinky perfume for years.",
        "The integration portion of Michael's orientation finds four new employees sitting in chairs on the banquet room table. Karen asks Michael why they aren't being treated as equal. The boss and Dwight try to force hefty, skeptical Tony up on the table, and he quits instead. Jan later calls Michael and yells at him for firing Tony when he tried to quit (an impulsive decision Michael made after feeling insulted by Tony's attempt). She complains that because Michael fired Tony rather than letting him quit like he wanted to, Dunder Mifflin has to pay him severance. Michael initially uses Dwight as a scapegoat by saying \"Bad advice from my number two.\" of which Jan corrects him and says Jim is actually going to be the number two. This is eventually brought into a meeting between Michael, Dwight, Jim and Andy and culminates in yet another battle between Dwight and Andy for Michael's respect.",
        "After Tony leaves the room, Hannah walks out, agreeing Michael is unprofessional. A short while later, Michael runs into the office and tells everyone to go down to the parking lot because someone has let the air out of all their tires. The employees rush down to see what is going on and Michael blames Vance Refrigeration employees. Michael suggests stealing all of the refrigerators from Bob Vance in retribution. Martin notes Michael's tires remain fully inflated, but Michael says they left a hate note under his windshield wiper reading, \"You guys suck! You can never pull together as one and revenge us. That is why you suck!\" Everyone shakes their heads in disbelief at what Michael has done. Once again, Pam noticed Karen casually touching Jim's back with her hand as they walk away. Later, all the employees are shown talking to each other and getting along due to a common interest: Michael as an unprofessional boss. Michael watches from his office and comments how a common enemy has brought the Stamford and Scranton employees together, although he apparently believes that the employees have fallen for his scheme and consider Vance Refrigeration the common enemy, not Michael himself.",
        "Jim sits in his Toyota Corolla and receives a call from Karen to meet up. He quickly ends the conversation as he sees Pam and runs over to say the day had been awkward and that he feels he should tell her he is seeing someone. She denies awkwardness and states that they'll always be friends.",
        "Kevin uses the shredder to make a salad. Dwight and Andy trade numerous barbs on a downward elevator ride. Andy disses Dwight's Trans Am, which is defended as classic American muscle. Andy praises his luxurious, rugged, Japanese Xterra, but Dwight says the vehicle's name isn't even a word and makes little sense."
    ],
    "quotes": [
        [
            {
                "speaker": "Dwight",
                "content": " I am fast. To give you a reference point. I'm somewhere between a snake and a mongoose. And a panther."
            }
        ],
        [
            {
                "speaker": "Pam",
                "content": " Am I being mean to Dwight? I don't know, I did just make him run around the building, and I have no intention of timing him - this isn't even a stopwatch, it's a digital thermometer! He does make my life harder sometimes, and on purpose - like, he tried to put meters on the bathroom stalls as a way of bringing in more money for the company...I should really get back to work."
            }
        ],
        [
            {
                "speaker": "Andy",
                "content": " Am I trying to get under his skin? Yes...because, the angrier (Dwight) gets, the more marginalized he becomes. Meanwhile, Andy Bernard is out there...layin' on the charm."
            }
        ],
        [
            {
                "speaker": "Stanley",
                "content": " I don't know who these new people think they are; I've sat downwind of Phyllis's stinky perfumes for years...never said a word."
            }
        ],
        [
            {
                "speaker": "Karen",
                "content": " Bob Vance, of Vance Refrigeration?"
            }
        ]
    ]
}