{
    "season": 3,
    "title": "The Convict",
    "episode": "9",
    "episodes": [
        9
    ],
    "coldOpens": [
        "Michael imitates the baby from Look Who's Talking when Hannah Smoterich-Barr brings in her baby boy who is mistaken for a girl because of bizarre and nonsensical gender roles. She confirms his favorite color is pink. "
    ],
    "storylines": [
        "Hannah brings her infant son to work where his all-pink ensemble evokes gender confusion. The baby is met with ambivalence from Stanley. Creed attempts to play a paperclip-based game against Karen's admonishment. Michael can't help himself, and crawls under a nearby desk to act as the voice of the child riffing on lines from the Look Who's Talking film series.",
        "Angela, Kevin, Michael and Pam teleconference Jan to determine the source of a rebate check the office received. Jan informs the group the check stems from a federal reformed convict employment program, a \"smart move\" by Josh, former manager of Dunder Mifflin Stamford. She e-mails human resources and quickly determines the employee hired through the program is one Martin.",
        "Michael proposes the quartet forget the news they've received to avoid creating a rift among employees. All agree, although Michael misreads a sarcastic Angela who says she supports protecting a criminal, especially as a \"90 lb. female who sits in a poorly-lit, rarely-visited corner of the office\".",
        "Meanwhile, Andy dials Jim's extension and whispers \"I'm horny\". Jim is flabbergasted but soon realizes Andy wants a rundown on his attractive female coworkers and asks for a debriefing on Kelly, Angela and Pam. Jim encourages Andy to pursue Pam and as a prank, coaches him on her favorite things. In actuality, his tips are things that Pam hates: frisbee-based competitions, hunting, pig Latin, and the Six Flags television commercial \"with the old guy\".",
        "Dwight assures Michael he is of a collected, cool mindset to hear a piece of news, but when told of Martin's criminal past attempts to take off in a dead sprint. In an interview he says he simply doesn't like criminals. Michael himself announces Martin's \"problems with Johnny Law\" to everyone, and says that for every trusted white man, he can name a black man he trusts more. He then asks employees to call out names of white men. He tops Pam's father with \"Danny Glover\", but is unfamiliar with Jim's suggestion of \"Jonas Salk\"; Jim quickly substitutes Justin Timberlake, which garners \"Colin Powell\". Karen suggests \"Jesus\", to which the boss replies \"Apollo Creed\" to which Stanley simply rolls his eyes in casual disbelief.",
        "In the breakroom over lunch, Martin tells the others he was incarcerated for insider trading, and although it was routine and could be dull, he enjoyed certain perks of prison, including outside time and art classes. Ryan is told about prison business classes taught by Harvard Business School guys. Pam comments that prison sounds better than their current work situation and Kevin wonders why the branch doesn't receive daily outdoors time.",
        "Soon, Michael announces an hour outdoors time will take place in the parking lot. Nearly everyone heads outside to bitter cold temperatures. Michael offers a weightlifting session with a 2.5 lb. dumbbell he produces from the trunk of his Sebring, but a freezing Stanley leads a charge back into the warmth of the office.",
        "Michael soon calls an impromptu meeting in which he dons a do-rag and attempts to \"scare you straight\" as an ex-con character named \"Prison Mike\". He speaks with a New York accent, calls Angela a bee-yoch, threatens to shove her up against a wall (and incites Dwight to politely come to her defense with the rest of the staff), says life \"in the clink\" is no picnic, alludes to violence and rape and singles out Ryan because, in prison, he would be \"da belle of da ball\", who responds \"Michael, please\" in total discomfort.",
        "Jim asks Prison Mike where he learned such information and he claims it's a mix of the Internet and prison. Jim asks his crime and Angela is peeved when Dwight asks Prison Mike the worst thing about prison, which he responds by claiming there were Dementors. Andy plays along, and says prison sounds awful. Prison Mike concludes his speech, saying \"You got a good life.\" Martin comments that Michael's performance did not remind him of his time in prison. A frustrated Michael locks everyone in the conference room, who become concerned and begin moving around for an exit. Hannah, still at her desk with the pink-clothed child, ignores Kevin's pleas for assistance.",
        "Pam phones Toby who tells Michael the staff is fully aware a workplace is better than prison and are simply teasing him. A relieved Michael releases his prisoners, including Stanley who never stopped working on his crossword puzzle through the entire incarceration.",
        "Martin cleans out his desk and quits Dunder Mifflin. In his office, Michael remarks to the camera that he thinks Martin is a quitter.",
        "Andy strums \"The Rainbow Connection\" on his banjo, while singing pig Latin in his \"sexy, high, falsetto voice\" in an attempt to woo Pam based on Jim's advice. She smiles politely and glances at Jim, who gives the camera his trademark smirk."
    ],
    "quotes": [
        [
            {
                "speaker": "Dwight",
                "content": " I am greatly concerned about having a convict in the office. And I do not care if that convict is white, black, Asian, German, or some kind of halfsy. I do not like criminals."
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " [puts on bandanna]. I'm prison Mike! You know why they call me prison Mike?!"
            }
        ],
        [
            {
                "speaker": "Angela",
                "content": " Do you really expect us to believe you're somebody else?"
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " Do you really expect me to not push you up against the wall, beeyotch?! [employees protest] All right, hey, hey, hey, hey, that's just the way we talk in the clink. Been a lot of fun talk about prison today, but I am here to scare you straight. I AM HERE TO SCARE YOU STRAIIIGHT!! In prison you are somebody's bitch. Oh, and you. [points to Ryan] You, my friend, would be da belle of da ball. Don't drop the soap! Don't drop the soap!"
            }
        ],
        [
            {
                "speaker": "Ryan",
                "content": " Michael, please. [Michael makes kissing noises]"
            }
        ],
        [
            {
                "speaker": "Jim",
                "content": " Where... did you learn all of this?"
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " Internet. "
            }
        ],
        [
            {
                "speaker": "Jim",
                "content": " So, not prison."
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " And prison. Eh, fifty-fifty, both. Look, prison stinks, is what I'm saying. It's not like you can go home, and, recharge your batteries, and come back in the morning and, be with your friends, having fun in the office. "
            }
        ],
        [
            {
                "speaker": "Jim",
                "content": " What'd you do, Prison Mike?"
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " I stole. ... And I robbed. And I kidnapped... the... president's son. And held him for ransom."
            }
        ],
        [
            {
                "speaker": "Jim",
                "content": " That is... quite the rap sheet, Prison Mike."
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " And I nevah got caught, neither."
            }
        ],
        [
            {
                "speaker": "Jim",
                "content": " Well, you're... in... prison, but, mmhmm."
            }
        ],
        [
            {
                "speaker": "Pam",
                "content": " Prison Mike? What was the food like in prison?"
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " Gruel. Sandwiches. Gruel omelettes. Nothing but gruel. Plus, you can eat your own hair."
            }
        ],
        [
            {
                "speaker": "Andy",
                "content": " Wow. Prison sounds horrible."
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " Yeah. Yeah. Well, thank you, Andy. Tanks."
            }
        ],
        [
            {
                "speaker": "Dwight",
                "content": " Prison Mike. What's the very very worst thing about prison?"
            }
        ],
        [
            {
                "speaker": "Angela",
                "content": " Don't encourage him, Dwight. "
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " The worst thing about prison was the... was the Dementors. They... were flying all over the place, and they were scary. And they'd come down, and they'd suck the soul out of your body, and it hurt!"
            }
        ]
    ]
}