{
    "season": 3,
    "title": "The Convict",
    "episode": "9",
    "episodes": [
        9
    ],
    "episodeDetails": {
        "sections": [
            {
                "title": "The Convict",
                "level": 1,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "\"The Convict\" is the ninth episode of the third season of The Office and the 37th overall. It was written by Ricky Gervais and Stephen Merchant and directed by Jeffrey Blitz. It first aired on November 30, 2006."
                    }
                ],
                "images": []
            },
            {
                "title": "Plot",
                "level": 2,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Hannah brings her infant son to work where his all-pink ensemble evokes gender confusion. The baby is met with ambivalence from Stanley. Creed attempts to play a paperclip-based game against Karen's admonishment. Michael can't help himself, and crawls under a nearby desk to act as the voice of the child riffing on lines from the Look Who's Talking film series."
                    },
                    {
                        "type": "paragraph",
                        "text": "Angela, Kevin, Michael and Pam teleconference Jan to determine the source of a rebate check the office received. Jan informs the group the check stems from a federal reformed convict employment program, a \"smart move\" by Josh, former manager of Dunder Mifflin Stamford. She e-mails human resources and quickly determines the employee hired through the program is one Martin."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael proposes the quartet forget the news they've received to avoid creating a rift among employees. All agree, although Michael misreads a sarcastic Angela who says she supports protecting a criminal, especially as a \"90 lb. female who sits in a poorly-lit, rarely-visited corner of the office\"."
                    },
                    {
                        "type": "paragraph",
                        "text": "Meanwhile, Andy dials Jim's extension and whispers \"I'm horny\". Jim is flabbergasted but soon realizes Andy wants a rundown on his attractive female coworkers and asks for a debriefing on Kelly, Angela and Pam. Jim encourages Andy to pursue Pam and as a prank, coaches him on her favorite things. In actuality, his tips are things that Pam hates: frisbee-based competitions, hunting, pig Latin, and the Six Flags television commercial \"with the old guy\"."
                    },
                    {
                        "type": "paragraph",
                        "text": "Dwight assures Michael he is of a collected, cool mindset to hear a piece of news, but when told of Martin's criminal past attempts to take off in a dead sprint. In an interview he says he simply doesn't like criminals. Michael himself announces Martin's \"problems with Johnny Law\" to everyone, and says that for every trusted white man, he can name a black man he trusts more. He then asks employees to call out names of white men. He tops Pam's father with \"Danny Glover\", but is unfamiliar with Jim's suggestion of \"Jonas Salk\"; Jim quickly substitutes Justin Timberlake, which garners \"Colin Powell\". Karen suggests \"Jesus\", to which the boss replies \"Apollo Creed\" to which Stanley simply rolls his eyes in casual disbelief."
                    },
                    {
                        "type": "paragraph",
                        "text": "In the breakroom over lunch, Martin tells the others he was incarcerated for insider trading, and although it was routine and could be dull, he enjoyed certain perks of prison, including outside time and art classes. Ryan is told about prison business classes taught by Harvard Business School guys. Pam comments that prison sounds better than their current work situation and Kevin wonders why the branch doesn't receive daily outdoors time."
                    },
                    {
                        "type": "paragraph",
                        "text": "Soon, Michael announces an hour outdoors time will take place in the parking lot. Nearly everyone heads outside to bitter cold temperatures. Michael offers a weightlifting session with a 2.5 lb. dumbbell he produces from the trunk of his Sebring, but a freezing Stanley leads a charge back into the warmth of the office."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael soon calls an impromptu meeting in which he dons a do-rag and attempts to \"scare you straight\" as an ex-con character named \"Prison Mike\". He speaks with a New York accent, calls Angela a bee-yoch, threatens to shove her up against a wall (and incites Dwight to politely come to her defense with the rest of the staff), says life \"in the clink\" is no picnic, alludes to violence and rape and singles out Ryan because, in prison, he would be \"da belle of da ball\", who responds \"Michael, please\" in total discomfort."
                    },
                    {
                        "type": "paragraph",
                        "text": "Jim asks Prison Mike where he learned such information and he claims it's a mix of the Internet and prison. Jim asks his crime and Angela is peeved when Dwight asks Prison Mike the worst thing about prison, which he responds by claiming there were Dementors. Andy plays along, and says prison sounds awful. Prison Mike concludes his speech, saying \"You got a good life.\" Martin comments that Michael's performance did not remind him of his time in prison. A frustrated Michael locks everyone in the conference room, who become concerned and begin moving around for an exit. Hannah, still at her desk with the pink-clothed child, ignores Kevin's pleas for assistance."
                    },
                    {
                        "type": "paragraph",
                        "text": "Pam phones Toby who tells Michael the staff is fully aware a workplace is better than prison and are simply teasing him. A relieved Michael releases his prisoners, including Stanley who never stopped working on his crossword puzzle through the entire incarceration."
                    },
                    {
                        "type": "paragraph",
                        "text": "Martin cleans out his desk and quits Dunder Mifflin. In his office, Michael remarks to the camera that he thinks Martin is a quitter."
                    },
                    {
                        "type": "paragraph",
                        "text": "Andy strums \"The Rainbow Connection\" on his banjo, while singing pig Latin in his \"sexy, high, falsetto voice\" in an attempt to woo Pam based on Jim's advice. She smiles politely and glances at Jim, who gives the camera his trademark smirk."
                    }
                ],
                "images": []
            },
            {
                "title": "Deleted scenes",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "In a talking head interview, Dwight lists the many skills of a mother.",
                                "elements": []
                            },
                            {
                                "text": "Dwight and Andy spar verbally in the kitchen.",
                                "elements": []
                            },
                            {
                                "text": "In a talking head interview, Pam describes the various doodles she does at work.",
                                "elements": []
                            },
                            {
                                "text": "Extension of the scene in which Jan reveals Martin as the ex-convict.",
                                "elements": []
                            },
                            {
                                "text": "In a talking head interview, Angela calls herself \"a dead woman.\"",
                                "elements": []
                            },
                            {
                                "text": "In a talking head interview, Pam explains that she has no problem with Martin, especially compared to Dwight.",
                                "elements": []
                            },
                            {
                                "text": "Karen plays with the baby and talks with Jim. Pam observes them warily.",
                                "elements": []
                            },
                            {
                                "text": "In a talking head interview, Pam tries to act pleased that Karen has become so popular so quickly.",
                                "elements": []
                            },
                            {
                                "text": "In a talking head interview, Karen believes that things are going well with Jim, and asks the documentary crew if Jim has said anything.",
                                "elements": []
                            },
                            {
                                "text": "Kelly plays with Hannah's baby and announces to Ryan she wants one \"this instant.\" In a talking head interview, Ryan is upset that Kelly forgets to take her birth control pills on purpose.",
                                "elements": []
                            },
                            {
                                "text": "In a tense conversation, Michael tells Dwight that the situation is very sensitive and Dwight insists he can be cool. In a talking head interview, Dwight explains that he was the cool one among his cousins.",
                                "elements": []
                            },
                            {
                                "text": "Martin joins the office for lunch. Kevin tries to make small talk; Dwight practices some karate moves. In talking head interviews, Martin, Creed, and Ryan talk about their criminal pasts.",
                                "elements": []
                            },
                            {
                                "text": "In a talking head interview, Stanley expresses his outrage that the criminal is the other black person in the office. \"What the hell was he thinking?\"",
                                "elements": []
                            },
                            {
                                "text": "Dwight suspects that Martin may be lying about why he was in jail and asks Michael for permission to see Martin's HR file. In a talking head interview, Dwight explains his belief that he would do well in prison.",
                                "elements": []
                            },
                            {
                                "text": "Angela and Dwight secretly try to determine the worst-case crime Martin could have been guilty of.",
                                "elements": []
                            },
                            {
                                "text": "Martin offers Meredith a ride to the tire shop so she can pick up her car. In a talking head interview, Dwight reads a pretend story of the events of the day beginning with \"There is a convicted probably-murderer\" and ending with \"Everybody died. The end.\" Under the guise of friendly conversation, Angela pointedly takes notes on Martin's license plate and car model. Martin begins to drive off but stops and opens the back door to his car. Dwight sheepishly emerges.",
                                "elements": []
                            },
                            {
                                "text": "Noting Meredith's empty desk, Dwight tries to trick Martin into making inconsistent statements.",
                                "elements": []
                            },
                            {
                                "text": "Andy tells Jim a \"little birdie\" told him that Jim needs a night out. He invites Jim to a strange night out, and Jim plays along. When Pam walks past, Jim congratulates her. She replies, \"Effay Offay.\"",
                                "elements": []
                            },
                            {
                                "text": "Phyllis plays with Hannah's baby, but when she uses baby talk, Hannah says, \"Don't patronize him.\"",
                                "elements": []
                            },
                            {
                                "text": "Dwight informs Michael that he believes Martin has murdered Meredith. Michael won't hear of it. In response to Angela's prodding about what he's going to do about Meredith, Dwight explains, \"She's on her own.\"",
                                "elements": []
                            },
                            {
                                "text": "In a talking head interview, Michael describes the power of speaking as a character. He created Prison Mike in improv class and his behavior with two people after the class led to him getting kicked out.",
                                "elements": []
                            },
                            {
                                "text": "Additional scenes of Michael as \"Prison Mike.\"",
                                "elements": []
                            },
                            {
                                "text": "While locked in the conference room, Pam admires Phyllis's engagement ring, and Jim and Karen play \"I Spy\".",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Prison Mike",
                "level": 2,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "In response to Martin's account of prison life, some of the employees playfully suggest that prison is better than Dunder Mifflin. Taking the remark personally, Michael summons the employees to a meeting in the conference room."
                    },
                    {
                        "type": "paragraph",
                        "text": "After a brief introduction, Michael's Prison Mike persona emerges. Wearing a purple bandana over his head, briefly exhibiting an eye deformity (presumably due to fighting), speaking in a caricature of New York English and adopting the role of a convict, he says he came because there had been \"a lot of fun talk about prison,\" but that he was there to scare everyone straight. Michael came up with the idea of Prison Mike in his improv class."
                    },
                    {
                        "type": "paragraph",
                        "text": "In his Prison Mike persona, Michael paints an awful, and somewhat fanciful, picture of prison life. He states that he learned about prison life from the internet and from prison itself, 50/50. Prison described by Michael in his \"Prison Mike\" persona involves such colorful elements as the dementors of Harry Potter, a diet of gruel—gruel sandwiches and gruel omelets—and chain gangs. Sex—with inmates or guards—is compulsory, there are no movies and you can't go home, \"recharge your batteries,\" and come back the next day to be with your friends, having fun in office. Michael is somewhat vague about Prison Mike's criminal background, except for a claim that he had stolen, robbed, and kidnapped the President's son for ransom, but \"never got caught\"."
                    }
                ],
                "images": []
            },
            {
                "title": "Trivia",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Meredith's absence for most of the episode and her appearance in the elevator are explained in a subplot from the deleted scenes.",
                                "elements": []
                            },
                            {
                                "text": "Kevin hints at being involved in insider trading.",
                                "elements": []
                            },
                            {
                                "text": "Prison Mike is one of the many characters that Michael creates, such as Michael Klump, Michael Scarn, and Michael Scotch.",
                                "elements": []
                            },
                            {
                                "text": "Toby suggests to Michael that he should let the other employees out of the conference room. This may be the only time where Michael actually listens to Toby's suggestion.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Cultural references",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Hannah dresses her boy in pink. In the United States, blue is the traditional color for boys; pink is the traditional color for girls.",
                                "elements": []
                            },
                            {
                                "text": "Look Who's Talking is a 1989 comedy movie whose gimmick was that the baby's thoughts were provided by an adult.",
                                "elements": []
                            },
                            {
                                "text": "The Work Opportunity Tax Credit (WOTC) is a federal program that provides tax credits to companies who hire certain categories of employees, among them ex-felons.",
                                "elements": []
                            },
                            {
                                "text": "In the United States, electronic funds transfer exists but is not pervasive. Many monetary transactions are still carried out by \"check\" (spelled \"cheque\" in British English), a document authorizing the recipient to receive a specific amount of money from the payer's bank.",
                                "elements": []
                            },
                            {
                                "text": "A person who is high-maintenance requires a lot of attention, is very demanding or particular, and is difficult to please.",
                                "elements": []
                            },
                            {
                                "text": "Frisbee is a brand of flying disc toy. Frisbee golf (or frolf) is a golf-like game played with a flying disc.",
                                "elements": []
                            },
                            {
                                "text": "Six Flags is a chain of amusement parks. The old guy is \"Mr. Six\", a character used in Six Flags commercials between 2004 and 2005. Andy hums the music from the commercials.",
                                "elements": []
                            },
                            {
                                "text": "Danny Glover is an actor. Jonas Salk developed the polio vaccine. Justin Timberlake is a pop singer. Colin Powell is a former general who also served as United States Secretary of State. Apollo Creed is a fictional character from the Rocky film series.",
                                "elements": []
                            },
                            {
                                "text": "Pama-lama-ding-dong is a pun on the song Rama-lama-ding-dong by The Edsels.",
                                "elements": []
                            },
                            {
                                "text": "Macanudo is a brand of cigar.",
                                "elements": []
                            },
                            {
                                "text": "Pig Latin is a children's toy language that changes the pronunciation of English words to make them sound as if they were Latin. To convert a word from English to Pig Latin, move the initial consonants to the end of the word and add \"ay\"; if the word begins with a vowel, add \"way\".",
                                "elements": [
                                    {
                                        "text": "\"Utway ooday ooyay inkthay, Ampay?\" =\"What do you think, Pam?\"",
                                        "elements": []
                                    },
                                    {
                                        "text": "\"Ainbowray Onnectionkay\" =\"Rainbow Connection\"",
                                        "elements": []
                                    },
                                    {
                                        "text": "\"Effay offay\" =\"F off\"",
                                        "elements": []
                                    }
                                ]
                            },
                            {
                                "text": "Michael tunes a fuzzy image of local television station WBRE, featuring meteorologist Josh Hodell as himself.",
                                "elements": []
                            },
                            {
                                "text": "Michael (as \"Prison Mike\") announces his intention \"to scare you straight\". Scared Straight! was a 1978 documentary about prison life directed at kids. Prison Mike is an absurd stereotype of a prisoner.",
                                "elements": []
                            },
                            {
                                "text": "Dementors are characters from the Harry Potter series of novels.",
                                "elements": []
                            },
                            {
                                "text": "The Rainbow Connection is a song performed by Kermit the Frog. Watch it here",
                                "elements": []
                            },
                            {
                                "text": "Martin takes Meredith to a tire store \"on Linden and Franklin\". McCarthy Tire and Automotive Center has a location on Linden St. between Franklin and Hallstead.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Cast",
                "level": 2,
                "content": [],
                "images": []
            },
            {
                "title": "Main cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Steve Carell as Michael Scott",
                                "elements": []
                            },
                            {
                                "text": "Rainn Wilson as Dwight Schrute",
                                "elements": []
                            },
                            {
                                "text": "John Krasinski as Jim Halpert",
                                "elements": []
                            },
                            {
                                "text": "Jenna Fischer as Pam Beesly",
                                "elements": []
                            },
                            {
                                "text": "B.J. Novak as Ryan Howard",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Supporting cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Melora Hardin as Jan Levenson",
                                "elements": []
                            },
                            {
                                "text": "Leslie David Baker as Stanley Hudson",
                                "elements": []
                            },
                            {
                                "text": "Brian Baumgartner as Kevin Malone",
                                "elements": []
                            },
                            {
                                "text": "Kate Flannery as Meredith Palmer",
                                "elements": []
                            },
                            {
                                "text": "Mindy Kaling as Kelly Kapoor",
                                "elements": []
                            },
                            {
                                "text": "Angela Kinsey as Angela Martin",
                                "elements": []
                            },
                            {
                                "text": "Paul Lieberstein as Toby Flenderson",
                                "elements": []
                            },
                            {
                                "text": "Phyllis Smith as Phyllis Lapin",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Recurring cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Ed Helms as Andy Bernard",
                                "elements": []
                            },
                            {
                                "text": "Rashida Jones as Karen Filippelli",
                                "elements": []
                            },
                            {
                                "text": "Creed Bratton (actor) as Creed Bratton",
                                "elements": []
                            },
                            {
                                "text": "Wayne Wilderson as Martin Nash",
                                "elements": []
                            },
                            {
                                "text": "Ursula Burton as Hannah Smoterich-Barr",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Guest cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Josh Hodell as himself",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            }
        ]
    },
    "quotesDetails": {
        "sections": [
            {
                "title": "The Convict Quotes",
                "level": 1,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Dwight: I am greatly concerned about having a convict in the office. And I do not care if that convict is white, black, Asian, German, or some kind of halfsy. I do not like criminals."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael: [puts on bandanna]. I'm prison Mike! You know why they call me prison Mike?!"
                    },
                    {
                        "type": "paragraph",
                        "text": "Angela: Do you really expect us to believe you're somebody else?"
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael: Do you really expect me to not push you up against the wall, beeyotch?! [employees protest] All right, hey, hey, hey, hey, that's just the way we talk in the clink. Been a lot of fun talk about prison today, but I am here to scare you straight. I AM HERE TO SCARE YOU STRAIIIGHT!! In prison you are somebody's bitch. Oh, and you. [points to Ryan] You, my friend, would be da belle of da ball. Don't drop the soap! Don't drop the soap!"
                    },
                    {
                        "type": "paragraph",
                        "text": "Ryan: Michael, please. [Michael makes kissing noises]"
                    },
                    {
                        "type": "paragraph",
                        "text": "Jim: Where... did you learn all of this?"
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael: Internet. "
                    },
                    {
                        "type": "paragraph",
                        "text": "Jim: So, not prison."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael: And prison. Eh, fifty-fifty, both. Look, prison stinks, is what I'm saying. It's not like you can go home, and, recharge your batteries, and come back in the morning and, be with your friends, having fun in the office. "
                    },
                    {
                        "type": "paragraph",
                        "text": "Jim: What'd you do, Prison Mike?"
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael: I stole. ... And I robbed. And I kidnapped... the... president's son. And held him for ransom."
                    },
                    {
                        "type": "paragraph",
                        "text": "Jim: That is... quite the rap sheet, Prison Mike."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael: And I nevah got caught, neither."
                    },
                    {
                        "type": "paragraph",
                        "text": "Jim: Well, you're... in... prison, but, mmhmm."
                    },
                    {
                        "type": "paragraph",
                        "text": "Pam: Prison Mike? What was the food like in prison?"
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael: Gruel. Sandwiches. Gruel omelettes. Nothing but gruel. Plus, you can eat your own hair."
                    },
                    {
                        "type": "paragraph",
                        "text": "Andy: Wow. Prison sounds horrible."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael: Yeah. Yeah. Well, thank you, Andy. Tanks."
                    },
                    {
                        "type": "paragraph",
                        "text": "Dwight: Prison Mike. What's the very very worst thing about prison?"
                    },
                    {
                        "type": "paragraph",
                        "text": "Angela: Don't encourage him, Dwight. "
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael: The worst thing about prison was the... was the Dementors. They... were flying all over the place, and they were scary. And they'd come down, and they'd suck the soul out of your body, and it hurt!"
                    }
                ],
                "images": []
            }
        ]
    },
    "coldOpens": [
        "Michael imitates the baby from Look Who's Talking when Hannah Smoterich-Barr brings in her baby boy who is mistaken for a girl because of bizarre and nonsensical gender roles. She confirms his favorite color is pink. "
    ],
    "storylines": [
        "Hannah brings her infant son to work where his all-pink ensemble evokes gender confusion. The baby is met with ambivalence from Stanley. Creed attempts to play a paperclip-based game against Karen's admonishment. Michael can't help himself, and crawls under a nearby desk to act as the voice of the child riffing on lines from the Look Who's Talking film series.",
        "Angela, Kevin, Michael and Pam teleconference Jan to determine the source of a rebate check the office received. Jan informs the group the check stems from a federal reformed convict employment program, a \"smart move\" by Josh, former manager of Dunder Mifflin Stamford. She e-mails human resources and quickly determines the employee hired through the program is one Martin.",
        "Michael proposes the quartet forget the news they've received to avoid creating a rift among employees. All agree, although Michael misreads a sarcastic Angela who says she supports protecting a criminal, especially as a \"90 lb. female who sits in a poorly-lit, rarely-visited corner of the office\".",
        "Meanwhile, Andy dials Jim's extension and whispers \"I'm horny\". Jim is flabbergasted but soon realizes Andy wants a rundown on his attractive female coworkers and asks for a debriefing on Kelly, Angela and Pam. Jim encourages Andy to pursue Pam and as a prank, coaches him on her favorite things. In actuality, his tips are things that Pam hates: frisbee-based competitions, hunting, pig Latin, and the Six Flags television commercial \"with the old guy\".",
        "Dwight assures Michael he is of a collected, cool mindset to hear a piece of news, but when told of Martin's criminal past attempts to take off in a dead sprint. In an interview he says he simply doesn't like criminals. Michael himself announces Martin's \"problems with Johnny Law\" to everyone, and says that for every trusted white man, he can name a black man he trusts more. He then asks employees to call out names of white men. He tops Pam's father with \"Danny Glover\", but is unfamiliar with Jim's suggestion of \"Jonas Salk\"; Jim quickly substitutes Justin Timberlake, which garners \"Colin Powell\". Karen suggests \"Jesus\", to which the boss replies \"Apollo Creed\" to which Stanley simply rolls his eyes in casual disbelief.",
        "In the breakroom over lunch, Martin tells the others he was incarcerated for insider trading, and although it was routine and could be dull, he enjoyed certain perks of prison, including outside time and art classes. Ryan is told about prison business classes taught by Harvard Business School guys. Pam comments that prison sounds better than their current work situation and Kevin wonders why the branch doesn't receive daily outdoors time.",
        "Soon, Michael announces an hour outdoors time will take place in the parking lot. Nearly everyone heads outside to bitter cold temperatures. Michael offers a weightlifting session with a 2.5 lb. dumbbell he produces from the trunk of his Sebring, but a freezing Stanley leads a charge back into the warmth of the office.",
        "Michael soon calls an impromptu meeting in which he dons a do-rag and attempts to \"scare you straight\" as an ex-con character named \"Prison Mike\". He speaks with a New York accent, calls Angela a bee-yoch, threatens to shove her up against a wall (and incites Dwight to politely come to her defense with the rest of the staff), says life \"in the clink\" is no picnic, alludes to violence and rape and singles out Ryan because, in prison, he would be \"da belle of da ball\", who responds \"Michael, please\" in total discomfort.",
        "Jim asks Prison Mike where he learned such information and he claims it's a mix of the Internet and prison. Jim asks his crime and Angela is peeved when Dwight asks Prison Mike the worst thing about prison, which he responds by claiming there were Dementors. Andy plays along, and says prison sounds awful. Prison Mike concludes his speech, saying \"You got a good life.\" Martin comments that Michael's performance did not remind him of his time in prison. A frustrated Michael locks everyone in the conference room, who become concerned and begin moving around for an exit. Hannah, still at her desk with the pink-clothed child, ignores Kevin's pleas for assistance.",
        "Pam phones Toby who tells Michael the staff is fully aware a workplace is better than prison and are simply teasing him. A relieved Michael releases his prisoners, including Stanley who never stopped working on his crossword puzzle through the entire incarceration.",
        "Martin cleans out his desk and quits Dunder Mifflin. In his office, Michael remarks to the camera that he thinks Martin is a quitter.",
        "Andy strums \"The Rainbow Connection\" on his banjo, while singing pig Latin in his \"sexy, high, falsetto voice\" in an attempt to woo Pam based on Jim's advice. She smiles politely and glances at Jim, who gives the camera his trademark smirk."
    ],
    "quotes": [
        "Dwight: I am greatly concerned about having a convict in the office. And I do not care if that convict is white, black, Asian, German, or some kind of halfsy. I do not like criminals.",
        "Michael: [puts on bandanna]. I'm prison Mike! You know why they call me prison Mike?!",
        "Angela: Do you really expect us to believe you're somebody else?",
        "Michael: Do you really expect me to not push you up against the wall, beeyotch?! [employees protest] All right, hey, hey, hey, hey, that's just the way we talk in the clink. Been a lot of fun talk about prison today, but I am here to scare you straight. I AM HERE TO SCARE YOU STRAIIIGHT!! In prison you are somebody's bitch. Oh, and you. [points to Ryan] You, my friend, would be da belle of da ball. Don't drop the soap! Don't drop the soap!",
        "Ryan: Michael, please. [Michael makes kissing noises]",
        "Jim: Where... did you learn all of this?",
        "Michael: Internet. ",
        "Jim: So, not prison.",
        "Michael: And prison. Eh, fifty-fifty, both. Look, prison stinks, is what I'm saying. It's not like you can go home, and, recharge your batteries, and come back in the morning and, be with your friends, having fun in the office. ",
        "Jim: What'd you do, Prison Mike?",
        "Michael: I stole. ... And I robbed. And I kidnapped... the... president's son. And held him for ransom.",
        "Jim: That is... quite the rap sheet, Prison Mike.",
        "Michael: And I nevah got caught, neither.",
        "Jim: Well, you're... in... prison, but, mmhmm.",
        "Pam: Prison Mike? What was the food like in prison?",
        "Michael: Gruel. Sandwiches. Gruel omelettes. Nothing but gruel. Plus, you can eat your own hair.",
        "Andy: Wow. Prison sounds horrible.",
        "Michael: Yeah. Yeah. Well, thank you, Andy. Tanks.",
        "Dwight: Prison Mike. What's the very very worst thing about prison?",
        "Angela: Don't encourage him, Dwight. ",
        "Michael: The worst thing about prison was the... was the Dementors. They... were flying all over the place, and they were scary. And they'd come down, and they'd suck the soul out of your body, and it hurt!"
    ]
}