{
    "season": 4,
    "title": "Branch Wars",
    "episode": "10",
    "episodes": [
        10
    ],
    "coldOpens": [
        "Stanley tells Michael he is going to Utica to work with Karen (who claimed in a talking head that, without an incompetent boss and a boyfriend in love with another woman, Regional Manager was a \"pretty easy job\"). "
    ],
    "storylines": [
        "Karen, now Regional Manager at the Dunder-Mifflin branch in Utica, New York, offers a higher-paying job to Stanley, if he leaves Scranton. Stanley takes the offer and bluntly informs Michael. Michael believes that Karen is doing this to get back at Jim for \"dumping\" her.",
        "Meanwhile, Pam, Oscar, and Toby have created a \"Finer Things Club\", where they discuss literature, music, and the arts. Membership in the club is \"exclusive\", though they are still bothered by the activity of the other workers in the office. Jim wants to join but Toby and Oscar feel he dominates the conversation by trying to be funny, thus diverting the conversation away from the \"finer things\". Andy wants to join because it's the office's most exclusive club (the party planning committee, headed by Angela, is his backup and Kevin's band Scrantonicity II is his safety), but all three members shoot him down.",
        "Michael and Dwight invite Jim on a \"sales call\", which is a trick to get him to go to Utica to help get back at Karen. Jim is shocked by the deception but agrees to go along in order to prevent Michael and Dwight from doing anything foolish, including using Dwight's Molotov cocktails.  When Karen discovers the Scranton crew trying to steal her copier, she chastises them in her office. Before they leave, she pulls Jim aside and attempts to have a civil conversation with him. She is under the impression that this prank was constructed so Jim could have an opportunity to see her.  Jim awkwardly tells her that he didn't want to see her, trying not to hurt her feelings further, but does not succeed; he lets slip that he and Pam are finally dating and very happy. Karen reacts to the news with anger and he leaves.",
        "After Michael returns to Scranton, he tearfully says farewell to Stanley. Stanley then states his intentions to stay in Scranton, revealing to the camera that his threat of leaving was a bluff to get a raise.",
        "Pam attempts to cheer up Jim by giving him a place in the \"Finer Things Club\" as Andy still longs to be in it. The episode ends with Jim and the rest of the club wearing traditional Irish caps (Pam is wearing a scarf around her head). They are trying to discuss Angela's Ashes but Jim is being disruptive by speaking candidly with an Irish brogue. He gets it out of his system and then says he found the book to be a \"fun read\". Oscar and Toby are unamused, considering the book is a tragic memoir, and do not believe Jim actually read the book. Jim only proves them right by saying that the main character in the memoir is 'ashes'."
    ],
    "quotes": [
        [
            {
                "speaker": "Karen",
                "content": " I am the Regional Manager of the Dunder-Mifflin Utica brach. Turns out it's a pretty easy gig when your boss isn't an idiot and your boyfriend's not in love with somebody else."
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " You cannot take the hilarious black guy from the office. Stanley is part of what makes this branch so extraordinary. The bluesy wisdom, the sassy remarks, the crossword puzzles, the smile, those big watery red eyes. I don't know how George Bush did it when Colin Powell left, and if Utica thinks that they are going to poach Stanley, they have another thing coming."
            }
        ],
        [
            {
                "speaker": "Oscar",
                "content": " Besides having sex with men, I would say that the Finer Things Club is the gayest thing about me."
            }
        ],
        [
            {
                "speaker": "Karen",
                "content": " I cried for weeks over that guy, so yeah...seeing him climb out a PT Cruiser in a ladies' warehouse uniform...felt pretty good!"
            }
        ],
        [
            {
                "speaker": "Stanley",
                "content": " I wasn't really planning on leaving - all I wanted was a raise. How on Earth did Michael call my bluff? Is he some sort of secret genius?...Sometimes I say crazy things..."
            }
        ]
    ]
}