{
    "season": 4,
    "title": "Goodbye, Toby",
    "episode": "18/19",
    "episodes": [
        18,
        19
    ],
    "episodeDetails": {
        "sections": [
            {
                "title": "Goodbye, Toby",
                "level": 1,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "\"Goodbye, Toby\" is the eighteenth/nineteenth episode of the fourth season of The Office and is the 71st/72nd episode overall. It was written by Jennifer Celotta & Paul Lieberstein and directed by Paul Feig. It first aired May 15, 2008. It was viewed by 8.07 million people."
                    }
                ],
                "images": []
            },
            {
                "title": "Synopsis",
                "level": 2,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "The episode starts with one of Jim's pranks: he links Dwight's cell phone to his own bluetooth headset. He also forwards Dwight's office phone to his own office phone. During the prank he pretends to steal a client from Dwight, a throwback to Dwight's stealing a client from him in Diversity Day."
                    },
                    {
                        "type": "paragraph",
                        "text": "Dunder Mifflin Scranton is planning a going-away party for Toby before he leaves for Costa Rica. Michael is determined to make the party match the joy in his heart at Toby leaving, but when Angela balks at his unreasonable demands, such as an anti-gravity machine, Phyllis accepts the duty of planning the party. She does fantastically, ordering carnival rides to the parking lot and hiring Darryl's band, much to Angela's chagrin."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael's hatred of Toby seems to have been transferred to the new HR representative, Holly, and he and Dwight plan to haze her. When she shows disdain for Toby, though, Michael suddenly thinks he is falling in love with her. Jim advises him to fight his over-aggressive instincts and play it slow, recounting his story on how he fell in love with Pam. Michael succeeds in warming up to Holly with less-obnoxious small talk and jokes. Michael even tempers Toby's exit interview, which he originally planned to be brutal and insulting, when Holly attends. When Michael's cruel going-away present (a rock with the words \"Suck On This\") is revealed, Pam cons Michael into giving Toby his sports watch. Dwight continues the hazing, telling Holly that Kevin is mentally challenged and putting a raccoon in her car. When Michael chastises him in front of everyone, Holly is even more receptive. Meanwhile, Kevin misinterprets Holly's praise of his ability to perform mundane tasks that would be difficult for a mentally challenged individual as romantic interest."
                    },
                    {
                        "type": "paragraph",
                        "text": "Pam is accepted to study graphic design at Pratt Institute, for which she will have to go to New York City for three months. A supportive Jim assures her that, while the separation will not be fun, it is still a great opportunity. Meanwhile, when Jim calls Ryan about his huge sale in Job Fair, Ryan instructs him to enter the sale on the company's website before abruptly hanging up. Jim leaves Ryan a voicemail proclaiming that he will fight for his position at Dunder Mifflin, despite Ryan's attempts to push him out. Shortly afterwards, the staff finds a video on YouTube of Ryan being arrested for fraud (though while describing what he'd done in a talking head, Oscar jokes that Ryan's attempt at a beard was his \"real\" crime). Michael is greatly concerned for his \"friend\" Ryan, but Jim takes pleasure in the video and leaves Ryan a second voicemail telling him to disregard the last message \"since [his] hands are tied.\""
                    },
                    {
                        "type": "paragraph",
                        "text": "Jim also contributes to the party-planning fund in order to buy fireworks. He claims it is to give Toby a proper send-off, but later reveals that he has decided to propose to Pam after recounting his story to Michael. Pam notices the purchase and guesses his intentions in an interview; however, at the party, just before Jim can pop the question, Andy ruins the moment by proposing to Angela (who responds with a halfhearted \"Okay\"). Dwight is crushed but says, \"It's my own fault.\" Jim puts the ring back in his pocket. In a later interview, Pam is visibly disappointed, thinking she had guessed wrong. Toby gets the pictures he wanted of him and Pam together and leaves the office forever, but Michael gets in a final shot when he has Hank, the security guard escort Toby from the building."
                    },
                    {
                        "type": "paragraph",
                        "text": "Kevin runs into Jan at the grocery store and calls Michael to come talk to her. Michael discovers that Jan has artificially inseminated herself from a sperm bank and wants him to be involved in the pregnancy. He initially is indecisive, but eventually calls and agrees to attend lamaze class with her in Allentown."
                    },
                    {
                        "type": "paragraph",
                        "text": "Right at the end of the episode, Phyllis returns to the office, with the camera crew and compares party planning to a runner's high, evidently pleased at the success of her party, but on her way in, she hears moaning and walks in on Angela and Dwight having sex on one of the desks, which is also recorded by the camera crew accompanying Phyllis."
                    }
                ],
                "images": []
            },
            {
                "title": "Deleted scenes",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Michael attempts to embarrass Toby by making him come up and give a speech, however the group laughs at all his jokes, and it is quite heartfelt. Quite amusingly, he mentions going out for beers every Tuesday with the office (much to Michael’s shock and discomfort).",
                                "elements": []
                            },
                            {
                                "text": "Toby introduces Holly to Pam and Jim. Holly reveals that Toby said many good things about Pam but that the only positive thing Toby said about Jim was that he's \"a good salesman\". This comment hints at Toby's disdain of Jim for dating Pam.",
                                "elements": [
                                    {
                                        "text": "Following the above revelation, in a talking head interview, Jim remarks that he and Toby are friends, but they are unlikely to stay in touch after Toby leaves. \"I'll probably get updates on him from Pam.\"",
                                        "elements": []
                                    }
                                ]
                            },
                            {
                                "text": "Holly introduces herself to Meredith and learns that they live near each other. The two exchange pleasant chit-chat. In a talking head interview, Meredith says, \"I hate that bitch. I want to cut her face.\" Dwight takes notice.",
                                "elements": []
                            },
                            {
                                "text": "Dwight opens a \"secret\" conversation with Meredith in the kitchen by instructing her to make a sandwich. \"Make your own — sandwich.\" The sandwich is a cover for their clandestine conversation in which Dwight proposes hazing the new HR representative. He also becomes increasingly frustrated with Meredith's sandwich-making skills.",
                                "elements": []
                            },
                            {
                                "text": "Phyllis becomes increasingly frustrated by her difficulties in planning the party. Jim drops in and asks her how she's doing. She replies, \"Jim, I'm so f—d.\"",
                                "elements": []
                            },
                            {
                                "text": "In a talking head interview, Phyllis remarks that her mother told her she could be anything. \"A teacher's aid, nurse's assistant, some kind of volunteer. But now, I'm not so sure.\"",
                                "elements": []
                            },
                            {
                                "text": "Bob Vance gives Phyllis extra money to enable her to purchase everything she wanted for the party.",
                                "elements": []
                            },
                            {
                                "text": "In a talking head interview, Toby shows a postcard of a beach in Costa Rica which he has been carrying around for years. Whenever he gets stressed out, he looks at it. When he learned that condominiums were being built, he bought one. \"Right where those trees are.\"",
                                "elements": []
                            },
                            {
                                "text": "Toby returns to work with an expensive camera he just bought and talks with Jim and Pam at reception. He asks, \"Mind if I get a picture?\" and Jim and Pam pose for a photo together. Disappointed, Toby takes the picture and retreats to the annex, barely audibly muttering, \"Waste of money...\"",
                                "elements": []
                            },
                            {
                                "text": "Jim tries to log his sales into the website but the site is down. It was also down yesterday. Dwight suspects that the website is busy conspiring with other websites.",
                                "elements": []
                            },
                            {
                                "text": "Troy stops by the office to talk to Michael. He's cagey about why he came to Scranton instead of Ryan, saying that he now reports directly to David Wallace. After the YouTube video is discovered, Dwight asks him if he knows anything about the arrest. He merely says, \"Maybe I do.\"",
                                "elements": []
                            },
                            {
                                "text": "Oscar and Stanley share an appreciation for corn dogs.",
                                "elements": []
                            },
                            {
                                "text": "Angela tells Andy to announce that the party is a disaster. Andy thinks the party is going well, but he'll go along with her. He ostentatiously tries a fried Twinkie (so he can announce how bad it tastes) but is overcome by how good it is.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Trivia",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "During Toby's exit interview, the reason why Michael threatens to kill Toby is because he finally has an opportunity to reveal Michael's unethical work behavior and abusive treatment. He also does not want Holly to find out how awful he is to him and even tries to frame Dwight and Jim for giving Toby a rock as going away gift. Toby, however, shrugs to the camera that he has made it long enough without disclosing Michael's behavior and that it is pointless to do so. Toby still gets revenge after he exposes Michael's insulting farewell gift and Pam makes him give up his watch to Toby.",
                                "elements": []
                            },
                            {
                                "text": "Writer Paul Lieberstein provided the lyrics to \"Beers in Heaven\" and \"Total Eclipse of the Fart\" in an online chat following the episode's premiere.",
                                "elements": []
                            },
                            {
                                "text": "Phyllis is assigned to plan Toby's going-away party, despite only speaking to him once on camera (Sexual Harassment).",
                                "elements": []
                            },
                            {
                                "text": "Paul Lieberstein wrote this episode, thus writing off his own character.",
                                "elements": []
                            },
                            {
                                "text": "The role of Holly Flax was written with Amy Ryan in mind. The writing staff are fans of the television program The Wire, on which she appeared.",
                                "elements": []
                            },
                            {
                                "text": "A Scranton/Wilkes-Barre Yankees sticker can be seen on the vending machine when Pam tells Jim that she's been accepted to Pratt Institute",
                                "elements": []
                            },
                            {
                                "text": "Michael mentions that he's worked for Toby for 12 years, meaning he's been there at least 1 year after Michael first started at the office.",
                                "elements": []
                            },
                            {
                                "text": "Phyllis' discovery of Dwight and Angela's intimate relationship makes her the fourth person to be made aware of it, after Pam, Jim and Ryan.",
                                "elements": []
                            },
                            {
                                "text": "When Jim answers Dwight's call on his phone, he makes it sound as though he is talking to Dwight's mother, although she is deceased (Fun Run).",
                                "elements": []
                            },
                            {
                                "text": "Michael mentions using Propecia, which explains his new, thicker hair at the start of the second season.",
                                "elements": []
                            },
                            {
                                "text": "Although Toby moves to Costa Rica, he returns in Frame Toby .",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Amusing details",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "In a deleted scene, it’s revealed the entire office likes to go out for beers on Tuesday without Michael (which he was unaware of) despite the fact that Michael has tried to hang out with them several times.",
                                "elements": []
                            },
                            {
                                "text": "In the cold open, Jim forwards calls from Dwight's cell phone to his earpiece. When Jim receives Dwight's cell phone call, he appears to be selling paper to Dwight's client, however a client seeking to buy paper would call Dwight's work phone, not his cell phone.",
                                "elements": []
                            },
                            {
                                "text": "At the beginning of the episode, Michael is dancing around the empty office. He says, \"Today is Toby Flenderson's last day. I couldn't sleep last night. I came in extra early. So much energy. There are certain days that you know you will remember for the rest of your life. And I just have a feeling that today is one of those days.\" Not only is it Toby's last day at Dunder Mifflin; it is also the day Michael meets Holly.",
                                "elements": []
                            },
                            {
                                "text": "When Toby is leaving and has Michael's watch, it starts going off. This is because in the beginning of the episode, Michael sets a watch alarm so he can celebrate the exact moment he leaves for good.",
                                "elements": []
                            },
                            {
                                "text": "Michael says, \"Holly is the best thing that has ever happened to Dunder Mifflin since World War II! Fifty years!\" This is likely referring to when Dunder Mifflin was a supplier of metal brackets in WWII. However, World War II was much longer ago than fifty years.",
                                "elements": []
                            },
                            {
                                "text": "Michael suggests that Jan made him wear two condoms for extra precaution. This actually is unsafe and increases the chance of it breaking.",
                                "elements": []
                            },
                            {
                                "text": "Angela has a beer in front of her at the party, even though in past episodes she mentions abstaining from alcohol. In Ben Franklin, she spits out her champagne when she realizes that it isn't the sparkling cider she thought it was.",
                                "elements": []
                            },
                            {
                                "text": "Not only is Holly's first name that of a plant, so is her last name Flax. However, it should be noted that \"Holly\" is actually short for \"Hollis\", as shown by her nameplate in later episodes.",
                                "elements": []
                            },
                            {
                                "text": "Michael plays \"Crash into Me\" on his computer while trying to build a mix CD for Holly. This song is doubly inappropriate: Not only does Michael consider a song with \"crash\" in the title for Holly to listen to in her car, but the song itself is about a Peeping Tom.",
                                "elements": []
                            },
                            {
                                "text": "Michael buys \"Crash into Me\" from Amazon. In A Benihana Christmas, he sampled the song \"Goodbye My Lover\" from iTunes. Between the third and fourth seasons, NBC stopped distributing its episodes over iTunes in favor of Amazon Unbox.",
                                "elements": []
                            },
                            {
                                "text": "During Pam's talking head where she guesses that Jim may propose, reflected in the window is Kevin playing in the bouncy house.",
                                "elements": []
                            },
                            {
                                "text": "Holly drives a convertible, the same impractical car that Michael drove for the first three seasons.",
                                "elements": []
                            },
                            {
                                "text": "Michael's ring tone is a standard ringing sound rather than \"My Humps\", his usual ring tone. Presumably he changed it so as not to offend Holly.",
                                "elements": []
                            },
                            {
                                "text": "When Toby returns with a camera to take a picture with Pam, it's not a cheap disposable camera but an expensive dSLR camera which was an Canon Rebel XTi. This makes sense with the theory that he went out to buy the cheapest good camera (Probably to use in Costa Rica also), and at the time this was recorded, the XTi was the cheapest Canon dSLR equipped with an EF 18-55mm f/3.5-5.6 IS which is the lens that comes with the camera (If bought in a kit)",
                                "elements": []
                            },
                            {
                                "text": "The characters drink WPop at the goodbye party. WPop is the generic soda of Wegmans, a popular Rochester, New York based supermarket with many regional stores, including three around the Scranton area.",
                                "elements": []
                            },
                            {
                                "text": "During Dwight and Angela's intimate scene at the end of the episode, Angela Kinsey (Angela) is currently pregnant. She later complained in an interview that Rainn Wilson (Dwight) had eaten a tuna sandwich before the scene and because she was pregnant and extra sensitive to smell she had a hard time kissing him.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Connections to other episodes",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Michael has once again forgotten that Jim and Pam are still dating. He previously did that in Night Out, when he thought Jim was single.",
                                "elements": []
                            },
                            {
                                "text": "Michael calls Hank \"security guard\" when he is taking Toby out, referencing a previous episode, Night Out, when nobody can recall Hank's name except Creed.",
                                "elements": []
                            },
                            {
                                "text": "This is the second time Dwight destroys his cell phone because of Jim's pranks. The first time was in A Benihana Christmas, in which Jim and Pam convinced Dwight the CIA accepted him for a mission and then ordered him to destroy his phone.",
                                "elements": []
                            },
                            {
                                "text": "Kevin keeps his M&Ms hidden so other people won't take them. In The Merger, Kevin shows Jim his secret M&M hiding place. Kevin's preference for M&Ms also appeared in Office Olympics.",
                                "elements": []
                            },
                            {
                                "text": "This is the second time Michael makes a Yoda impression. The first time was in The Fire.",
                                "elements": []
                            },
                            {
                                "text": "As Holly enters the conference room to sit in on Toby's exit interview, Michael asks her if she has seen the baler, introduced in Safety Training.",
                                "elements": []
                            },
                            {
                                "text": "Holly's final talking head interview begins with \"It was a good day.\" This phrase has been used by Jim (Diversity Day) and Pam (Michael's Birthday) in talking head interviews at the end of days that were personally meaningful to them.",
                                "elements": []
                            },
                            {
                                "text": "Dwight and Angela's intimate scene after Angela has become engaged to Andy mirrors the earlier intimate scene between Jim and Pam after Pam became engaged to Roy. This reflection has Pam and Jim's foils on the show taking their places.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Goofs",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Jim appears to talk on the phone with Dwight's mother. Dwight's mother is no longer alive; she is buried at the east field of Schrute Farms (Fun Run). Jim may have been faking the call, however.",
                                "elements": []
                            },
                            {
                                "text": "Pam has used the word \"perfect\" before: In The Fight, she describes the situation as \"The Perfect Storm\". Although in this episode, she uses it in context.",
                                "elements": []
                            },
                            {
                                "text": "As Michael and Hank arrive to escort Toby, at first there is nothing on the wall of his cubicle behind him, but after he's shown a second time the wall has papers tacked to it.",
                                "elements": []
                            },
                            {
                                "text": "Michael's watch alarm goes off just as Toby leaves, even though Toby reset the watch to Costa Rica time, a two-hour difference during the summer months. However, this could be explained if Michael had set the alarm for 5 P.M. to mark the end of Toby's last day, as the alarm could be going off at 7 P.M. Scranton time.",
                                "elements": []
                            },
                            {
                                "text": "In the deleted scene with Andy and the fried Twinkie, the people in the background change. Initially, it's Calvin and Hidetoshi. Later in the scene, Hide has been replaced with Kelly.",
                                "elements": []
                            },
                            {
                                "text": "Although Jim claims that his and Pam's first kiss occurred \"right outside\" the office, their technical first kiss captured on film took place at a Chili's restaurant during The Dundies when Pam drunkenly kisses him after winning her Dundie. However, their first kiss in the context of a romantic relationship occurs in the office, as the kiss at the Dundies could be a friendly kiss between friends due to Pam's drunkenness.",
                                "elements": []
                            },
                            {
                                "text": "At the intro to his marriage proposal, Andy introduces his parents who are inexplicably at Toby's going away party. He introduces his father as Andrew Bernard but we learn later in the series that his father's name is Walter; that Walter Bernard Jr. was Andy's given name for six years. When Andy's younger brother was born they felt he \"better exemplified the Walter Jr. name\" and gave it to him. His parents then picked Andrew out of a baby name book and changed his name.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Cultural references",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Jim refers to Dwight's Mutter and Vater, German for mother and father, a nod to the Schrute family's German heritage.",
                                "elements": []
                            },
                            {
                                "text": "Michael wants an anti-gravity machine he saw in a movie. \"You drink a potion, and then you just start floating all around.\" The children's movie Willy Wonka & the Chocolate Factory contains a scene in which two characters drink a \"Fizzy Lifting Drink\" and begin floating around the room.",
                                "elements": []
                            },
                            {
                                "text": "Selling someone a fake elevator pass is a standard hazing prank.",
                                "elements": []
                            },
                            {
                                "text": "Michael mentions the movie E.T. the Extra-Terrestrial, a science fiction movie from the 1980s featuring a friendly alien visitor trapped on earth.",
                                "elements": []
                            },
                            {
                                "text": "Creed is trying to remember his job title, \"Quality assurance\".",
                                "elements": []
                            },
                            {
                                "text": "Michael mentions hanging holly from the ceiling and kissing beneath it. Holly is a traditional Christmas decoration, but it is mistletoe under which one traditionally kisses.",
                                "elements": []
                            },
                            {
                                "text": "Michael asks Holly if she is a Holly-gram, a pun on hologram.",
                                "elements": []
                            },
                            {
                                "text": "Michael thinks the musical group U2 is from Scranton. They are from Ireland.",
                                "elements": []
                            },
                            {
                                "text": "Michael tells Jim that he's creating a CD mixtape. A mixtape is cassette tape (hence the name) or other audio medium containing a series of songs, carefully selected to reflect a particular sentiment. They are typically used as expressions of affection among younger people.",
                                "elements": []
                            },
                            {
                                "text": "Michael and Holly do impressions of Yoda and Master Thespian. Holly quietly identifies the actor as John Lovitz.",
                                "elements": []
                            },
                            {
                                "text": "Michael tells Jim that he's laying a base, a confused reference to the adolescent baseball metaphors for sex.",
                                "elements": []
                            },
                            {
                                "text": "Cruisin' for a bruisin' is a slang description for someone who is behaving in a manner that will lead to physical retaliation. Captain Bruisin' is a term Michael just made up.",
                                "elements": []
                            },
                            {
                                "text": "Michael mentions parody lyrics for \"Beers in Heaven\" (\"Tears in Heaven\") and \"Total Eclipse of the Fart\" (\"Total Eclipse of the Heart\").",
                                "elements": []
                            },
                            {
                                "text": "Kevin goes to Gerrity's, a Scranton-based supermarket chain.",
                                "elements": []
                            },
                            {
                                "text": "Michael mentions the drugs Propecia (a hair growth drug) and Accutane (an acne medication), exposure to both of which can cause birth defects.",
                                "elements": []
                            },
                            {
                                "text": "Michael mentions that the whole toilet seat thing is a myth, referring to a teen legend that one can get pregnant from sitting on a toilet seat.",
                                "elements": []
                            },
                            {
                                "text": "IHOP is a national chain of breakfast restaurants, specializing in pancakes.",
                                "elements": []
                            },
                            {
                                "text": "Allentown is a large city in Pennsylvania, approximately 70 miles from Scranton.",
                                "elements": []
                            },
                            {
                                "text": "The Glider Diner is a Scranton restaurant open 24 hours a day. It serves burgers and sandwiches.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Cast",
                "level": 2,
                "content": [],
                "images": []
            },
            {
                "title": "Main Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Steve Carell as Michael Scott",
                                "elements": []
                            },
                            {
                                "text": "Rainn Wilson as Dwight Schrute",
                                "elements": []
                            },
                            {
                                "text": "John Krasinski as Jim Halpert",
                                "elements": []
                            },
                            {
                                "text": "Jenna Fischer as Pam Beesly",
                                "elements": []
                            },
                            {
                                "text": "B.J. Novak as Ryan Howard",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Supporting Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Melora Hardin as Jan Levinson",
                                "elements": []
                            },
                            {
                                "text": "Ed Helms as Andy Bernard",
                                "elements": []
                            },
                            {
                                "text": "Leslie David Baker as Stanley Hudson",
                                "elements": []
                            },
                            {
                                "text": "Brian Baumgartner as Kevin Malone",
                                "elements": []
                            },
                            {
                                "text": "Creed Bratton (actor) as Creed Bratton",
                                "elements": []
                            },
                            {
                                "text": "Kate Flannery as Meredith Palmer",
                                "elements": []
                            },
                            {
                                "text": "Mindy Kaling as Kelly Kapoor",
                                "elements": []
                            },
                            {
                                "text": "Angela Kinsey as Angela Martin",
                                "elements": []
                            },
                            {
                                "text": "Paul Lieberstein as Toby Flenderson",
                                "elements": []
                            },
                            {
                                "text": "Oscar Nunez as Oscar Martinez",
                                "elements": []
                            },
                            {
                                "text": "Craig Robinson as Darryl Philbin",
                                "elements": []
                            },
                            {
                                "text": "Phyllis Smith as Phyllis Vance",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Recurring Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Amy Ryan as Holly Flax",
                                "elements": []
                            },
                            {
                                "text": "Bobby Ray Shafer as Bob Vance",
                                "elements": []
                            },
                            {
                                "text": "Hugh Dane as Hank Tate",
                                "elements": []
                            },
                            {
                                "text": "Michael Schur as Mose Schrute",
                                "elements": []
                            },
                            {
                                "text": "Noel Petok as Troy Undercook (deleted scenes)",
                                "elements": []
                            },
                            {
                                "text": "Lee Eisenberg as Gino",
                                "elements": []
                            },
                            {
                                "text": "Gene Stupnitsky as Leo",
                                "elements": []
                            },
                            {
                                "text": "Calvin Tenner as Calvin (Uncredited)",
                                "elements": []
                            },
                            {
                                "text": "Hidetoshi Imura as Hidetoshi Hasagawa (Uncredited)",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Guest Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Chris Rob as Bass Player in Darryl's band (uncredited)",
                                "elements": []
                            },
                            {
                                "text": "Asa Watkins as Drummer in Darryl's band (uncredited)",
                                "elements": []
                            },
                            {
                                "text": "David Sampson as Guitar Player in Darryl's band (uncredited)",
                                "elements": []
                            },
                            {
                                "text": "Ace ??? as Andrew Bernard (uncredited)",
                                "elements": []
                            },
                            {
                                "text": "Robin ??? as Ellen Bernard (uncredited)",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "References",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "↑ Was Holly written with Amy Ryan in mind?, The Office: Live Blog with Paul Lieberstein.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            }
        ]
    },
    "quotesDetails": {
        "sections": [
            {
                "title": "Goodbye, Toby Quotes",
                "level": 1,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Creed: What is wrong with this woman? She's asking about stuff that's nobody's business. \"What do I do?\"... Really, what do I do here? I should've written it down. \"Qua\" something, uh... qua... quar... quibo, qual...quir-quabity. Quabity assuance! No. No, no, no, no, but I'm getting close."
                    },
                    {
                        "type": "paragraph",
                        "text": "Jim: Hey, Ryan, it's Jim. Look, man, I don't know what's gotten into you lately, but you know what? I really don't care, because you're trying to get rid of me - and I bet you think I don't care enough about this job to actually fight back, but you're wrong, because I do, and I will. So you can keep trying to push me out of this place, but guess what? I'm not going anywhere."
                    },
                    {
                        "type": "paragraph",
                        "text": "Oscar: Well this is what happened: uh, Ryan's big project was the website - which wasn't doing so well. So Ryan, in order to give the impression of sales, recorded them twice - once as office sales and once as website sales, which is what we in the business refer to as \"misleading the shareholders\" - another good term is \"fraud\"...The real crime, I think, was the beard."
                    },
                    {
                        "type": "paragraph",
                        "text": "Kelly: I cannot wait to visit Ryan in prison...I'm gonna wear my hottest tracksuit, get my hair done, and then be like, \"Hi, Ryan\"...And then all the other prisoners are gonna be like, \"Damn, Ryan, you got a hot ex-girlfriend, ooh, I would never have treated her so bad when I was outside of prison!\""
                    },
                    {
                        "type": "paragraph",
                        "text": "Jim: Hey, Ryan, it's Jim - you know what? Totally disregard that last voicemail because you obviously have your hands tied."
                    },
                    {
                        "type": "paragraph",
                        "text": "Jan: If I was 22, and I had lots of time...to have lots of children...then, sure, let's let Michael have a shot at one of them. But, honestly, I need to make this one count."
                    }
                ],
                "images": []
            }
        ]
    },
    "coldOpens": [
        "Jim connects his headpiece to Dwight's phone, making Dwight extremely angry. Pam helps by calling Jim and pretends to think she's confused whether she is talking to Dwight or Jim. "
    ],
    "storylines": [
        "The episode starts with one of Jim's pranks: he links Dwight's cell phone to his own bluetooth headset. He also forwards Dwight's office phone to his own office phone. During the prank he pretends to steal a client from Dwight, a throwback to Dwight's stealing a client from him in Diversity Day.",
        "Dunder Mifflin Scranton is planning a going-away party for Toby before he leaves for Costa Rica. Michael is determined to make the party match the joy in his heart at Toby leaving, but when Angela balks at his unreasonable demands, such as an anti-gravity machine, Phyllis accepts the duty of planning the party. She does fantastically, ordering carnival rides to the parking lot and hiring Darryl's band, much to Angela's chagrin.",
        "Michael's hatred of Toby seems to have been transferred to the new HR representative, Holly, and he and Dwight plan to haze her. When she shows disdain for Toby, though, Michael suddenly thinks he is falling in love with her. Jim advises him to fight his over-aggressive instincts and play it slow, recounting his story on how he fell in love with Pam. Michael succeeds in warming up to Holly with less-obnoxious small talk and jokes. Michael even tempers Toby's exit interview, which he originally planned to be brutal and insulting, when Holly attends. When Michael's cruel going-away present (a rock with the words \"Suck On This\") is revealed, Pam cons Michael into giving Toby his sports watch. Dwight continues the hazing, telling Holly that Kevin is mentally challenged and putting a raccoon in her car. When Michael chastises him in front of everyone, Holly is even more receptive. Meanwhile, Kevin misinterprets Holly's praise of his ability to perform mundane tasks that would be difficult for a mentally challenged individual as romantic interest.",
        "Pam is accepted to study graphic design at Pratt Institute, for which she will have to go to New York City for three months. A supportive Jim assures her that, while the separation will not be fun, it is still a great opportunity. Meanwhile, when Jim calls Ryan about his huge sale in Job Fair, Ryan instructs him to enter the sale on the company's website before abruptly hanging up. Jim leaves Ryan a voicemail proclaiming that he will fight for his position at Dunder Mifflin, despite Ryan's attempts to push him out. Shortly afterwards, the staff finds a video on YouTube of Ryan being arrested for fraud (though while describing what he'd done in a talking head, Oscar jokes that Ryan's attempt at a beard was his \"real\" crime). Michael is greatly concerned for his \"friend\" Ryan, but Jim takes pleasure in the video and leaves Ryan a second voicemail telling him to disregard the last message \"since [his] hands are tied.\"",
        "Jim also contributes to the party-planning fund in order to buy fireworks. He claims it is to give Toby a proper send-off, but later reveals that he has decided to propose to Pam after recounting his story to Michael. Pam notices the purchase and guesses his intentions in an interview; however, at the party, just before Jim can pop the question, Andy ruins the moment by proposing to Angela (who responds with a halfhearted \"Okay\"). Dwight is crushed but says, \"It's my own fault.\" Jim puts the ring back in his pocket. In a later interview, Pam is visibly disappointed, thinking she had guessed wrong. Toby gets the pictures he wanted of him and Pam together and leaves the office forever, but Michael gets in a final shot when he has Hank, the security guard escort Toby from the building.",
        "Kevin runs into Jan at the grocery store and calls Michael to come talk to her. Michael discovers that Jan has artificially inseminated herself from a sperm bank and wants him to be involved in the pregnancy. He initially is indecisive, but eventually calls and agrees to attend lamaze class with her in Allentown.",
        "Right at the end of the episode, Phyllis returns to the office, with the camera crew and compares party planning to a runner's high, evidently pleased at the success of her party, but on her way in, she hears moaning and walks in on Angela and Dwight having sex on one of the desks, which is also recorded by the camera crew accompanying Phyllis."
    ],
    "quotes": [
        "Creed: What is wrong with this woman? She's asking about stuff that's nobody's business. \"What do I do?\"... Really, what do I do here? I should've written it down. \"Qua\" something, uh... qua... quar... quibo, qual...quir-quabity. Quabity assuance! No. No, no, no, no, but I'm getting close.",
        "Jim: Hey, Ryan, it's Jim. Look, man, I don't know what's gotten into you lately, but you know what? I really don't care, because you're trying to get rid of me - and I bet you think I don't care enough about this job to actually fight back, but you're wrong, because I do, and I will. So you can keep trying to push me out of this place, but guess what? I'm not going anywhere.",
        "Oscar: Well this is what happened: uh, Ryan's big project was the website - which wasn't doing so well. So Ryan, in order to give the impression of sales, recorded them twice - once as office sales and once as website sales, which is what we in the business refer to as \"misleading the shareholders\" - another good term is \"fraud\"...The real crime, I think, was the beard.",
        "Kelly: I cannot wait to visit Ryan in prison...I'm gonna wear my hottest tracksuit, get my hair done, and then be like, \"Hi, Ryan\"...And then all the other prisoners are gonna be like, \"Damn, Ryan, you got a hot ex-girlfriend, ooh, I would never have treated her so bad when I was outside of prison!\"",
        "Jim: Hey, Ryan, it's Jim - you know what? Totally disregard that last voicemail because you obviously have your hands tied.",
        "Jan: If I was 22, and I had lots of time...to have lots of children...then, sure, let's let Michael have a shot at one of them. But, honestly, I need to make this one count."
    ]
}