{
    "season": 4,
    "title": "Survivor Man",
    "episode": "11",
    "episodes": [
        11
    ],
    "episodeDetails": {
        "sections": [
            {
                "title": "Survivor Man",
                "level": 1,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "\"Survivor Man\" is the eleventh episode of the fourth season of The Office and the 64th overall. It was written by Steve Carell and directed by Paul Feig. It first aired November 8, 2007. This episode is part of NBC's Green Week. It was viewed by 8.29 million people."
                    }
                ],
                "images": []
            },
            {
                "title": "Synopsis",
                "level": 2,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Toby returns to the office talking about a recent wilderness retreat he took with Ryan and many other branch managers. Michael, however, had not been invited and he was upset to learn of it. In order to show that he is capable of surviving in the wilderness, Michael decides to strand himself in the wilderness for a few days, leaving Jim in charge of the office. Michael blindfolds himself and has Dwight take him to a location deep in the forest. Michael instructs Dwight to leave after dropping him off, however, knowing that Michael does not have proper wilderness survival skills Dwight does not leave, instead staying and keeping an eye on Michael (even through the scope of his rifle)."
                    },
                    {
                        "type": "paragraph",
                        "text": "Meanwhile, back at the office, Jim learns that it is \"birthday month\", a stretch of days that includes the birthdays of Creed, Meredith, and Oscar, Creed's being on the particular day that Jim is left in charge. In his first order of business, Jim forgoes organizing a party for Creed, instead announcing that the three parties will be celebrated together. He begins to run into problems, however, when Creed and Meredith request two different types of cake. Additionally, Andy refuses to attend unless an ice cream cake is made. Toby also requests to be included in the party, as his party two months earlier was poorly dated and thus scarcely attended. In a talking head interview, Jim belittles Toby's request."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael proves to be completely incapable of living out in the wild by himself. With the only materials he has, he is only able to fashion himself more clothes out of a cut up pair of pants, eventually crudely creating shelter out of them. Unable to find food, Michael begins to try to eat a group of wild mushrooms, unaware that they are highly poisonous. Dwight blows his cover to tackle Michael and pull the mushrooms from his mouth."
                    },
                    {
                        "type": "paragraph",
                        "text": "Back at the office, after a brief meeting, Jim finds that no one likes his office-wide party idea, even provoking Phyllis to mistakenly refer to him as Michael. Once this has happened, Jim decides to have a traditional party solely for Creed. Michael and Dwight return in time for the lighting of the cake, with Michael expressing that he no longer has any desire to return to the wilderness, and Jim expressing his relief that Michael has returned to run the office."
                    }
                ],
                "images": []
            },
            {
                "title": "Deleted scenes",
                "level": 2,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "The Season 4 DVD contains a number of deleted scenes."
                    },
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "In a talking head interview, Ryan explains that he wanted to go camping with some friends and invented the idea of a \"green retreat\" to obtain funding. He also claims that all the cute secretaries are impressed by his environmental stance, but B roll footage of Ryan smugly cruising the hallways at Corporate past several young women shows nobody paying him any attention. He explains that \"No one ever does anything for the environment just to help the environment. If someone tells you they have a green initiative, it's a scam.\"",
                                "elements": []
                            },
                            {
                                "text": "Michael asks Pam, \"hypothetically, would you go camping with me?\" Pam declines. In a talking head interview, Pam explains, \"When Michael invents a hypothetical situation, he eventually turns it into an actual situation.\"",
                                "elements": []
                            },
                            {
                                "text": "In a talking head interview, Michael professes that he's glad he wasn't invited. That way, he can experience the wild on his own. He conducts an imaginary conversation in which he regales an audience with his tales of the wild. At the end of the talking head interview, Michael pretends that Ryan is one of the people captivated by his stories.",
                                "elements": []
                            },
                            {
                                "text": "Dwight explains to Michael the properties of one particular knife, but Michael isn't interested and just asks for the knife. Dwight offers other camping gear such as a tent and food, but Michael explains that he will simply use his instincts. Dwight moans doubtfully.",
                                "elements": []
                            },
                            {
                                "text": "In a talking head interview, Angela explains that there are four birthdays in one month because, if you count back nine months, it's Valentine's Day. \"Stagger your sin, people.\"",
                                "elements": []
                            },
                            {
                                "text": "In a talking head interview, Kelly notes that everyone else who works at Dunder Mifflin is \"elderly,\" and adds, in confidence, \"Pam lies about her age.\"",
                                "elements": []
                            },
                            {
                                "text": "In a talking head interview, Kevin says that he celebrates his birthday with friends. \"Who do not work here.\"",
                                "elements": []
                            },
                            {
                                "text": "In a talking head interview, Phyllis claims that this year, she's going to celebrate her birthday by calling in sick.",
                                "elements": []
                            },
                            {
                                "text": "In the wilderness, Michael gives wildly incorrect descriptions of the wilderness. He identifies a bird call as a falcon, but it's actually just Dwight pretending to be a bird.",
                                "elements": []
                            },
                            {
                                "text": "In a talking head interview after returning to the office, Michael describes that nature was beautiful, yet also repulsive \"because I threw up all over Dwight's hand.\"",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Trivia",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "B.J. Novak (Ryan Howard) is credited but only appears in this episode via a deleted scene.",
                                "elements": []
                            },
                            {
                                "text": "The weaponry hidden in the office include a Jian (Chinese sword) in the ceiling, a Bowie knife in the filing cabinet, a pair of Japanese Sai daggers behind the water cooler, and a blowgun in the toilet tank. Dwight also refers to a can of pepper spray taped under his chair, which he claims to \"saved Jim's life with\" by using on Roy Anderson in the episode The Negotiation.",
                                "elements": []
                            },
                            {
                                "text": "The rifle Dwight uses to watch Michael is a .22 caliber rifle.",
                                "elements": []
                            },
                            {
                                "text": "Michael is inspired by the television program Survivorman; see Cultural references below.",
                                "elements": []
                            },
                            {
                                "text": "The species of mushroom Michael was about to consume was Hypholoma fasciculare, most commonly known as the \"clustered woodlover\", a type of mushroom common in woodland areas that grow on rotting trees, stumps or trunks. It is poisonous and symptoms of consumption would result in diarrhea, nausea, vomiting, proteinuria and collapse.",
                                "elements": []
                            },
                            {
                                "text": "Continuity Error: In the season one episode The Alliance, Meredith's birthday was in April (based on the airdate and Pam's planner) and Creed's birthday was not directly before hers (Pam states that Meredith has the next birthday in the office, a month after the events of that episode).",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Amusing details",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Dwight probably keeps his hunting rifle either stashed in the office or in his car, as it is unlikely Michael would have tolerated him stopping home to get it.",
                                "elements": []
                            },
                            {
                                "text": "Michael's sense of time is completely wrong throughout the entire episode. When he says he's been out in the wilderness for \"several hours now\" he's only been out for an hour and 45 minutes or so. And when he says he's gone \"about three hours\" without food it's only been two.",
                                "elements": [
                                    {
                                        "text": "In addition, when Michael is recording himself in the woods, he looks up at the sky as though calculating the time based on the sun's location, glances at his watch, and gives an approximate time.",
                                        "elements": []
                                    }
                                ]
                            },
                            {
                                "text": "When Dwight is walking through the forest, the cameraman's hand can be seen moving branches out the way.",
                                "elements": []
                            },
                            {
                                "text": "When Michael tells Pam he is leaving, the way Dwight holds the knife and other objects changes between cuts.",
                                "elements": []
                            },
                            {
                                "text": "When Dwight leads a blindfolded Michael through the forest, he walks along a path and intentionally leads Michael through the brush.",
                                "elements": []
                            },
                            {
                                "text": "In the flashback to Kevin's birthday, Michael dances with the doll from Sexual Harassment, forces it onto Stanley and Dwight tries to kiss it. The doll has a \"Stacy\" sticker on its chest, so consequently, Kevin is not particularly amused by Michael's antics. When Dwight kisses it, Kevin rebukes, \"How dare you?\" takes the doll and pounds Dwight with it repetitively with the whole office (Michael included) cheering for him.",
                                "elements": []
                            },
                            {
                                "text": "Jim states that there are 13 people in the office and they celebrate 13 birthdays. Therefore, Michael celebrates Toby's birthday, even though Michael hates Toby. However, Toby does reveal that the last birthday took place in the parking lot on a Friday at 4:58.",
                                "elements": []
                            },
                            {
                                "text": "The trees in the forest include Ponderosa Pine Trees, Jeffery Pine Trees, and Incense Cedar Trees. These trees are not native to Pennsylvania, but are native to the Transverse Ranges of Southern California where the forest scenes were most likely shot.",
                                "elements": []
                            },
                            {
                                "text": "After fashioning a shelter from his clothes, Michael proudly announces that he \"tented [his] pants!\" Given that \"tenting [one's] pants\" is a euphemism for getting an erection, it is unusual that Michael does not say \"That's what she said!\" especially given his conversation with Jim about the phrase at the end of the episode.",
                                "elements": []
                            },
                            {
                                "text": "In the flashback of Michael surprising Phyllis in the parking lot, it looks like she is trying hard not to laugh after dropping the cake.",
                                "elements": []
                            },
                            {
                                "text": "In the birthday party scene, Michael is wearing a Battlestar Galactica sweatshirt, which he must have borrowed from Dwight.",
                                "elements": []
                            },
                            {
                                "text": "Meredith's birthday was at the end of the month, after everyone else's. However, in \"The Alliance\", they throw a party for Meredith, whose birthday isn't for another month. This means that Kelly and Creed were not considered when they were choosing the next office birthday. In addition, later on in the episode, Creed implies Jim's birthday was in this time period, as he mentions that Jim's birthday was celebrated 3 weeks prior.",
                                "elements": []
                            },
                            {
                                "text": "Even Toby seems happy to see Michael when he arrives in the conference room at the end of the episode.",
                                "elements": []
                            },
                            {
                                "text": "There appears to be matches and an ashtray in the men's bathroom, as well as a magazine with a topless woman. In a previous episode, when the picture of a topless Jan was plastered everywhere, Dwight mentioned that there were a lot in the bathroom.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Cultural references",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Andy tells Jim he wants a Fudgie the Whale cake. Fudgie the Whale is a type of ice cream cake made by Carvel.",
                                "elements": []
                            },
                            {
                                "text": "Michael mentions the television program Survivorman, a reality program that focuses on the emphasis of survival in various situations, which Michael, in this episode, claims to have been \"kidnapped by a serial killer\". In this case, Michael attempts to imitate the survival expert Les Stroud, the star of the show, but has absolutely no idea on how to use survival skills, such as his focus on the uses of his clothes (such as converting his pants to shorts, or even his pants to a tent) and his consumption of a poisonous mushroom, which Dwight interferes in time before the mushrooms are ingested. Additionally, Michael imitates the way the show is also filmed as well, by using a home video camera rather than a TV crew.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Cast",
                "level": 2,
                "content": [],
                "images": []
            },
            {
                "title": "Main Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Steve Carell as Michael Scott",
                                "elements": []
                            },
                            {
                                "text": "Rainn Wilson as Dwight Schrute",
                                "elements": []
                            },
                            {
                                "text": "John Krasinski as Jim Halpert",
                                "elements": []
                            },
                            {
                                "text": "Jenna Fischer as Pam Beesly",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Supporting Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Ed Helms as Andy Bernard",
                                "elements": []
                            },
                            {
                                "text": "Leslie David Baker as Stanley Hudson",
                                "elements": []
                            },
                            {
                                "text": "Brian Baumgartner as Kevin Malone",
                                "elements": []
                            },
                            {
                                "text": "Creed Bratton (actor) as Creed Bratton",
                                "elements": []
                            },
                            {
                                "text": "Kate Flannery as Meredith Palmer",
                                "elements": []
                            },
                            {
                                "text": "Mindy Kaling as Kelly Kapoor",
                                "elements": []
                            },
                            {
                                "text": "Angela Kinsey as Angela Martin",
                                "elements": []
                            },
                            {
                                "text": "Paul Lieberstein as Toby Flenderson",
                                "elements": []
                            },
                            {
                                "text": "Oscar Nunez as Oscar Martinez",
                                "elements": []
                            },
                            {
                                "text": "Phyllis Smith as Phyllis Vance",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            }
        ]
    },
    "quotesDetails": {
        "sections": [
            {
                "title": "Survivor Man Quotes",
                "level": 1,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Dwight: I keep various weaponries strategically placed around the office. I saved Jim's life with a can of pepper spray I had velcroed under my desk. People say, \"Oh, it's dangerous to keep weapons in the home or the work place.\" Well I say, \"It's better to be hurt by someone you know accidentally, than by a stranger on purpose.\""
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael: Here we are living out a scenario in which a serial killer has captured me. Dwight is going to take me into the woods and leave me for dead."
                    },
                    {
                        "type": "paragraph",
                        "text": "Dwight: I would never do that- if I had to do that I would make sure you were dead, then cut off the finger tips and eyes so they couldn't identify you- and they'd call me the \"Overkill Killer\""
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael: You are as creepy as a real serial killer."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael: I wish I could’ve gone with Ryan on that cool retreat! Jan has plastic boobs! I...have...hemorrhoids!"
                    }
                ],
                "images": []
            }
        ]
    },
    "coldOpens": [
        "Michael wasn't invited to a corporate retreat when Ryan lets everyone else go, and replaces Michael with Toby. Everyone comments that Michael wasn't invited and Pam is interested in what happened. "
    ],
    "storylines": [
        "Toby returns to the office talking about a recent wilderness retreat he took with Ryan and many other branch managers. Michael, however, had not been invited and he was upset to learn of it. In order to show that he is capable of surviving in the wilderness, Michael decides to strand himself in the wilderness for a few days, leaving Jim in charge of the office. Michael blindfolds himself and has Dwight take him to a location deep in the forest. Michael instructs Dwight to leave after dropping him off, however, knowing that Michael does not have proper wilderness survival skills Dwight does not leave, instead staying and keeping an eye on Michael (even through the scope of his rifle).",
        "Meanwhile, back at the office, Jim learns that it is \"birthday month\", a stretch of days that includes the birthdays of Creed, Meredith, and Oscar, Creed's being on the particular day that Jim is left in charge. In his first order of business, Jim forgoes organizing a party for Creed, instead announcing that the three parties will be celebrated together. He begins to run into problems, however, when Creed and Meredith request two different types of cake. Additionally, Andy refuses to attend unless an ice cream cake is made. Toby also requests to be included in the party, as his party two months earlier was poorly dated and thus scarcely attended. In a talking head interview, Jim belittles Toby's request.",
        "Michael proves to be completely incapable of living out in the wild by himself. With the only materials he has, he is only able to fashion himself more clothes out of a cut up pair of pants, eventually crudely creating shelter out of them. Unable to find food, Michael begins to try to eat a group of wild mushrooms, unaware that they are highly poisonous. Dwight blows his cover to tackle Michael and pull the mushrooms from his mouth.",
        "Back at the office, after a brief meeting, Jim finds that no one likes his office-wide party idea, even provoking Phyllis to mistakenly refer to him as Michael. Once this has happened, Jim decides to have a traditional party solely for Creed. Michael and Dwight return in time for the lighting of the cake, with Michael expressing that he no longer has any desire to return to the wilderness, and Jim expressing his relief that Michael has returned to run the office."
    ],
    "quotes": [
        "Dwight: I keep various weaponries strategically placed around the office. I saved Jim's life with a can of pepper spray I had velcroed under my desk. People say, \"Oh, it's dangerous to keep weapons in the home or the work place.\" Well I say, \"It's better to be hurt by someone you know accidentally, than by a stranger on purpose.\"",
        "Michael: Here we are living out a scenario in which a serial killer has captured me. Dwight is going to take me into the woods and leave me for dead.",
        "Dwight: I would never do that- if I had to do that I would make sure you were dead, then cut off the finger tips and eyes so they couldn't identify you- and they'd call me the \"Overkill Killer\"",
        "Michael: You are as creepy as a real serial killer.",
        "Michael: I wish I could’ve gone with Ryan on that cool retreat! Jan has plastic boobs! I...have...hemorrhoids!"
    ]
}