{
    "season": 4,
    "title": "Night Out",
    "episode": "15",
    "episodes": [
        15
    ],
    "coldOpens": [
        "Michael has gum in his hair because he saw a shiny thing under a car. Dwight puts peanut butter in his hair, and Dwight eats it. "
    ],
    "storylines": [
        "The episode begins with Ryan arriving at the Scranton branch and noticeably friendlier than on his previous visits. Ryan shows the staff at the branch the new Dunder Mifflin website, \"Dunder Mifflin Infinity 2.0\", the previous version of which was shut down because sexual predators had invaded the social networking component of the site. As Ryan leaves, he tells Michael of the women he meets in clubs in New York City. Michael and Dwight subsequently decide to go to New York, locate Ryan, attend parties with him, and try to meet women while doing so.",
        "In New York, Michael and Dwight locate Ryan after discovering which club Ryan frequents; the latter appears to be under the influence of drugs (coke) but Michael and Dwight do not notice. Later, Michael, Dwight, Ryan, and Ryan's colleague, Troy Underbridge wait outside another club, but fail to get in because they do not have dates. Dwight comes to the rescue when he manages to pair each of them with members of a women's basketball team, who are also waiting in line. Inside the club, Ryan's dancing becomes erratic and aggressive, and he accidentally hits a girl, prompting her friends to attack Ryan. Dwight and Michael escort him out of the club, and after Troy advises them not to take Ryan to a hospital, he runs off. Michael and Dwight bring Ryan back to his apartment, where he tells them that he thinks \"his friend Troy\" has a drug problem, and asks what he should do about it. Michael, oblivious to the fact that Ryan is obviously referring to his own drug addiction, gives him hypothetical advice involving a wiretap and snitching on a drug dealer.",
        "Back in Scranton, the rest of the employees are going to be forced to work on a Saturday to record their own sales as the website's sales, which is, according to Ryan, \"a temporary procedure to increase the legitimacy of the website\". With no one eager to participate, Jim decides to ask everyone to stay in the office overtime instead of coming in on Saturday. They all agree to the plan, and after working until 9:00 , they are shocked to find the parking lot gates locked. Jim had forgotten to tell the security guard that they were staying overtime. They are unable to return to the office because Pam locked the door from the inside, and Dwight, miles away in New York, has both the spare and master keys. Sitting in the lobby area waiting for the security guard to arrive, the employees exchange jokes and during a moment of levity, Toby affectionately places his hand on Pam's knee. After an awkward silence, Toby proclaims that he is moving to Costa Rica; he then hops the parking lot fence and runs away. Jim repeatedly calls Hank, the security guard, but he fails to show up. At the end of the episode, the cleaning staff arrives and lets the group out. Later, Hank shows up and discovers that they are not there."
    ],
    "quotes": [
        [
            {
                "speaker": "Michael",
                "content": " I umm, thought about getting a tattoo on my back as well at one point. I was thinking about getting \"Back to the Future.\" \"Back\" because it's on my back and \"Future\" because I'm the kind of guy who likes to look ahead into the future. I just think a tattoo should mean something, you know? And it's my second favorite movie."
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " This place is like sexy pre-school."
            }
        ],
        [
            {
                "speaker": "Pam",
                "content": " There is a master key and a spare key for the office. Dwight has them both. When I asked, \"What if you die Dwight, how will we get into the office?\" He said, \"If I'm dead, you guys have been dead for weeks.\""
            }
        ]
    ]
}