{
    "season": 4,
    "title": "Dinner Party",
    "episode": "13",
    "episodes": [
        13
    ],
    "coldOpens": [
        "Michael pretends to call corporate and says that everyone can go home instead of working late. He, however, has a plan and gets Jim, Pam, Angela and Andy to come because they rescheduled all of their plans (at which point Jim realizes that the project that would require them to work late never existed). Dwight is distraught at not being invited. "
    ],
    "storylines": [
        "Michael pretends that Corporate has ordered the staff to work late on a Friday night, then pretends to call Corporate to reverse their decision. Their Friday evening now free, Jim and Pam have no excuse for declining Michael's latest invitation to socialize - in this case, a dinner party at his condo. Although Dwight wants to attend, Michael explains that the party is only for couples, that he also invited Andy and Angela, and that he only has six wine glasses.",
        "Jim and Pam are welcomed by Michael and Jan, who give them a tour of the condo. One bedroom has been converted into Jan's office (which appears unused); another is her workspace where she makes candles for her home business: \"Serenity by Jan.\" The aroma from the candles is overpowering. Jan then leads the guests into the master bedroom and playfully scolds Michael for not putting away the video camera tripod.",
        "Michael demonstrates how he sleeps on a small bench at the foot of the bed because Jan has \"some space issues.\" Jan has gotten her way with the home decor, although Michael takes comfort in his small plasma television mounted on the wall. Michael is also proud of a crude wooden table he built. To be polite, Jim confesses that he has no talent for crafts, and Pam joins in by mentioning that Jim couldn't set up her TiVo.",
        "Michael tells Pam that if she needs help, \"I'm just a phone call away.\" Jan angrily remarks to Michael, \"I bet you are.\"",
        "When Andy and Angela arrive, Jan offers to take them on a short tour before starting dinner. All that's left to do is cook the ossobuco, which will take three hours, she says. Pam looks horrified.",
        "When she returns, Jan plays a CD (\"The Hunted\") recorded by her former assistant, Hunter. The lyrics of the song and Jan's provocative dancing suggest that he lost his virginity to her.",
        "During a disastrous game of Celebrity, Jim excuses himself and pretends to have received a telephone call informing him that his apartment has flooded. His attempt to escape the party with Pam is thwarted when Michael notes that only one person needs to check on the damage. Jim concedes the point and tries to escape alone, but Pam forces a smiling Jim to stay.",
        "Jim returns to the game of Celebrity and undermines Michael's turn by intentionally guessing the wrong names to obvious clues.",
        "After the game, Michael tries to make a sales pitch to Jim and Andy to buy shares in Jan's candle company for $10,000, which Andy immediately accepts. Pam and Angela join Jan in the kitchen, where Jan says that Michael told her that he used to date Pam. Pam is disgusted and tells Jan she never has and never wants to date Michael, but Angela quickly comments that she sees Pam staring at Michael in the office.",
        "As dinner begins, Dwight arrives, uninvited, with his own food, two wine glasses and (apparently) his former babysitter, with whom he claims to be having a \"carnal\" relationship. Michael and Jan argue openly about very personal matters: while Jan debated whether or not to have children, she forced Michael to undergo a vasectomy, have it reversed, then undergo another vasectomy.",
        "The tension between Michael and Jan only grows during dinner. Michael confides in Pam that he thinks Jan has poisoned his food; Jan is upset with Michael for dipping his food in wine. Michael then plugs in a garish neon St. Pauli Girl beer sign, and the tension erupts in a shouting match. The conflict escalates until Jan throws one of Michael's Dundie awards and breaks his $200 \"plasma\" television.",
        "When the police arrive to investigate a disturbance call, Michael says that he will not press charges against Jan and will \"take the fall\" for what happened. On the advice of the responding officers, Michael agrees to go home with a friend. Jim and Pam are unavailable because Jim's apartment is \"on fire\"--Pam corrects him: \"flooded.\" Dwight happily takes Michael in his car.",
        "In Michael's condo, Jan tries to repair his Dundie. Jim and Pam stop at a coney island for dinner, eating in Jim's car while listening to Hunter's CD (which Jim stole). Angela and Andy make their own stopover for ice cream cones; Andy playfully takes a lick of Angela's cone, who gives him a look of unbridled disgust and smears the rest of her ice cream on the side of his car."
    ],
    "quotes": [
        [
            {
                "speaker": "Jim",
                "content": " Michael has asked Pam and me to dinner at least...nine times, and every time, we've been able to get out of it. But, I gotta give him credit...he got me...because I'm starting to suspect that there was no assignment from Corporate."
            }
        ],
        [
            {
                "speaker": "Pam",
                "content": " I don't care what they say about me, I just want to eat. Which I realize is a lot to ask for...at a dinner party!"
            }
        ],
        [
            {
                "speaker": "Jim",
                "content": " Michael and Jan seem to be playing their own separate game, and it's called \"Let's See How Uncomfortable We Can Make Our Guests\" - and, they're both winning, so I am going to make a run for it."
            }
        ],
        [
            {
                "speaker": "Pam",
                "content": " You can buy new stuff, Jim, but you can't buy a new fiance."
            },
            {
                "speaker": "Michael",
                "content": " That's true."
            }
        ],
        [
            {
                "speaker": "Jan",
                "content": " What're you doing here?!"
            },
            {
                "speaker": "Dwight",
                "content": " We came to eat dinner, and to party - this is, a...dinner party, right?"
            },
            {
                "speaker": "Pam",
                "content": " Awesome!"
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " That was a $200 plasma screen TV!!!"
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " When I said that I wanted to have kids, and you said, you wanted me to have a vasectomy, what did I do? And then when you said that you might want to have kids and I wasn't so sure, Who had the vasectomy reversed? And then when you said you defintely didn't want to have kids, who had it reversed back? Snip snap! Snip snap! Snip snap! I did. You have no idea the physical toll, that three vasectomies have on a person. And I bought this condo to fill with children."
            }
        ],
        [
            {
                "speaker": "Pam",
                "content": " I know Jan didn't poison the food - I know that. But if she was going to poison the food of someone at that table, wouldn't it be me? Michael's former lover."
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " (jokingly)I'm in hell!"
            }
        ],
        [
            {
                "speaker": "Angela",
                "content": " (sternly) You shouldn't joke about that, you know."
            }
        ]
    ]
}