{
    "season": 4,
    "title": "Night Out",
    "episode": "15",
    "episodes": [
        15
    ],
    "episodeDetails": {
        "sections": [
            {
                "title": "Night Out",
                "level": 1,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "\"Night Out\" is the fifteenth episode of the fourth season of The Office and the 68th episode overall. It was written by Mindy Kaling and directed by Ken Whittingham. It first aired April 24, 2008. It was viewed by 7.56 million people."
                    }
                ],
                "images": []
            },
            {
                "title": "Synopsis",
                "level": 2,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "The episode begins with Ryan arriving at the Scranton branch and noticeably friendlier than on his previous visits. Ryan shows the staff at the branch the new Dunder Mifflin website, \"Dunder Mifflin Infinity 2.0\", the previous version of which was shut down because sexual predators had invaded the social networking component of the site. As Ryan leaves, he tells Michael of the women he meets in clubs in New York City. Michael and Dwight subsequently decide to go to New York, locate Ryan, attend parties with him, and try to meet women while doing so."
                    },
                    {
                        "type": "paragraph",
                        "text": "In New York, Michael and Dwight locate Ryan after discovering which club Ryan frequents; the latter appears to be under the influence of drugs (coke) but Michael and Dwight do not notice. Later, Michael, Dwight, Ryan, and Ryan's colleague, Troy Underbridge wait outside another club, but fail to get in because they do not have dates. Dwight comes to the rescue when he manages to pair each of them with members of a women's basketball team, who are also waiting in line. Inside the club, Ryan's dancing becomes erratic and aggressive, and he accidentally hits a girl, prompting her friends to attack Ryan. Dwight and Michael escort him out of the club, and after Troy advises them not to take Ryan to a hospital, he runs off. Michael and Dwight bring Ryan back to his apartment, where he tells them that he thinks \"his friend Troy\" has a drug problem, and asks what he should do about it. Michael, oblivious to the fact that Ryan is obviously referring to his own drug addiction, gives him hypothetical advice involving a wiretap and snitching on a drug dealer."
                    },
                    {
                        "type": "paragraph",
                        "text": "Back in Scranton, the rest of the employees are going to be forced to work on a Saturday to record their own sales as the website's sales, which is, according to Ryan, \"a temporary procedure to increase the legitimacy of the website\". With no one eager to participate, Jim decides to ask everyone to stay in the office overtime instead of coming in on Saturday. They all agree to the plan, and after working until 9:00 , they are shocked to find the parking lot gates locked. Jim had forgotten to tell the security guard that they were staying overtime. They are unable to return to the office because Pam locked the door from the inside, and Dwight, miles away in New York, has both the spare and master keys. Sitting in the lobby area waiting for the security guard to arrive, the employees exchange jokes and during a moment of levity, Toby affectionately places his hand on Pam's knee. After an awkward silence, Toby proclaims that he is moving to Costa Rica; he then hops the parking lot fence and runs away. Jim repeatedly calls Hank, the security guard, but he fails to show up. At the end of the episode, the cleaning staff arrives and lets the group out. Later, Hank shows up and discovers that they are not there."
                    }
                ],
                "images": [
                    {
                        "src": "https://vignette.wikia.nocookie.net/theoffice/images/a/a2/Nightout2.jpg/revision/latest/scale-to-width-down/230?cb=20081006012558",
                        "caption": "Jim, Pam and Toby locked in the building"
                    }
                ]
            },
            {
                "title": "Deleted scenes",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Michael, Dwight, and Ryan taxi home, but the taxi pulls over when Ryan vomits in the back seat.",
                                "elements": []
                            },
                            {
                                "text": "In a talking head interview, Troy denies responsibility for taking care of him. \"Friends are there to help you have a good time, and to sell you the stuff you need to have a good time.\"",
                                "elements": []
                            },
                            {
                                "text": "In an attempt to cheer him up, Michael expresses his admiration for Ryan's life, including his awesome apartment building they are sitting in front of. Ryan corrects him: They are sitting on the steps of the Metropolitan Museum of Art.",
                                "elements": []
                            },
                            {
                                "text": "Michael prevents Ryan from sleeping by asking him question like, \"Do you ever miss us?\"",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Trivia",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Due to a mix-up, the actress playing the basketball player (\"Tall Girl #1\") did not know that her character would have a make-out session with Dwight until the day of filming. Even though the casting sheet requested someone 6'1\" or taller, the actress is only 5'11\" but she is a former basketball player.",
                                "elements": []
                            },
                            {
                                "text": "While Jim and Ryan are talking in the kitchenette, the latter says that the former talked to David Wallace about his doubts with DMI during the Christmas Party. A Christmas episode was written, but never filmed due to the WGA Strike.",
                                "elements": []
                            },
                            {
                                "text": "At one point Ryan tries to get into a nightclub by claiming to be \"Ryan Howard, the baseball player\", power-hitting first baseman for the Philadelphia Phillies: this Ryan Howard, for whom the character is actually named (he was playing for the Phillies' Scranton-based minor league team when the show debuted in 2005) would go on to appear as himself in Promos.",
                                "elements": []
                            },
                            {
                                "text": "Oscar speaks Spanish with a Cuban dialect, even though he is Mexican. Actor Oscar Nunez is actually from Cuba.",
                                "elements": []
                            },
                            {
                                "text": "When Hank finally arrives at the office, the camera sweeps over a parking lot that is empty with the exception of the cleaning crew's van. However, Toby (presumably) drove to work and ran home, meaning his vehicle should have still been there as well. It is possible that the car was simply not in view.",
                                "elements": []
                            },
                            {
                                "text": "The nightclub scenes were shot at The Edison in downtown Los Angeles.",
                                "elements": []
                            },
                            {
                                "text": "The song played during the nightclub scene is from LCD Soundsystem - Tribulations",
                                "elements": []
                            },
                            {
                                "text": "In the establishing shot prior to the scene that takes place in Ryan's apartment, the camera briefly pans up a building with a closed bike shop on the ground floor with a URL painted on the awning.  If Ryan lives in the building above this shop he lives on East 62nd Street, between 1st and 2nd Avenues in N.Y.C.  The bike shop, My Bike Heaven is located at 348 East 62nd Street.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Amusing details",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "During the conference room meeting when Michael erroneously says \"T.D.B.\" instead of \"T.B.D.,\" Ryan appears to be struggling to hold back a smile.",
                                "elements": []
                            },
                            {
                                "text": "Creed, who regularly forgets the names of his coworkers, is the only one to remember Hank's name. Jim doesn't believe him most likely due to all of Creed's past name failures. Andy shouts out \"Eddy\" when Jim asks for the security guard's name.",
                                "elements": []
                            },
                            {
                                "text": "When Andy asked his co-workers \"Who thinks we're a better couple than Jim and Pam?\", Angela and Andy raise their hand to their own relationship.",
                                "elements": []
                            },
                            {
                                "text": "Ryan has a giant flat-screen television on the wall right next to his bed. Aside from this extravagance, he lives in a comparatively run-down apartment.",
                                "elements": []
                            },
                            {
                                "text": "In this episode, Dwight fails to detect Ryan's drug use even though he professed great skill at detecting drug use in the episode Drug Testing.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Connections to previous episodes",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Toby formerly expressed a desire to move to Costa Rica in Branch Closing.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Goofs",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Hank should have known everyone was still inside the office since he sits at his desk all day and wouldn't have seen them leave the building.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Cultural references",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Peanut butter is effective at removing gum from hair. Dwight, however, goes overboard and uses far too much.",
                                "elements": []
                            },
                            {
                                "text": "Michael orders a Midori sour. The drink is very sweet and is a stereotypical \"girly\" drink.",
                                "elements": []
                            },
                            {
                                "text": "There is no such college as New Jersey State.",
                                "elements": []
                            },
                            {
                                "text": "The Wire is a show on HBO. Michael says he doesn't understand it, presumably because of the street language commonly used on it.",
                                "elements": []
                            },
                            {
                                "text": "\"Let's Hear It for the Boy\" is a soul classic by Deniece Williams.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Cast",
                "level": 2,
                "content": [],
                "images": []
            },
            {
                "title": "Main Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Steve Carell as Michael Scott",
                                "elements": []
                            },
                            {
                                "text": "Rainn Wilson as Dwight Schrute",
                                "elements": []
                            },
                            {
                                "text": "John Krasinski as Jim Halpert",
                                "elements": []
                            },
                            {
                                "text": "Jenna Fischer as Pam Beesly",
                                "elements": []
                            },
                            {
                                "text": "B.J. Novak as Ryan Howard",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Supporting Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Ed Helms as Andy Bernard",
                                "elements": []
                            },
                            {
                                "text": "Leslie David Baker as Stanley Hudson",
                                "elements": []
                            },
                            {
                                "text": "Brian Baumgartner as Kevin Malone",
                                "elements": []
                            },
                            {
                                "text": "Creed Bratton (actor) as Creed Bratton",
                                "elements": []
                            },
                            {
                                "text": "Kate Flannery as Meredith Palmer",
                                "elements": []
                            },
                            {
                                "text": "Mindy Kaling as Kelly Kapoor",
                                "elements": []
                            },
                            {
                                "text": "Angela Kinsey as Angela Martin",
                                "elements": []
                            },
                            {
                                "text": "Paul Lieberstein as Toby Flenderson",
                                "elements": []
                            },
                            {
                                "text": "Oscar Nunez as Oscar Martinez",
                                "elements": []
                            },
                            {
                                "text": "Phyllis Smith as Phyllis Vance",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Recurring Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Hugh Dane as Hank Tate",
                                "elements": []
                            },
                            {
                                "text": "Noel Petok as Troy Underbridge",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Guest Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Jennifer Peo as Cocktail Waitress",
                                "elements": []
                            },
                            {
                                "text": "Taji Coleman as Tall Girl (Basketball Player)",
                                "elements": []
                            },
                            {
                                "text": "Cassie Fliegel as Tall Girl (Basketball Player)",
                                "elements": []
                            },
                            {
                                "text": "Kelsea Button as Girl in club (Tattoo Girl)",
                                "elements": []
                            },
                            {
                                "text": "Ashley Walsh as Girl in Club (Dog Groomer)",
                                "elements": []
                            },
                            {
                                "text": "Kim Stodel as Girl in Club",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "References",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "↑ Office kiss and tell: Actress who plants one on Dwight tonight grateful for big break",
                                "elements": []
                            },
                            {
                                "text": "↑ The Office: Faux documentary style is harder than it looks, Mix magazine, October 1, 2008.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            }
        ]
    },
    "quotesDetails": {
        "sections": [
            {
                "title": "Night Out Quotes",
                "level": 1,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Michael: I umm, thought about getting a tattoo on my back as well at one point. I was thinking about getting \"Back to the Future.\" \"Back\" because it's on my back and \"Future\" because I'm the kind of guy who likes to look ahead into the future. I just think a tattoo should mean something, you know? And it's my second favorite movie."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael: This place is like sexy pre-school."
                    },
                    {
                        "type": "paragraph",
                        "text": "Pam: There is a master key and a spare key for the office. Dwight has them both. When I asked, \"What if you die Dwight, how will we get into the office?\" He said, \"If I'm dead, you guys have been dead for weeks.\""
                    }
                ],
                "images": []
            }
        ]
    },
    "coldOpens": [
        "Michael has gum in his hair because he saw a shiny thing under a car. Dwight puts peanut butter in his hair, and Dwight eats it. "
    ],
    "storylines": [
        "The episode begins with Ryan arriving at the Scranton branch and noticeably friendlier than on his previous visits. Ryan shows the staff at the branch the new Dunder Mifflin website, \"Dunder Mifflin Infinity 2.0\", the previous version of which was shut down because sexual predators had invaded the social networking component of the site. As Ryan leaves, he tells Michael of the women he meets in clubs in New York City. Michael and Dwight subsequently decide to go to New York, locate Ryan, attend parties with him, and try to meet women while doing so.",
        "In New York, Michael and Dwight locate Ryan after discovering which club Ryan frequents; the latter appears to be under the influence of drugs (coke) but Michael and Dwight do not notice. Later, Michael, Dwight, Ryan, and Ryan's colleague, Troy Underbridge wait outside another club, but fail to get in because they do not have dates. Dwight comes to the rescue when he manages to pair each of them with members of a women's basketball team, who are also waiting in line. Inside the club, Ryan's dancing becomes erratic and aggressive, and he accidentally hits a girl, prompting her friends to attack Ryan. Dwight and Michael escort him out of the club, and after Troy advises them not to take Ryan to a hospital, he runs off. Michael and Dwight bring Ryan back to his apartment, where he tells them that he thinks \"his friend Troy\" has a drug problem, and asks what he should do about it. Michael, oblivious to the fact that Ryan is obviously referring to his own drug addiction, gives him hypothetical advice involving a wiretap and snitching on a drug dealer.",
        "Back in Scranton, the rest of the employees are going to be forced to work on a Saturday to record their own sales as the website's sales, which is, according to Ryan, \"a temporary procedure to increase the legitimacy of the website\". With no one eager to participate, Jim decides to ask everyone to stay in the office overtime instead of coming in on Saturday. They all agree to the plan, and after working until 9:00 , they are shocked to find the parking lot gates locked. Jim had forgotten to tell the security guard that they were staying overtime. They are unable to return to the office because Pam locked the door from the inside, and Dwight, miles away in New York, has both the spare and master keys. Sitting in the lobby area waiting for the security guard to arrive, the employees exchange jokes and during a moment of levity, Toby affectionately places his hand on Pam's knee. After an awkward silence, Toby proclaims that he is moving to Costa Rica; he then hops the parking lot fence and runs away. Jim repeatedly calls Hank, the security guard, but he fails to show up. At the end of the episode, the cleaning staff arrives and lets the group out. Later, Hank shows up and discovers that they are not there."
    ],
    "quotes": [
        "Michael: I umm, thought about getting a tattoo on my back as well at one point. I was thinking about getting \"Back to the Future.\" \"Back\" because it's on my back and \"Future\" because I'm the kind of guy who likes to look ahead into the future. I just think a tattoo should mean something, you know? And it's my second favorite movie.",
        "Michael: This place is like sexy pre-school.",
        "Pam: There is a master key and a spare key for the office. Dwight has them both. When I asked, \"What if you die Dwight, how will we get into the office?\" He said, \"If I'm dead, you guys have been dead for weeks.\""
    ]
}