{
    "season": 4,
    "title": "Job Fair",
    "episode": "17",
    "episodes": [
        17
    ],
    "coldOpens": [
        "Michael plans to \"youthanize\" Dunder Mifflin with a job fair for interns. Kelly says Darryl looks like Barack Obama and Michael offends Pam with saying that she'll be eye candy. (\"Job Fair\")."
    ],
    "storylines": [
        "Michael, Pam, Oscar and Darryl set up a booth at a local job fair at Valley View High School, which happens to be Pam's alma mater, to find the \"Best and the Brightest\" for Dunder Mifflin's summer internship. Meanwhile, Jim hits the links with Andy and Kevin to try and land his biggest sale after receiving a formal warning from Ryan regarding his job performance.",
        "Michael sets up the company's booth at the job fair by placing one sheet of white paper on the table and nothing else. The client Jim is trying to impress, Phil Maguire, suggests they bet on the golf game, which excites Kevin, as he both loves to gamble and proves to be an excellent golfer. Andy, on the other hand, is quite a poor golfer. The employees realize there is no reason for them to be in the office with so many people gone and want to go home. Stanley quietly packs his things and walks out as Dwight becomes outraged that everyone wants to leave.",
        "At the job fair, Michael turns away the only student interested in their booth because he is not the type of person Michael was interested in recruiting. He then gets mad that the student signed his name on the sheet of paper and tells Pam to put out another. Pam only brought one, and when Michael gets mad at her, she points out that he told her to only bring one sheet. Michael pushes the blame back on her and makes her go find another piece of paper.",
        "Jim tries to convince the client to switch paper companies, but Phil is content with the supplier he is using and is not interested in hearing a sales pitch. Michael tries to pull other students in to the booth but no one is interested. Back at the office, Angela and Dwight find themselves alone as the rest of the employees decide to go home.",
        "Pam finds a piece of paper from her old art room and returns to the booth with it, but Michael is mad that it is not Dunder Mifflin paper and makes Pam go back to the office to retrieve another sheet. Meanwhile, Dwight calls Michael with the news that the employees left but Michael agrees that no one should have to be there as both he and Jim are gone and hangs up.",
        "The sales pitch does not seem to be going well for Jim, but he is determined to give it his best shot. After getting shot down again, Andy, in an attempt to be funny, suggests racing to the next hole and crashes the golf cart into a sand trap. Michael becomes disgusted with how well the rest of the booths are doing. Michael tries to re-recruit Justin, the only student who showed an interest in the company, but Justin tells Michael he was a jerk and walks away.",
        "After the golf game, Jim delivers one last desperate sales pitch and Phil finally breaks down and gives Dunder Mifflin his business. As the job fair starts to wrap up, Michael grabs the microphone and, like Jim, delivers one last desperate sales pitch to get anyone to intern at the company, but he gets no takers.",
        "In his final talking head, Michael justifies his failure at the job fair by accepting credit for Jim's success, as Jim chooses to work at Dunder Mifflin.",
        "The final scene shows Pam walking over to a graphic design booth during the job fair and asking for an application. Although Pam is intimidated when the graphic design interviewer lists several programs that she is unfamiliar with, the interviewer states that it should be easy to find adult education programs to help Pam learn them."
    ],
    "quotes": [
        [
            {
                "speaker": "Michael",
                "content": " Today I'm heading over to the job fair at Valley View High School, to find some new interns. Want to get some fresh blood. Um, euthanize this place."
            }
        ],
        [
            {
                "speaker": "Andy",
                "content": " People assume I'm great at golf. But like everybody, I hated golf lessons when I was a kid. So, I used to hang out at the sailing club instead. Got my \"knot\" on."
            }
        ]
    ]
}