{
    "season": 4,
    "title": "Goodbye, Toby",
    "episode": "18/19",
    "episodes": [
        18,
        19
    ],
    "coldOpens": [
        "Jim connects his headpiece to Dwight's phone, making Dwight extremely angry. Pam helps by calling Jim and pretends to think she's confused whether she is talking to Dwight or Jim. "
    ],
    "storylines": [
        "The episode starts with one of Jim's pranks: he links Dwight's cell phone to his own bluetooth headset. He also forwards Dwight's office phone to his own office phone. During the prank he pretends to steal a client from Dwight, a throwback to Dwight's stealing a client from him in Diversity Day.",
        "Dunder Mifflin Scranton is planning a going-away party for Toby before he leaves for Costa Rica. Michael is determined to make the party match the joy in his heart at Toby leaving, but when Angela balks at his unreasonable demands, such as an anti-gravity machine, Phyllis accepts the duty of planning the party. She does fantastically, ordering carnival rides to the parking lot and hiring Darryl's band, much to Angela's chagrin.",
        "Michael's hatred of Toby seems to have been transferred to the new HR representative, Holly, and he and Dwight plan to haze her. When she shows disdain for Toby, though, Michael suddenly thinks he is falling in love with her. Jim advises him to fight his over-aggressive instincts and play it slow, recounting his story on how he fell in love with Pam. Michael succeeds in warming up to Holly with less-obnoxious small talk and jokes. Michael even tempers Toby's exit interview, which he originally planned to be brutal and insulting, when Holly attends. When Michael's cruel going-away present (a rock with the words \"Suck On This\") is revealed, Pam cons Michael into giving Toby his sports watch. Dwight continues the hazing, telling Holly that Kevin is mentally challenged and putting a raccoon in her car. When Michael chastises him in front of everyone, Holly is even more receptive. Meanwhile, Kevin misinterprets Holly's praise of his ability to perform mundane tasks that would be difficult for a mentally challenged individual as romantic interest.",
        "Pam is accepted to study graphic design at Pratt Institute, for which she will have to go to New York City for three months. A supportive Jim assures her that, while the separation will not be fun, it is still a great opportunity. Meanwhile, when Jim calls Ryan about his huge sale in Job Fair, Ryan instructs him to enter the sale on the company's website before abruptly hanging up. Jim leaves Ryan a voicemail proclaiming that he will fight for his position at Dunder Mifflin, despite Ryan's attempts to push him out. Shortly afterwards, the staff finds a video on YouTube of Ryan being arrested for fraud (though while describing what he'd done in a talking head, Oscar jokes that Ryan's attempt at a beard was his \"real\" crime). Michael is greatly concerned for his \"friend\" Ryan, but Jim takes pleasure in the video and leaves Ryan a second voicemail telling him to disregard the last message \"since [his] hands are tied.\"",
        "Jim also contributes to the party-planning fund in order to buy fireworks. He claims it is to give Toby a proper send-off, but later reveals that he has decided to propose to Pam after recounting his story to Michael. Pam notices the purchase and guesses his intentions in an interview; however, at the party, just before Jim can pop the question, Andy ruins the moment by proposing to Angela (who responds with a halfhearted \"Okay\"). Dwight is crushed but says, \"It's my own fault.\" Jim puts the ring back in his pocket. In a later interview, Pam is visibly disappointed, thinking she had guessed wrong. Toby gets the pictures he wanted of him and Pam together and leaves the office forever, but Michael gets in a final shot when he has Hank, the security guard escort Toby from the building.",
        "Kevin runs into Jan at the grocery store and calls Michael to come talk to her. Michael discovers that Jan has artificially inseminated herself from a sperm bank and wants him to be involved in the pregnancy. He initially is indecisive, but eventually calls and agrees to attend lamaze class with her in Allentown.",
        "Right at the end of the episode, Phyllis returns to the office, with the camera crew and compares party planning to a runner's high, evidently pleased at the success of her party, but on her way in, she hears moaning and walks in on Angela and Dwight having sex on one of the desks, which is also recorded by the camera crew accompanying Phyllis."
    ],
    "quotes": [
        [
            {
                "speaker": "Creed",
                "content": " What is wrong with this woman? She's asking about stuff that's nobody's business. \"What do I do?\"... Really, what do I do here? I should've written it down. \"Qua\" something, uh... qua... quar... quibo, qual...quir-quabity. Quabity assuance! No. No, no, no, no, but I'm getting close."
            }
        ],
        [
            {
                "speaker": "Jim",
                "content": " Hey, Ryan, it's Jim. Look, man, I don't know what's gotten into you lately, but you know what? I really don't care, because you're trying to get rid of me - and I bet you think I don't care enough about this job to actually fight back, but you're wrong, because I do, and I will. So you can keep trying to push me out of this place, but guess what? I'm not going anywhere."
            }
        ],
        [
            {
                "speaker": "Oscar",
                "content": " Well this is what happened: uh, Ryan's big project was the website - which wasn't doing so well. So Ryan, in order to give the impression of sales, recorded them twice - once as office sales and once as website sales, which is what we in the business refer to as \"misleading the shareholders\" - another good term is \"fraud\"...The real crime, I think, was the beard."
            }
        ],
        [
            {
                "speaker": "Kelly",
                "content": " I cannot wait to visit Ryan in prison...I'm gonna wear my hottest tracksuit, get my hair done, and then be like, \"Hi, Ryan\"...And then all the other prisoners are gonna be like, \"Damn, Ryan, you got a hot ex-girlfriend, ooh, I would never have treated her so bad when I was outside of prison!\""
            }
        ],
        [
            {
                "speaker": "Jim",
                "content": " Hey, Ryan, it's Jim - you know what? Totally disregard that last voicemail because you obviously have your hands tied."
            }
        ],
        [
            {
                "speaker": "Jan",
                "content": " If I was 22, and I had lots of time...to have lots of children...then, sure, let's let Michael have a shot at one of them. But, honestly, I need to make this one count."
            }
        ]
    ]
}