{
    "season": 4,
    "title": "Survivor Man",
    "episode": "11",
    "episodes": [
        11
    ],
    "coldOpens": [
        "Michael wasn't invited to a corporate retreat when Ryan lets everyone else go, and replaces Michael with Toby. Everyone comments that Michael wasn't invited and Pam is interested in what happened. "
    ],
    "storylines": [
        "Toby returns to the office talking about a recent wilderness retreat he took with Ryan and many other branch managers. Michael, however, had not been invited and he was upset to learn of it. In order to show that he is capable of surviving in the wilderness, Michael decides to strand himself in the wilderness for a few days, leaving Jim in charge of the office. Michael blindfolds himself and has Dwight take him to a location deep in the forest. Michael instructs Dwight to leave after dropping him off, however, knowing that Michael does not have proper wilderness survival skills Dwight does not leave, instead staying and keeping an eye on Michael (even through the scope of his rifle).",
        "Meanwhile, back at the office, Jim learns that it is \"birthday month\", a stretch of days that includes the birthdays of Creed, Meredith, and Oscar, Creed's being on the particular day that Jim is left in charge. In his first order of business, Jim forgoes organizing a party for Creed, instead announcing that the three parties will be celebrated together. He begins to run into problems, however, when Creed and Meredith request two different types of cake. Additionally, Andy refuses to attend unless an ice cream cake is made. Toby also requests to be included in the party, as his party two months earlier was poorly dated and thus scarcely attended. In a talking head interview, Jim belittles Toby's request.",
        "Michael proves to be completely incapable of living out in the wild by himself. With the only materials he has, he is only able to fashion himself more clothes out of a cut up pair of pants, eventually crudely creating shelter out of them. Unable to find food, Michael begins to try to eat a group of wild mushrooms, unaware that they are highly poisonous. Dwight blows his cover to tackle Michael and pull the mushrooms from his mouth.",
        "Back at the office, after a brief meeting, Jim finds that no one likes his office-wide party idea, even provoking Phyllis to mistakenly refer to him as Michael. Once this has happened, Jim decides to have a traditional party solely for Creed. Michael and Dwight return in time for the lighting of the cake, with Michael expressing that he no longer has any desire to return to the wilderness, and Jim expressing his relief that Michael has returned to run the office."
    ],
    "quotes": [
        [
            {
                "speaker": "Dwight",
                "content": " I keep various weaponries strategically placed around the office. I saved Jim's life with a can of pepper spray I had velcroed under my desk. People say, \"Oh, it's dangerous to keep weapons in the home or the work place.\" Well I say, \"It's better to be hurt by someone you know accidentally, than by a stranger on purpose.\""
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " Here we are living out a scenario in which a serial killer has captured me. Dwight is going to take me into the woods and leave me for dead."
            }
        ],
        [
            {
                "speaker": "Dwight",
                "content": " I would never do that- if I had to do that I would make sure you were dead, then cut off the finger tips and eyes so they couldn't identify you- and they'd call me the \"Overkill Killer\""
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " You are as creepy as a real serial killer."
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " I wish I could’ve gone with Ryan on that cool retreat! Jan has plastic boobs! I...have...hemorrhoids!"
            }
        ]
    ]
}