{
    "season": 4,
    "title": "The Deposition",
    "episode": "12",
    "episodes": [
        12
    ],
    "coldOpens": [
        "Michael has Pam write notes to him during meetings so that he can feel important. However, it gets him in trouble when Ryan thinks he has a client, but doesn't and has to take it. "
    ],
    "storylines": [
        "Michael shows us how he impresses people by having Pam give him fake messages telling him there's a call for him so he can say he'll call back later no matter how important the call or caller may be. On one occasion, Ryan is visiting, and Pam brings the usual fake message. Michael initially passes it up, but Ryan insists that customer service is the first priority and has Michael take the call, which requires Michael to do a surprise bit of improv.",
        "Jan and Michael drive to the corporate office in New York City to do a deposition for Jan's lawsuit over her dismissal. They rehearse Michael's testimony in the car, and he makes up absurd mnemonic devices so he won't forget what to say. He has also memorized Jan's answers and plans to throw in some \"errs\" and \"ahhs\" for the deposition to appear not so scripted.",
        "Meanwhile, back at the warehouse, Darryl is wiping Jim out in a ping pong game while Pam and Kelly watch. Kelly goes all trash talk on Pam, about how Pam's boyfriend \"sucks\" at ping pong, but Kelly calls it \"talking smack.\" Pam gets ticked off and sets up a practice ping pong table in the conference room so she can get back at Kelly by way of Jim and Darryl. She gets Kevin and then Dwight as \"sparring partners\" for Jim, but Dwight easily defeats Jim. Dwight reveals for the first time that he is a huge lifelong table tennis fan, and he reels off the names of immortals of the sport whom he idolizes.",
        "At corporate, Michael is (maybe) all set to support Jan during the deposition hearing, but Ryan then takes him aside and urges him to do the right thing and not hurt Dunder Mifflin. Michael agrees and then is left with a terrible conflict. Michael's testimony starts well when he mentions the inappropriate way corporate handled Jan's situation, but his comments about her drinking and about apparent conflicts in statements he made about the nature of their relationship and when it started to cause problems.",
        "When he finds out that Jan has stolen his diary in order to prove the timeline of their relationship, Michael is extremely upset. Jan points out that he emailed a nude photo of her to the entire company. Toby tries to comfort him, to no avail.",
        "Then, to add insult to injury, Dunder Mifflin's attorney reveals to Michael that Jan gave him a scathing performance review after they had begun dating. In it, she argued that Michael is an unmanageable employee and unfit for his position as branch manager, and should be demoted.",
        "In a last-ditch attempt to win Michael back to her side, Jan has her lawyer read the deposition of David Wallace. From it, Michael, who always felt that he was a front-runner for the job at Corporate, learns that Wallace reluctantly admitted that, while Michael is a nice guy, he was never a serious contender for the job.",
        "But David has shown more consideration to Michael than Jan so, when asked if he believes Dunder Mifflin really showed a pattern of mistreatment to Jan, Michael declares that it did not. He does not hold David's words against him, stating \"You expect to get screwed by your company. But you never expect to get screwed by your girlfriend.\"",
        "Michael and Jan drive home, clearly angry at each other. Jan suggests they pick up some Chinese food. Michael states he'd prefer something cheap, and Jan replies that Chinese is cheap. They agree to fast food."
    ],
    "quotes": [
        [
            {
                "speaker": "Kelly",
                "content": " I don't talk trash, I talk smack. They're totally different. Trash talk is all hypothetical, like, \"Your mom is so fat she can eat the internet.\" But smack talk is happening like right now. Like: \"You're ugly and I know it for a fact so I got the evidence right there.\""
            }
        ],
        [
            {
                "speaker": "(sheepishly watching the pathetic excuse for a match between their trash-talking girlfriends) Jim",
                "content": " Do you wanna go play on the table upstairs?"
            },
            {
                "speaker": "Darryl",
                "content": " Yes!"
            }
        ],
        [
            {
                "speaker": "Lester Schneider",
                "content": " How long have you known Ms. Levinson?"
            },
            {
                "speaker": "Michael",
                "content": " Six years and two months."
            },
            {
                "speaker": "Lester Schneider",
                "content": " And you were directly under her the entire time?"
            },
            {
                "speaker": "Michael",
                "content": " That's what she said."
            },
            {
                "speaker": "Lester Schneider",
                "content": " Excuse me?"
            },
            {
                "speaker": "Michael",
                "content": " That's what she said."
            },
            {
                "speaker": "Lester Schneider",
                "content": " Ms. Levinson told you that she was your direct superior?"
            }
        ],
        [
            {
                "speaker": "Lester Schneider",
                "content": " Can you go back to where this diression began?"
            },
            {
                "speaker": "Stenographer",
                "content": " Mr. Schneider - \"And you were directly under her the entire time?\" Mr. Scott - \"That's what she said.\""
            },
            {
                "speaker": "Michael",
                "content": " Well, delivery's all wrong - butchering it."
            }
        ],
        [
            {
                "speaker": "Diane Kelly",
                "content": " Mr. Scott, who is this other woman...\"Ryan\"?...who you refer to here as...\"Just as hot as Jan, but in a different way\"?"
            },
            {
                "speaker": "Michael",
                "content": " Not a woman - just a cool, great-looking best friend..."
            },
            {
                "speaker": "Lester Schneider",
                "content": " Aren't we trying to determine whether Michael and Jan were engaged in a romantic affair? Not Michael and this Ryan person..."
            },
            {
                "speaker": "Toby",
                "content": " (Laughing, unable to control himself) Excuse me!"
            }
        ]
    ]
}