{
    "season": 4,
    "title": "Did I Stutter?",
    "episode": "16",
    "episodes": [
        16
    ],
    "coldOpens": [
        "Michael puts his face in concrete because he wants his kids to remember him. "
    ],
    "storylines": [
        "When in a meeting Michael tries to persuade Stanley to participate. Stanley doesn't really want to; he just wants to work on his crossword puzzles. After much nagging, Stanley finally interrupts Michael with the phrase, 'Did I stutter?' much to Michael's shock. Michael then leaves the conference room in disbelief and embarrassment. Toby heads into Michael's office trying to convince him to have a talk with Stanley. Toby's efforts fail as Michael claims that he and Stanley were simply joking.",
        "Dwight discovers that Andy is selling his car and decides to buy it from him, after convincing him to lower the price. Pam is shown at reception wearing a pair of glasses instead of her usual contacts. Pam then explains that after spending the night at the house of “a friend”, implied to be Jim, she forgot her contact solution and must use glasses.",
        "Michael walks over to Stanley and tries to make up with him. Stanley explains to the camera that he doesn't apologize unless he thinks that he's wrong.",
        "Ryan shows up to the office in order to give Jim a formal warning regarding his job performance, stating that he spends far too much time pranking Dwight and hanging out at reception rather than selling paper. Jim asks if the warning has to do with his discussion with David Wallace about Ryan’s website, but Ryan immediately becomes defensive. In a talking head, Toby gloats that all of Jim’s time spent talking with Pam has “finally caught up to him”.",
        "Andy discovers that Dwight has put the car that he bought from him for sale on eBay. Dwight feels that he can sell the car for more money and reveals that the car is currently in a three-way bidding war. Kevin tells Pam that he loves her glasses because all the girls he's ever dated have had glasses. After he reveals that glasses and librarians are a turn-on for him, however, Pam decides to sacrifice her good vision by taking her glasses off.",
        "Michael then decides that he can slap some sense into Stanley by fake-firing him, when he does so Stanley threatens to file a lawsuit against him.  Michael tells Stanley that the firing was fake, but that only makes Stanley outraged, telling Michael that he is a professional idiot. Michael is hurt by this and loudly tells Stanley to stop it, he then makes everyone leave the room and has a conversation with Stanley, bluntly telling him that he is his boss and won't be talked to that way. Stanley then agrees that even though he has no respect for Michael, he will not talk to him the way he did anymore. Michael asks Stanley's opinion on a new idea of his, to which Stanley replies \"It has potential to be your best idea yet\"."
    ]
}