{
    "season": 4,
    "title": "Dunder Mifflin Infinity",
    "episode": "3/4",
    "episodes": [
        3,
        4
    ],
    "coldOpens": [
        "Everyone realizes Pam and Jim are in a relationship when Toby sends a notice regarding relationships in the office, after he sees Pam and Jim kiss in the office. Michael says that it will a day remembered in infamy. "
    ],
    "storylines": [
        "Toby sees Jim and Pam kiss secretly in the break room, and fires off an unsolicited memo warning about public displays of affection within the office. The entire office immediately speculates on the reason for the notice. Toby (whose crush on Pam has been previously established) tells everyone it's because of Jim and Pam, apparently in an attempt to shame them. This effectively forces them to confirm their relationship, and to Toby's surprise, all of the other workers are ecstatic. Jim and Pam later ask Toby whether they need to file the same paperwork Michael and Jan once had, but Toby tries to put it off, hoping the relationship won't last.",
        "Ryan Howard returns to the Scranton branch of Dunder Mifflin for the first time since his promotion, sporting a much more urbane look and attitude (which does not prevent him from receiving a noogie from Kevin). He convenes a meeting to inform the staff about \"Dunder Mifflin Infinity,\" his initiative to revitalize the company with new technology. Michael is initially excited about the prospect of getting a BlackBerry, but is warned by Creed that the purpose of the program is really to get rid of older workers.",
        "Kelly tries to restart her relationship with Ryan, an effort he ignores until she (untruly) tells him she's pregnant. He agrees to discuss the situation over dinner that night. Jim informs Pam that Dwight and Angela are secretly dating, only to discover that she has known this for quite some time. Meanwhile, Dwight attempts to make amends for the death of Angela's cat Sprinkles by giving her a stray cat he found in his barn. Dwight's cousin Mose named the cat Garbage because that's what it eats. Angela rejects the gift, and Dwight attempts to dump the cat into the office of Vance Refrigeration.",
        "Creed dyes his hair jet-black (using ink cartridges) in an attempt to convince everyone that he's much younger. After a conversation with Jan, Michael decides to formally challenge Dunder Mifflin Infinity by claiming that Ryan is being ageist. Michael brings the octogenarian co-founder of Dunder Mifflin into a meeting to make his point about old things still being useful, but shoves Dunder out after tiring of his rambling stories. Angela asks Dwight out to dinner, where she breaks up with him, saying that she can't look into Dwight's eyes without seeing Sprinkles' corpse.",
        "To show that personal interaction is more effective than new technology, Michael decides to go out and win back the clients they lost in the past year with gift baskets. Dwight insists on going with him. Each manager they encounter refuses to consider returning to Dunder Mifflin unless the company improves its technology.",
        "Michael misinterprets his rental car's GPS map system's directions and ends up driving into Lake Scranton. He takes this as further proof that new technology is useless because it \"tried to kill him\". After the lake incident, he and Dwight walk back to one of the former clients to awkwardly get back their gift basket, causing a scene.",
        "Ryan learned during the previous night's dinner that Kelly's pregnancy claim was a lie. Back at the office, Ryan asks Pam to create a logo for Dunder Mifflin Infinity. Pam is excited about the opportunity to use her art background, but Ryan uses the logo as an excuse to ask her out, which he does in front of Jim. Pam responds that she's dating Jim, which leaves the new boss thoroughly embarrassed."
    ],
    "quotes": [
        [
            {
                "speaker": "Michael",
                "content": " We had a foreign exchange student live with us when I was young. And we called him my brother. And that's who I thought he was. Um, then he went home to what is now formerly Yugoslavia, taking all of my blue jeans with him. And I had to spend the entire winter in shorts. That is what Ryan is like. A fake brother who steals your jeans.  Michael: Where are the turtles? Where? WHERE ARE THE TURTLES? WHERE ARE THEY? Michael : I drove my car into a ******* lake."
            }
        ],
        [
            {
                "speaker": "Dwight Schrute",
                "content": " I'm gonna live for a very long time. My grandma Schrute lived to be 101. My grandpa Manheim, he's 103. He's still puttering down in Argentina. I tried to go visit him once, but my travel visa was protested by the Shoah Foundation."
            }
        ]
    ]
}