{
    "season": 4,
    "title": "Money",
    "episode": "7/8",
    "episodes": [
        7,
        8
    ],
    "coldOpens": [
        "Michael treats Pam like Meryl Streep's character in Devil Wears Prada and apologizes when he finishes the movie. However, when he uses a term from Million Dollar Baby, Pam thinks Michael is going to try to kill her. "
    ],
    "storylines": [
        "The episode begins with a conversation between Pam and Michael, explaining that Michael receives his films from Netflix and while watching The Devil Wears Prada, he decides to act out that whole movie in the office as Meryl Streep which includes throwing his coat at Pam and yelling for his steak when he is at his desk. When he finishes the movie, he apologizes for his behavior, and references his newest rental, Million Dollar Baby.",
        "Michael and Jan sit in Michael's office talking about renovating their condo, not able to decide which type of flooring they want. When Jan leaves, it is revealed that she still has not gotten a job and that Michael had to trade in his car to buy her a Porsche.",
        "Jim discovers that Dwight and Mose are now running Schrute Farms as a Bed and Breakfast. Jim and Pam decide to spend the night there, finding the operation even stranger than they had imagined. They take part in Dwight and Mose's table-making demonstration, watch Mose produce wine from beets, and even have Dwight read Harry Potter as a bedtime story. Jim also begins to recognize the extent of Dwight's depression over the loss of Angela.",
        "Michael begins leaving the office early, refusing to explain his reasons to Pam (and telling Jan that he's taking a nighttime improv class). It is revealed that Michael has loads of debt and had to get a second job as a telemarketer, taking the bus there immediately after leaving Dunder Mifflin. There, he works until 1 A.M. In one instance, he calls a \"Mr. Hudson.\" It turns out to be Stanley from Dunder Mifflin, who recognizes his voice (but assumes it's a joke).",
        "Ryan arrives at the office to supervise Michael's first PowerPoint presentation. However, Michael is unprepared. In the process of defending himself, he inadvertently acknowledges that he has taken a second job. As Michael's lack of being prepared for the presentation is seemingly a result of his second job, Ryan orders Michael to quit the other job or face termination. Michael reluctantly agrees.",
        "During the meeting, it is revealed that Kelly is dating Darryl. The relationship turns out to be quite dysfunctional, as Kelly is mainly concerned with making Ryan jealous. Darryl realizes this, but finds that Kelly's scheming actually turns him on. Kelly, on the other hand, is perplexed by the fact that Darryl never seems to have any hidden agenda, but always means exactly what he says.",
        "After Michael devises some desperate schemes to come up with more money, Creed encourages him to just declare bankruptcy. Unaware of what that entails, Michael takes the advice literally and announces \"I declare bankruptcy!\" to the office, thinking that is all that is required. Seeing Michael's desperation, Oscar agrees to look over his financial situation and finds that he spends a lot of money on stuff \"no one ever, ever needs\" such as a core blaster extreme exercise machine, professional bass fishing equpiment, and multiple magic sets.",
        "Oscar convinces Michael to discuss the situation with Jan over the phone, but she immediately harangues Michael about being irresponsible. In the middle of her diatribe, Michael runs out of the office in a failed attempt to hop a train. Jan arrives and attempts to console Michael, saying she appreciates the fact that he was there for her when she was fired. Michael fails to confront Jan about her role in his financial problems, and insists that his lack of money is no reason to have her breast augmentation reversed.",
        "Andy gives Angela a cat he discovered in the Vance Refrigeration office as part of his continuing effort to court her. It is the same cat, named Garbage, Dwight unsuccessfully tried to give her (in Dunder Mifflin Infinity) to make amends for his mercy killing of her cat Sprinkles. This time it works, and she gives Andy permission to ask her to dinner, with several provisos about what they will be eating. After seeing this exchange, Dwight sits alone in the stairway of Dunder Mifflin, crushed. Jim attempts to console Dwight, relaying that the pain of his own rebuffed affection for Pam is what caused him to leave for Stamford, and was so awful that \"it is something that I wouldn't wish on my worst enemy -- and that includes you\". On his way back into the office, Jim spends a last moment remembering how much he'd suffered when he couldn't be with Pam. He shakes it off and walks over to passionately kiss her in full view of everyone. Though surprised, Pam responds without a moment's hesitation, and then they discuss eating Italian food for dinner. In an interview Pam says coyly that Jim is passionate about Italian food. Jim responds in his own interview that he is in love with Italian food, implying that he's actually in love with Pam. Soon after, seemingly aided by Jim's outreach, Dwight returns to his desk and resumes his more typical, obnoxious behavior. He silently pushes away Jim's work materials that have started to encroach on his desk and makes a sales call. Jim and Pam share a poignant smile, knowing that they have helped Dwight get over Angela."
    ],
    "quotes": [
        [
            {
                "speaker": "Dwight",
                "content": " My girlfriend and I broke up recently. And I must say, I am relieved. Gives me a chance to sow my wild oats. In the Schrute family, we have a tradition, where when the male has sex with another woman, he is rewarded with a bag of wild oats left on his door step by his parents. You can use these oats to make oatmeal, bread, whatever you want. I don't care, they're your oats."
            }
        ],
        [
            {
                "speaker": "Jim",
                "content": " You know, I just realized, this is Pam's and my first night away together. I used to play it over in my head, and...it was just a little bit different. Maybe a nice hotel, or, a romantic dinner, wine...um, but wine that wasn't made out of beets...didn't think Dwight would be involved at all, and, uh, I always imagined less manure - I mean, some manure, just...less."
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " Is Mr. Hudson there?"
            }
        ],
        [
            {
                "speaker": "\"Mr. Hudson\"",
                "content": " Yeah, who is this?"
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " I'm just calling because you responded positively to..."
            }
        ],
        [
            {
                "speaker": "\"Mr. Hudson\"",
                "content": " Michael?!"
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " Stanley?"
            }
        ],
        [
            {
                "speaker": "Stanley",
                "content": " Why are you calling me here at home?!"
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " (in a faux-Hispanic accent) Senor, are you happy with your long-distance..."
            }
        ],
        [
            {
                "speaker": "Stanley",
                "content": " Michael, I know that's you - why are you calling me here at home?"
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " (in a faux-Indian accent) Have you cons...have you considered satellite television..."
            }
        ],
        [
            {
                "speaker": "Stanley",
                "content": " Michael, I know that's you - I know your voice. Why are you calling me here at home?!?!"
            }
        ],
        [
            {
                "speaker": "Stanley",
                "content": " When I'm at home at night in my own house, in my sweats, drinkin' some red wine, watchin' my mystery stories, the last thing in the whole godforsaken world I wanna hear is the voice of Michael Scott!"
            }
        ],
        [
            {
                "speaker": "Pam",
                "content": " Now that I think about it, Angela and Andy might actually make a good couple. But I couldn't do that to Dwight...or Angela......or Andy."
            }
        ],
        [
            {
                "speaker": "Jim",
                "content": " Did I ever tell you why I left Scranton?...Yeah, I didn't think I had...Well, it was all about Pam...I mean, she was with Roy, and, uh, I just couldn't take it. I mean, I lost it, Dwight - I couldn't sleep, I couldn't concentrate on anything...even weird stuff, like, food had no taste. So my solution was to move away. It was awful...and it is something that I wouldn't wish on my worst enemy - and that includes you."
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " I...declare......BANKRUPTCY!"
            }
        ]
    ]
}