{
    "season": 4,
    "title": "Local Ad",
    "episode": "9",
    "episodes": [
        9
    ],
    "coldOpens": [
        "Michael tries to get ideas from a local ad and Andy is angry when he can't remember a rhyme from a commercial. However, Jim tells everyone not to tell him. Jim explains that a local ad is great because no one knows what Dunder Mifflin is. "
    ],
    "storylines": [
        "Dunder Mifflin's corporate office has hired advertising consultants to create a television commercial. Michael is excited by the opportunity to exhibit creativity, but then dismisses the consultants when it’s revealed that his input will be limited to the final five seconds of the commercial, when the branch staff are shown waving at the camera. Corporate accepts Michael’s offer to fund and film his own, alternative commercial by the next day, with the proviso that, if they don't like it better, they'll use the consultants' version.",
        "Pam, who is taking a computer animation class, makes an animated logo for the commercial. Phyllis tries to enlist author Sue Grafton, who is appearing at a book signing at the local mall to appear in the ad. Phyllis later cries after Grafton refuses their offer.",
        "Andy struggles throughout the episode to recall the product name from the famous \"Break Me Off a Piece of that Kit Kat Bar\" ad campaign, substituting the final three syllables with the guesses \"applesauce\", \"Chrysler car\", and \"football cream.\"",
        "Headed by Darryl, a group of employees writes a jingle for the commercial, which is rejected by Michael. The singers include Kelly, Andy, Creed and Kevin. Darryl plays keyboards for the demo they do for Michael, and Michael's rejection hurts Darryl, as we see when he sadly trudges out of the office with the instrument.",
        "Dwight has largely removed himself to the virtual world of Second Life, but has become Andy’s confidante regarding his relationship with Angela. This is initially painful for him, until Andy confides that, during a makeout session, Angela said, \"Oh, D!\"; it was the first response he has gotten from their physical contact. While Andy interprets this as the second syllable of his name, Dwight is delighted, because Angela used to call him \"D.\"",
        "The office gathers at a local bar, Poor Richard's, to watch the commercial. Although corporate has rejected Michael’s version of the commercial and aired the original, Jim slips the bartender a DVD of Michael's version, calling it a \"Director's Cut.\" The positive response from the employees and others at the bar cheers Michael up, who later buys all of them another round of drinks."
    ],
    "quotes": [
        [
            {
                "speaker": "Dwight",
                "content": " I signed up for Second Life about a year ago. Back then my life was so great that I literally wanted a second one. In my Second Life I was also a paper salesman and I was also named Dwight. Absolutely everything was the same. Except I could fly."
            }
        ],
        [
            {
                "speaker": "Pam",
                "content": " I worked until about 2:45 AM, and then I had to decide if I wanted to spend the night with Michael editing in his office, and Dwight watching Michael edit in his office, or drive home and probably fall asleep at the wheel and die in a fiery car wreck - I passed out on my keyboard trying do decide."
            }
        ]
    ]
}