{
    "season": 5,
    "title": "Prince Family Paper",
    "episode": "13",
    "episodes": [
        13
    ],
    "coldOpens": [
        "Dwight looks for the source of the red wire coming from his computer."
    ],
    "storylines": [
        "CFO David Wallace enlists Michael to report on the success of a small family-owned local paper competitor named Prince Paper (company) as he wishes to expand the company. Michael brings Dwight along to help gather information. Michael goes to the owner as a potential customer under his alias \"Michael Scarn\" while Dwight goes in as himself requesting a job. Michael succeeds in getting the customer list from the already struggling family business, run by a Vietnam War veteran. They use the client list as a reference for future sales and he and Dwight leave victorious. However, Michael breaks the bumper off his car trying to get out of the parking space, which catches the attention of the Prince family. They come out to help fix the bumper as much as they can as Michael watches. Michael is visibly moved by their kindness and has a change of heart regarding giving the customer list to Wallace, while Dwight remains unmoved.",
        "Back at the office, Dwight tries to convince Michael that he can't let his heart get in the way of business. Michael obliges to send the list to Wallace, but not before he tries to escape back to Prince Paper to give them back the list. Dwight manages to chase Michael down and take the list from him, causing him to finally give in. David Wallace calls Michael to congratulate him on getting him the list. Michael then explains he feels \"bittersweet\" about the ordeal, bitter because he potentially ruined a decent family, and sweet because he satisfied Wallace, and afterward claiming that as the reason for not liking bittersweet chocolate.",
        "Meanwhile, the rest of the office start arguing over whether or not Hilary Swank is hot. Half of the office say she is while the other half say she isn't. The argument gets heated at various points. Jim temporarily convinces Kevin to say she is by having him imagine Hilary kissing him, only to have him switch back when he says the debate is whether or not she is hot, not if he would have sex with her. Angela, initially reluctant to join the debate, takes the \"hot\" side stating Kevin deserves to lose for saying that he thought it would be revealed in Boys Don't Cry that Hilary was actually a male.",
        "Kelly gets emotional when Toby says she isn't, making Kelly feel like she herself is not hot. Pam claims they shouldn't let the Kevins of the world decide who is hot or not, mentioning that they don't give Kevin full internet access. Oscar is seen in the board room giving an overhead presentation about the structure of Hilary Swank's facial features, ending by saying, \"not hot\". Stanley gives an uncharacteristically inspiring speech on how hot she is. At the end of the debate the sides are still tied, with Oscar noting there isn't much of a point to debating as people would still stay on their sides. At the end of the episode, Michael, oblivious of their debate, looks at photos of Hilary on the wall, saying she's hot, apparently casting the deciding vote."
    ],
    "quotes": [
        [
            {
                "speaker": "Stanley",
                "content": " What difference does it make - attractive, hot, beautiful? We're talking about the same thing here!"
            },
            {
                "speaker": "Kevin",
                "content": " Huge difference - a painting can be beautiful, but I don't want to bang a painting!"
            }
        ],
        [
            {
                "speaker": "Kevin",
                "content": " Ladies and gentlemen...Even though the penis was fake, I kept expecting a second plot twist, where we found out that Hillary Swank actually was a boy!"
            },
            {
                "speaker": "Pam",
                "content": " Kevin!"
            },
            {
                "speaker": "Angela",
                "content": " OK, I wasn't gonna dignify this discussion by getting involved...And I don't even get the discussion - \"hot\" is a temperature, people!...But, Kevin deserves to lose for what he said...so yes, she's hot - she's hot as heck. She's a female Boris Becker!"
            }
        ],
        [
            {
                "speaker": "Kelly",
                "content": " No, no, no. Shes hot, okay? Because if you are saying Hillary Swank isn't hot, then you are saying that I am not hot. Because obviously I am not as hot as Hillary Swank! [runs away in tears]"
            }
        ],
        [
            {
                "speaker": "Pam",
                "content": " Ladies, are we prepared to let the Kevins of the world decide anything for us? Anything at all? We don't even give him full internet access!"
            },
            {
                "speaker": "Kevin",
                "content": " Wait...what?!?!?!"
            }
        ],
        [
            {
                "speaker": "Stanley",
                "content": " I, am trying to be more...optimistic in life. I've got, what - 20, 30 more years left - and my family history says I have less. Now the old Stanley Hudson would've found something to complain about with this actress...But that's no way to live life! Look...at this healthy, sexy, pretty, strong young woman. Come on, people! She...is...hot."
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " So when, uh, when did you set up shop."
            }
        ],
        [
            {
                "speaker": "Roger Prince",
                "content": " Ah I opened this place after I came back from Vietnam."
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " Ooh, Vietnam. I hear it's lovely."
            }
        ],
        [
            {
                "speaker": "Roger Prince",
                "content": " [long pause] Mmm-hmm."
            }
        ]
    ]
}