{
    "season": 5,
    "title": "Moroccan Christmas",
    "episode": "11",
    "episodes": [
        11
    ],
    "coldOpens": [
        "Jim wrapped up many presents for Dwight."
    ],
    "storylines": [
        "Phyllis throws a Moroccan-themed Christmas party, her first Christmas party as head of the Party Planning Committee. Alcohol is served at the party, of which Meredith takes full advantage - she gets so intoxicated that she accidentally sets her hair on fire while she is dancing around. Dwight puts out the fire with an extinguisher and the party comes to a halt. Michael then stages an intervention by gathering everyone in a circle to discuss how Meredith's alcoholism affects them. When Meredith continues to deny her alcoholism, the rest of the office find it best to go back to the party. Michael then talks with Meredith in his office before leaving the building. Meredith is told by Michael that they are going to a bar, but he actually takes her to a rehabilitation center. When Meredith sees this, she tries to escape, but Michael grabs her and drags her into the center. However, Michael learns that the staff will not check anyone in against their will, so he and Meredith leave and head back to the office.",
        "Dwight has been performing research to determine what will be the most popular toy of the current Christmas season: a doll named \"Princess Unicorn\", which is (as the name implies) a princess with a unicorn horn on its head. Dwight has bought every doll he could find in the local toy stores and explains he is going to sell the dolls to desperate parents for an enormous profit. Jim is skeptical that people would pay a high price for a doll, but he watches numerous customers come in throughout the day to purchase a doll from Dwight, all paying his asking price of $200. Toby wants to buy a doll for his daughter, Sasha, so he can be the hero this Christmas, which would irritate his ex-wife. When he goes to Dwight to purchase one, he finds that Darryl has already purchased the last one. Toby begs Darryl to the verge of tears, and Darryl offers to sell it to him for twice the price. Toby tells him that he doesn't have the money with him, but Darryl allows him to pay him back later, and Toby becomes visibly happy. He is, however, slightly shocked when the doll he gets from Darryl is a black version of the doll, but he decides not to complain.",
        "Throughout the day, Phyllis continues to order Angela to do various tasks for the party, such as preparing a plate of bread and hummus during Michael's intervention, or putting away her Nativity scene and removing the Christmas tree (as neither of those are in the theme of Moroccan Christmas). When Phyllis tells Angela to bring back the Christmas tree after Michael and Meredith leave, Angela refuses, telling Phyllis that she will no longer fulfill Phyllis' demands. Phyllis threatens to inform everyone of Angela's affair with Dwight, but Angela still refuses, as Phyllis would no longer be head of the Party Planning Committee if she did. As Phyllis despondently heads toward the door, she suddenly turns around and announces to the office that Angela is having an affair with Dwight, much to everyone's shock. Angela is visibly upset while Dwight is visibly amused. Pam claims that she knew it all along, which Jim initially doubts, but then decides to believe her in the spirit of Christmas. Andy, however, was absent for Phyllis' announcement, having been in the annex teaching himself to play a sitar. At the end of the episode, he returns to the party to play \"Deck the Halls\" for Angela on the sitar, before she asks him to take her home. The rest of the office decide not to reveal the secret to Andy."
    ],
    "quotes": [
        [
            {
                "speaker": "Andy",
                "content": " When I was in college I used to get wicked hammered. My nickname was puke. I would chug a fifth of socos, sneak into a frat party, polish off a few people's empties, some brewskies, some Jell-O shots, do some body shots off myself, pass out, wake up the next morning, boot, rally, more soco, head to class. Probably would have gotten expelled if I had let it affect my grades, but I aced all my courses. They called me Ace. It was totally awesome. Got straight B's. They called me Buzz."
            }
        ],
        [
            {
                "speaker": "Phyllis",
                "content": " So, this is the first Christmas party I'm planning as Head of the Party Planning Committee. The theme is \"Nights in Morocco.\" It's not your grandmother's Christmas party. That is, of course, if she's from Morocco. Then it would be very accurate."
            }
        ],
        [
            {
                "speaker": "Dwight",
                "content": " (After making a big profit selling dolls) Fa La Fa La La La La KA-CHING!"
            }
        ]
    ]
}