{
    "season": 5,
    "title": "Stress Relief",
    "episode": "14/15",
    "episodes": [
        14,
        15
    ],
    "coldOpens": [
        "Dwight sets up a fire test for the preparedness of a fire drill."
    ],
    "storylines": [
        "Dwight tries to teach fire safety by example, forcing all the doors closed and disabling the phones before setting a fire in an office trash can with a cigarette. He then says, \"today smoking will save lives.\" He returns to his desk and tries to draw attention to the smoke, asking if anyone “smells anything smoky in here?” People don't believe him at first but he clears his throat and Pam notices the smoke. During the subsequent panic, the copy machine is destroyed, Michael smashes a window to call for help and Kevin takes advantage of the havoc to raid the snack machine. Stanley collapses from a heart attack immediately following Dwight’s announcement that the whole thing was a drill. Michael, against the advice of his coworkers, tries to give CPR to an unconscious Stanley, but instead he shoves a wallet in his mouth.",
        "As Dwight's actions could have burned down the building or killed Stanley, Corporate is not amused. Michael and Dwight are called on the carpet in New York, Michael to be reminded of his responsibilities to his subordinates and Dwight to be warned that he is subject to being fired. On the drive back home, Michael revokes Dwight’s status as safety advisor. Back in Scranton, because he hadn't had any idea how to give first aid to Stanley, Michael has the American Red Cross send over an instructor (and most importantly a dummy) to teach CPR. Dwight pouts, Andy sings, and naturally no one learns anything except the lyrics to The Bee Gee's song \"Stayin' Alive\" - and that Dwight looked very realistic wearing the face of the dummy a la “Silence of the Lambs”. Most importantly, Dwight takes the scenario far too seriously and mutilates the dummy to “harvest the organs.” CFO David Wallace and Corporate HR Kendall, upset that Dwight's mutilating the dummy cost the company $3500, requires Dwight to apologize to his co-workers and get their acknowledgement of his apology in writing. Michael signs the apology without much thought, but the rest of Dwight’s coworkers refuse; everyone except Phyllis is tricked into signing the sheet, mistaking it for an attendance sheet (Phyllis only signs when Dwight has a fake delivery sent to her.)",
        "Michael tries a number of ways to get his employees to unwind, like soft music and meditation, before discovering that he is the number one cause of stress at work. So that people won't feel afraid of him, he insists on a no-holds-barred roast of himself. He actually thought that each speaker would also express love for him, so while the employees had a great time, Michael ends up with his feelings hurt. Later, after taking a \"Personnel Day,\" he recovers and conducts a mini-roast of his employees - initially making them somewhat uncomfortable, before Stanley bursts into laughter about his joke and the rest of the office jumps in.",
        "While all of this has been going on, Andy is convinced that Jim and Pam are film gurus because they are talking about Pam's parents as the three watch a pirated movie, but Andy thinks they're talking about the movie—and by chance, it sounds like it. The episode features movie stars Jack Black, Cloris Leachman, and Jessica Alba in the film, Mrs. Albert Hannaday, which features what some would consider a taboo subject, a love triangle with a \"May - late-December\" relationship. Andy does not know that Jim and Pam were actually discussing Pam's mother and father's deteriorating relationship. Pam's father stays with Pam and Jim for several days. Pam asks Jim to talk to her father and see if her dad will tell Jim what is wrong with his relationship with Pam's mother. After the two men talk her father says he is going to get his own apartment. Jim has no idea what he could have said to make Pam's father leave her mother for good. Later Pam is stunned by revelations on two fronts: 1) that Jim has been deeply in love with her since the beginning and 2) that her father never felt a deep emotion for her mother - Mr. Beesly realized the latter after hearing the former from the heart, and that was what Jim had said. In a talking heads interview, Pam says that although most children expect their parents to be soulmates, Pam and Jim’s children “will be right about that.” She also says that love affairs and relationships look different from the outside, which is overhead by a frustrated Andy, who (once again) believes she is talking about the film they watched and decides he is not fit to be a movie critic."
    ],
    "quotes": [
        [
            {
                "speaker": "Dwight",
                "content": " Today, smoking is going to save lives."
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " Nobody should have to go to work thinking, \"Oh, this is the place that I might die today.\" That's what a hospital is for. An office is for not dying. An office is a place to live life to the fullest, to the max, to... An office is a place where dreams come true."
            }
        ],
        [
            {
                "speaker": "Stanley",
                "content": " It's true - around this office in the past, I have been a little, abrupt with people, (clips from various episodes back him up)...but the doctor said, if I can't find a new way to relate more positively to my surroundings, I'm going to die."
            }
        ],
        [
            {
                "speaker": "Andy",
                "content": " A throne for Your Highness!"
            },
            {
                "speaker": "Stanley",
                "content": " I'm not sittin' in a wheelchair."
            },
            {
                "speaker": "Michael",
                "content": " No debate - you are going to sit in that wheelchair until you are back on your feet..."
            },
            {
                "speaker": "Stanley",
                "content": " I'm going to die."
            }
        ],
        [
            {
                "speaker": "Pam",
                "content": " We don't normally download films illegally...because, we're honest, hard-working people..."
            },
            {
                "speaker": "Jim",
                "content": " ...And we don't know how."
            },
            {
                "speaker": "Pam",
                "content": " But, Andy does, so we have to watch it with him."
            },
            {
                "speaker": "Jim",
                "content": " Punishment fits the crime."
            }
        ],
        [
            {
                "speaker": "Kevin",
                "content": " Michael, I think you're what's stressing everybody out!"
            }
        ],
        [
            {
                "speaker": "Pam",
                "content": " What could Jim have said to make my dad wanna leave my mom? And at what point in our marriage is he gonna say it to me?!"
            }
        ],
        [
            {
                "speaker": "Oscar",
                "content": " I consider myself a good person......But I'm gonna try to make him cry."
            }
        ],
        [
            {
                "speaker": "Meredith",
                "content": " Michael, you are the reason I drink...you are the reason I live to forget."
            }
        ],
        [
            {
                "speaker": "Dwight",
                "content": " It's very unusual for Michael not to show up to work. My guess? He's either deeply depressed, or an icicle has snapped off his roof and impaled his brain...He has this terrible habit of standing directly underneath them, and staring up at them - and I always say, \"Michael, take two steps back, and stare at them from the side!\", and he's like, \"No, I like the way they look standing directly underneath them!\"...It was only a matter of time."
            }
        ],
        [
            {
                "speaker": "Jim",
                "content": " So what'd he say...was it my fault?"
            },
            {
                "speaker": "Pam",
                "content": " Yeah...He said that you...told him how much you love me...about how you feel when I walk in a room, and...about how you've never for a second that I'm the woman you want to spend the rest of your life with...I guess he's never felt that with my mom, even at their best."
            }
        ],
        [
            {
                "speaker": "Pam",
                "content": " When you're a kid, you assume your parents are soulmates - my kids are gonna be right about that...I guess it also means that, sometimes, love affairs look different to the people inside them."
            }
        ],
        [
            {
                "speaker": "Andy",
                "content": " (singing during Michael's roast) What I hate about you, you really suck as a boss, you're the laziest, jerkiest and you're dumber than applesauce. We're stuck listening to you all day, Stanley tried to die just to get away, heeey, well it's true. That's what I hate about you. That's what I hate about you."
            }
        ],
        [
            {
                "speaker": "Dwight",
                "content": " Last week I gave a fire safety talk. [clears throat] And nobody paid any attention. It's my own fault for using PowerPoint. PowerPoint is boring. People learn in a lot of different ways, but experience is the best teacher. [lights a cigarette] Today, smoking is gonna save lives. [throws cigarette into garbage can filled with paper and lighter fluid]"
            },
            {
                "speaker": "Dwight",
                "content": " [looking around office to see if anyone notices the smoke] Does anyone smell anything smoky?"
            },
            {
                "speaker": "Angela",
                "content": " Did you bring your jerky in again?"
            },
            {
                "speaker": "Pam",
                "content": " [points to smoke] Oh, my God! Uh, Oh my God!"
            },
            {
                "speaker": "Phyllis",
                "content": " What--"
            },
            {
                "speaker": "Andy",
                "content": " Whoa, fire!"
            },
            {
                "speaker": "Dwight",
                "content": " Oh, fire! Oh my goodness! What's the procedure? What do we do, people?"
            },
            {
                "speaker": "Pam",
                "content": " The phones are dead."
            },
            {
                "speaker": "Dwight",
                "content": " Oh, how did that happen?"
            },
            {
                "speaker": "Kevin",
                "content": " It's out in the hall."
            },
            {
                "speaker": "Dwight",
                "content": " No, we don't know that. The smoke could be coming through an air duct."
            },
            {
                "speaker": "Michael",
                "content": " Oh my God! Okay, it happening. Everybody stay calm."
            },
            {
                "speaker": "Dwight",
                "content": " What's the procedure, everyone? What's the procedure?"
            },
            {
                "speaker": "Michael",
                "content": " Stay [bleep] calm!"
            },
            {
                "speaker": "Dwight",
                "content": " Wait, wait, wait."
            },
            {
                "speaker": "Michael",
                "content": " Everyone, now [bleep] calm down!"
            },
            {
                "speaker": "Dwight",
                "content": " No! No, Michael! No! Touch the handle. If it's hot, there could be a fire in the hallway."
            },
            {
                "speaker": "Michael",
                "content": " What does warm mean?"
            },
            {
                "speaker": "Everyone",
                "content": " [groaning] Oh my God."
            },
            {
                "speaker": "Dwight",
                "content": " Not a viable option."
            },
            {
                "speaker": "Pam",
                "content": " Try a different door."
            },
            {
                "speaker": "Dwight",
                "content": " Okay, what's next?"
            },
            {
                "speaker": "Michael",
                "content": " Don't run."
            },
            {
                "speaker": "Dwight",
                "content": " Oh! Here's a door. Check that one out. How's the handle?"
            },
            {
                "speaker": "Andy",
                "content": " It-- it's warm."
            },
            {
                "speaker": "Dwight",
                "content": " Well, uh, another option. [everyone chattering at once]"
            },
            {
                "speaker": "Jim",
                "content": " Back door."
            },
            {
                "speaker": "Dwight",
                "content": " Back to our options. Jeez! Ok! settle down everyone. No bunching!"
            },
            {
                "speaker": "Phyllis",
                "content": " Oh! I forgot my purse."
            },
            {
                "speaker": "Stanley",
                "content": " Leave it woman!"
            },
            {
                "speaker": "Michael",
                "content": " Get out of the way! Go, go, go!"
            },
            {
                "speaker": "Dwight",
                "content": " Things can be replaced, Phyllis! People, human lives, however, can..."
            },
            {
                "speaker": "Oscar",
                "content": " Ah! My hand! That's hot!"
            },
            {
                "speaker": "Andy",
                "content": " Aah! This ones hot too!"
            },
            {
                "speaker": "Michael",
                "content": " Okay, we're trapped. Everyone for himself."
            },
            {
                "speaker": "Dwight",
                "content": " Okay, let's go. Okay, okay."
            },
            {
                "speaker": "Everyone",
                "content": " [shouting] Out of my way! Let's go. Get out of my way!"
            },
            {
                "speaker": "Dwight",
                "content": " Calm, please."
            },
            {
                "speaker": "Andy",
                "content": " Get out of the way!"
            },
            {
                "speaker": "Dwight",
                "content": " Have you ever seen a burn victim?"
            },
            {
                "speaker": "Andy",
                "content": " Move it!"
            },
            {
                "speaker": "Dwight",
                "content": " Okay! Procedure, procedure. Exit options. Where do we go folks? Wha-- Use a what to cover the mouth?"
            },
            {
                "speaker": "Angela",
                "content": " [pulling cat out of filing drawer] It's okay. Shh shhh."
            },
            {
                "speaker": "Dwight",
                "content": " A what? A rag. A damp rag, perhaps. Let's remember those procedures. What are the options? Okay, that's the wrong way. We've already tried that. Remember your exit points. Exit points people."
            },
            {
                "speaker": "Angela",
                "content": " Oscar."
            },
            {
                "speaker": "Dwight",
                "content": " What's next? Huh?"
            },
            {
                "speaker": "Angela",
                "content": " Oscar!"
            },
            {
                "speaker": "Oscar",
                "content": " Stay alive! I'm getting help!"
            },
            {
                "speaker": "Angela",
                "content": " Pull me up!"
            },
            {
                "speaker": "Oscar",
                "content": " You're too heavy!"
            },
            {
                "speaker": "Angela",
                "content": " I only weigh 82 pounds! Save Bandit! [throws cat into air duct and he falls out through the other side] Oh!"
            },
            {
                "speaker": "Dwight",
                "content": " How about 911? Anyone? 911. [Michael throws a chair at the window, Kevin smashes a chair through the vending machine and begins to grab snacks, everyone is shouting.]"
            },
            {
                "speaker": "Pam",
                "content": " What do we do?"
            },
            {
                "speaker": "Dwight",
                "content": " Use the surge of fear and adrenaline to sharpen your decision-making."
            },
            {
                "speaker": "Jim",
                "content": " Okay, I am not dying here. Come on. [everyone is coughing from the smoke, Dwight lights some fire crackers and they start popping]"
            },
            {
                "speaker": "Angela",
                "content": " What is that? What is that?"
            },
            {
                "speaker": "Andy",
                "content": " The fire's shooting at us!"
            },
            {
                "speaker": "Phyllis",
                "content": " What in the name of God is going on?!"
            },
            {
                "speaker": "Andy",
                "content": " Yes! [Dwight pulls fire alarm] Yes, ba-- Yes, battering ram! Battering ram!"
            },
            {
                "speaker": "Phyllis and Creed",
                "content": " Ahhhh!!! [Oscar's leg crashes through the ceiling]"
            },
            {
                "speaker": "Andy",
                "content": " Go, go, go, go, go!! [Andy and Jim ram the door with the copy machine]"
            },
            {
                "speaker": "Michael",
                "content": " [throws the projector out the window] Help!! Help!!"
            },
            {
                "speaker": "Stanley",
                "content": " I'm about to die!"
            },
            {
                "speaker": "Dwight",
                "content": " [blowing air horn] Attention! Employees of Dunder Mifflin! This has been a test of our emergency preparedness. There was no fire. It was only a simulation."
            },
            {
                "speaker": "Jim",
                "content": " What?!"
            },
            {
                "speaker": "Dwight",
                "content": " Fire not real. This was merely a training exercise. [Oscar drops down from the ceiling] So, what have we learned? [Stanley falls to the floor] Oh come on. It's not real Stanley. Don't have a heart attack."
            },
            {
                "speaker": "Michael",
                "content": " No, no, no! You will not die! Stanley! Stanley! You will not die! Stanley! Stanley! Barack is president! You are black, Stanley! I'm gonna give him mouth to mouth."
            },
            {
                "speaker": "Jim",
                "content": " No, no, no! Don't give him mouth to mouth for this!"
            },
            {
                "speaker": "Michael",
                "content": " He's going to swallow is tongue."
            },
            {
                "speaker": "Jim",
                "content": " No. Michael. Michael."
            },
            {
                "speaker": "Michael",
                "content": " Open your mouth. Swal-Don't swallow it!"
            },
            {
                "speaker": "Jim",
                "content": " [everyone shouting at once] Michael! Michael!"
            },
            {
                "speaker": "Michael",
                "content": " I'm fine, leave me al--"
            },
            {
                "speaker": "Andy",
                "content": " You're choking him!"
            },
            {
                "speaker": "Michael",
                "content": " Saving him!"
            }
        ],
        [
            {
                "speaker": "Creed",
                "content": " Give it up, he's dead."
            },
            {
                "speaker": "Jim",
                "content": " He just sent a text..."
            },
            {
                "speaker": "Creed",
                "content": " What's a text?"
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " Well I wrote them down so I wouldn't forget. Jim, you're 6'11 and you weigh 90 pounds, Gumby has a better body than you. Boom. Roasted. Dwight, you're a kiss ass. Boom. Roasted. Pam, you failed art school. Boom. Roasted. Meredith, you've slept with so many guys you're starting to look like one. Boom. Roasted. Kevin, I can't decide between a fat joke and a dumb joke. Boom. Roasted. Creed, you're teeth called, your breath stinks. Boom. Roasted. Angela where's Angela? [Angela raises her hand] Whoa there you are, I didn't see you there behind that grain of rice. Boom. Roasted. Stanley, you crush your wife during sex and your heart sucks. Boom. Roasted. Oscar, you are... [Stanley is laughing] Oscar, you're gay."
            }
        ],
        [
            {
                "speaker": "Oscar",
                "content": " Wow."
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " Andy, Cornell called, they think you suck. And you're gayer than Oscar. Boom. Roasted. [Stanley is still laughing] Alright. Alright everybody, you know I kid, you know I kid. You guys are the reason I went into the paper business, so, uh, goodnight, God bless, God bless America, and get home safe. [clapping and murmurs of appreciation]"
            }
        ],
        [
            {
                "speaker": "Jim",
                "content": " So what did he say? Was it my fault?"
            },
            {
                "speaker": "Pam",
                "content": " Yeah. He said that you told him how much you love me. About how you feel when I walk in a room, and about how, you've never doubted for a second that I'm the woman you want to spend the rest of your life with. I guess he's never felt that with my mom, even at their best."
            }
        ]
    ]
}