{
    "season": 5,
    "title": "Lecture Circuit Part 2",
    "episode": "17",
    "episodes": [
        17
    ],
    "coldOpens": [
        "Recap of main events in the previous episode."
    ],
    "storylines": [
        "Michael and Pam head to the Nashua branch to give a presentation, as well as having Michael find closure with Holly. When they arrive at the branch, they find that Holly is away on an HR retreat. They also learn that she is dating one of the salesmen there named A.J., which deeply upsets Michael.",
        "Michael finds himself unable to give the presentation after hearing that news. Pam empathizes with Michael saying she felt the same way when Jim was dating Karen, but she kept her composure. She encourages Michael to do the best presentation possible so that people will tell Holly about it.",
        "They then go do their presentation, which starts off well, until Michael calls out A.J. about his relationship with Holly. Michael then leaves the room deeply upset, leaving Pam to do the rest of the presentation using Michael's techniques, which fails. Michael goes to Holly's desk and cuts off a sleeve of her sweater and puts it in his pocket. He looks at her computer and finds a file entitled \"Dear Michael\", which he copies to his flash drive. Later, at a diner, Michael tells Pam what he did and Pam says it was not a good idea to copy the file and that he should not read it, given that he would be violating her trust. Pam, however, volunteers to read it, and deletes it afterward. She says that the letter said that Holly still has feelings for Michael and that it's not over. Michael becomes happy and feels like he has found closure.",
        "Back in Scranton, Jim picks up a blank cake for Kelly, and later decorates it with her name spelled incorrectly. Dwight tries to find out why Kelly was in juvenile hall. Kelly explains that it was because her boyfriend at the time dumped her and she responded by stealing his father's boat. Kelly gets mad at Jim and Dwight for not having a theme.",
        "Jim and Dwight then wonder what Kelly's favorite things are so they can make a theme out of it. When the party starts, Jim and Dwight give Kelly the option of either watching TV for an hour or taking a nap for an hour. Kelly says she loves the theme and decides to take a nap in the conference room for an hour. Jim and Dwight enjoy the ice cream cake at the reception couch, on which Dwight compliments him for getting.",
        "Angela comes in happier than usual because she bought a new cat for $7,000 with the money she received from selling her engagement ring from Andy. Kevin and Oscar are annoyed with the fact that Angela set a nanny cam up at her home so she can monitor them from work. Angela becomes rather distressed when one of her cats (Mister Ash) tries to have sex with her new cat (Princess Lady), while Kevin, Oscar, Meredith, and Creed find it funny. She goes home to check on them but leaves the nanny cam on and Kevin and Oscar become disgusted at the image of Angela licking her cat on the monitor. Angela comes back to work and coughs up a cat hair, which is an image that Oscar claims will disturb him for the rest of his life."
    ],
    "quotes": [
        [
            {
                "speaker": "Angela",
                "content": " I am proud to announce that there is a new addition to the Martin family. She's hypoallergenic. She doesn't struggle when you try to dress her. She's a third-generation show cat. Her father was in 'Meet the Parents.' Needless to say, she was very, very expensive."
            }
        ],
        [
            {
                "speaker": "Dwight",
                "content": " (from another room) What did you do?!"
            },
            {
                "speaker": "Kelly",
                "content": " Stop yelling at me!"
            },
            {
                "speaker": "Dwight",
                "content": " What did you do?!"
            },
            {
                "speaker": "Kelly",
                "content": " I didn't do anything!"
            },
            {
                "speaker": "Dwight",
                "content": "  What did you learn in there? I bet you learned something there, like how to fashion a sieve. Hmm?"
            },
            {
                "speaker": "Jim",
                "content": " Hey, what the hell's going on?"
            },
            {
                "speaker": "Dwight",
                "content": "  Why don't you tell Jim where you were from ages 14 to 15.."
            },
            {
                "speaker": "Kelly",
                "content": " I was kicking it."
            },
            {
                "speaker": "Dwight",
                "content": " In juvie."
            },
            {
                "speaker": "Jim",
                "content": " What?"
            },
            {
                "speaker": "Dwight",
                "content": " Juvie... nile detention center? where they send teenagers."
            },
            {
                "speaker": "Jim",
                "content": " Yep."
            },
            {
                "speaker": "Dwight",
                "content": " For reha-"
            },
            {
                "speaker": "Jim",
                "content": " Got it."
            },
            {
                "speaker": "Dwight",
                "content": " What did you do? Huh?"
            },
            {
                "speaker": "Jim",
                "content": " Hey, Dwight, sounds like she was 14, so maybe we wanna go a little easy."
            },
            {
                "speaker": "Dwight",
                "content": " Yeah, if she's old enough to get married, she's old enough to follow the law. [to Kelly] What did you do?"
            },
            {
                "speaker": "Kelly",
                "content": "My boyfriend dumped me, so, I stole his boat. I mean, he told me it was his boat. It was actually his father's. And I just thought it'd be really romantic, like \"Thelma and Louise\", but with, like, a boat. And it was the worst year of my life. And I can't believe that you guys are making me talk about this on my birthday!"
            },
            {
                "speaker": "Dwight",
                "content": " I thought you said yesterday was your birthday!"
            },
            {
                "speaker": "Jim",
                "content": " Hey, you know what? I got you a cake."
            },
            {
                "speaker": "Kelly",
                "content": " Really? I want to see the cake."
            },
            {
                "content": "(we now cut to the kitchen area. Inside are Jim, Dwight, Kelly, and Phyllis. Jim shows a plain cake without flowers and her name.)"
            },
            {
                "speaker": "Jim",
                "content": " And, ta-da."
            }
        ],
        [
            {
                "speaker": "Kelly",
                "content": " I hate it."
            },
            {
                "speaker": "Jim",
                "content": "How do you hate it? It's a cake."
            },
            {
                "speaker": "Kelly",
                "content": "Well, there's no flowers... or toys... or--- I mean, there's nothing on it. Where did you even find a cake like this? I mean, it doesn't have my name on it! Do you guys know what my name is? My name is Kelly!"
            },
            {
                "speaker": "Jim",
                "content": " Right. (in confessional) I forgot if there was an \"e\" between the \"l\" and the \"y.\" I still don't know."
            }
        ],
        [
            {
                "speaker": "Kelly",
                "content": " I mean, I don't even know what the theme is. What's the theme?!"
            },
            {
                "speaker": "Dwight",
                "content": " Frosting."
            },
            {
                "speaker": "Jim",
                "content": " Birthday."
            },
            {
                "speaker": "Kelly",
                "content": " Those aren't... themes. There's always a theme. [walks out]."
            },
            {
                "speaker": "Phyllis",
                "content": " There's always a theme."
            },
            {
                "speaker": "Dwight",
                "content": " Nice job on the cake, Bozo!"
            },
            {
                "speaker": "Jim",
                "content": " OK. You know what? Next time, I'll let you get the cake, and I get to scream at the birthday girl."
            }
        ]
    ]
}