{
    "season": 5,
    "title": "The Surplus",
    "episode": "10",
    "episodes": [
        10
    ],
    "episodeDetails": {
        "sections": [
            {
                "title": "The Surplus",
                "level": 1,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "\"The Surplus\" is the tenth episode of the fifth season of The Office and the show's 82nd episode overall. It was written by Lee Eisenberg and Gene Stupnitsky and directed by Paul Feig. It first aired December 4, 2008. It was viewed by 8.33 million people."
                    }
                ],
                "images": []
            },
            {
                "title": "Synopsis",
                "level": 2,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Oscar informs Michael that the office must spend a $4300 surplus or lose it in next year's budget. When Michael opens up the floor for suggestions, factions break out and office employees square off against one another in order to get what they want. Oscar suggests that they replace the copier while Pam suggests they buy new chairs. Jim takes Oscar's side, much to Pam's shock, because he started making copies himself since he and Pam started dating and knows how bad the copier is, while the rest of the employees side with Pam. Toby is the only employee who does not choose a side. He instead suggests that they get the air quality in the office tested saying that there is radon coming from downstairs and asbestos coming from the ceiling, and calls them \"silent killers\", to which Michael replies that Toby is the silent killer. Pam notices the copier malfunctioning when she uses it, but still wants to replace the chairs. Michael feels indifferent about the matter, so both sides start warming up to him to win him over. Jim and Oscar take Michael out for lunch, while Pam puts on more make-up and starts to hit on Michael."
                    },
                    {
                        "type": "paragraph",
                        "text": "Meanwhile, Angela and Andy visit Schrute Farms to discuss wedding plans with Dwight. Dwight holds a mock wedding in a barn, with Dwight playing Andy and Andy playing Angela's father. A Mennonite minister who only speaks German plays the minister and performs the mock-ceremony. Dwight goes through the steps of the wedding, putting a ring made of twine on Angela's finger and having them both say \"I do\" to each other. Angela appears to be very happy with Dwight and tells him that she made a mistake getting together with Andy. Dwight acknowledges her mistake and tells her that the mock wedding was an actual wedding since Andy technically acted as their witness and the supposedly fake minister was actually marrying them in German. He tells her that this was why he allowed her to have her wedding to Andy on his farm, and she angrily storms off. Back in the office, Angela passionately kisses Andy in front of everybody and tells him that she is going into town to take care of a \"legal issue\" (presumably annulling her marriage to Dwight)."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael still remains indifferent regarding what to buy, so he brings in a third party: Hank the security guard. However, Hank is more interested in staying in the warm office than making a decision so Michael calls CFO David Wallace to help settle the matter. David informs Michael that he has the option of turning in the surplus, which would result in him getting paid a bonus equal to 15% of it. Michael then tells the employees that he is not going to replace the copier nor the chairs, but Oscar realizes that Michael now knows about the 3rd option (Michael says \"645 dollars\" when Oscar asks him what 15% of 4300 is instead of just saying 645). Michael becomes indecisive again and, unable to take the employees' intrusive behavior anymore, delegates the decision-making to them, hoping that they will be unable to come to a consensus so that he can take the bonus. The employees quickly decide to have the chairs replaced instead of having nothing replaced. Michael is upset because he already bought a fur coat when he expected to receive the bonus from the surplus, and because a group of people threw a bucket of fake blood on his coat when he walked out of the store. Throughout the day, Jim and Pam try to get each other to switch sides. Pam gives Jim a scare, implying that he should switch to her side. Jim later shudders in a talking head spot, amazed at Pam's ultimatum. At the end of the episode, Jim gets back at Pam for getting the chairs replaced by having her make three copies of a document on the copier, initially telling her he is kidding. He then reveals that he actually needs four copies, doing so in the same way Pam had mock threatened him earlier."
                    }
                ],
                "images": []
            },
            {
                "title": "Deleted scenes",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Dwight states half of his ancestors came on a U-boat.",
                                "elements": []
                            },
                            {
                                "text": "Jim tried to scare Dwight with a screamer video but it seemingly backfired when Dwight knew what it was, but as he watched it anyway Jim popped up next to him in a mask.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Cultural references",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Michael mispronounces \"ergonomically\" as \"urkelnomically\". Urkel was the nerd on the television comedy Family Matters.",
                                "elements": []
                            },
                            {
                                "text": "A U-boat is a German submarine. They became notorious in the First and Second World War for hunting Allied cargo ships and for their high casualty rates; of the 40,000 U-boat sailors in World War II, 30,000 never returned.",
                                "elements": []
                            },
                            {
                                "text": "Andy whistles Johann Pachelbel's Canon in D major as he takes Angela down the aisle at the mock wedding. The song is commonly used at weddings as the processional.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Connections to previous episodes",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "In Christmas Party Michael claims to have received a bonus after firing Devon. This may be due to the fact that Devon's termination generated a surplus in that year's budget. In this case, however, accounting most likely gave the money back to corporate without consulting Michael.",
                                "elements": []
                            },
                            {
                                "text": "Pam reminds Michael that she was supposed to get his old chair when he got a new chair, a reference to Chair Model.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Trivia",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "B.J. Novak (Ryan Howard) is credited but does not appear in the episode.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Amusing Details",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "When Michael is in the kitchen after giving his ultimatum, he can be seen pouring sugar into a diet cola.",
                                "elements": []
                            },
                            {
                                "text": "Jim gave Pam tiramisu cake as a peace offering and Pam throws it away. During Michael's speech about the copier and the chairs he mentions that the office is wasteful and that \"people throw away perfectly good tiramisu because it has a little tiny hair on it.\" This causes Pam to give Michael a weird look as Michael must have taken the cake out of the trash that she had thrown it in. This makes it seem like this was also the same tiramisu cake that Michael was choking on while he was on the phone with David Wallace in the previous scene.",
                                "elements": []
                            },
                            {
                                "text": "The group of people that threw blood on Michael's fur coat was likely a group of PETA protestors.",
                                "elements": []
                            },
                            {
                                "text": "The German minister departs on a horse.",
                                "elements": []
                            },
                            {
                                "text": "Pam’s chair slowly sinks while Michael is sitting in it.",
                                "elements": []
                            },
                            {
                                "text": "Michael looks at his watch, and then says, \"That's my phone.\"",
                                "elements": []
                            },
                            {
                                "text": "Andy takes a bite out of a tuna sandwich just before Angela walks up to him and kisses him.  During the season 4 finale, Angela and Dwight had an intimate scene.  Angela complained in an interview that Rainn had eaten a tuna sandwich before the scene and because she was pregnant and extra sensitive to smell she had a hard time kissing Rainn.",
                                "elements": []
                            },
                            {
                                "text": "Michael had to have bought his fur coat somewhere between him finding out about the bonus and Oscar and Pam deciding to go with new chairs.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Cast",
                "level": 2,
                "content": [],
                "images": []
            },
            {
                "title": "Main cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Steve Carell as Michael Scott",
                                "elements": []
                            },
                            {
                                "text": "Rainn Wilson as Dwight Schrute",
                                "elements": []
                            },
                            {
                                "text": "John Krasinski as Jim Halpert",
                                "elements": []
                            },
                            {
                                "text": "Jenna Fischer as Pam Beesly",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Supporting cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Ed Helms as Andy Bernard",
                                "elements": []
                            },
                            {
                                "text": "Leslie David Baker as Stanley Hudson",
                                "elements": []
                            },
                            {
                                "text": "Brian Baumgartner as Kevin Malone",
                                "elements": []
                            },
                            {
                                "text": "Creed Bratton (actor) as Creed Bratton",
                                "elements": []
                            },
                            {
                                "text": "Kate Flannery as Meredith Palmer",
                                "elements": []
                            },
                            {
                                "text": "Mindy Kaling as Kelly Kapoor",
                                "elements": []
                            },
                            {
                                "text": "Angela Kinsey as Angela Martin",
                                "elements": []
                            },
                            {
                                "text": "Paul Lieberstein as Toby Flenderson",
                                "elements": []
                            },
                            {
                                "text": "Oscar Nunez as Oscar Martinez",
                                "elements": []
                            },
                            {
                                "text": "Phyllis Smith as Phyllis Vance",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Recurring cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Andy Buckley as David Wallace (Voice Only)",
                                "elements": []
                            },
                            {
                                "text": "Hugh Dane as Hank Tate",
                                "elements": []
                            },
                            {
                                "text": "Michael Schur as Mose Schrute",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Guest cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Potsch Boyd as Mennonite Priest",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            }
        ]
    },
    "quotesDetails": {
        "sections": [
            {
                "title": "The Surplus Quotes",
                "level": 1,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Andy: We're getting married at Schrute Farms, no matter what. I have looked at twelve venues, I have lost eight deposits, and I have seen Angela naked zero times. I am not losing another deposit."
                    },
                    {
                        "type": "paragraph",
                        "text": "Jim: Truce.\nPam: Yeah I guess, since I won.\nJim: You did win, you did win. Anyway I'm gonna need three copies of each of these, stapled and collated. (He begins to walk away, then turns around).\nJim: I'm totally kidding.\nPam: [Laughs in relief].\nJim: (Whispering) I'm gonna need four. (He kisses her)"
                    }
                ],
                "images": []
            }
        ]
    },
    "coldOpens": [
        "Oscar explains to Michael how well the office used its budget."
    ],
    "storylines": [
        "Oscar informs Michael that the office must spend a $4300 surplus or lose it in next year's budget. When Michael opens up the floor for suggestions, factions break out and office employees square off against one another in order to get what they want. Oscar suggests that they replace the copier while Pam suggests they buy new chairs. Jim takes Oscar's side, much to Pam's shock, because he started making copies himself since he and Pam started dating and knows how bad the copier is, while the rest of the employees side with Pam. Toby is the only employee who does not choose a side. He instead suggests that they get the air quality in the office tested saying that there is radon coming from downstairs and asbestos coming from the ceiling, and calls them \"silent killers\", to which Michael replies that Toby is the silent killer. Pam notices the copier malfunctioning when she uses it, but still wants to replace the chairs. Michael feels indifferent about the matter, so both sides start warming up to him to win him over. Jim and Oscar take Michael out for lunch, while Pam puts on more make-up and starts to hit on Michael.",
        "Meanwhile, Angela and Andy visit Schrute Farms to discuss wedding plans with Dwight. Dwight holds a mock wedding in a barn, with Dwight playing Andy and Andy playing Angela's father. A Mennonite minister who only speaks German plays the minister and performs the mock-ceremony. Dwight goes through the steps of the wedding, putting a ring made of twine on Angela's finger and having them both say \"I do\" to each other. Angela appears to be very happy with Dwight and tells him that she made a mistake getting together with Andy. Dwight acknowledges her mistake and tells her that the mock wedding was an actual wedding since Andy technically acted as their witness and the supposedly fake minister was actually marrying them in German. He tells her that this was why he allowed her to have her wedding to Andy on his farm, and she angrily storms off. Back in the office, Angela passionately kisses Andy in front of everybody and tells him that she is going into town to take care of a \"legal issue\" (presumably annulling her marriage to Dwight).",
        "Michael still remains indifferent regarding what to buy, so he brings in a third party: Hank the security guard. However, Hank is more interested in staying in the warm office than making a decision so Michael calls CFO David Wallace to help settle the matter. David informs Michael that he has the option of turning in the surplus, which would result in him getting paid a bonus equal to 15% of it. Michael then tells the employees that he is not going to replace the copier nor the chairs, but Oscar realizes that Michael now knows about the 3rd option (Michael says \"645 dollars\" when Oscar asks him what 15% of 4300 is instead of just saying 645). Michael becomes indecisive again and, unable to take the employees' intrusive behavior anymore, delegates the decision-making to them, hoping that they will be unable to come to a consensus so that he can take the bonus. The employees quickly decide to have the chairs replaced instead of having nothing replaced. Michael is upset because he already bought a fur coat when he expected to receive the bonus from the surplus, and because a group of people threw a bucket of fake blood on his coat when he walked out of the store. Throughout the day, Jim and Pam try to get each other to switch sides. Pam gives Jim a scare, implying that he should switch to her side. Jim later shudders in a talking head spot, amazed at Pam's ultimatum. At the end of the episode, Jim gets back at Pam for getting the chairs replaced by having her make three copies of a document on the copier, initially telling her he is kidding. He then reveals that he actually needs four copies, doing so in the same way Pam had mock threatened him earlier."
    ],
    "quotes": [
        "Andy: We're getting married at Schrute Farms, no matter what. I have looked at twelve venues, I have lost eight deposits, and I have seen Angela naked zero times. I am not losing another deposit.",
        "Jim: Truce.\nPam: Yeah I guess, since I won.\nJim: You did win, you did win. Anyway I'm gonna need three copies of each of these, stapled and collated. (He begins to walk away, then turns around).\nJim: I'm totally kidding.\nPam: [Laughs in relief].\nJim: (Whispering) I'm gonna need four. (He kisses her)"
    ]
}