{
    "season": 5,
    "title": "The Duel",
    "episode": "12",
    "episodes": [
        12
    ],
    "coldOpens": [
        "The office times their sprints using a radar gun located in front of the building."
    ],
    "storylines": [
        "Andy still hasn't found out about fiancee Angela's affair with Dwight seventeen days after Phyllis revealed it to everyone else in the office. Michael suggests that somebody inform Andy, but the entire office is against that idea; Jim is particularly concerned that Andy's past anger management issues may lead to in-office violence between Andy and the combative Dwight. Michael then asks Andy to accompany him to the parking lot before he leaves for a meeting with David Wallace. Michael carefully times the conversation so that he reveals the affair while simultaneously driving out of the parking lot. A shocked and dismayed Andy heads back into the office to confront Angela regarding the affair, but she continues to hold back, as everyone else looks on. Andy then confronts Dwight about it and challenges him to a duel in the parking lot over who gets Angela, which Dwight accepts. Angela finds this flattering. Jim, acting in Michael's stead, concedes that he does not have the power to prevent them from fighting outside of work, but he locates and confiscates most of Dwight's hidden weaponry throughout the office.",
        "Meanwhile in New York, Michael is nervous as to why David Wallace called a meeting with him. He is, however, surprised and relieved to hear that David is proud of Michael for making the Scranton branch the most successful one, as the other branches are struggling due to the current economic crisis. David wants to know what Michael is doing to make his branch productive and Michael is unable to come up with a reason, speaking off topic for most of the meeting, but David understands that it is hard for someone to come up with a self-evaluation and lets him leave. Michael then thanks David for holding him in high esteem.",
        "Dwight waits in the parking lot for Andy, who doesn't show up on time. Dwight then finds a note hanging in the bushes in an empty parking space from Andy, saying he is giving up. Andy is actually in his car (a Toyota Prius), which, as Oscar points out, is silent below 5 MPH (due to the electric motor). Because Dwight is unable to hear him, Andy drives into the empty space and pins Dwight between the car and the bush. After much banter between the two--in which Andy complains about Angela's affair, and Dwight makes fun of how pathetic he thinks Andy is--Andy reveals he had slept with Angela only twice. Dwight is shocked as Angela told him she was only sleeping with Dwight. They both head back into the office, where Andy makes a call to cancel his wedding cake (which was shaped like a sailboat) and Dwight throws out his bobblehead doll, which was a gift from Angela, as a dismayed Angela looks on."
    ],
    "quotes": [
        [
            {
                "speaker": "Dwight",
                "content": " \"Rule 17: Don't turn your back on bears, men you have wronged, or the dominant turkey during mating season. There are forty rules all Schrute boys must learn before the age of five. [sings] Learn your rules. You better learn your rules. If you don't, you'll be eaten in your sleep.\""
            }
        ],
        [
            {
                "speaker": "Jim",
                "content": " (To Dwight) \"What are you standing for?\""
            }
        ],
        [
            {
                "speaker": "Dwight",
                "content": " \"If I'm sitting, I can't disable his neck or his groin.\""
            }
        ],
        [
            {
                "speaker": "Jim",
                "content": " \"You're not going to do anything to his neck or his groin.\""
            }
        ],
        [
            {
                "speaker": "Dwight",
                "content": " \"If I am sitting I don't have the option to.\""
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " (To David Wallace) \"David here it is, my philosophy is basically this, and this is something that I live by, and I always have, and I always will: Don't ever, for any reason, do anything, to anyone, for any reason, ever, no matter what, no matter where, or who, or who you are with, or where you are going, or where you've been, ever, for any reason whatsoever.\""
            }
        ]
    ]
}