{
    "season": 5,
    "title": "Lecture Circuit Part 1",
    "episode": "16",
    "episodes": [
        16
    ],
    "coldOpens": [
        "Michael does impressions on the intercom."
    ],
    "storylines": [
        "Michael is asked to go around to the different branches to lecture about Scranton's success, except Nashua, where Holly was transferred, as Michael says it's still a \"little bit raw\" there. He brings Pam along as his assistant, mostly just to carry around his belongings. Pam states that she agreed to come on the trip because she gets time and a half pay. Their first stop is the Utica branch, where Karen is the regional manager. Pam is nervous to see Karen as she believes Karen is still mad at her over Jim. When Karen comes to greet them, the two are shocked to see that she is pregnant. Michael immediately asks if it is Jim's, which Karen denies. Michael's lecture to the Utica branch is a failure and Karen brings Michael and Pam into her office. While Michael fools around, Karen reveals to Pam she is due in one month and is married to a dermatologist named Dan. Pam mentions that she and Jim are engaged, about which Karen hesitantly but happily congratulates her. On the way to the car, Pam mentions to Michael that she is happy she came on the trip because she found closure with Karen. Later, in the car, Michael tells Pam about Holly and how he never really found closure with her. Pam suggests that they drive to Nashua so that he can find closure, and Michael agrees, blowing off the lecture in Rochester.",
        "Back in Scranton, Jim and Dwight become the reluctant heads of the Party Planning Committee after Phyllis blackmailed Angela. Michael determined that Angela and Phyllis became too power hungry when they were the sole heads at their respective times, and it would be best for both of them to step down and appoint two new heads. They openly show their disdain for it, which is reflected in their performance of their duties when Kelly chastises them for forgetting her birthday. They try to make it up to her by having a party but do a poor job setting it up as Dwight puts little effort into blowing up the balloons and neither of them know how old Kelly is. Dwight reads through Kelly's file report and finds out that she has been to juvenile hall. He is, however, disappointed when he reads that it has not affected her job performance.",
        "Meanwhile, Andy finds himself attracted to Julia, a potential female client, who is talking with Stanley. Andy awkwardly interrupts their business meeting and Stanley pulls him aside. Andy admits his attraction to her to Stanley, who then gives the potential client over to Andy in exchange for two of his clients. Andy awkwardly gets Julia to reveal that she is single and tries to muster up the courage to ask her out. Creed suggests that he goes in for the kiss, before mistakenly calling him Jim. Andy walks the client to her car and attempts to kiss her, but she immediately rebukes his advances. Andy apologizes and mentions that he just got out of a relationship. The client mentions that she got out of a relationship as well and Andy starts feeling a connection, but she still rejects him and he loses the account."
    ],
    "quotes": [
        [
            {
                "speaker": "Michael",
                "content": " I don't know you. But I need to know you in order to sell to you. That is why I have asked you to go around and tell me your names. I have an amazing mnemonic device, by which I have memorized all of your names. Shirty, mole, lazy eye, Mexico, baldy, sugar boobs, black woman. I have taken a unique part of who you are, and I have used that to memorize your name. Baldy, your head is bald. It is hairless. It is shiny, it is reflective like a mirror. \"M\" your name is Mark."
            }
        ]
    ]
}