{
    "season": 5,
    "title": "Golden Ticket",
    "episode": "19",
    "episodes": [
        19
    ],
    "episodeDetails": {
        "sections": [
            {
                "title": "Golden Ticket",
                "level": 1,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "\"Golden Ticket\" is the nineteenth episode of the fifth season of the television series The Office, and the show's 91st overall. It was written by Mindy Kaling who also wrote Frame Toby and Night Out and directed by Randall Einhorn who also directed Blood Drive. It originally aired on March 12, 2009. It was viewed by 7.51 million people."
                    }
                ],
                "images": []
            },
            {
                "title": "Synopsis",
                "level": 2,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Michael is seen making offensive jokes around the office but is later insulted himself by a joke made by Dwight regarding the KGB. After banning \"knock knock\" jokes, Jim changes the joke from \"knock knock\" to \"ding dong\", intriguing Michael. Jim responds that the KGB is again waiting, only to have Michael and Dwight fight over who gets the door. Eventually, Jim slaps Dwight the same way Dwight had slapped Michael as a part of the joke."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael comes to work dressed up and starts to impersonate Willy Wonka, after being \"inspired\" by an idea that is sure to bring up paper sales. His idea is to place golden tickets in shipments of paper for the customers to be eligible for a 10% discount for a year. In addition to his excitement, Michael also holds a \"marketing conference\" in the office. However, his idea backfires, as the company's largest client, Blue Cross of Pennsylvania, receives a ticket and Oscar claims that a 10% discount given to Blue Cross is harmful to the company. The news worsens when the health insurance company receives all the golden tickets, making them eligible for 50% off on all paper purchases. To make matters worse, it is revealed that Michael had completely forgotten to note \"limit one per customer\". Michael, at first, berates Darryl for not properly labeling the shipments for the customers, although Darryl made it clear that Michael had to know that shipments close to each other meant they were headed to the same customer. Embarrassed, Michael disposes of his Willy Wonka attire and returns with Andy's blazer, and starts a conference to get the branch out of the problem."
                    },
                    {
                        "type": "paragraph",
                        "text": "However, all the employees are disgruntled and are also furious for reasons of their own, such as Jim blaming Michael for his losing 1/2 of his commission while he has to pay a mortgage for his parents' home. Soon Michael receives a call from CEO David Wallace, who is also furious and demands an explanation on the perpetrator responsible for the idea and why the idea was approved. Michael, not admitting that it was his idea, claims it was an \"inside job\" and blames it on one of the employees: Dwight. Soon, Dwight is seen talking with Michael, fighting over who was responsible for the idea, which Dwight clearly explains was Michael's fault, with the help of his diary."
                    },
                    {
                        "type": "paragraph",
                        "text": "Later, Dwight and Michael are seen walking around, discussing loyalty and what Dunder Mifflin had offered Dwight. Michael also explains that true loyalty is to take the blame from Wallace and risk losing his job. Dwight considers accommodating Michael but has not made his mind up when Jim tries to talk him into letting Michael take responsibility for his actions. When Wallace comes in Michael, expecting Dwight to get fired, anxiously asks Dwight to take the blame for the golden ticket idea. Michael is appalled when Wallace tells them that due to the golden ticket idea, Blue Cross is making Dunder Mifflin its exclusive office supply provider. Dwight, having risked losing his job when the golden tickets were a bad idea, takes the credit as the office cheers 'his' great idea. Wallace wants Dwight to talk to the Marketing department and as the telephone conference begins, Michael listens in then busts into the conference room to claim the credit. Michael becomes furious and complains that it was his idea and fights with Dwight to take credit. However, Wallace, unable to believe that Michael wants credit after having blamed a subordinate, becomes annoyed and leaves prematurely. Dwight and Michael later discuss to the camera about whose idea it was in their own words and begin to fight over Dwight's diary. In the end, Dwight also continues his KGB joke with Jim, only to be stood up after Jim states \"I'm taking a shower, can you come back later?\""
                    },
                    {
                        "type": "paragraph",
                        "text": "Meanwhile, Kevin, interested in Lynn, asks advice from Jim, Pam, and Andy. Jim recommends caution, Pam recommends action, and Andy recommends brutish behavior. As the three begin to fight over what is true and whose idea is more practical, a frustrated Kevin decides to take matters into his own hands. Kevin asks Lynn out in his own method and is successful."
                    }
                ],
                "images": []
            },
            {
                "title": "Quotes",
                "level": 2,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "For quotes see: Golden Ticket Quotes."
                    }
                ],
                "images": []
            },
            {
                "title": "Deleted Scenes",
                "level": 2,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Many deleted scenes were put on the Season 5 DVD. Notable cuts include:"
                    },
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Kevin tells Lynn that he is going to be busy for the next twenty days. Kevin explains he doesn't know much about women.",
                                "elements": []
                            },
                            {
                                "text": "Andy says that Angela is Satan.",
                                "elements": []
                            },
                            {
                                "text": "Michael tries to get Dwight to take a stroll with him outside. When Dwight asks Michael if he is wearing sunblock, Michael says he put on SPF 1 sunscreen. Cut to Dwight putting on sunscreen is seen.",
                                "elements": []
                            },
                            {
                                "text": "Upon Pam's advice, Kevin touches Lynn. However, upon Andy's, Kevin tells Lynn he likes the color of her shirt but not the cut.",
                                "elements": []
                            },
                            {
                                "text": "Jim jokingly tells Pam that they can't date. Pam says that's hot and Jim tells Pam to pick him or Kevin. Jim leaves and Pam laughs.",
                                "elements": []
                            },
                            {
                                "text": "Andy tells Kevin to tell Lynn that he has tons of girlfriends.",
                                "elements": []
                            },
                            {
                                "text": "Dwight says that Lynn and Kevin are perfect for each other.",
                                "elements": []
                            },
                            {
                                "text": "Dwight calls Oscar a lady.",
                                "elements": []
                            },
                            {
                                "text": "Kelly wants Dwight to be fired and replaced with a new, hot guy. Angela, Oscar, and Kelly talk to each other and say that Michael is being unfair. Michael overhears and goes into the bathroom to spy on them. Angela says that Dwight shouldn't be blamed and Meredith replies that Angela's saying that because \"she used to bone him.\" Michael continues to watch them.",
                                "elements": []
                            },
                            {
                                "text": "Michael makes an announcement. He says that if he wasn't there, Jim and Pam may be transferred because someone else doesn't like love in the workplace or some guy who knows that accounting doesn't need three people may downsize. Everyone looks sad, but Michael tells them not to say something mean behind his back when he is faking going poop.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Amusing details",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "After disposing of his Willy Wonka costume, Michael wears Andy's blazer for the remainder of the day.",
                                "elements": []
                            },
                            {
                                "text": "It is revealed that when he was a child, Dwight wasn't allowed to consume candy or sugary confectioneries or see movies.",
                                "elements": []
                            },
                            {
                                "text": "A couple of shots reveal Dwight is wearing white shoes as opposed to his normal dark dress shoes. It is not explained as to why.",
                                "elements": []
                            },
                            {
                                "text": "David Wallace doesn't question Michael wearing a random t-shirt, sweatpants, and a tan blazer.",
                                "elements": []
                            },
                            {
                                "text": "One of Michael's ideas was to open up a shoe store called \"Shoe La La,\" which would have sold men's shoes for all the occasions in a man’s life. This is just an example of one of his many ideas.",
                                "elements": []
                            },
                            {
                                "text": "When Dwight yells \"Horse Boat,\" he looks at the documentary crew, as if he is selling them the idea.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Connections to previous episodes",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "The last time Pam hugged Dwight was The Injury, another Mindy Kaling episode.",
                                "elements": []
                            },
                            {
                                "text": "Michael couldn't remember the name of the movie Willy Wonka & the Chocolate Factory in Goodbye, Toby.",
                                "elements": []
                            },
                            {
                                "text": "Kevin drinks out of the mug from Kelly's America's Got Talent party in Customer Survey.",
                                "elements": []
                            },
                            {
                                "text": "Michael also misused the phrase \"No harm, no foul\" in the episode Women's Appreciation.",
                                "elements": []
                            },
                            {
                                "text": "Dwight continues to be paranoid about computers, harking back to Jim and Pam's prank in Launch Party.",
                                "elements": []
                            },
                            {
                                "text": "This is not the first time Dwight has been slapped by Jim, the other was in the episode \"Traveling Salesmen\".",
                                "elements": []
                            },
                            {
                                "text": "The episode \"Traveling Salesmen\" also has references to the movie Willy Wonka & the Chocolate Factory. Andy compares the employees from Stamford to the children in the movie and makes up a song about Dwight leaving to the tune sung by the Oompa Loompas.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Trivia",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "When Michael was walking outside with Dwight they were walking past a sign saying \"Keyser Valley Auto Parts.\" That place is a real place in Scranton and has its own website",
                                "elements": []
                            },
                            {
                                "text": "B.J. Novak (Ryan Howard) is credited but does not appear in the episode.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Cultural references",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "A knock-knock joke is a joke pattern popular among children. The joke pattern is demonstrated at the start of the episode when Michael tells a knock-knock joke to Pam. The ding-dong joke was invented for the episode.",
                                "elements": []
                            },
                            {
                                "text": "The KGB was the state security agency of the former Soviet Union.",
                                "elements": []
                            },
                            {
                                "text": "Michael's Golden Ticket idea and his Willy Wonka costume are taken from the children's movie Willy Wonka & the Chocolate Factory, based on the book Charlie and the Chocolate Factory.",
                                "elements": []
                            },
                            {
                                "text": "The Golden Girls was a long-running American sitcom from the late 1980s.",
                                "elements": []
                            },
                            {
                                "text": "Golden Grahams is a brand of breakfast cereal.",
                                "elements": []
                            },
                            {
                                "text": "Michael is allegedly attending a civil rights rally at the Lincoln Memorial in Washington, DC (over 200 miles away).",
                                "elements": []
                            },
                            {
                                "text": "Another of Michael's excuses is attending an Obama fashion show. Barack Obama was President of the United States when this episode aired.",
                                "elements": []
                            },
                            {
                                "text": "Blue Cross of Northeastern Pennsylvania is a health insurance company based in nearby Wilkes-Barre. They also have an office in Scranton.",
                                "elements": []
                            },
                            {
                                "text": "Michael claims that he had a colonoscopy to prevent talking with Wallace. A colonoscopy is the examination of the colon with a small camera.",
                                "elements": []
                            },
                            {
                                "text": "Carnations are colorful flowers that are often given to people as gifts for decorating.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Cast",
                "level": 2,
                "content": [],
                "images": []
            },
            {
                "title": "Main Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Steve Carell as Michael Scott",
                                "elements": []
                            },
                            {
                                "text": "Rainn Wilson as Dwight Schrute",
                                "elements": []
                            },
                            {
                                "text": "John Krasinski as Jim Halpert",
                                "elements": []
                            },
                            {
                                "text": "Jenna Fischer as Pam Beesly",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Supporting Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Ed Helms as Andy Bernard",
                                "elements": []
                            },
                            {
                                "text": "Leslie David Baker as Stanley Hudson",
                                "elements": []
                            },
                            {
                                "text": "Brian Baumgartner as Kevin Malone",
                                "elements": []
                            },
                            {
                                "text": "Creed Bratton (actor) as Creed Bratton",
                                "elements": []
                            },
                            {
                                "text": "Kate Flannery as Meredith Palmer",
                                "elements": []
                            },
                            {
                                "text": "Angela Kinsey as Angela Martin",
                                "elements": []
                            },
                            {
                                "text": "Oscar Nunez as Oscar Martinez",
                                "elements": []
                            },
                            {
                                "text": "Craig Robinson as Darryl Philbin",
                                "elements": []
                            },
                            {
                                "text": "Phyllis Smith as Phyllis Vance",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Recurring Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Andy Buckley as David Wallace",
                                "elements": []
                            },
                            {
                                "text": "Calvin Tenner as Calvin (uncredited)",
                                "elements": []
                            },
                            {
                                "text": "Hidetoshi Imura as Hidetoshi Hasagawa (uncredited)",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Guest Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Lisa K. Wyatt as Lynn",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            }
        ]
    },
    "quotesDetails": {
        "sections": [
            {
                "title": "Golden Ticket Quotes",
                "level": 1,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Andy: You can't let a girl feel good about herself. It will backfire on you. Every compliment has to be backhanded. 'Oh I like your dress, but I'd like it more if you had prettier hair.'"
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael (walks up to Darryl in the warehouse): You idiot."
                    },
                    {
                        "type": "paragraph",
                        "text": "Darryl: Start over."
                    }
                ],
                "images": []
            }
        ]
    },
    "coldOpens": [
        "Michael and Dwight do knock knock jokes. Jim does a ding dong joke. Jim finishes Dwight's joke."
    ],
    "storylines": [
        "Michael is seen making offensive jokes around the office but is later insulted himself by a joke made by Dwight regarding the KGB. After banning \"knock knock\" jokes, Jim changes the joke from \"knock knock\" to \"ding dong\", intriguing Michael. Jim responds that the KGB is again waiting, only to have Michael and Dwight fight over who gets the door. Eventually, Jim slaps Dwight the same way Dwight had slapped Michael as a part of the joke.",
        "Michael comes to work dressed up and starts to impersonate Willy Wonka, after being \"inspired\" by an idea that is sure to bring up paper sales. His idea is to place golden tickets in shipments of paper for the customers to be eligible for a 10% discount for a year. In addition to his excitement, Michael also holds a \"marketing conference\" in the office. However, his idea backfires, as the company's largest client, Blue Cross of Pennsylvania, receives a ticket and Oscar claims that a 10% discount given to Blue Cross is harmful to the company. The news worsens when the health insurance company receives all the golden tickets, making them eligible for 50% off on all paper purchases. To make matters worse, it is revealed that Michael had completely forgotten to note \"limit one per customer\". Michael, at first, berates Darryl for not properly labeling the shipments for the customers, although Darryl made it clear that Michael had to know that shipments close to each other meant they were headed to the same customer. Embarrassed, Michael disposes of his Willy Wonka attire and returns with Andy's blazer, and starts a conference to get the branch out of the problem.",
        "However, all the employees are disgruntled and are also furious for reasons of their own, such as Jim blaming Michael for his losing 1/2 of his commission while he has to pay a mortgage for his parents' home. Soon Michael receives a call from CEO David Wallace, who is also furious and demands an explanation on the perpetrator responsible for the idea and why the idea was approved. Michael, not admitting that it was his idea, claims it was an \"inside job\" and blames it on one of the employees: Dwight. Soon, Dwight is seen talking with Michael, fighting over who was responsible for the idea, which Dwight clearly explains was Michael's fault, with the help of his diary.",
        "Later, Dwight and Michael are seen walking around, discussing loyalty and what Dunder Mifflin had offered Dwight. Michael also explains that true loyalty is to take the blame from Wallace and risk losing his job. Dwight considers accommodating Michael but has not made his mind up when Jim tries to talk him into letting Michael take responsibility for his actions. When Wallace comes in Michael, expecting Dwight to get fired, anxiously asks Dwight to take the blame for the golden ticket idea. Michael is appalled when Wallace tells them that due to the golden ticket idea, Blue Cross is making Dunder Mifflin its exclusive office supply provider. Dwight, having risked losing his job when the golden tickets were a bad idea, takes the credit as the office cheers 'his' great idea. Wallace wants Dwight to talk to the Marketing department and as the telephone conference begins, Michael listens in then busts into the conference room to claim the credit. Michael becomes furious and complains that it was his idea and fights with Dwight to take credit. However, Wallace, unable to believe that Michael wants credit after having blamed a subordinate, becomes annoyed and leaves prematurely. Dwight and Michael later discuss to the camera about whose idea it was in their own words and begin to fight over Dwight's diary. In the end, Dwight also continues his KGB joke with Jim, only to be stood up after Jim states \"I'm taking a shower, can you come back later?\"",
        "Meanwhile, Kevin, interested in Lynn, asks advice from Jim, Pam, and Andy. Jim recommends caution, Pam recommends action, and Andy recommends brutish behavior. As the three begin to fight over what is true and whose idea is more practical, a frustrated Kevin decides to take matters into his own hands. Kevin asks Lynn out in his own method and is successful."
    ],
    "quotes": [
        "Andy: You can't let a girl feel good about herself. It will backfire on you. Every compliment has to be backhanded. 'Oh I like your dress, but I'd like it more if you had prettier hair.'",
        "Michael (walks up to Darryl in the warehouse): You idiot.",
        "Darryl: Start over."
    ]
}