{
    "season": 5,
    "title": "Weight Loss",
    "episode": "1/2",
    "episodes": [
        1,
        2
    ],
    "coldOpens": [
        "None "
    ],
    "storylines": [
        "The Scranton branch participates in a weight loss competition to see which branch can lose the most cumulative weight, with a prize of three extra vacation days (which later changes to five due to every branch performing poorly) for every employee in the winning branch. Although the branch is enthusiastic at first, the competition begins to take a huge toll on many of the employees, particularly Kelly, who stops eating and tries various kinds of diets, ultimately collapsing after one of the weigh-ins and later consuming a “tape worm” supplied by Creed. As a result, corporate sends a memo insisting that the staff need not resort to drastic measures to lose weight.",
        "Pam begins her three-month stay in New York to attend classes in graphic design at the Pratt Institute, leaving Jim to adjust to her being away. Pam is temporarily replaced by Ronni, an older woman, and she is quickly replaced by Ryan, who was recently fired by Dunder Mifflin for fraud. Ryan, who is shown to be planning to rise again in the company, tries to make up with several workers he had treated badly. He apologizes to his former girlfriend Kelly, and asks her out, only to be rejected because she's dating Darryl, and is mocked by Jim when Ryan apologizes to him.",
        "Michael successfully continues his casual bonding with Holly, with Jim noting that his success is due to Holly being \"kind of a major dork\". However, when Holly notices Michael talking in his office with a pregnant Jan, she asks Oscar to set her up with his yoga instructor. Michael learns of this and gets frustrated with Jim because he did not ask Holly out months earlier, which he wanted to but Jim told him not to. At one point, Angela chastises Kevin for improperly accounting for sales numbers. Holly, who thinks Kevin is mentally challenged, yells at Angela for treating Kevin so rudely, but when she refers to him as \"mentally challenged,\" Kevin awkwardly reveals that he is not. Embarrassed, Holly apologizes and walks away.",
        "Due to the poor results of the Scranton branch weigh ins, Dwight “randomly selects” Kevin, Phyllis and Stanley to get liposuction surgery. An insulted Phyllis is later approached by Dwight, who attempts to apologize by recruiting her for a two-person sale. Hours later, a sweaty and infuriated Phyllis returns to the office and reveals that there was no sale, and that Dwight left her in a warehouse five miles away without her purse or phone. Dwight tries to justify his actions by pointing out how many calories she burned on the walk home; in response, Phyllis calls corporate to report him.",
        "Due to Dwight’s actions, the next weigh in is skipped. Holly tries to hold a meeting involving positive body images, but is sabotaged by Michael in his Michael Klump persona (achieved by wearing a plus-size outfit over one of his sumo suits from Beach Games). Michael argues that Michael Klump is a “celebration of fat people,” as opposed to Oscar and Kevin’s opinions that it is his “making fun of fat people character.” Michael forces an inauthentic apology out of Dwight, then reminds his subordinates that the weight loss contest was not just about weight loss, but positive body image and healthy lifestyles as a whole. He then requests that Kelly cease her unhealthy dieting habits and begin eating once again.",
        "Phyllis takes over the Party Planning Committee after catching Angela cheating on Andy with Dwight. Andy has been making plans for his wedding with Angela, who irritatedly rejects all of his ideas. After Andy gives a heartfelt speech about not caring where they marry because he wants to be with her forever, Angela warms up to him a little. However, later in the episode Angela's disinterest resumes after Andy's persists in bringing his old a cappella group to be his best man, causing her and Dwight to resume their intimate affair.",
        "Jim, having an unsatisfactory summer due to not being able to see Pam, asks her on a last minute lunch date at an interstate rest stop in between Scranton and New York City. At the rest stop, in a pouring rain, Jim finally proposes to Pam, and she happily accepts. Holly buys Counting Crows tickets as a surprise for the yoga instructor, but he never calls. Michael denigrates the yoga instructor for not calling her back, much to her apparent pleasure. He then offers to buy the tickets from her, only to tear them up in front of her and tells her to forget about being stood up.",
        "The Scranton branch loses the competition to the Utica branch, much to the disappointment of the employees. Stanley, however, is pleased with the fact that he personally lost seven pounds and decides to take an extra five days off anyway. In the last scene, Toby is seen in a hospital in Costa Rica, having broken his neck due to a malfunctioning zip-line harness on the third day of his new life and has been subsequently hospitalized for five weeks."
    ],
    "quotes": [
        [
            {
                "speaker": "Michael",
                "content": " What is wrong with these people? They have no willpower. I went -- I once went 28 years without having sex. And then again for seven years."
            }
        ],
        [
            {
                "speaker": "Jim",
                "content": " I can't believe I'm saying this - but Michael is actually killing it with Holly. And I think I know why - it's because Holly is kind of a major dork!"
            }
        ],
        [
            {
                "speaker": "Jim",
                "content": " When Michael told us that Jan was pregnant, he led us to believe that he was the father - by telling us that...he was the father."
            }
        ],
        [
            {
                "speaker": "Holly",
                "content": " Who's that woman in Michael's office, with the feet?"
            },
            {
                "speaker": "Oscar",
                "content": " That's his ex."
            },
            {
                "speaker": "Holly",
                "content": " Oh, she's...she's very beautiful..."
            },
            {
                "speaker": "Oscar",
                "content": " Yes, she is...and clinically insane."
            }
        ],
        [
            {
                "speaker": "Holly",
                "content": " You do not talk to him like that!"
            },
            {
                "speaker": "Angela",
                "content": " But he's an idiot!"
            },
            {
                "speaker": "Holly",
                "content": " He is not an idiot! He is mentally challenged...but he's doing a super job here!"
            },
            {
                "speaker": "Kevin",
                "content": " Wait, back up. Do you think that I'm retarded?"
            },
            {
                "speaker": "Holly",
                "content": "Wha...no...a...Dwight..."
            },
            {
                "speaker": "Angela",
                "content": " (Clearly enjoying the spectacle) Oh Holly, that is very offensive!"
            }
        ],
        [
            {
                "speaker": "Phyllis",
                "content": " I've replaced Angela as head of the Party Planning Committee...I guess I was just in the right place at the right time!"
            }
        ],
        [
            {
                "speaker": "Holly",
                "content": " It's kind of a Good News-Bad News situation. The bad news is, we're not doing very well, so we really hadda starve ourselves this whole week. But the good news, is that all the other branches are doing just as bad as we are, so Corporate upped the prize to five days - so if we stay fat long enough, we may actually get a whole month off!"
            }
        ],
        [
            {
                "speaker": "Kelly",
                "content": " I swallowed a tapeworm last night. It's going to grow up to three feet inside of me, and then it eats all my food so that I don't get fat, and then, after three months I take some medicine and I pass it - Creed sold it to me, it's from Mexico."
            },
            {
                "speaker": "Creed",
                "content": " That wasn't a tapeworm."
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " Ronnie was...bllahh...things were at an all-time sad here. But then I got an e-mail from Ryan, that he was coming back to town, and I called the temp agency, and I told them, I will pay you any amount, just give me Ryan Howard - give him to me. I need him!"
            }
        ]
    ]
}