{
    "season": 5,
    "title": "Michael Scott Paper Company",
    "episode": "23",
    "episodes": [
        23
    ],
    "episodeDetails": {
        "sections": [
            {
                "title": "Michael Scott Paper Company",
                "level": 1,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "\"Michael Scott Paper Company\" alternatively titled as \"The Michael Scott Paper Company\" is the twenty-third episode of the fifth season of The Office, and is the 95th episode overall. It was written by Justin Spitzer and directed by Gene Stupnitsky. It aired on April 9, 2009 after \"Dream Team.\" It was viewed by 7.94 million people."
                    }
                ],
                "images": []
            },
            {
                "title": "Synopsis",
                "level": 2,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Michael explains he is back for the new company and Pam and Ryan join him. They see their new office and look awkwardly at it. Pam and Ryan wait to get calls from clients and Michael eagerly waits for his upcoming Pancake Luncheon."
                    },
                    {
                        "type": "paragraph",
                        "text": "Meanwhile, Kelly continues to be infatuated with Charles Miner. She tries to see him as much as she can by deliberately misinterpreting Charles as wanting her to come into his office every time he calls for the new receptionist, Kelly Hannon. Eventually, Charles tires of this and declares that he will call them by their last names instead. Kelly Hannon requests to be called Erin, her middle name. Kelly Kapoor then storms out."
                    },
                    {
                        "type": "paragraph",
                        "text": "When Michael gives Ryan and Pam a paper to copy, Pam asks Ryan to do it as she doesn't want to be the receptionist anymore. Pam says she misses making copies. Ryan continues to be a lazy employee of the company, and talks to his friends on his phone. Ryan calls Pam a \"6 in New York and a 7 in Scranton\" based on her looks. Pam looks to the camera, disgusted."
                    },
                    {
                        "type": "paragraph",
                        "text": "Andy and Dwight, once \"sexual competitors\" and enemies, become best friends and decide to go on a hunting trip. However, Dwight and Andy start to compete over Erin. Dwight plays a joke on Erin and talks to her. Andy briefly (and awkwardly) dances with Erin before she leaves the room. Dwight realizes that Andy is attracted to Erin, and admits that he is too. However, Andy and Dwight agree to not pursue a relationship with Erin, and instead continue to be friends."
                    },
                    {
                        "type": "paragraph",
                        "text": "Charles asks Jim to create a “run-down” of his clients. Jim accepts the task, but doesn't know what a run-down is. He stalls, and asks Charles about a run-down and awkwardly talks to him. Hours later, still unknowing of what a run-down is, Jim asks Oscar and Kevin for help, but they are unaware as well. Charles asks Jim if he has started the run-down, but becomes angry when he discovers Jim is doing something else. When Jim finally brings the run-down to Charles, he is told to send it to everyone on the “distribution list”. Jim gives the run-down to his dad, still unknowing of what in fact, a run-down really is."
                    },
                    {
                        "type": "paragraph",
                        "text": "Ryan spends his time watching videos on YouTube (specifically \"It's Just Like a Mini Mall\") . Pam and Ryan endlessly fight and Michael yells at them for fighting. Pam and Ryan remain bored and Pam yells at Ryan for putting a naked picture of Ryan's friend, Jasmine, on the computer. Ryan and Pam continue their feud. Michael has a talk with Pam and Ryan about disliking each other, and they talk about making a corner idea so that everyone can have a personal space. To Pam's sadness, her corner is the one with the copier."
                    },
                    {
                        "type": "paragraph",
                        "text": "Pam goes to Charles to ask for her job back. Charles refuses, but Pam desperately asks if she can be his personal shopper. Pam admits she misses Dunder Mifflin."
                    },
                    {
                        "type": "paragraph",
                        "text": "Phyllis and Stanley visit The Michael Scott Paper Company and tell Michael that Pam was seeing Charles. Michael starts to regret starting the company. Michael starts his pancake luncheon with Pam trying to get clients and Ryan not doing anything. Creed and Meredith take pancakes from Michael, which they don't like."
                    },
                    {
                        "type": "paragraph",
                        "text": "Andy and Dwight continue to bond as they play their instruments. They play \"Take Me Home, Country Roads\" when Erin comes in. Andy and Dwight try to outdo the other in an attempt to impress her by playing it fast, by singing, and in Dwight's case singing in German. Erin looks shocked at how well they are playing and laughs. Erin, amused, leaves the break room, and continuing to play, Dwight and Andy are finally stopped by Toby Flenderson."
                    },
                    {
                        "type": "paragraph",
                        "text": "After a day with no success, Michael, Pam, and Ryan are sad that they have made no clients. However, Pam makes her first sale when a client from the luncheon calls. Ryan, Pam, and Michael are ecstatic. As they leave the building, Michael tells the documentary crew that they have the people with the biggest hearts."
                    },
                    {
                        "type": "paragraph",
                        "text": "When Angela sees Dwight and Andy bonding, she sarcastically rolls her eyes."
                    }
                ],
                "images": []
            },
            {
                "title": "Amusing details",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Michael is carrying a large container of cheese balls as he's climbing out of the back of his convertible PT Cruiser stating, \"They can take away my parking space, but they can't take away my pride.\"",
                                "elements": []
                            },
                            {
                                "text": "When Pam is in a talking head interview in the Dunder Mifflin office, she mentions that the seats are comfortable. They are most likely the seats she fought for in \"The Surplus\".",
                                "elements": []
                            },
                            {
                                "text": "New credits were used for the episode to focus on the Michael Scott Paper Company.",
                                "elements": []
                            },
                            {
                                "text": "The copier is the bad copier from \"The Surplus\" which was eventually replaced in \"Two Weeks\".",
                                "elements": []
                            },
                            {
                                "text": "The whiteboard reads, \"'You miss 100% of the shots you don't take. - Wayne Gretzky' - Michael Scott\"",
                                "elements": []
                            },
                            {
                                "text": "The Scranton clock is in the Eastern Time Zone. However, all the other ones are in the time zone of the Pacific, where the show is shot.",
                                "elements": []
                            },
                            {
                                "text": "Ryan still hasn't made a sale.",
                                "elements": []
                            },
                            {
                                "text": "Dwight and Andy impress Erin by playing John Denver's \"Take Me Home Countrry Roads\" on guitar and banjo respectively however only the first verse is sung and are interrupted by Toby before they can finish.",
                                "elements": []
                            },
                            {
                                "text": "Michael seems to enjoy listening to people in the bathroom through the vent. However, when we hear Toby's conversation while in the bathroom through the vent, this seems to particularly annoy Michael and emphasize how bad the office is.",
                                "elements": []
                            },
                            {
                                "text": "In the closing scene, Oscar is using his mug from Kelly's America's Got Talent party, mentioned in the episode \"Customer Survey.\"",
                                "elements": []
                            },
                            {
                                "text": "When Pam asks if her corner is the one with the copier, Michael says, \"Pam, I don't make the rules,\" even though Michael is the boss who can make the rules and came up with the corner idea.",
                                "elements": []
                            },
                            {
                                "text": "At the Pancake Luncheon, Creed still calls Michael \"boss\".",
                                "elements": []
                            },
                            {
                                "text": "This is the first appearance of Erin Hannon.",
                                "elements": []
                            },
                            {
                                "text": "In some releases of this episode, it is titled \"The Michael Scott Paper Company\"",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Goofs",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "In the episode \"Goodbye Toby,\" Michael says every year he receives money from his grandmother for his birthday, and in recent years he has been receiving multiple checks a year from this grandmother. He believes this may be due to dementia of some sort, but if he was speaking of the same Nana that appears in this episode, it would seem to be an error. However, this could also be a different grandmother or his Nana's investment success has led her to be more generous towards Michael.",
                                "elements": []
                            },
                            {
                                "text": "When Dwight tells Erin that there is a ghost in the office he stated that a prostitute was murdered on the floor of the building in 1816 but according to an earlier episode, Scranton wasn't founded until 1866.",
                                "elements": []
                            },
                            {
                                "text": "When the e-vite information for the \"Michael Scott Paper Company Pancake Luncheon\" is shown on Michael's computer, it says the event is on Saturday - yet everyone in the building is at work.",
                                "elements": []
                            },
                            {
                                "text": "Dwight and Andy incorrectly sing the chorus of \"Take Me Home, Country Roads\" as \"Take me home, country roads, to the place, I belong,\" rather than the correct \"Country roads, take me home, to the place, I belong.\"",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Connections to previous episodes",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Michael told his mom about Pam. Pam and Michael's mom have not talked to each other since, \"The Injury.\"",
                                "elements": []
                            },
                            {
                                "text": "Pam doesn't like being a receptionist and has felt unmotivated in her job since the pilot episode when she said, \"It's not many girls' dream to be a receptionist.\" This is a persisting plot point on the show.",
                                "elements": []
                            },
                            {
                                "text": "The plant that Pam brings on the first day is the same plant that she finds dead when she returns from her maternity leave in \"Secretary's Day\".",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Quotes",
                "level": 2,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "For quotes see: Michael Scott Paper Co. Quotes."
                    }
                ],
                "images": []
            },
            {
                "title": "Deleted scenes",
                "level": 2,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "On the Season 5 DVD there were many deleted scenes. Notable cuts include:"
                    },
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Pam is excited about embarking on a new adventure.",
                                "elements": []
                            },
                            {
                                "text": "Ryan says he is apprehensive but will always be the youngest VP in Dunder Mifflin history.",
                                "elements": []
                            },
                            {
                                "text": "Michael explains his company name's origin.",
                                "elements": []
                            },
                            {
                                "text": "While Michael tries to make an inspirational speech, Pam and Ryan point out the problems. Michael compares himself to Apple, however, Ryan points out that Apple is a company with over 35,000 employees.",
                                "elements": []
                            },
                            {
                                "text": "Andy and Dwight pretend to hunt while Jim is on the phone with a client. Jim tells the client he'll call back. Dwight and Andy pretend to shoot Jim and Jim falls on his face on his desk. Charles mockingly tells the office to \"be quiet, Jim is taking a nap.\"",
                                "elements": []
                            },
                            {
                                "text": "Andy says that he lost his high notes from depression after breaking up with Angela and explains that since his friendship with Dwight, he can sing better than ever.",
                                "elements": []
                            },
                            {
                                "text": "Michael accidentally says Dunder Mifflin. Michael says he is \"such a blonde,\" leaving Ryan offended. Pam rolls her eyes.",
                                "elements": []
                            },
                            {
                                "text": "Ryan reads Pam's e-mails.",
                                "elements": []
                            },
                            {
                                "text": "Charles becomes angry when Jim asks Charles what a rundown is. Jim tells Charles he is kidding.",
                                "elements": []
                            },
                            {
                                "text": "Jim realizes that a rundown is a list of something. (in this case, clients).",
                                "elements": []
                            },
                            {
                                "text": "Pam points out that Ryan is watching videos on the computer. Pam tells Ryan, \"Screw You.\"",
                                "elements": []
                            },
                            {
                                "text": "Michael feeds his fish.",
                                "elements": []
                            },
                            {
                                "text": "Andy talks to Erin about sign-language. Dwight gives Andy his coffee, calling him \"Nard Dog.\" Dwight then talks to Erin and tells her to be careful to sit by the shredder.",
                                "elements": []
                            },
                            {
                                "text": "Erin admits that the office is like any other and asks the documentary crew if she has to do this every time she has a break.",
                                "elements": []
                            },
                            {
                                "text": "Angela asks to herself what Dwight and Andy have in common, but realizes she is the common ground.",
                                "elements": []
                            },
                            {
                                "text": "Michael compares himself to Pfizer and McDonald's.",
                                "elements": []
                            },
                            {
                                "text": "When Michael asks if this place is worse to work in than Dunder Mifflin, Ryan says, \"yup,\" but tells Michael that Pam said it.",
                                "elements": []
                            },
                            {
                                "text": "Ryan gives Michael his inhaler.",
                                "elements": []
                            },
                            {
                                "text": "Andy and Dwight prepare to go hunting. They talk about what position to stand in. Dwight brings up Andy's anger management problem.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Cultural references",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Michael drives to work playing Just Dance by Lady Gaga but misidentifies the singer as Britney Spears, a pop singer known for her many attempts to restart her music career (in the same way Michael is attempting to restart his paper career).",
                                "elements": []
                            },
                            {
                                "text": "Michael proclaims, \"They took away my parking space but they can't take away my pride!\" This is vaguely reminiscent of the line \"They may take our lives, but they'll never take our freedom\" from the movie Braveheart. It is also reminiscent of the lyric \"They took your life but they could not take your pride,\" from Pride (In the Name of Love) by U2. Michael names U2's lead singer, Bono, as one of his heroes but does not appear to know much about U2.",
                                "elements": []
                            },
                            {
                                "text": "The video Ryan watches instead of doing work is an advertisement for Flea Market Montgomery which was virally popular on the Internet in early 2007. Watch it.",
                                "elements": []
                            },
                            {
                                "text": "Take Me Home, Country Roads is a song by John Denver.",
                                "elements": []
                            },
                            {
                                "text": "An e-vite is an online invitational card e-mailed to people alerting them of events like parties.",
                                "elements": []
                            },
                            {
                                "text": "Damages is a show about a lawyer, her protegee, and her law firm.",
                                "elements": []
                            },
                            {
                                "text": "Over the phone, Ryan tells a friend that he wishes that his iPod could make calls. When the person on the other line presumably tells him that an iPod that makes phone calls is an iPhone, he replies that he knows what an iPhone is, and he doesn't want one.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Cast",
                "level": 2,
                "content": [],
                "images": []
            },
            {
                "title": "Main cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Steve Carell as Michael Scott",
                                "elements": []
                            },
                            {
                                "text": "Rainn Wilson as Dwight Schrute",
                                "elements": []
                            },
                            {
                                "text": "John Krasinski as Jim Halpert",
                                "elements": []
                            },
                            {
                                "text": "Jenna Fischer as Pam Beesly",
                                "elements": []
                            },
                            {
                                "text": "B.J. Novak as Ryan Howard",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Supporting cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Ed Helms as Andy Bernard",
                                "elements": []
                            },
                            {
                                "text": "Leslie David Baker as Stanley Hudson",
                                "elements": []
                            },
                            {
                                "text": "Brian Baumgartner as Kevin Malone",
                                "elements": []
                            },
                            {
                                "text": "Creed Bratton (actor) as Creed Bratton",
                                "elements": []
                            },
                            {
                                "text": "Kate Flannery as Meredith Palmer",
                                "elements": []
                            },
                            {
                                "text": "Mindy Kaling as Kelly Kapoor",
                                "elements": []
                            },
                            {
                                "text": "Angela Kinsey as Angela Martin",
                                "elements": []
                            },
                            {
                                "text": "Paul Lieberstein as Toby Flenderson",
                                "elements": []
                            },
                            {
                                "text": "Oscar Nunez as Oscar Martinez",
                                "elements": []
                            },
                            {
                                "text": "Phyllis Smith as Phyllis Vance",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Special guest star",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Idris Elba as Charles Miner",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Recurring cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Ellie Kemper as Erin Hannon",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Guest cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Patrick LoSasso as Russell",
                                "elements": []
                            },
                            {
                                "text": "Cindy Drummond as Ryan's Mom",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            }
        ]
    },
    "quotesDetails": {
        "sections": [
            {
                "title": "Michael Scott Paper Company Quotes",
                "level": 1,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Jim: The new receptionist is also named Kelly - so, Kelly Kapoor has decided to hover around my desk, so that she can run into Charles's office every time he calls for Kelly. She thinks if she says \"you wanted me\" enough, he will, in fact, want her...It's not the worst plan she's ever had."
                    },
                    {
                        "type": "paragraph",
                        "text": " Charles: I'm gonna call you \"Kapoor\", and you, \"Hannon\"\nErin: If we're changing names, can I be \"Erin\"? That's my middle name.\nCharles: \"Erin\"? OK - that's...very pretty.\nKelly: Well, you know what my middle name is? Rajnigandha - and I hate it...I HATE it!!!\nKevin: I thought Rajnigandha was a boy's name."
                    },
                    {
                        "type": "paragraph",
                        "text": "Dwight: Yes, I am taking Andy hunting after work. Not long ago we were sexual competitors. I used to hate him, hate him, hate him, hate him. I studied him, to figure out why I hated him so much. But that blossomed into a very real friendship, as these things often do."
                    }
                ],
                "images": []
            }
        ]
    },
    "coldOpens": [
        "Michael arrives back at Scranton business park to open Michael Scott Paper Company and in search of a good parking space."
    ],
    "storylines": [
        "Michael explains he is back for the new company and Pam and Ryan join him. They see their new office and look awkwardly at it. Pam and Ryan wait to get calls from clients and Michael eagerly waits for his upcoming Pancake Luncheon.",
        "Meanwhile, Kelly continues to be infatuated with Charles Miner. She tries to see him as much as she can by deliberately misinterpreting Charles as wanting her to come into his office every time he calls for the new receptionist, Kelly Hannon. Eventually, Charles tires of this and declares that he will call them by their last names instead. Kelly Hannon requests to be called Erin, her middle name. Kelly Kapoor then storms out.",
        "When Michael gives Ryan and Pam a paper to copy, Pam asks Ryan to do it as she doesn't want to be the receptionist anymore. Pam says she misses making copies. Ryan continues to be a lazy employee of the company, and talks to his friends on his phone. Ryan calls Pam a \"6 in New York and a 7 in Scranton\" based on her looks. Pam looks to the camera, disgusted.",
        "Andy and Dwight, once \"sexual competitors\" and enemies, become best friends and decide to go on a hunting trip. However, Dwight and Andy start to compete over Erin. Dwight plays a joke on Erin and talks to her. Andy briefly (and awkwardly) dances with Erin before she leaves the room. Dwight realizes that Andy is attracted to Erin, and admits that he is too. However, Andy and Dwight agree to not pursue a relationship with Erin, and instead continue to be friends.",
        "Charles asks Jim to create a “run-down” of his clients. Jim accepts the task, but doesn't know what a run-down is. He stalls, and asks Charles about a run-down and awkwardly talks to him. Hours later, still unknowing of what a run-down is, Jim asks Oscar and Kevin for help, but they are unaware as well. Charles asks Jim if he has started the run-down, but becomes angry when he discovers Jim is doing something else. When Jim finally brings the run-down to Charles, he is told to send it to everyone on the “distribution list”. Jim gives the run-down to his dad, still unknowing of what in fact, a run-down really is.",
        "Ryan spends his time watching videos on YouTube (specifically \"It's Just Like a Mini Mall\") . Pam and Ryan endlessly fight and Michael yells at them for fighting. Pam and Ryan remain bored and Pam yells at Ryan for putting a naked picture of Ryan's friend, Jasmine, on the computer. Ryan and Pam continue their feud. Michael has a talk with Pam and Ryan about disliking each other, and they talk about making a corner idea so that everyone can have a personal space. To Pam's sadness, her corner is the one with the copier.",
        "Pam goes to Charles to ask for her job back. Charles refuses, but Pam desperately asks if she can be his personal shopper. Pam admits she misses Dunder Mifflin.",
        "Phyllis and Stanley visit The Michael Scott Paper Company and tell Michael that Pam was seeing Charles. Michael starts to regret starting the company. Michael starts his pancake luncheon with Pam trying to get clients and Ryan not doing anything. Creed and Meredith take pancakes from Michael, which they don't like.",
        "Andy and Dwight continue to bond as they play their instruments. They play \"Take Me Home, Country Roads\" when Erin comes in. Andy and Dwight try to outdo the other in an attempt to impress her by playing it fast, by singing, and in Dwight's case singing in German. Erin looks shocked at how well they are playing and laughs. Erin, amused, leaves the break room, and continuing to play, Dwight and Andy are finally stopped by Toby Flenderson.",
        "After a day with no success, Michael, Pam, and Ryan are sad that they have made no clients. However, Pam makes her first sale when a client from the luncheon calls. Ryan, Pam, and Michael are ecstatic. As they leave the building, Michael tells the documentary crew that they have the people with the biggest hearts.",
        "When Angela sees Dwight and Andy bonding, she sarcastically rolls her eyes."
    ],
    "quotes": [
        "Jim: The new receptionist is also named Kelly - so, Kelly Kapoor has decided to hover around my desk, so that she can run into Charles's office every time he calls for Kelly. She thinks if she says \"you wanted me\" enough, he will, in fact, want her...It's not the worst plan she's ever had.",
        " Charles: I'm gonna call you \"Kapoor\", and you, \"Hannon\"\nErin: If we're changing names, can I be \"Erin\"? That's my middle name.\nCharles: \"Erin\"? OK - that's...very pretty.\nKelly: Well, you know what my middle name is? Rajnigandha - and I hate it...I HATE it!!!\nKevin: I thought Rajnigandha was a boy's name.",
        "Dwight: Yes, I am taking Andy hunting after work. Not long ago we were sexual competitors. I used to hate him, hate him, hate him, hate him. I studied him, to figure out why I hated him so much. But that blossomed into a very real friendship, as these things often do."
    ]
}