{
    "season": 5,
    "title": "Two Weeks",
    "episode": "21",
    "episodes": [
        21
    ],
    "coldOpens": [
        "Michael talks to his coworkers about his quitting story."
    ],
    "storylines": [
        "Having submitted his two weeks notice to Dunder Mifflin, Michael begins goofing off and drinking around the office, while new company vice president Charles Miner plans to hire the new regional manager from the outside, for \"obvious reasons.\" The employees suggest that Michael start looking for another job. Michael is unworried at first, until he learns how poorly the economy is performing. He first tries Prince Paper, but they had been run out of business by Dunder Mifflin. After finding no available work, Michael decides to start his own paper company and unsuccessfully tries to convince others around the office to join him. When Charles catches Michael labeling Dunder Mifflin customer lists with his new company's name, he orders security guard Hank to escort Michael from the building. Michael drives out of the parking lot, but is later spotted sneaking back into the building.",
        "Meanwhile, the office has received a new copy machine, but it is not assembled, so Pam spends the day putting it together as the rest of the employees hassle and tease her. Meanwhile, Angela and Kelly continue to flirt with Charles, who claims to be aware of the effect he has on women.",
        "Michael sneaks back into the office, crawling on the floor below the desks so Charles, who is sitting in the conference room, will not notice him. Michael grabs his customer list and makes a final desperate offer for the other employees to join him. Charles notices Michael and physically threatens him, prompting Michael to leave without the customer list. After Charles angrily closes the conference room door, Pam follows Michael out of the building, announcing that she's leaving with him. However, she tells Michael she wants to be a salesperson at his new company, not a receptionist. Michael agrees, and the two leave together, feeling both exhilarated and apprehensive.",
        "At the end of the episode, Charles, who still knows very little about the employees at the Scranton branch, decides to make Kevin the temporary receptionist and make Stanley the office's \"Productivity Czar,\" much to the surprise of both men."
    ],
    "quotes": [
        [
            {
                "speaker": "Dwight",
                "content": " [examining the copier manual] Do you want me to translate the German instructions for you?"
            },
            {
                "speaker": "Pam",
                "content": " No, I'm sure they're pretty much the same as the English instructions."
            },
            {
                "speaker": "Dwight",
                "content": " Typical American ignorance that got us involved in a war we never should have been in. World War II."
            },
            {
                "speaker": "Pam",
                "content": " That's a really... well fine, Do the German instructions say what this is supposed to do?"
            },
            {
                "speaker": "Dwight",
                "content": " Deutsch... let me see here. That is either an incense dispenser, or a ceremonial sarcophagus."
            }
        ]
    ]
}