{
    "season": 5,
    "title": "Café Disco",
    "episode": "27",
    "episodes": [
        27
    ],
    "episodeDetails": {
        "sections": [
            {
                "title": "Café Disco",
                "level": 1,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "\"Café Disco\" is the twenty-seventh episode of the fifth season of The Office, and the 99th episode overall. It was written by Warren Lieberstein and Halsted Sullivan and directed by Randall Einhorn. It first aired on May 7, 2009 and was viewed by 7.71 million people."
                    }
                ],
                "images": []
            },
            {
                "title": "Synopsis",
                "level": 2,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Erin exclaims that she has just won an art contest. Pam and Jim exchange disbelieving looks while Dwight watches them deviously. Dwight pays Erin, who responds in an audible whisper that she still doesn't know why Dwight wanted her to do that. Dwight burst out in savage laughter in his talking head saying he \"got\" Pam. Back in the office, Pam tells him that wasn't cool, but Dwight continues to laugh uncontrollably."
                    },
                    {
                        "type": "paragraph",
                        "text": "The documentary crew finds Michael dancing in the empty room that he still has under his lease for the Michael Scott Paper Company. When Michael returns to the Dunder Mifflin office to entice them to join him, everyone declines the offer. While Michael \"relieves stress\" in the room formerly the Michael Scott Paper Company, Erin tries to deliver him a memo. Michael forbids work and Erin begins to dance with him. They later return to the office, both with espresso cups, and Michael announces he has figured out what's going on. He believes Charles made them become \"too focused on work\". In an attempt to get the office more relaxed, he explains about the converted room downstairs. Erin finally helps Michael put a label to the room: the Café Disco. Kevin joins Michael downstairs for the all-you-can-drink espresso, but Angela needs him to return to work. Michael sympathizes with the founders of Phillip Morris inasmuch as his attempt to give people a means of relaxation is rejected."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael's next attempt to increase attendance to the Cafe Disco is to hold the boom box speaker up to the ceiling vent, piping \"Everybody Dance Now\" into the Dunder Mifflin office. Phyllis, won over by the music, leaves to get Bob. When she enters Vance Refrigeration, Bob's new secretary, Jessica (who bears physical resemblance to Phyllis), informs Phyllis her husband doesn't want to be disturbed. Suspicious, Phyllis leaves a message with Jessica and proceeds to the Café Disco. Michael is surprised Phyllis would show up, but quickly overcomes this and they begin dancing. While dancing, Phyllis throws out her back. Michael texts Dwight for assistance and the two wheel her back up to the office. Dwight takes Phyllis into the conference room and tends to her as he would a horse. He cuts open the back of her shirt to massage her, hand-feeds her vegetables, and says \"whoa, girl,\" when she tries to get up. Phyllis confesses to him her fear that Bob may cheat on her with his secretary but the two laugh when she realizes how ridiculous the idea sounds."
                    },
                    {
                        "type": "paragraph",
                        "text": "Though Michael tries to still promote interest in the Café Disco everyone wishes Michael would stop his shenanigans. Michael throws his keys at Erin, tells her to \"shut it down\", and storms into his office to eat his lunch alone. Kelly helps Erin dismantle the Cafe Disco but when Kelly turns off the light, Erin decides to turn on the boom box. They begin dancing, and Leo from the warehouse notices them. In no time, the room is packed with nearly everyone from the office and even Erin's friend Ashley. Upstairs, Michael hears the music from the revived Café Disco and follows it. Andy begins a dance off with Kelly. Creed donates the mini disco ball he'd been using as a rearview mirror. Angela walks straight under the limbo pole and tries to get Michael to sign some papers. Michael refuses to sign more than one paper per song, exasperating Angela. Michael further forbids her to clean up to which Angela exclaims \"am I not allowed to have some fun?\""
                    },
                    {
                        "type": "paragraph",
                        "text": "Jim and Pam decide they are going to get married today in Youngstown, Ohio, because there is no three-day waiting period. Jim picks some flowers from the planters outside the office and presents them to Pam. As they leave to elope, they stop by the Café Disco. Nobody seems to notice Pam's pink wedding dress as she and Jim join the party. Dwight and Phyllis return (her blouse mended with staples) and they begin to dance as well, Phyllis with Bob. While everyone dances to the song \"YMCA\", Kevin makes out with Lynn and Jim and Pam realize they both want a real wedding. In the end, although she refuses to dance, Angela taps her foot to the beat. In the women's bathroom, Kelly prepares to give Andy the ear piercing she claims he's been wanting, but Andy screams when she has only touched his ear with the ice."
                    }
                ],
                "images": []
            },
            {
                "title": "Notes",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "The Café Disco is in the old Michael Scott Paper Company office. In previous episodes, the office was able to hear sounds from the Dunder Mifflin men's bathroom, whereas in this episode, Michael and Creed can hear the office's music from the bathroom.",
                                "elements": []
                            },
                            {
                                "text": "Several songs are featured in the episode, including \"Boy Hangover\", written by Lester Lewis especially for The Office.",
                                "elements": []
                            },
                            {
                                "text": "Dwight and Phyllis further their friendship that arguably began in Crime Aid.",
                                "elements": []
                            },
                            {
                                "text": "When Creed walks out of the bathroom he is eating chicken.",
                                "elements": []
                            },
                            {
                                "text": "The woman (Lynn) who Kevin makes out with in the Café Disco is the woman he met in the Valentine's Day episode.",
                                "elements": []
                            },
                            {
                                "text": "Michael asks Erin if she would like an espresso and then adds \"Gotta keep yourself dehydrated\". This is because coffee is a diuretic.",
                                "elements": []
                            },
                            {
                                "text": "Michael mentions the \"all you can eat espresso\", he obviously means all you can drink.",
                                "elements": []
                            },
                            {
                                "text": "One of the songs played in the Café Disco is \"Cat People (Putting Out Fire)\" by David Bowie. This song was featured in the 2009 film Inglourious Basterds, which was released around the time that Café Disco aired. B.J. Novak had a role in Inglourious Basterds.",
                                "elements": []
                            },
                            {
                                "text": "During the dance-off, Kelly does parts of the famous chair-routine from Flashdance.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Amusing Details",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "A limbo bar is placed at the entrance to the disco room. Everyone has to limbo under it except Angela, who merely walks under it.",
                                "elements": []
                            },
                            {
                                "text": "Michael tells Erin to come to Cafe Disco anytime because the lock on the door is broken, however later in the episode when Michael tells Erin to shut it down, he tosses her a keychain, implying that she would lock the door.",
                                "elements": []
                            },
                            {
                                "text": "Creed gives Michael a mini disco ball for Cafe Disco, and suggests that he uses it as a rearview mirror in his car, saying, \"I'll just have no idea who's driving behind me now.\"",
                                "elements": []
                            },
                            {
                                "text": "When Dwight discovers somebody has plans to visit a courthouse in Ohio, he says one of the reasons to do so is \"to obtain a learner's permit at age 14½ instead of 15\". The state of Ohio requires that you be 15½ to get a permit and the state of Pennsylvainia requires that you be 16.",
                                "elements": []
                            }
                        ]
                    },
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "When Dwight asks to see Erin's birth certificate, she reaches into her purse looking for it. This is likely because she is adopted, so she would be carrying it for proof if somebody arrived who claimed to be her birth parents.",
                                "elements": []
                            },
                            {
                                "text": "Michael says he still has the lease on the Michael Scott Paper Company office, however in Dream Team, it is heavily implied that they do not pay a lease on the office as it is a closet and Billy is just doing Michael a favor.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Cast",
                "level": 2,
                "content": [],
                "images": []
            },
            {
                "title": "Main cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Steve Carell as Michael Scott",
                                "elements": []
                            },
                            {
                                "text": "Rainn Wilson as Dwight Schrute",
                                "elements": []
                            },
                            {
                                "text": "John Krasinski as Jim Halpert",
                                "elements": []
                            },
                            {
                                "text": "Jenna Fischer as Pam Beesly",
                                "elements": []
                            },
                            {
                                "text": "B.J. Novak as Ryan Howard",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Supporting cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Ed Helms as Andy Bernard",
                                "elements": []
                            },
                            {
                                "text": "Leslie David Baker as Stanley Hudson",
                                "elements": []
                            },
                            {
                                "text": "Brian Baumgartner as Kevin Malone",
                                "elements": []
                            },
                            {
                                "text": "Creed Bratton (actor) as Creed Bratton",
                                "elements": []
                            },
                            {
                                "text": "Kate Flannery as Meredith Palmer",
                                "elements": []
                            },
                            {
                                "text": "Mindy Kaling as Kelly Kapoor",
                                "elements": []
                            },
                            {
                                "text": "Angela Kinsey as Angela Martin",
                                "elements": []
                            },
                            {
                                "text": "Oscar Nunez as Oscar Martinez",
                                "elements": []
                            },
                            {
                                "text": "Phyllis Smith as Phyllis Vance",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Recurring cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Ellie Kemper as Erin Hannon",
                                "elements": []
                            },
                            {
                                "text": "Bobby Ray Shafer as Bob Vance",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Guest cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Lisa K. Wyatt as Lynn",
                                "elements": []
                            },
                            {
                                "text": "Lee Eisenberg as Gino",
                                "elements": []
                            },
                            {
                                "text": "Gene Stupnitsky as Leo",
                                "elements": []
                            },
                            {
                                "text": "Alyssa Preston as Jessica",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            }
        ]
    },
    "quotesDetails": {
        "sections": [
            {
                "title": "Cafe Disco Quotes",
                "level": 1,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Michael: Now I know what the founders of Phillip-Morris felt like. You just want to give people a smooth, fun way to relax and suddenly you're just some terrible monster."
                    },
                    {
                        "type": "paragraph",
                        "text": "Jim: Oh, so this morning at breakfast, we're having breakfast together, and I just looked up from my cereal and I said, 'You what I want to do today? I wanna marry you'."
                    },
                    {
                        "type": "paragraph",
                        "text": "Pam: I had just woken up. I didn't look cute. That's how I knew he meant it."
                    }
                ],
                "images": []
            }
        ]
    },
    "coldOpens": [
        "Dwight uses the new receptionist to pull a prank on Jim and Pam."
    ],
    "storylines": [
        "Erin exclaims that she has just won an art contest. Pam and Jim exchange disbelieving looks while Dwight watches them deviously. Dwight pays Erin, who responds in an audible whisper that she still doesn't know why Dwight wanted her to do that. Dwight burst out in savage laughter in his talking head saying he \"got\" Pam. Back in the office, Pam tells him that wasn't cool, but Dwight continues to laugh uncontrollably.",
        "The documentary crew finds Michael dancing in the empty room that he still has under his lease for the Michael Scott Paper Company. When Michael returns to the Dunder Mifflin office to entice them to join him, everyone declines the offer. While Michael \"relieves stress\" in the room formerly the Michael Scott Paper Company, Erin tries to deliver him a memo. Michael forbids work and Erin begins to dance with him. They later return to the office, both with espresso cups, and Michael announces he has figured out what's going on. He believes Charles made them become \"too focused on work\". In an attempt to get the office more relaxed, he explains about the converted room downstairs. Erin finally helps Michael put a label to the room: the Café Disco. Kevin joins Michael downstairs for the all-you-can-drink espresso, but Angela needs him to return to work. Michael sympathizes with the founders of Phillip Morris inasmuch as his attempt to give people a means of relaxation is rejected.",
        "Michael's next attempt to increase attendance to the Cafe Disco is to hold the boom box speaker up to the ceiling vent, piping \"Everybody Dance Now\" into the Dunder Mifflin office. Phyllis, won over by the music, leaves to get Bob. When she enters Vance Refrigeration, Bob's new secretary, Jessica (who bears physical resemblance to Phyllis), informs Phyllis her husband doesn't want to be disturbed. Suspicious, Phyllis leaves a message with Jessica and proceeds to the Café Disco. Michael is surprised Phyllis would show up, but quickly overcomes this and they begin dancing. While dancing, Phyllis throws out her back. Michael texts Dwight for assistance and the two wheel her back up to the office. Dwight takes Phyllis into the conference room and tends to her as he would a horse. He cuts open the back of her shirt to massage her, hand-feeds her vegetables, and says \"whoa, girl,\" when she tries to get up. Phyllis confesses to him her fear that Bob may cheat on her with his secretary but the two laugh when she realizes how ridiculous the idea sounds.",
        "Though Michael tries to still promote interest in the Café Disco everyone wishes Michael would stop his shenanigans. Michael throws his keys at Erin, tells her to \"shut it down\", and storms into his office to eat his lunch alone. Kelly helps Erin dismantle the Cafe Disco but when Kelly turns off the light, Erin decides to turn on the boom box. They begin dancing, and Leo from the warehouse notices them. In no time, the room is packed with nearly everyone from the office and even Erin's friend Ashley. Upstairs, Michael hears the music from the revived Café Disco and follows it. Andy begins a dance off with Kelly. Creed donates the mini disco ball he'd been using as a rearview mirror. Angela walks straight under the limbo pole and tries to get Michael to sign some papers. Michael refuses to sign more than one paper per song, exasperating Angela. Michael further forbids her to clean up to which Angela exclaims \"am I not allowed to have some fun?\"",
        "Jim and Pam decide they are going to get married today in Youngstown, Ohio, because there is no three-day waiting period. Jim picks some flowers from the planters outside the office and presents them to Pam. As they leave to elope, they stop by the Café Disco. Nobody seems to notice Pam's pink wedding dress as she and Jim join the party. Dwight and Phyllis return (her blouse mended with staples) and they begin to dance as well, Phyllis with Bob. While everyone dances to the song \"YMCA\", Kevin makes out with Lynn and Jim and Pam realize they both want a real wedding. In the end, although she refuses to dance, Angela taps her foot to the beat. In the women's bathroom, Kelly prepares to give Andy the ear piercing she claims he's been wanting, but Andy screams when she has only touched his ear with the ice."
    ],
    "quotes": [
        "Michael: Now I know what the founders of Phillip-Morris felt like. You just want to give people a smooth, fun way to relax and suddenly you're just some terrible monster.",
        "Jim: Oh, so this morning at breakfast, we're having breakfast together, and I just looked up from my cereal and I said, 'You what I want to do today? I wanna marry you'.",
        "Pam: I had just woken up. I didn't look cute. That's how I knew he meant it."
    ]
}