{
    "season": 5,
    "title": "New Boss",
    "episode": "20",
    "episodes": [
        20
    ],
    "episodeDetails": {
        "sections": [
            {
                "title": "New Boss",
                "level": 1,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "\"New Boss\" is the twentieth episode of the fifth season of The Office and is the show's 92nd episode overall. It was written by Lee Eisenberg and Gene Stupnitsky who also wrote Weight Loss and The Surplus. It aired on March 19, 2009. It was viewed by 7.95 million people."
                    }
                ],
                "images": []
            },
            {
                "title": "Plot",
                "level": 2,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Jim, Dwight, Pam, and Michael try to come up with ideas for Michael's 15 year anniversary. Jim is wearing a tuxedo, prompted by a memo sent by Dwight encouraging a more rigid dress code that happens to coincide with his and Angela's preferred manner of dress. Michael, impressed by Jim's classy attire, gives his ideas preferential treatment...even though Jim just rephrases Dwight's suggestions. Dwight storms out of the conference room in anger."
                    },
                    {
                        "type": "paragraph",
                        "text": "If Jim had known that the new VP of Sales, Charles Miner, was coming today, he would not have worn the tuxedo. Charles is a tall, good-looking African-American man who instantly gets looks from the women in the office. Michael and Charles had met at a previous meeting with David Wallace and gotten along fine. Though Michael has gone to all the trouble of bringing in bagels from which he has cut out chunks so that they will resemble the letter C, he neglected to tell the staff their new VP was coming today. Charles is also unhappy to find out that Michael has not communicated some new guidelines to save money: watching expenses, managing petty cash flow, Corporate approval for overtime and fewer parties."
                    },
                    {
                        "type": "paragraph",
                        "text": "Charles also notices Jim's tuxedo. Normally unflappable, Jim has a hard time explaining his reasoning. Charles looks unimpressed and slightly groans. Pam explains that it took 40 minutes to get ready."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael quickly resents what he feels is his position being usurped. He calls David Wallace to complain about this unwanted supervision. When he tries to get personal information out of Charles, he is only able to learn that Charles used to work at Saticoy Steel. Michael is shocked that he didn't work in the paper industry and tells Charles that he doesn't need to be managed, explaining Ryan's and Jan's largely ineffective styles."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael, worried, continues to call David. When David doesn't answer, Dwight tells the receptionist, Stephanie, that he is \"Michael Scotch\" and that he has David's son in the car held captive. Michael, shocked, calls back and says that everything is fine."
                    },
                    {
                        "type": "paragraph",
                        "text": "Feeling uncomfortable at Charles' constantly watching him, Jim asks the camera not to document him. Michael and Charles get into an argument when Charles overrides Michael authorizing overtime for Kevin. After resorting to increasingly childish behavior, Michael orders the PPC into the conference room. In the meantime, Kelly asks Angela if she should seduce Charles. Angela snaps, \"No one wants to see that.\""
                    },
                    {
                        "type": "paragraph",
                        "text": "After finding out from a resentful Phyllis that the PPC stands for Party Planning Committee and that hours are wasted on meetings, Charles bursts into the conference room to find out what they are doing. Michael protests that some great ideas for his party are being suggested, especially by Jim. Charles reads Jim's list which includes a two-way petting zoo (\"You pet the animals and they pet you back\") and instantly dissolves the committee."
                    },
                    {
                        "type": "paragraph",
                        "text": "Furious that Charles won't allow the Party Planning Committee to continue, Michael threatens to call David Wallace. Charles explains that he will tell David what he needs to know. After several weeks in which David has come to realize that Michael has little control over his branch, contacts David constantly over issues he should be able to resolve himself and resorts to extreme tactics to get a return call, David has apparently realized that the Scranton branch succeeds despite Michael, not because of him. This policy has been implemented so that Charles will perform the same role as Jan and Ryan, limiting Michael's contact with David. Not wanting to give up having the CFO's ear, Michael storms off to New York to confront David."
                    },
                    {
                        "type": "paragraph",
                        "text": "Knowing he's gotten off on the wrong foot with Charles, Jim tries to explain that he really is a hard worker, a productive employee and a good second-in-command. Charles apparently was never told that Jim is the office's number two and Jim doesn't do a good job of explaining it, leaving Charles to believe that this is just an imaginary position."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael arrives at Corporate and catches David coming out of the men's room, furious that he's been brushed off all day due to alleged meetings. He protests that he's worked for the company for 15 years, has been loyal to it and made sacrifices for it. He shouldn't have to drive all the way to New York City to speak with the CFO. David agrees and attempts to placate Michael by allowing the 15th Anniversary Party and telling him that he will attend it. Michael realizes he's being humored and he abruptly quits Dunder Mifflin. As he walks out the door he says, \"You have no idea how high I can fly\"."
                    },
                    {
                        "type": "paragraph",
                        "text": "Kelly tries to get Charles to date her but sees Angela in the parking lot. Angela says that Charles and Kelly are not meant for each other because \"Charles is a sophisticated man, and he doesn't need to go dumpster diving for companionship\"."
                    }
                ],
                "images": []
            },
            {
                "title": "Cultural References",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "While discussing plans for Michael's party, Pam and Jim describe a surreal scenario where a stripper comes out of a cake with another cake from which another stripper appears, and so on. When asked about this Pam says \"It's cupcakes and strippers all the way down.\" This may be a reference to a story popularized by Stephen Hawking, where an astronomer was describing the movements of celestial bodies, but was interrupted by an old lady claiming that the Earth was flat, and rested on a giant turtle. When asked what that turtle was on, she replied \"It's turtles all the way down.\"",
                                "elements": []
                            },
                            {
                                "text": "Charles says that Dunder-Mifflin isn't matching 401(K) plans. A 401(K) plan is a retirement plan allowing a worker to save money for retirement. Companies can match contributions, if they want to.",
                                "elements": []
                            },
                            {
                                "text": "When Pam says that Michael does an \"Ace Ventura talking butt thing\", it refers to a movie called Ace Ventura: Pet Detective a movie starring Jim Carrey.",
                                "elements": []
                            },
                            {
                                "text": "Chocolate-covered strawberries are a popular snack food made by dipping fresh strawberries into a chocolate fountain.",
                                "elements": []
                            },
                            {
                                "text": "Using --er, I hardly know her is a popular joke used when a word ends in an \"er.\" For example, when Michael tells Pam, \"Miner' (\"Mine Her\"), I hardly know her, it implies that Pam asked Michael to in fact, \"mine her.\"",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Amusing Details",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Since The Office is filmed in California, rain is a rarity. However, rain is falling heavily in this episode.",
                                "elements": []
                            },
                            {
                                "text": "Charles Miner continues the streak of Michael having problems with the VP of Northeast Sales.",
                                "elements": []
                            },
                            {
                                "text": "Michael says \"ASAP As Possible.\"",
                                "elements": []
                            },
                            {
                                "text": "Kelly appears to be talking to the camera crew and the viewers of the documentary while putting on makeup.",
                                "elements": []
                            },
                            {
                                "text": "Dwight looks at the tape dispenser on the desk before making up the name Michael Scotch.",
                                "elements": []
                            },
                            {
                                "text": "Idris Elba considers The Office as his only comedic acting job. He is also the the second of four cast members of the drama, The Wire, to appear on The Office. The others are: Amy Ryan, who played Holly Flax; David Costabile, as a banker in Season 6's, The Banker; and Chris Bauer, as Harry Jannerone in Season 8's Turf War.",
                                "elements": []
                            },
                            {
                                "text": "When Charles says that he worked at \"Saticoy Steel\", it is a reference to where The Office is filmed, on Saticoy Street.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Connections to previous episodes",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Michael tells Charles that he planned to have egg salad for lunch despite the fact that he adamantly refused Oscar’s offer to share his egg salad on the plane to Winnipeg in “Business Trip”, likening the smell of egg salad to a bag of baby poop.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Goofs",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "The number two position is not fake, to which Jim and Charles imply. In Season 3, Jan Levinson tells Jim that he is the number two for Scranton, and Jim accepts.",
                                "elements": []
                            },
                            {
                                "text": "Though many fans thought that Michael said, \"I acquit,\" Jenna Fischer's MySpace blog confirmed that Michael, in fact said, \"I quit.\"",
                                "elements": []
                            },
                            {
                                "text": "After Michael has driven to New York to talk to David Wallace, you can see his PT Cruiser parked in the parking lot outside the office when Angela and Kelly both go out to find Charles.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Deleted Scenes",
                "level": 2,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "On the Season 5 DVD there were several deleted scenes. Notable cuts include:"
                    },
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "The office talks about Charles Miner. Creed asks who Charles is working for.",
                                "elements": []
                            },
                            {
                                "text": "Dwight mocks Jim about Charles not liking him.",
                                "elements": []
                            },
                            {
                                "text": "Michael tells Charles that in the mid-90's, the PPC was started. Charles doesn't care and says that the party isn't important.",
                                "elements": []
                            },
                            {
                                "text": "Michael says he will stand for micro-managing, but then tells the crew he won't.",
                                "elements": []
                            },
                            {
                                "text": "Charles makes fun of Jim's work ethic. Pam asks Jim to leave her desk.",
                                "elements": []
                            },
                            {
                                "text": "Michael has mixed emotions for quitting his job. He calls his mom, cries, laughs, and eats.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Quotes",
                "level": 2,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "For quotes see: New Boss Quotes."
                    }
                ],
                "images": []
            },
            {
                "title": "Trivia",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Michael assumes that Charles Miner is married, whereas Kelly and Angela assume he is single. The truth has yet to be revealed.",
                                "elements": []
                            },
                            {
                                "text": "When Charles' subs are being brought in they are in a box from Quality Snack Foods.",
                                "elements": []
                            },
                            {
                                "text": "As this episode surrounds Michael's 15th anniversary, it can be inferred that he started work on March 19th, 1994, assuming that this episode is set on its airdate. However, in the season 7 episode Michael's Last Dundies, he is said to have worked at Dunder-Mifflin, as of April 21, 2011 (that episode's airdate) for \"9,986,000 minutes\". This means that, if one takes that figure to mean the number of minutes since he began his job, and not just his time present in the office, Michael has worked at Dunder-Mifflin for a minimum of 19 years as of Michael's Last Dundies, and 17 years as of this episode. Then again one must remember that a year was supposed to have passed between season 6 and 7.",
                                "elements": []
                            },
                            {
                                "text": "B.J. Novak (Ryan Howard) is credited but does not appear in this episode.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Cast",
                "level": 2,
                "content": [],
                "images": []
            },
            {
                "title": "Main Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Steve Carell as Michael Scott",
                                "elements": []
                            },
                            {
                                "text": "Rainn Wilson as Dwight Schrute",
                                "elements": []
                            },
                            {
                                "text": "John Krasinski as Jim Halpert",
                                "elements": []
                            },
                            {
                                "text": "Jenna Fischer as Pam Beesly",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Supporting Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Ed Helms as Andy Bernard",
                                "elements": []
                            },
                            {
                                "text": "Leslie David Baker as Stanley Hudson",
                                "elements": []
                            },
                            {
                                "text": "Brian Baumgartner as Kevin Malone",
                                "elements": []
                            },
                            {
                                "text": "Creed Bratton (actor) as Creed Bratton",
                                "elements": []
                            },
                            {
                                "text": "Kate Flannery as Meredith Palmer",
                                "elements": []
                            },
                            {
                                "text": "Mindy Kaling as Kelly Kapoor",
                                "elements": []
                            },
                            {
                                "text": "Angela Kinsey as Angela Martin",
                                "elements": []
                            },
                            {
                                "text": "Oscar Nunez as Oscar Martinez",
                                "elements": []
                            },
                            {
                                "text": "Phyllis Smith as Phyllis Vance",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Special Guest Star",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Idris Elba as Charles Miner",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Recurring Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Andy Buckley as David Wallace",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Guest Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Suzanne Watson as Stephanie",
                                "elements": []
                            },
                            {
                                "text": "Lisa K. Wyatt as Lynn",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            }
        ]
    },
    "quotesDetails": {
        "sections": [
            {
                "title": "New Boss Quotes",
                "level": 1,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Jim : I don't know. Is it classy enough?"
                    },
                    {
                        "type": "paragraph",
                        "text": "Jim: The thing about classy is it's a state of mind."
                    },
                    {
                        "type": "paragraph",
                        "text": "Pam: I can tell Michael's mood by which comedy routine he chooses to do, the more infantile, the more upset he is. And he just skipped the Ace Ventura talking butt thing. He never skips it. This is bad."
                    }
                ],
                "images": []
            }
        ]
    },
    "coldOpens": [
        "Michael decides to celebrate his 15th anniversary. Dwight doesn't like his outfit. Jim is Mr. Peanut. Jim talks about ice sculptures."
    ],
    "storylines": [
        "Jim, Dwight, Pam, and Michael try to come up with ideas for Michael's 15 year anniversary. Jim is wearing a tuxedo, prompted by a memo sent by Dwight encouraging a more rigid dress code that happens to coincide with his and Angela's preferred manner of dress. Michael, impressed by Jim's classy attire, gives his ideas preferential treatment...even though Jim just rephrases Dwight's suggestions. Dwight storms out of the conference room in anger.",
        "If Jim had known that the new VP of Sales, Charles Miner, was coming today, he would not have worn the tuxedo. Charles is a tall, good-looking African-American man who instantly gets looks from the women in the office. Michael and Charles had met at a previous meeting with David Wallace and gotten along fine. Though Michael has gone to all the trouble of bringing in bagels from which he has cut out chunks so that they will resemble the letter C, he neglected to tell the staff their new VP was coming today. Charles is also unhappy to find out that Michael has not communicated some new guidelines to save money: watching expenses, managing petty cash flow, Corporate approval for overtime and fewer parties.",
        "Charles also notices Jim's tuxedo. Normally unflappable, Jim has a hard time explaining his reasoning. Charles looks unimpressed and slightly groans. Pam explains that it took 40 minutes to get ready.",
        "Michael quickly resents what he feels is his position being usurped. He calls David Wallace to complain about this unwanted supervision. When he tries to get personal information out of Charles, he is only able to learn that Charles used to work at Saticoy Steel. Michael is shocked that he didn't work in the paper industry and tells Charles that he doesn't need to be managed, explaining Ryan's and Jan's largely ineffective styles.",
        "Michael, worried, continues to call David. When David doesn't answer, Dwight tells the receptionist, Stephanie, that he is \"Michael Scotch\" and that he has David's son in the car held captive. Michael, shocked, calls back and says that everything is fine.",
        "Feeling uncomfortable at Charles' constantly watching him, Jim asks the camera not to document him. Michael and Charles get into an argument when Charles overrides Michael authorizing overtime for Kevin. After resorting to increasingly childish behavior, Michael orders the PPC into the conference room. In the meantime, Kelly asks Angela if she should seduce Charles. Angela snaps, \"No one wants to see that.\"",
        "After finding out from a resentful Phyllis that the PPC stands for Party Planning Committee and that hours are wasted on meetings, Charles bursts into the conference room to find out what they are doing. Michael protests that some great ideas for his party are being suggested, especially by Jim. Charles reads Jim's list which includes a two-way petting zoo (\"You pet the animals and they pet you back\") and instantly dissolves the committee.",
        "Furious that Charles won't allow the Party Planning Committee to continue, Michael threatens to call David Wallace. Charles explains that he will tell David what he needs to know. After several weeks in which David has come to realize that Michael has little control over his branch, contacts David constantly over issues he should be able to resolve himself and resorts to extreme tactics to get a return call, David has apparently realized that the Scranton branch succeeds despite Michael, not because of him. This policy has been implemented so that Charles will perform the same role as Jan and Ryan, limiting Michael's contact with David. Not wanting to give up having the CFO's ear, Michael storms off to New York to confront David.",
        "Knowing he's gotten off on the wrong foot with Charles, Jim tries to explain that he really is a hard worker, a productive employee and a good second-in-command. Charles apparently was never told that Jim is the office's number two and Jim doesn't do a good job of explaining it, leaving Charles to believe that this is just an imaginary position.",
        "Michael arrives at Corporate and catches David coming out of the men's room, furious that he's been brushed off all day due to alleged meetings. He protests that he's worked for the company for 15 years, has been loyal to it and made sacrifices for it. He shouldn't have to drive all the way to New York City to speak with the CFO. David agrees and attempts to placate Michael by allowing the 15th Anniversary Party and telling him that he will attend it. Michael realizes he's being humored and he abruptly quits Dunder Mifflin. As he walks out the door he says, \"You have no idea how high I can fly\".",
        "Kelly tries to get Charles to date her but sees Angela in the parking lot. Angela says that Charles and Kelly are not meant for each other because \"Charles is a sophisticated man, and he doesn't need to go dumpster diving for companionship\"."
    ],
    "quotes": [
        "Jim : I don't know. Is it classy enough?",
        "Jim: The thing about classy is it's a state of mind.",
        "Pam: I can tell Michael's mood by which comedy routine he chooses to do, the more infantile, the more upset he is. And he just skipped the Ace Ventura talking butt thing. He never skips it. This is bad."
    ]
}