{
    "season": 5,
    "title": "Casual Friday",
    "episode": "26",
    "episodes": [
        26
    ],
    "coldOpens": [
        "Kevin brings a huge pot of his \"Kevin's Famous Chili\" dish to the office, and accidentally drops it onto the floor, making a big mess of the carpet and himself as he tries to scoop it back into the pot."
    ],
    "storylines": [
        "Michael Scott has returned to his old job as regional manager of the Dunder Mifflin Scranton branch and announces that Pam and Ryan have joined the sales team, retaining their old clients from the Michael Scott Paper Company. Dwight, Andy, Phyllis and Stanley are upset because most of those clients were ones Michael previously stole from them. They are also upset that Michael treats Pam and Ryan with more respect because they were the only people to follow him to his new company, with Michael believing his company operates within the branch despite the buyout. Dwight calls a secret meeting in the warehouse with the salespeople, minus Pam and Ryan, to think of a way to get their clients back.",
        "Jim, trying to remain impartial, informs Michael of the potential mutiny and heads to the break room to play chess with Creed until the conflict is resolved. Things take a turn for the worse when Dwight interrupts a sales call with Ryan, causing him to lose the client. Michael steps in and demands an apology, but Dwight, Andy, Phyllis and Stanley threaten to quit and start their own paper company. When Michael calls their bluff, Phyllis breaks down and says that they were the real victims of Michael's company, not corporate, and that they were hurt since Michael had treated them like a family and then turned on them. Michael is taken aback by her words.",
        "Meanwhile, it is Casual Friday and most people dress too loosely at the office. Angela complains to Toby about Oscar wearing sandals to work and having to look at his feet. Meredith disgusts the rest of the employees by wearing a very short dress without any panties or a bra, thus exposing herself to the rest of the office as she tries to adjust it to meet Toby's requests. Toby calls a meeting with everyone regarding Casual Friday. When Dwight tries to take charge of the meeting, Toby is finally stern with him and cancels Casual Friday, much to everyone's disappointment.",
        "Michael calls a meeting with Dwight, Andy, Phyllis and Stanley to give them a formal apology, but they do not accept it since all they want is their clients back. Michael reluctantly agrees to give back their clients. In doing so, however, there are not enough clients to keep both Pam and Ryan on the sales team, leaving Michael to decide which one to keep. He talks it over with Jim, who suggests Pam would be better suited, while Michael thinks Ryan should get it. Michael calls a meeting with Pam after meeting with Ryan to inform her she did not get the sales job. Pam is visibly disappointed, but Michael starts laughing and tells her that she did get it, having offered Ryan a temp position again. Pam laughs it off and tells him he should stop with the \"fake-firing\" joke. Michael then decides to pull the joke on the new receptionist, Erin Hannon."
    ],
    "quotes": [
        [
            {
                "speaker": "Dwight",
                "content": " When held over heat the invisible ink will reveal that everyone should meet at the warehouse immediately. Do not ask me where I got the invisible ink. Urine. It was urine."
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " I'm going to have some of this meat sandwich."
            }
        ],
        [
            {
                "speaker": "Dwight",
                "content": " It's pony."
            }
        ],
        [
            {
                "speaker": "Dwight",
                "content": " What are you doing here!?"
            }
        ],
        [
            {
                "speaker": "Meredith",
                "content": " I dunno. I saw a crowd, I thought there might a dog fight or someth-"
            }
        ],
        [
            {
                "speaker": "Dwight",
                "content": " Get out!"
            }
        ],
        [
            {
                "speaker": "Oscar",
                "content": " Meredith, your boob is out!"
            }
        ],
        [
            {
                "speaker": "Kelly",
                "content": " Dammit, Meredith, where are your panties?!"
            }
        ],
        [
            {
                "speaker": "Meridith",
                "content": " Hey, it's causal Friday."
            }
        ],
        [
            {
                "speaker": "Angela",
                "content": " The man is wearing sandals. I don't need to see Oscar's toes at work. Gross! I mean, it looks like he just got off the boat."
            }
        ]
    ]
}