{
    "season": 5,
    "title": "Company Picnic",
    "episode": "28",
    "episodes": [
        28
    ],
    "coldOpens": [
        "After Michael falls asleep at the desk, the entire office conspires to convince him it's 5 o'clock when it really only 1 o'clock."
    ],
    "storylines": [
        "Michael ate a whole family size chicken pot pie, and then fell asleep. The office tries to get all the clocks reset so that he thinks it is five o' clock, so that they can leave for the day. After resetting his computer clock, his watch and the clock in his car, they pretend to laugh at a joke, and Michael realizes the time. Michael says that they can all go, and they yell in the parking lot, with Jim and Dwight pretending to shoot a gun.",
        "The next day, the Scranton branch joins several other branches at the Dunder Mifflin Company Picnic. Pam explains that last year someone grabbed her breasts for \"balance.\" Dwight and his friend Rolf argue about Sunscreen and Bug repellent, which Dwight made homemade, because of regulations. Michael sees Holly after Kevin points her out with her boyfriend, A.J.. They hug, and talk to each other. Michael pretends to not remember A.J., however, A.J. remembers him, and says hi.",
        "Michael gets Holly and A.J. drinks, but makes it awkward. Michael explains that he lied to Kevin about how Holly was only his friend, he wants more out of their relationship. Michael continues, and says that he and Holly are soul mates.",
        "Charles Miner continues to belittle Jim, by saying that Jim must be happy to get a rest from all of his rest.",
        "Dwight plans the volleyball game carefully to not repeat what happened last year, when Jim found a supposedly poisonous spider in his glove. When Andy requests being next to Erin to Dwight, Dwight refuses, and puts him next to Phyllis. Meanwhile, Michael asks Holly and A.J. what is happening. He is shocked and sad when Holly tells Michael that they are building a house. Michael says that he is building a pants-chair, and A.J. says that he'll take a pair. When he reveals his size, Michael calls him a fatty, and Holly and Michael begin to prepare their skit, saying that the old comedy team is back together again.",
        "Andy is angry at Erin for missing the volleyball. However, he pretends he was yelling at a guy wearing Ray-Bans, asking him if he is blind. When Kevin misses, Dwight and Andy belittle him to no end. Phyllis, tired, sits down on the ground, and an angry Dwight asks why. The Scranton Branch continues to play, and Ryan misses, however, Dwight finds someone holding the net, so he deducts a point from their team. Dwight tells Pam to serve, who serves well. In a talking head, she reveals that she went to volleyball camp most summers. She wins the game against Albany for the Scranton branch.",
        "Holly and Michael have snacks and plan their skit, which they will wing. They bond once again. Pam continues to do great, but Phyllis quits. Rolf puts Meredith in the game and Angela asks why not her. Rolf explains why and in doing so calls Angela a cheater and tramp, which slightly alarms Dwight. Holly and Michael continue to plan their skit, but can't come up with an idea. As they complete their task, Pam wins another game, and Charles and David watch, saying that corporate will beat them. However, Rolf crudely tells them, \"That they'll piss all over your faces,\" alarming everyone. Kendall and Toby reflect on a previous company picnic.",
        "Holly and Michael finish planning their skit and David introduces them to the whole Dunder Mifflin company. Their skit, which is called, SlumDunder Mifflinaire, starts well. Holly asks Michael questions, and Michael replies in an Indian voice. Holly then pretends to stab Michael with a microphone. They continue their horrible play, and talk about Robert Mifflin's suicide, and how he killed himself. Many people look at Holly and Michael with disgust. Stanley, surprisingly loves it. Holly and Michael accidentally reveal that the Buffalo branch will be closed down. Holly continues to torture Michael. Michael says that David told him that Buffalo will be closed down. David Wallace reveals it to be true, and he berates Michael and Holly for their performances. Meredith, Oscar, Dwight and Pam confer about their volleyball game and decide to, \"Kick corporate's ass.\" Charles continues to make fun of Jim.",
        "Kevin loses another point for Scranton. Rolf calls Angela a whore, and Dwight angrily tells Rolf to stop. Erin, finally makes a point, yelling, \"Booyah!\" Pam slips and is supposedly injured. Charles and David, wanting to get the best player off Scranton's team, tells them to go to the hospital. Dwight tells them that there is a hospital around, and Pam tells him that they'll be back. Dwight, stalling, kicks the ball into the woods, and slowly gets it.",
        "Holly and Michael talk about their skit, and they are unsure whether it was good or not. Michael has a hard time telling Holly that he loves her and eventually doesn't. At the hospital, a nurse tells Pam that she needs an x-ray and asks if she is pregnant. A.J. tells Holly and Michael that he liked the skit. In a talking head, Michael tells the documentary crew that the relationship between Michael and Holly will take a long time, but then it will be perfect. He says he is in no rush.",
        "Dwight stalls again to wait for Pam to come back. Jim, at the hospital, tells Dwight that they are hurrying and to buy them a few more minutes.",
        "In the end scene, Jim walks into the x-ray room, and a doctor inaudibly reveals something to Jim and Pam. They are thrilled. Jim, holding back tears, calls Dwight and tells him to send in the subs."
    ],
    "quotes": [
        [
            {
                "speaker": "Dwight",
                "content": " Normally I don't condone leaving early, but I have an appointment with the horse doctor. How that horse became a doctor, I don't know. No, I'm kidding. He's just a regular doctor who shoots your horse in the head when its leg is broken."
            }
        ],
        [
            {
                "speaker": "Dwight",
                "content": " Like clockwork."
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " [To AJ after he request an iced tea] You can go to hell. Just kidding, I will get you the best iced tea in the world."
            }
        ],
        [
            {
                "speaker": "Pam",
                "content": " Maybe I played a little in junior high. And in high school. Maybe a little in college. And went to volleyball camp most summas!"
            }
        ],
        [
            {
                "speaker": "Rolf",
                "content": " [To the coperate volleyball team] They're going to wipe their asses with your serves! Piss all over your faces!"
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " [To AJ] You bet your fat ass we are!"
            }
        ],
        [
            {
                "speaker": "Ralph",
                "content": " [To Angela] Here's an accounting question for you. What does one fiance plus one lover equal? Answer: one whore."
            }
        ],
        [
            {
                "speaker": "Dwight ",
                "content": " [To Corporate] Aah! I'm so MAD that Pam got HURT! RRRAAAAAA! *kicks volleyball* ... I'll get it."
            }
        ],
        [
            {
                "speaker": "Jim",
                "content": " [After discovering Pam is pregnant] Hey, Dwight! Send in the subs!"
            }
        ]
    ]
}