{
    "season": 5,
    "title": "Casual Friday",
    "episode": "26",
    "episodes": [
        26
    ],
    "episodeDetails": {
        "sections": [
            {
                "title": "Casual Friday",
                "level": 1,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "\"Casual Friday\" is the twenty-sixth episode of the fifth season of The Office, and the 98th episode overall. It was written by Anthony Farrell and directed by Brent Forrester. It first aired on April 30, 2009. It was viewed by 7.31 million people."
                    }
                ],
                "images": []
            },
            {
                "title": "Synopsis",
                "level": 2,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Michael Scott has returned to his old job as regional manager of the Dunder Mifflin Scranton branch and announces that Pam and Ryan have joined the sales team, retaining their old clients from the Michael Scott Paper Company. Dwight, Andy, Phyllis and Stanley are upset because most of those clients were ones Michael previously stole from them. They are also upset that Michael treats Pam and Ryan with more respect because they were the only people to follow him to his new company, with Michael believing his company operates within the branch despite the buyout. Dwight calls a secret meeting in the warehouse with the salespeople, minus Pam and Ryan, to think of a way to get their clients back."
                    },
                    {
                        "type": "paragraph",
                        "text": "Jim, trying to remain impartial, informs Michael of the potential mutiny and heads to the break room to play chess with Creed until the conflict is resolved. Things take a turn for the worse when Dwight interrupts a sales call with Ryan, causing him to lose the client. Michael steps in and demands an apology, but Dwight, Andy, Phyllis and Stanley threaten to quit and start their own paper company. When Michael calls their bluff, Phyllis breaks down and says that they were the real victims of Michael's company, not corporate, and that they were hurt since Michael had treated them like a family and then turned on them. Michael is taken aback by her words."
                    },
                    {
                        "type": "paragraph",
                        "text": "Meanwhile, it is Casual Friday and most people dress too loosely at the office. Angela complains to Toby about Oscar wearing sandals to work and having to look at his feet. Meredith disgusts the rest of the employees by wearing a very short dress without any panties or a bra, thus exposing herself to the rest of the office as she tries to adjust it to meet Toby's requests. Toby calls a meeting with everyone regarding Casual Friday. When Dwight tries to take charge of the meeting, Toby is finally stern with him and cancels Casual Friday, much to everyone's disappointment."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael calls a meeting with Dwight, Andy, Phyllis and Stanley to give them a formal apology, but they do not accept it since all they want is their clients back. Michael reluctantly agrees to give back their clients. In doing so, however, there are not enough clients to keep both Pam and Ryan on the sales team, leaving Michael to decide which one to keep. He talks it over with Jim, who suggests Pam would be better suited, while Michael thinks Ryan should get it. Michael calls a meeting with Pam after meeting with Ryan to inform her she did not get the sales job. Pam is visibly disappointed, but Michael starts laughing and tells her that she did get it, having offered Ryan a temp position again. Pam laughs it off and tells him he should stop with the \"fake-firing\" joke. Michael then decides to pull the joke on the new receptionist, Erin Hannon."
                    }
                ],
                "images": []
            },
            {
                "title": "Trivia",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Dwight's idea of dressing casually is not wearing a necktie. Angela's idea of dressing casually is wearing short sleeves (exposing her elbow).",
                                "elements": []
                            },
                            {
                                "text": "Dwight does not know Stanley's surname.",
                                "elements": []
                            },
                            {
                                "text": "Michael says, \"Do I rent The Devil Wears Prada again?\" referring to the cold open in which he acts to Pam as Meryl Streep acts to her secretary in the movie because he is renting The Devil Wears Prada.",
                                "elements": []
                            },
                            {
                                "text": "Pam is the only person Michael has fake-fired twice; this was the second time. The first time was in the Season 1 episode \"Pilot\". This was Erin's first time being fake-fired.",
                                "elements": []
                            },
                            {
                                "text": "The picture of Toby standing outside a church while he was in seminary school is the same church the show uses later on for Jim and Pam's wedding (Niagara).",
                                "elements": []
                            },
                            {
                                "text": "Michael says he is not to be \"truffled\" with but he means \"trifled\" with. (See Michael's Botched Phrases)",
                                "elements": []
                            },
                            {
                                "text": "When Jim and Michael are discussing if Pam or Ryan will get the sales position, Jim suggests creating a Pro and Con list, similarly to how he does during The Promotion. This also mirrors Pam making lists in Dream Team.",
                                "elements": []
                            },
                            {
                                "text": "Erin compliments Kelly's outfit, the same outfit she asks Kelly for when Kelly offers Erin any of her clothes in Body Language.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Deleted scenes",
                "level": 2,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "These were deleted scenes from the Season 5 DVD:"
                    },
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Michael explains that Pam, himself, and Ryan have been through a lot, like they were in a love triangle.",
                                "elements": []
                            },
                            {
                                "text": "Oscar welcomes Michael back, and Michael explains what happened.",
                                "elements": []
                            },
                            {
                                "text": "Dwight sings the 24 theme song.",
                                "elements": []
                            },
                            {
                                "text": "Jim gives Pam a gift with Dwight, Jim, and Pam on an island, which Jim tells was from himself and Dwight. Dwight says he didn't give it and tries to convince Pam.",
                                "elements": []
                            },
                            {
                                "text": "Dwight tells Andy that urine was the code on the paper.",
                                "elements": []
                            },
                            {
                                "text": "Dwight tells Andy, Phyllis, Jim, and Stanley his plan to get Pam and Ryan fired.",
                                "elements": []
                            },
                            {
                                "text": "Dwight explains that failure is not an option. Andy and Phyllis tell Dwight that it is an option.",
                                "elements": []
                            },
                            {
                                "text": "Kelly asks Dwight what he is doing in her nook. Kelly shows Dwight a sign with \"Kelly's Nook\" on it and Dwight leaves.",
                                "elements": []
                            },
                            {
                                "text": "After Toby cancels casual Fridays, the office is outraged. Since he is tired, he says that they can wear whatever they want, causing the office to celebrate with hugs and handshakes. Toby mumbles and sits at his desk.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Cultural references",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Boscov's is a department store chain found on the east coast.",
                                "elements": []
                            },
                            {
                                "text": "Michael is unsure whether to rent Sophie's Choice or The Devil Wears Prada and says it is \"what you would call a classic difficult decision\". He doesn't seem to know that difficult decisions are often compared to the movie Sophie's Choice.",
                                "elements": []
                            },
                            {
                                "text": "When Michael interrupts Creed and Jim's game of Scrabble, he lays down the letters \"NOSCRUB.\" This is possibly a reference to the TLC song 'No Scrubs.'",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Cast",
                "level": 2,
                "content": [],
                "images": []
            },
            {
                "title": "Main cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Steve Carell as Michael Scott",
                                "elements": []
                            },
                            {
                                "text": "Rainn Wilson as Dwight Schrute",
                                "elements": []
                            },
                            {
                                "text": "John Krasinski as Jim Halpert",
                                "elements": []
                            },
                            {
                                "text": "Jenna Fischer as Pam Beesly",
                                "elements": []
                            },
                            {
                                "text": "B.J. Novak as Ryan Howard",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Supporting cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Leslie David Baker as Stanley Hudson",
                                "elements": []
                            },
                            {
                                "text": "Brian Baumgartner as Kevin Malone",
                                "elements": []
                            },
                            {
                                "text": "Creed Bratton (actor) as Creed Bratton",
                                "elements": []
                            },
                            {
                                "text": "Kate Flannery as Meredith Palmer",
                                "elements": []
                            },
                            {
                                "text": "Mindy Kaling as Kelly Kapoor",
                                "elements": []
                            },
                            {
                                "text": "Angela Kinsey as Angela Martin",
                                "elements": []
                            },
                            {
                                "text": "Paul Lieberstein as Toby Flenderson",
                                "elements": []
                            },
                            {
                                "text": "Oscar Nunez as Oscar Martinez",
                                "elements": []
                            },
                            {
                                "text": "Craig Robinson as Darryl Philbin",
                                "elements": []
                            },
                            {
                                "text": "Phyllis Smith as Phyllis Vance",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Recurring cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Ellie Kemper as Erin Hannon",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            }
        ]
    },
    "quotesDetails": {
        "sections": [
            {
                "title": "Casual Friday Quotes",
                "level": 1,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Dwight: When held over heat the invisible ink will reveal that everyone should meet at the warehouse immediately. Do not ask me where I got the invisible ink. Urine. It was urine."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael: I'm going to have some of this meat sandwich."
                    },
                    {
                        "type": "paragraph",
                        "text": "Dwight: It's pony."
                    },
                    {
                        "type": "paragraph",
                        "text": "Dwight: What are you doing here!?"
                    },
                    {
                        "type": "paragraph",
                        "text": "Meredith: I dunno. I saw a crowd, I thought there might a dog fight or someth-"
                    },
                    {
                        "type": "paragraph",
                        "text": "Dwight: Get out!"
                    },
                    {
                        "type": "paragraph",
                        "text": "Oscar: Meredith, your boob is out!"
                    },
                    {
                        "type": "paragraph",
                        "text": "Kelly: Dammit, Meredith, where are your panties?!"
                    },
                    {
                        "type": "paragraph",
                        "text": "Meridith: Hey, it's causal Friday."
                    },
                    {
                        "type": "paragraph",
                        "text": "Angela: The man is wearing sandals. I don't need to see Oscar's toes at work. Gross! I mean, it looks like he just got off the boat."
                    }
                ],
                "images": []
            }
        ]
    },
    "coldOpens": [
        "Kevin brings a huge pot of his \"Kevin's Famous Chili\" dish to the office, and accidentally drops it onto the floor, making a big mess of the carpet and himself as he tries to scoop it back into the pot."
    ],
    "storylines": [
        "Michael Scott has returned to his old job as regional manager of the Dunder Mifflin Scranton branch and announces that Pam and Ryan have joined the sales team, retaining their old clients from the Michael Scott Paper Company. Dwight, Andy, Phyllis and Stanley are upset because most of those clients were ones Michael previously stole from them. They are also upset that Michael treats Pam and Ryan with more respect because they were the only people to follow him to his new company, with Michael believing his company operates within the branch despite the buyout. Dwight calls a secret meeting in the warehouse with the salespeople, minus Pam and Ryan, to think of a way to get their clients back.",
        "Jim, trying to remain impartial, informs Michael of the potential mutiny and heads to the break room to play chess with Creed until the conflict is resolved. Things take a turn for the worse when Dwight interrupts a sales call with Ryan, causing him to lose the client. Michael steps in and demands an apology, but Dwight, Andy, Phyllis and Stanley threaten to quit and start their own paper company. When Michael calls their bluff, Phyllis breaks down and says that they were the real victims of Michael's company, not corporate, and that they were hurt since Michael had treated them like a family and then turned on them. Michael is taken aback by her words.",
        "Meanwhile, it is Casual Friday and most people dress too loosely at the office. Angela complains to Toby about Oscar wearing sandals to work and having to look at his feet. Meredith disgusts the rest of the employees by wearing a very short dress without any panties or a bra, thus exposing herself to the rest of the office as she tries to adjust it to meet Toby's requests. Toby calls a meeting with everyone regarding Casual Friday. When Dwight tries to take charge of the meeting, Toby is finally stern with him and cancels Casual Friday, much to everyone's disappointment.",
        "Michael calls a meeting with Dwight, Andy, Phyllis and Stanley to give them a formal apology, but they do not accept it since all they want is their clients back. Michael reluctantly agrees to give back their clients. In doing so, however, there are not enough clients to keep both Pam and Ryan on the sales team, leaving Michael to decide which one to keep. He talks it over with Jim, who suggests Pam would be better suited, while Michael thinks Ryan should get it. Michael calls a meeting with Pam after meeting with Ryan to inform her she did not get the sales job. Pam is visibly disappointed, but Michael starts laughing and tells her that she did get it, having offered Ryan a temp position again. Pam laughs it off and tells him he should stop with the \"fake-firing\" joke. Michael then decides to pull the joke on the new receptionist, Erin Hannon."
    ],
    "quotes": [
        "Dwight: When held over heat the invisible ink will reveal that everyone should meet at the warehouse immediately. Do not ask me where I got the invisible ink. Urine. It was urine.",
        "Michael: I'm going to have some of this meat sandwich.",
        "Dwight: It's pony.",
        "Dwight: What are you doing here!?",
        "Meredith: I dunno. I saw a crowd, I thought there might a dog fight or someth-",
        "Dwight: Get out!",
        "Oscar: Meredith, your boob is out!",
        "Kelly: Dammit, Meredith, where are your panties?!",
        "Meridith: Hey, it's causal Friday.",
        "Angela: The man is wearing sandals. I don't need to see Oscar's toes at work. Gross! I mean, it looks like he just got off the boat."
    ]
}