{
    "season": 5,
    "title": "Broke",
    "episode": "25",
    "episodes": [
        25
    ],
    "coldOpens": [
        "Michael, Pam, and Ryan adjust to early morning paper deliveries while making sure their delivery van isn't mistaken for a Korean church van."
    ],
    "storylines": [
        "The strain of early morning paper deliveries takes its toll on the Michael Scott Paper Company. Ryan, who says he gets sick by mornings now-a-days, is teased by Michael by moving the van when he reaches for the handle. Pam is told goodbye by a very sleepy Jim and Michael's honking disturbs their neighbor. Michael, Pam and Ryan visit an accountant to determine whether they can afford to hire a delivery person and discover that not only can they not afford one, but Michael's deep discounts and Ryan's flawed cash flow model mean that the company is on the brink of collapse.",
        "Meanwhile, CFO David Wallace visits the Scranton branch to determine what can be done to stop Michael from stealing Dunder Mifflin's clients. Dwight's bizarre suggestions on how to get rid of the Michael Scott Paper Company cast him in a new light in Charles Miner's eyes.",
        "Wallace realizes that he has to buy out the Michael Scott Paper Company. Jim \"investigates\" the situation (although he knows from Pam the Michael Scott Paper Company's desperate situation) and thwarts Dwight's efforts to warn David Wallace and Charles Miner that they are offering too much for the company.",
        "Michael shows an uncharacteristic flash of brilliance during the negotiations, first bidding up the offer for his company from $12,000 to $60,000, and then on top of that demanding (and getting) his old job back as Regional Manager of the Scranton branch, as well as jobs for both Pam and Ryan. Wallace is furious that Ryan will be back at Dunder Mifflin considering the enormous damage he caused the company, and Ryan doesn't seem too thrilled to be working there either."
    ],
    "quotes": [
        [
            {
                "speaker": "Michael",
                "content": " It's 4:30 in the morning. Do you know where your kids are? If you are Ryan's parents or Pam's parents or my parents, you do. They're gonna be in this van. With me. Who am I? Nothing to fear. I am just a 44 year old guy with a paper route."
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " Well, well, well how the turntables..."
            }
        ],
        [
            {
                "speaker": "Dwight",
                "content": " I say we fill Michael's office with bees. My apiarist owes me a favor."
            },
            {
                "speaker": "Jim",
                "content": " Really? Does he do good work or-- "
            },
            {
                "speaker": "Dwight",
                "content": " [scoffs] No, Jim. I use a bad apiarist. [sighs]"
            }
        ]
    ]
}