{
    "season": 5,
    "title": "Michael Scott Paper Company",
    "episode": "23",
    "episodes": [
        23
    ],
    "coldOpens": [
        "Michael arrives back at Scranton business park to open Michael Scott Paper Company and in search of a good parking space."
    ],
    "storylines": [
        "Michael explains he is back for the new company and Pam and Ryan join him. They see their new office and look awkwardly at it. Pam and Ryan wait to get calls from clients and Michael eagerly waits for his upcoming Pancake Luncheon.",
        "Meanwhile, Kelly continues to be infatuated with Charles Miner. She tries to see him as much as she can by deliberately misinterpreting Charles as wanting her to come into his office every time he calls for the new receptionist, Kelly Hannon. Eventually, Charles tires of this and declares that he will call them by their last names instead. Kelly Hannon requests to be called Erin, her middle name. Kelly Kapoor then storms out.",
        "When Michael gives Ryan and Pam a paper to copy, Pam asks Ryan to do it as she doesn't want to be the receptionist anymore. Pam says she misses making copies. Ryan continues to be a lazy employee of the company, and talks to his friends on his phone. Ryan calls Pam a \"6 in New York and a 7 in Scranton\" based on her looks. Pam looks to the camera, disgusted.",
        "Andy and Dwight, once \"sexual competitors\" and enemies, become best friends and decide to go on a hunting trip. However, Dwight and Andy start to compete over Erin. Dwight plays a joke on Erin and talks to her. Andy briefly (and awkwardly) dances with Erin before she leaves the room. Dwight realizes that Andy is attracted to Erin, and admits that he is too. However, Andy and Dwight agree to not pursue a relationship with Erin, and instead continue to be friends.",
        "Charles asks Jim to create a “run-down” of his clients. Jim accepts the task, but doesn't know what a run-down is. He stalls, and asks Charles about a run-down and awkwardly talks to him. Hours later, still unknowing of what a run-down is, Jim asks Oscar and Kevin for help, but they are unaware as well. Charles asks Jim if he has started the run-down, but becomes angry when he discovers Jim is doing something else. When Jim finally brings the run-down to Charles, he is told to send it to everyone on the “distribution list”. Jim gives the run-down to his dad, still unknowing of what in fact, a run-down really is.",
        "Ryan spends his time watching videos on YouTube (specifically \"It's Just Like a Mini Mall\") . Pam and Ryan endlessly fight and Michael yells at them for fighting. Pam and Ryan remain bored and Pam yells at Ryan for putting a naked picture of Ryan's friend, Jasmine, on the computer. Ryan and Pam continue their feud. Michael has a talk with Pam and Ryan about disliking each other, and they talk about making a corner idea so that everyone can have a personal space. To Pam's sadness, her corner is the one with the copier.",
        "Pam goes to Charles to ask for her job back. Charles refuses, but Pam desperately asks if she can be his personal shopper. Pam admits she misses Dunder Mifflin.",
        "Phyllis and Stanley visit The Michael Scott Paper Company and tell Michael that Pam was seeing Charles. Michael starts to regret starting the company. Michael starts his pancake luncheon with Pam trying to get clients and Ryan not doing anything. Creed and Meredith take pancakes from Michael, which they don't like.",
        "Andy and Dwight continue to bond as they play their instruments. They play \"Take Me Home, Country Roads\" when Erin comes in. Andy and Dwight try to outdo the other in an attempt to impress her by playing it fast, by singing, and in Dwight's case singing in German. Erin looks shocked at how well they are playing and laughs. Erin, amused, leaves the break room, and continuing to play, Dwight and Andy are finally stopped by Toby Flenderson.",
        "After a day with no success, Michael, Pam, and Ryan are sad that they have made no clients. However, Pam makes her first sale when a client from the luncheon calls. Ryan, Pam, and Michael are ecstatic. As they leave the building, Michael tells the documentary crew that they have the people with the biggest hearts.",
        "When Angela sees Dwight and Andy bonding, she sarcastically rolls her eyes."
    ],
    "quotes": [
        [
            {
                "speaker": "Jim",
                "content": " The new receptionist is also named Kelly - so, Kelly Kapoor has decided to hover around my desk, so that she can run into Charles's office every time he calls for Kelly. She thinks if she says \"you wanted me\" enough, he will, in fact, want her...It's not the worst plan she's ever had."
            }
        ],
        [
            {
                "speaker": " Charles",
                "content": " I'm gonna call you \"Kapoor\", and you, \"Hannon\""
            },
            {
                "speaker": "Erin",
                "content": " If we're changing names, can I be \"Erin\"? That's my middle name."
            },
            {
                "speaker": "Charles",
                "content": " \"Erin\"? OK - that's...very pretty."
            },
            {
                "speaker": "Kelly",
                "content": " Well, you know what my middle name is? Rajnigandha - and I hate it...I HATE it!!!"
            },
            {
                "speaker": "Kevin",
                "content": " I thought Rajnigandha was a boy's name."
            }
        ],
        [
            {
                "speaker": "Dwight",
                "content": " Yes, I am taking Andy hunting after work. Not long ago we were sexual competitors. I used to hate him, hate him, hate him, hate him. I studied him, to figure out why I hated him so much. But that blossomed into a very real friendship, as these things often do."
            }
        ]
    ]
}