{
    "season": 5,
    "title": "Dream Team",
    "episode": "22",
    "episodes": [
        22
    ],
    "coldOpens": [
        "Kevin has trouble adjusting to his job as receptionist but is finally able to transfer a call to Andy which turns out to be bad news."
    ],
    "storylines": [
        "Charles Miner is now in charge of the Scranton branch, due to the absence of Michael Scott, and seems to dislike Jim, much to Dwight's pleasure. Pam and Michael decide to assemble a 'Dream Team' to get the company started. Michael recommends Ryan, stating, \"He's everything I'm not and everything I am,\" an offer which Pam quickly denies. Michael then states the company already has a meeting later with an investor, making Pam visibly excited. Michael and Pam then decide to search for Vikram, an employee Michael formerly worked with at the telemarketing agency. Back at the office, Andy discovers that Charles loves soccer and soon the whole office is trying to impress him. When Jim says that he plays soccer (from second to fourth grade, he was on the orange team), he soon finds himself being stuck in a soccer game with Charles after work.",
        "With Vikram now part of the company, Michael drives to a bowling alley claiming he has to use the bathroom. When Pam heads inside to see why Michael is taking so long, she discovers him talking to a new bleach-blonde Ryan, who is working at the counter. Michael claims the new company has no files and therefore no proof of his past misconduct, leading Ryan to join them. The Michael Scott Paper Company tries to get the members of a local investment club (one of which is Michael's grandmother) to invest, to which they soon decline, saying the company will never get ahead with the state of the economy. The game back at Dunder-Mifflin then begins, revealing that Jim has no soccer experience, and does not even know how to play. Vikram claims that the investors brought up some good questions, that the company is impractical, and he soon quits and is thrown out of Michael's car.",
        "While playing soccer Jim ducks out of the way of the ball and Phyllis is hit in the face. Pam, sitting in Michael's car, tells him that she was just feeling impulsive and should have never taken the job with him. Michael tells Pam that he works best when people don't believe in him and that he is going to go find an office space for them. The office that Michael finds, turns out to be a former closet in the same building as Dunder-Mifflin."
    ],
    "quotes": [
        [
            {
                "speaker": "Pam",
                "content": " You get paid by the year here?"
            }
        ],
        [
            {
                "speaker": "Ryan",
                "content": " How much do you get paid, secretary?"
            }
        ],
        [
            {
                "speaker": "Bowling Alley Employee",
                "content": " (To Ryan) Get back to work, shoe bitch!"
            }
        ],
        [
            {
                "speaker": "Kelly",
                "content": " (To Charles) So, that's why I have to leave early on Tuesdays. I have to pick up my little sisters from school. We're really tight. We're like the Kardashians."
            }
        ]
    ]
}