{
    "season": 5,
    "title": "Business Ethics",
    "episode": "3",
    "episodes": [
        3
    ],
    "episodeDetails": {
        "sections": [
            {
                "title": "Business Ethics",
                "level": 1,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "\"Business Ethics\" is the third episode of the fifth season of The Office and the 75th episode overall. It was written by Ryan Koh and directed by Jeffrey Blitz. It first aired October 9, 2008. It was viewed by 8.99 million people."
                    }
                ],
                "images": []
            },
            {
                "title": "Summary",
                "level": 2,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Jim tells the office that he and Pam are engaged. Kevin, Oscar, Andy, and Angela provide rude responses. Dwight tells Jim that Pam is not a virgin. Creed tells Michael that “the tall guy got engaged” and Michael tackles Jim down onto the floor."
                    },
                    {
                        "type": "paragraph",
                        "text": "Holly gave the office a questionnaire, and Michael and her start the ethics meeting by dancing to the song, \"Physical,\" but with the lyrics, \"Let's get ethical.\" Michael explains his plan to merge the friendship between him and Holly into a relationship. Holly explains that the Business Ethics seminar is because of Ryan's fraud. Ryan tells the office what happened. He said that it was an amazing ride, even though he committed fraud. Holly discusses the questionnaires. Holly explains how time theft is horrible, but Kelly disagrees about it, telling Holly that she will take up smoking to waste time. Michael tells Holly that she is not doing a great job by setting herself up for failure."
                    },
                    {
                        "type": "paragraph",
                        "text": "Oscar explains how the meeting is not about true ethics. Then, Andy asks Michael whether he would take bread for his family or if he would let his family go hungry. Michael can't decide."
                    },
                    {
                        "type": "paragraph",
                        "text": "Holly tries to get some of her coworkers to discuss times where they were faced with ethical dilemmas, which they misinterpret as a platform to mention rules that they have broken, encouraged by Michael falsely saying they have “immunity.” Michael admits that when he discovered YouTube, he didn't work for five days. Oscar says that sometimes he takes a long lunch. Kelly says she downloads pirated music on to her work computer. Dwight tells Michael to fire Oscar. Angela says she reported Oscar to the INS. Meredith then says that she has been sleeping with a Hammermill paper rep for the past 6 years for lower prices on paper and Outback Steakhouse gift certificates. Holly is shocked and tries to get Michael to discipline her, however, Michael laughs it off, jokingly calls Meredith a “dirty girl” and doesn't believe that the situation is that serious."
                    },
                    {
                        "type": "paragraph",
                        "text": "Holly asks Meredith questions. Michael tries to feed Meredith advice and tells her to say that the sexual meetings were personal, but Meredith admits that it was only for the steaks and the lower prices. Michael calls Meredith a stupid bag. Meredith unsurprisingly feels good about being pretty much a prostitute."
                    },
                    {
                        "type": "paragraph",
                        "text": "Meanwhile, after Dwight says he has never wasted company time, Jim begins to time him to the second. Dwight tries to work all day without blinking or anything else."
                    },
                    {
                        "type": "paragraph",
                        "text": "Holly and Michael talk to each other in the annex, and Michael asks if she wants to go to lunch to talk to Meredith. Holly says she already has lunch. Michael throws it away, and Michael offers to treat her to lunch, before admitting that since she isn’t a client, she will have to pay half. Holly wants Meredith to be fired, but has trouble expressing this as Michael continuously dodges the conversation and treats their lunch like a date. Michael has an uncomfortable talk with Holly about chastity belts. Michael tells Holly that Meredith needs this job, but Holly disagrees with this being a justification for her actions and feels that Michael’s attempts to brush the issue under the rug is wrong. When Michael tells her that Dunder Mifflin is home to the employees, Holly tells him that it is not a family but a workplace. Michael becomes very upset."
                    },
                    {
                        "type": "paragraph",
                        "text": "Jim tells Andy about Dwight's favorite show, Battlestar Galactica, however, he uses wrong details to explain it, upsetting Dwight. Jim explains that Dwight sneezed while keeping his eyes open and even peed in a soda bottle at his desk just to remain focused on work. Jim says that he has been so busy watching Dwight that he hasn't started his own work. Dwight eventually takes a long break and an unassuming Jim tells Dwight that he is not completely ethical in his time-theft, unaware that Dwight's break was spent in the warehouse having sex with Angela, to which Dwight agrees."
                    },
                    {
                        "type": "paragraph",
                        "text": "Back from lunch, Michael tells the crew that Holly is not right and throws away the leftovers from her lunch. Holly explains that being the morality police isn't popular, comparing her current situation with how she was treated as a hall monitor in middle school. Michael won't talk to Holly. Michael and Holly talk to Kendall. Kendall sides with Michael, saying that Meredith isn't doing anything wrong, and that the discounts are good due to the current economic crisis. Kendall rudely tells Holly that she was only supposed to get the office to fill out the questionnaire. Michael struggles to find a way to tell Holly that he told her so about the Meredith situation."
                    },
                    {
                        "type": "paragraph",
                        "text": "Holly tells the office to finish the ethics seminar. When the office refuses, Michael screams at the office telling them to get into the conference room, to which they enter the room. Holly becomes seemingly happier. Meredith gives the whole office steaks from her sex deal, and they want Meredith to keep doing what she is doing. Stanley high-fives Phyllis, saying, \"Just keep the ribs coming.\""
                    }
                ],
                "images": []
            },
            {
                "title": "Deleted scenes",
                "level": 2,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "These deleted scenes were on the Season 5 DVD, notable cuts include:"
                    },
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Ryan reveals that he broke the side-view mirror on Kevin's car. When Kevin confronts him on it, Ryan blames it on \"the guy he used to be\" and says he is now \"Ryan 2.0\". Afterwards, Kevin bakes Ryan's sunglasses in the same toaster oven where the latter started the fire. Kevin then blames it on \"Kevin 1.0\".",
                                "elements": []
                            },
                            {
                                "text": "When Jim asks Dwight for answers on the HR questionnaire, Jim tells Holly that Dwight is cheating.",
                                "elements": []
                            },
                            {
                                "text": "Pam's class is cancelled and Pam agrees to go with her friends including Alex to the Tiki Bar.",
                                "elements": []
                            },
                            {
                                "text": "Oscar explains that he would love to have a real talk about ethics.",
                                "elements": []
                            },
                            {
                                "text": "Creed explains that he committed atrocities in Vietnam, \"2 years ago.\"",
                                "elements": []
                            },
                            {
                                "text": "Phyllis explains that she thinks she may have hit a kid on a safari.",
                                "elements": []
                            },
                            {
                                "text": "Holly and Andy give Michael brain teasers.",
                                "elements": []
                            },
                            {
                                "text": "Dwight assigns people to look at each wall and the ceiling.",
                                "elements": []
                            },
                            {
                                "text": "Pam gets drunk and tells her friend to send a \"big LOL little lol\" to her friend.",
                                "elements": []
                            },
                            {
                                "text": "Pam drank a whole vat of rum and she has a slurred voice. Her friends point out what she did and laugh. She tells the documentary crew that she is not a drunk, only a moody artist. (NB: the vat comparison has to be an exaggeration, since a vat is over 26 US gal.)",
                                "elements": []
                            },
                            {
                                "text": "Stanley tells Meredith that she said a bunch of racist stuff about him.",
                                "elements": []
                            },
                            {
                                "text": "Michael orders two lobsters.",
                                "elements": []
                            },
                            {
                                "text": "Some of Pam's rum comes up.",
                                "elements": []
                            },
                            {
                                "text": "Meredith tells Michael that she comes in at 11 and leaves at 4.",
                                "elements": []
                            },
                            {
                                "text": "Holly finds a poster saying NARC taped on her computer.",
                                "elements": []
                            },
                            {
                                "text": "Michael talks to Toby but then hangs up.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Trivia",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Ryan claims to have hooked up with a woman who looked just like JoAnna Ward from the sixth season of Survivor. Ward is African-American, further supporting Ryan's preference for dating women with darker skin.",
                                "elements": []
                            },
                            {
                                "text": "When Andy mentions the ethical dilemma of stealing bread to feed one's family Dwight responds by saying that he's been \"cuckholded by a stronger, smarter male.\" Andy responds by saying that that's \"not how it works.\" Angela looks to the side, embarassed. This interaction is a reference to the fact that Angela is cheating on Andy with Dwight.",
                                "elements": []
                            },
                            {
                                "text": "Battlestar Galactica is a television science fiction series which ran from 2004 to 2009. However, the rest of Jim and Andy's discussion is deliberately incorrect:",
                                "elements": [
                                    {
                                        "text": "Wookiees are an alien race, and Lando Calrissian is a character, from Star Wars.",
                                        "elements": []
                                    },
                                    {
                                        "text": "Klingons are an alien race from Star Trek.",
                                        "elements": []
                                    },
                                    {
                                        "text": "Dumbledore is a character from Harry Potter.",
                                        "elements": []
                                    },
                                    {
                                        "text": "Mordor is a location from Lord of the Rings.",
                                        "elements": []
                                    },
                                    {
                                        "text": "The original Battlestar Galactica is far different from the one Dwight loves.",
                                        "elements": []
                                    }
                                ]
                            },
                            {
                                "text": "The establishing shot of Michael and Holly's lunch out is of Cooper's Seafood in Scranton. The interior, on the other hand, was shot in Los Angeles.",
                                "elements": []
                            },
                            {
                                "text": "Meredith says that she has a bunch of cigars in her bag. Later, in Niagara, we learn that Meredith smokes every morning, to the disgust of Pam. In Niagara, Meredith is shown smoking a cigar outside of the church while waiting for Jim and Pam at the wedding.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Amusing details",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Based on the dishes at the table at Cooper's, Michael ordered two lobsters (or at the very least, one whole lobster) while Holly had a salad. When they come back to the office, Michael says he is holding on to Holly's leftovers, and throws them away, implying that he ate all of the food he ordered at lunch.",
                                "elements": []
                            },
                            {
                                "text": "At the \"business-romantic\" lunch, Michael has a glass of wine. Holly has a salad, the same lunch she was planning to eat originally.",
                                "elements": []
                            },
                            {
                                "text": "In the final scene, Angela (a vegetarian) eats only the potato salad.",
                                "elements": []
                            },
                            {
                                "text": "Meredith claims to be sleeping with the representative from Hammermill for 6 years in exchange for discount on supplies, and yet Hammermill was exclusive to Staples until 2006, according to the events in The Convention.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Connections to other episodes",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Kevin calls Ryan \"Hired Guy\" which is a recurring nickname joke that started in the episode The Fire when he was called \"Fire Guy\" for starting a fire in the office with a cheesy pita.",
                                "elements": []
                            },
                            {
                                "text": "In the season 7 episode Garage Sale, Michael mentions learning of Meredith's prostitution during his proposal to Holly.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Cultural References",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Michael and Holly sing parody lyrics to Olivia Newton-John's Physical.",
                                "elements": []
                            },
                            {
                                "text": "Michael tells Holly she needs to be more like Robin Williams (a madcap comedian) and M. Night Shyamalan (a filmmaker whose movies have surprise twist endings).",
                                "elements": []
                            },
                            {
                                "text": "Michael did no work after discovering YouTube, a video sharing site. Chocolate Rain was a virally popular video on YouTube in 2007. At the time of the episode's airing, there was no video of the song being performed by Cookie Monster, a popular children's television character, although such videos were quickly produced by fans after the episode aired.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Goofs",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Meredith says she has been having sex with Scranton's Hammermill representative for six years, implying that Dunder Mifflin has sold Hammermill products during that time, though it was only two years ago in The Convention that Michael broke Hammermill's exclusivity with Staples. In an online video chat, writer Ryan Koh explains that he chose Hammermill because it is the only well-known paper manufacturer, and he liked that the name Hammermill sounded somewhat sexual.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Cast",
                "level": 2,
                "content": [],
                "images": []
            },
            {
                "title": "Main Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Steve Carell as Michael Scott",
                                "elements": []
                            },
                            {
                                "text": "Rainn Wilson as Dwight Schrute",
                                "elements": []
                            },
                            {
                                "text": "John Krasinski as Jim Halpert",
                                "elements": []
                            },
                            {
                                "text": "Jenna Fischer as Pam Beesly (voice only, physically appears in deleted scenes)",
                                "elements": []
                            },
                            {
                                "text": "B.J. Novak as Ryan Howard",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Supporting Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Ed Helms as Andy Bernard",
                                "elements": []
                            },
                            {
                                "text": "Leslie David Baker as Stanley Hudson",
                                "elements": []
                            },
                            {
                                "text": "Brian Baumgartner as Kevin Malone",
                                "elements": []
                            },
                            {
                                "text": "Creed Bratton (actor) as Creed Bratton",
                                "elements": []
                            },
                            {
                                "text": "Kate Flannery as Meredith Palmer",
                                "elements": []
                            },
                            {
                                "text": "Mindy Kaling as Kelly Kapoor",
                                "elements": []
                            },
                            {
                                "text": "Angela Kinsey as Angela Martin",
                                "elements": []
                            },
                            {
                                "text": "Oscar Nunez as Oscar Martinez",
                                "elements": []
                            },
                            {
                                "text": "Phyllis Smith as Phyllis Vance",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Special Guest Star",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Amy Ryan as Holly Flax",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Guest Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "John Hartman as Kendall (Voice Only)",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "References",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "↑ Ask the Writers, Ryan Koh answers questions about Business Ethics.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            }
        ]
    },
    "quotesDetails": {
        "sections": [
            {
                "title": "Business Ethics Quotes",
                "level": 1,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "REDIRECT Business Ethics quotes",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            }
        ]
    },
    "coldOpens": [
        "Jim tells everyone that he is engaged to Pam and no one seems to care, until Michael comes to the office and takes Jim down."
    ],
    "storylines": [
        "Jim tells the office that he and Pam are engaged. Kevin, Oscar, Andy, and Angela provide rude responses. Dwight tells Jim that Pam is not a virgin. Creed tells Michael that “the tall guy got engaged” and Michael tackles Jim down onto the floor.",
        "Holly gave the office a questionnaire, and Michael and her start the ethics meeting by dancing to the song, \"Physical,\" but with the lyrics, \"Let's get ethical.\" Michael explains his plan to merge the friendship between him and Holly into a relationship. Holly explains that the Business Ethics seminar is because of Ryan's fraud. Ryan tells the office what happened. He said that it was an amazing ride, even though he committed fraud. Holly discusses the questionnaires. Holly explains how time theft is horrible, but Kelly disagrees about it, telling Holly that she will take up smoking to waste time. Michael tells Holly that she is not doing a great job by setting herself up for failure.",
        "Oscar explains how the meeting is not about true ethics. Then, Andy asks Michael whether he would take bread for his family or if he would let his family go hungry. Michael can't decide.",
        "Holly tries to get some of her coworkers to discuss times where they were faced with ethical dilemmas, which they misinterpret as a platform to mention rules that they have broken, encouraged by Michael falsely saying they have “immunity.” Michael admits that when he discovered YouTube, he didn't work for five days. Oscar says that sometimes he takes a long lunch. Kelly says she downloads pirated music on to her work computer. Dwight tells Michael to fire Oscar. Angela says she reported Oscar to the INS. Meredith then says that she has been sleeping with a Hammermill paper rep for the past 6 years for lower prices on paper and Outback Steakhouse gift certificates. Holly is shocked and tries to get Michael to discipline her, however, Michael laughs it off, jokingly calls Meredith a “dirty girl” and doesn't believe that the situation is that serious.",
        "Holly asks Meredith questions. Michael tries to feed Meredith advice and tells her to say that the sexual meetings were personal, but Meredith admits that it was only for the steaks and the lower prices. Michael calls Meredith a stupid bag. Meredith unsurprisingly feels good about being pretty much a prostitute.",
        "Meanwhile, after Dwight says he has never wasted company time, Jim begins to time him to the second. Dwight tries to work all day without blinking or anything else.",
        "Holly and Michael talk to each other in the annex, and Michael asks if she wants to go to lunch to talk to Meredith. Holly says she already has lunch. Michael throws it away, and Michael offers to treat her to lunch, before admitting that since she isn’t a client, she will have to pay half. Holly wants Meredith to be fired, but has trouble expressing this as Michael continuously dodges the conversation and treats their lunch like a date. Michael has an uncomfortable talk with Holly about chastity belts. Michael tells Holly that Meredith needs this job, but Holly disagrees with this being a justification for her actions and feels that Michael’s attempts to brush the issue under the rug is wrong. When Michael tells her that Dunder Mifflin is home to the employees, Holly tells him that it is not a family but a workplace. Michael becomes very upset.",
        "Jim tells Andy about Dwight's favorite show, Battlestar Galactica, however, he uses wrong details to explain it, upsetting Dwight. Jim explains that Dwight sneezed while keeping his eyes open and even peed in a soda bottle at his desk just to remain focused on work. Jim says that he has been so busy watching Dwight that he hasn't started his own work. Dwight eventually takes a long break and an unassuming Jim tells Dwight that he is not completely ethical in his time-theft, unaware that Dwight's break was spent in the warehouse having sex with Angela, to which Dwight agrees.",
        "Back from lunch, Michael tells the crew that Holly is not right and throws away the leftovers from her lunch. Holly explains that being the morality police isn't popular, comparing her current situation with how she was treated as a hall monitor in middle school. Michael won't talk to Holly. Michael and Holly talk to Kendall. Kendall sides with Michael, saying that Meredith isn't doing anything wrong, and that the discounts are good due to the current economic crisis. Kendall rudely tells Holly that she was only supposed to get the office to fill out the questionnaire. Michael struggles to find a way to tell Holly that he told her so about the Meredith situation.",
        "Holly tells the office to finish the ethics seminar. When the office refuses, Michael screams at the office telling them to get into the conference room, to which they enter the room. Holly becomes seemingly happier. Meredith gives the whole office steaks from her sex deal, and they want Meredith to keep doing what she is doing. Stanley high-fives Phyllis, saying, \"Just keep the ribs coming.\""
    ],
    "quotes": [
        null
    ]
}