{
    "season": 5,
    "title": "Business Ethics",
    "episode": "3",
    "episodes": [
        3
    ],
    "coldOpens": [
        "Jim tells everyone that he is engaged to Pam and no one seems to care, until Michael comes to the office and takes Jim down."
    ],
    "storylines": [
        "Jim tells the office that he and Pam are engaged. Kevin, Oscar, Andy, and Angela provide rude responses. Dwight tells Jim that Pam is not a virgin. Creed tells Michael that “the tall guy got engaged” and Michael tackles Jim down onto the floor.",
        "Holly gave the office a questionnaire, and Michael and her start the ethics meeting by dancing to the song, \"Physical,\" but with the lyrics, \"Let's get ethical.\" Michael explains his plan to merge the friendship between him and Holly into a relationship. Holly explains that the Business Ethics seminar is because of Ryan's fraud. Ryan tells the office what happened. He said that it was an amazing ride, even though he committed fraud. Holly discusses the questionnaires. Holly explains how time theft is horrible, but Kelly disagrees about it, telling Holly that she will take up smoking to waste time. Michael tells Holly that she is not doing a great job by setting herself up for failure.",
        "Oscar explains how the meeting is not about true ethics. Then, Andy asks Michael whether he would take bread for his family or if he would let his family go hungry. Michael can't decide.",
        "Holly tries to get some of her coworkers to discuss times where they were faced with ethical dilemmas, which they misinterpret as a platform to mention rules that they have broken, encouraged by Michael falsely saying they have “immunity.” Michael admits that when he discovered YouTube, he didn't work for five days. Oscar says that sometimes he takes a long lunch. Kelly says she downloads pirated music on to her work computer. Dwight tells Michael to fire Oscar. Angela says she reported Oscar to the INS. Meredith then says that she has been sleeping with a Hammermill paper rep for the past 6 years for lower prices on paper and Outback Steakhouse gift certificates. Holly is shocked and tries to get Michael to discipline her, however, Michael laughs it off, jokingly calls Meredith a “dirty girl” and doesn't believe that the situation is that serious.",
        "Holly asks Meredith questions. Michael tries to feed Meredith advice and tells her to say that the sexual meetings were personal, but Meredith admits that it was only for the steaks and the lower prices. Michael calls Meredith a stupid bag. Meredith unsurprisingly feels good about being pretty much a prostitute.",
        "Meanwhile, after Dwight says he has never wasted company time, Jim begins to time him to the second. Dwight tries to work all day without blinking or anything else.",
        "Holly and Michael talk to each other in the annex, and Michael asks if she wants to go to lunch to talk to Meredith. Holly says she already has lunch. Michael throws it away, and Michael offers to treat her to lunch, before admitting that since she isn’t a client, she will have to pay half. Holly wants Meredith to be fired, but has trouble expressing this as Michael continuously dodges the conversation and treats their lunch like a date. Michael has an uncomfortable talk with Holly about chastity belts. Michael tells Holly that Meredith needs this job, but Holly disagrees with this being a justification for her actions and feels that Michael’s attempts to brush the issue under the rug is wrong. When Michael tells her that Dunder Mifflin is home to the employees, Holly tells him that it is not a family but a workplace. Michael becomes very upset.",
        "Jim tells Andy about Dwight's favorite show, Battlestar Galactica, however, he uses wrong details to explain it, upsetting Dwight. Jim explains that Dwight sneezed while keeping his eyes open and even peed in a soda bottle at his desk just to remain focused on work. Jim says that he has been so busy watching Dwight that he hasn't started his own work. Dwight eventually takes a long break and an unassuming Jim tells Dwight that he is not completely ethical in his time-theft, unaware that Dwight's break was spent in the warehouse having sex with Angela, to which Dwight agrees.",
        "Back from lunch, Michael tells the crew that Holly is not right and throws away the leftovers from her lunch. Holly explains that being the morality police isn't popular, comparing her current situation with how she was treated as a hall monitor in middle school. Michael won't talk to Holly. Michael and Holly talk to Kendall. Kendall sides with Michael, saying that Meredith isn't doing anything wrong, and that the discounts are good due to the current economic crisis. Kendall rudely tells Holly that she was only supposed to get the office to fill out the questionnaire. Michael struggles to find a way to tell Holly that he told her so about the Meredith situation.",
        "Holly tells the office to finish the ethics seminar. When the office refuses, Michael screams at the office telling them to get into the conference room, to which they enter the room. Holly becomes seemingly happier. Meredith gives the whole office steaks from her sex deal, and they want Meredith to keep doing what she is doing. Stanley high-fives Phyllis, saying, \"Just keep the ribs coming.\""
    ]
}