{
    "season": 5,
    "title": "Baby Shower",
    "episode": "4",
    "episodes": [
        4
    ],
    "episodeDetails": {
        "sections": [
            {
                "title": "Baby Shower",
                "level": 1,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "\"Baby Shower\" is the fourth episode of the fifth season of The Office, and the 76th episode overall. It was written by Aaron Shure and directed by Greg Daniels. It first aired on October 16, 2008. It was viewed by 8.07 million people."
                    }
                ],
                "images": []
            },
            {
                "title": "Synopsis",
                "level": 2,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Dwight acts out the process of childbirth with a watermelon so Michael can be prepared for the arrival of Jan's baby. Dwight eventually drops the watermelon from his apron, which bursts onto the floor. Michael insists that the Party Planning Committee give him a Golden Shower just like they gave Phyllis for her wedding. Oscar deems the whole thing pointless as the baby isn't even related to Michael. Angela plans a \"Guess Whose Baby Picture\" game for the shower and gets angry when Andy unintentionally makes fun of her picture. Stanley gets irritated at pregnant women in the office when they complain about swollen ankles, constant hunger, varicose veins, and nipple chafing. He has the same problems and doesn't make them everyone's business."
                    },
                    {
                        "type": "paragraph",
                        "text": "Jim and Pam have a hard time trying to communicate with each other throughout the day, with Pam telling the documentary crew that the two of them would be having an \"off\" day even if she were in Scranton, which she is not."
                    },
                    {
                        "type": "paragraph",
                        "text": "When Jan arrives, everyone's surprised to see that her baby girl, Astrid, has already been born. The shower is held anyway with Michael doing his best to placate Jan by being cold to Holly (to whom he gave a head's up prior to the shower)."
                    },
                    {
                        "type": "paragraph",
                        "text": "The office employees pitched in money to buy a stroller for Jan who has already bought a $1200 Orbit stroller. Dwight can't imagine a stroller should cost as much as his bomb shelter. He takes the Orbit out to test its durability. While the shower continues, he straps a watermelon into the stroller and pushes it into fences, throws it over small cliffs and ties it to the back of his car for a bumper test."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael loves children. He never misses an opportunity to hold one. But when he holds Astrid, he feels nothing. He seeks advice from another \"baby-daddy,\" Darryl. Darryl explains that Michael doesn't have any attachment to Astrid because she's not his baby."
                    },
                    {
                        "type": "paragraph",
                        "text": "Despite Michael's pretense at the hostility toward Holly, Jan recognizes his attraction to her. After retrieving Astrid from Angela and Andy's vegetable photo shoot, she prepares to leave, but not before telling Michael not to date Holly. He agrees. Then he goes into the building and hugs Holly. He feels the connection to her he didn't feel with Astrid and asks Holly out on a date. She accepts."
                    },
                    {
                        "type": "paragraph",
                        "text": "Jim and Pam call each other at exactly the same time and leave similar messages, finishing the day still having not reached each other."
                    }
                ],
                "images": []
            },
            {
                "title": "Deleted scenes",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Michael reveals that Jan has allowed him to come up with names if she has a boy.",
                                "elements": []
                            },
                            {
                                "text": "Michael and Dwight reveal the contents of the \"go bag\" Michael carries around in case he needs to rush to the hospital for the birth, as written out in What to Expect When You're Expecting. Coming from the 1986 edition, the contents are laughably out of date, though Dwight has added some items of his own.",
                                "elements": []
                            },
                            {
                                "text": "Kevin and Phyllis pour orange juice into baby bottles for the shower - Meredith adds her own special ingredient, assuring them \"it's for me\".",
                                "elements": []
                            },
                            {
                                "text": "Stanley wonders why all babies seem genetically predisposed to stare at him.",
                                "elements": []
                            },
                            {
                                "text": "Jan reluctantly plays a pointless baby shower game. After Holly remarks how beautiful Jan looks (to which Jim mockingly states, \"Wait'll you get to know her better\"), Michael scolds her for talking during the party.",
                                "elements": []
                            },
                            {
                                "text": "Holly talks with Toby (via speakerphone) about what it was like being the HR person.",
                                "elements": []
                            },
                            {
                                "text": "Jan finds out that Kevin donated sperm at the same sperm bank she went to. While Kevin gleefully wonders if he might have \"done it\" with her, in a talking head interview, Jan considers her options if he really is the father: \"Sue? ...icide?\"",
                                "elements": []
                            },
                            {
                                "text": "More of Dwight's \"testing\" the stroller bought for Jan, ending with Dwight admitting he is very impressed when it holds up.",
                                "elements": []
                            },
                            {
                                "text": "Following a discussion regarding Astrid in the otherwise empty conference room, Jim insists that he has no intention of being Michael's connection with reality.",
                                "elements": []
                            },
                            {
                                "text": "Kevin, Phyllis, and Kelly wonder whether \"she\" should sleep on her stomach or back, but the camera zooms out to show not Astrid but a passed-out Meredith. In a talking head, Kelly says that, if she makes no mention of Meredith's clothes, there's no reason to bring up her drinking problem.",
                                "elements": []
                            },
                            {
                                "text": "Jan breast-feeds Astrid in plain view of the office, as Kevin and Creed happily look on.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Trivia",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "This episode demonstrates actress Melora Hardin's real-life singing talent.",
                                "elements": []
                            },
                            {
                                "text": "After the episode aired, participants in Dunder Mifflin Infinity were tasked with matching up each baby picture with the corresponding actor.",
                                "elements": []
                            },
                            {
                                "text": "Writer Michael Schur's wife and son appear in the montage of Michael with babies when Michael dances with two babies at once.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Amusing details",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "When Michael interrupts Phyllis's talking head interview, Angela watches with satisfaction.",
                                "elements": []
                            },
                            {
                                "text": "Creed wraps his foot in bandages, presumably the same foot which has only four toes (as revealed in the episode Take Your Daughter to Work Day).",
                                "elements": []
                            },
                            {
                                "text": "Stanley's contribution to the baby shower collection is a single dollar.",
                                "elements": []
                            },
                            {
                                "text": "When photographing Astrid, Angela calls the baby \"it\" instead of \"she\".",
                                "elements": []
                            },
                            {
                                "text": "Creed implies that he fought at Omaha Beach. Assuming his birthdate of November 1, 1925, is correct, this would make him 18 when D-Day occurred and thus is possible.",
                                "elements": []
                            },
                            {
                                "text": "Holly wears a different color of nail polish on each hand, in keeping with her quirky personality.",
                                "elements": []
                            },
                            {
                                "text": "Michael's \"special mark\" that he was to put on Astrid when she was born was \"MGS\", his initials.",
                                "elements": []
                            },
                            {
                                "text": "As Jan drives away, the stroller she received from the employees of Dunder Mifflin is seen next to Michael.",
                                "elements": []
                            }
                        ]
                    },
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Jan allows Michael to decide the name for the baby if it was a boy, however, it is heavily implied that she knew her baby would already be a girl which means she only allowed him to choose the name because she knew he had no chance of actually naming her child.",
                                "elements": []
                            }
                        ]
                    },
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "When Jan is sitting on the floor, singing to Astrid, you can see a hemorrhoid pillow sitting on the chair behind her. This is probably due to the fact that many women get hemorrhoids after giving birth.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Goofs",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "In the cold open, Jim shows two diagrams describing Astrid's parents and the watermelon's parents. According to a watcher's point of view, on Astrid's parents' diagram, the sperm donor (the father) is on the left side and Jan (the mother) is on the right side. On the watermelon's parents' diagram, Dwight is listed on the left side and Michael on the right. However, Dwight should be listed on the right and Michael on the left in order to correctly correspond with Astrid's diagram (Dwight is the \"mother\" of the watermelon because he's \"birthing\" it, like how Jan is the mother of Astrid).",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Connections to previous episodes",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Andy calls a baby picture of himself \"Nard Puppy\", a callback to the nickname \"Nard Dog\" he received in the episode Local Ad.",
                                "elements": []
                            },
                            {
                                "text": "In Take Your Daughter to Work Day, Michael complained about having children around the office and was awkward around Toby's daughter, however, by the end of the episode he calls himself a \"little kid lover\". In this episode, he talks about how much he likes babies as well.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Cultural references",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Michael wanted to get live storks for the baby shower. In Western culture, the stork is the symbol for childbirth.",
                                "elements": []
                            },
                            {
                                "text": "Michael asks for a golden shower, inadvertently using a slang term for urolagnia, the practice of urination for sexual pleasure.",
                                "elements": []
                            },
                            {
                                "text": "Pam mentions a friend who makes \"Murakami-style collages\". She is possibly referring to Haruki Murakami, a Japanese surrealist writer, or more likely, Takashi Murakami, a Japanese contemporary artist.",
                                "elements": []
                            },
                            {
                                "text": "On the phone, Pam talks about Sarah, the T.A., a common abbreviation for teaching assistant.",
                                "elements": []
                            },
                            {
                                "text": "Jan wants to talk to Michael about Astrid's 529. A 529 plan is a way of saving money for a child's higher education. The joke is that Jan expects Michael to contribute to Astrid's college fund.",
                                "elements": []
                            },
                            {
                                "text": "Angela's picture of Astrid in a vegetable patch echoes the style of photographer Anne Geddes.",
                                "elements": []
                            },
                            {
                                "text": "Omaha Beach was one of the five beaches where Allied forces landed on June 6, 1944. It faced the greatest amount of German resistance and suffered the most casualties.",
                                "elements": []
                            },
                            {
                                "text": "Jan is singing \"Son of a Preacher Man\" at her baby shower.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Cast",
                "level": 2,
                "content": [],
                "images": []
            },
            {
                "title": "Main Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Steve Carell as Michael Scott",
                                "elements": []
                            },
                            {
                                "text": "Rainn Wilson as Dwight Schrute",
                                "elements": []
                            },
                            {
                                "text": "John Krasinski as Jim Halpert",
                                "elements": []
                            },
                            {
                                "text": "Jenna Fischer as Pam Beesly",
                                "elements": []
                            },
                            {
                                "text": "B.J. Novak as Ryan Howard",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Supporting Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Ed Helms as Andy Bernard",
                                "elements": []
                            },
                            {
                                "text": "Melora Hardin as Jan Levinson",
                                "elements": []
                            },
                            {
                                "text": "Leslie David Baker as Stanley Hudson",
                                "elements": []
                            },
                            {
                                "text": "Brian Baumgartner as Kevin Malone",
                                "elements": []
                            },
                            {
                                "text": "Creed Bratton (actor) as Creed Bratton",
                                "elements": []
                            },
                            {
                                "text": "Kate Flannery as Meredith Palmer",
                                "elements": []
                            },
                            {
                                "text": "Mindy Kaling as Kelly Kapoor",
                                "elements": []
                            },
                            {
                                "text": "Angela Kinsey as Angela Martin",
                                "elements": []
                            },
                            {
                                "text": "Oscar Nunez as Oscar Martinez",
                                "elements": []
                            },
                            {
                                "text": "Craig Robinson as Darryl Philbin",
                                "elements": []
                            },
                            {
                                "text": "Phyllis Smith as Phyllis Vance",
                                "elements": []
                            },
                            {
                                "text": "Paul Lieberstein as Toby Flenderson (Uncredited, Voice Only, Deleted Scene)",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Special Guest Star",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Amy Ryan as Holly Flax",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Recurring Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Calvin Tenner as Calvin",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Guest Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Vanessa Ragland as Linda",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "References",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "↑ The Office: Baby Shower, Jennie Tan, October 17, 2008.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            }
        ]
    },
    "quotesDetails": {
        "sections": [
            {
                "title": "Baby Shower Quotes",
                "level": 1,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Jim: Jan is about to have a baby with a sperm donor - and Michael is preparing for the birth of a watermelon with Dwight. Now, this baby will be related to Michael, through...delusion."
                    },
                    {
                        "type": "paragraph",
                        "text": "Dwight: Babies are one of my many areas of expertise. Growing up, I performed my own circumcision."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael: When you first...became a baby-daddy, did you have...an immediate connection with that baby, like - the first time that you held it, did you find that...with your baby-baby?\nDarryl: Hell yeah!...You know why? Because that was my baby!"
                    }
                ],
                "images": []
            }
        ]
    },
    "coldOpens": [
        "Dwight and Michael prepare for Jan's baby by using a watermelon. Jim says that Michael and Jan's baby are connected through delusion."
    ],
    "storylines": [
        "Dwight acts out the process of childbirth with a watermelon so Michael can be prepared for the arrival of Jan's baby. Dwight eventually drops the watermelon from his apron, which bursts onto the floor. Michael insists that the Party Planning Committee give him a Golden Shower just like they gave Phyllis for her wedding. Oscar deems the whole thing pointless as the baby isn't even related to Michael. Angela plans a \"Guess Whose Baby Picture\" game for the shower and gets angry when Andy unintentionally makes fun of her picture. Stanley gets irritated at pregnant women in the office when they complain about swollen ankles, constant hunger, varicose veins, and nipple chafing. He has the same problems and doesn't make them everyone's business.",
        "Jim and Pam have a hard time trying to communicate with each other throughout the day, with Pam telling the documentary crew that the two of them would be having an \"off\" day even if she were in Scranton, which she is not.",
        "When Jan arrives, everyone's surprised to see that her baby girl, Astrid, has already been born. The shower is held anyway with Michael doing his best to placate Jan by being cold to Holly (to whom he gave a head's up prior to the shower).",
        "The office employees pitched in money to buy a stroller for Jan who has already bought a $1200 Orbit stroller. Dwight can't imagine a stroller should cost as much as his bomb shelter. He takes the Orbit out to test its durability. While the shower continues, he straps a watermelon into the stroller and pushes it into fences, throws it over small cliffs and ties it to the back of his car for a bumper test.",
        "Michael loves children. He never misses an opportunity to hold one. But when he holds Astrid, he feels nothing. He seeks advice from another \"baby-daddy,\" Darryl. Darryl explains that Michael doesn't have any attachment to Astrid because she's not his baby.",
        "Despite Michael's pretense at the hostility toward Holly, Jan recognizes his attraction to her. After retrieving Astrid from Angela and Andy's vegetable photo shoot, she prepares to leave, but not before telling Michael not to date Holly. He agrees. Then he goes into the building and hugs Holly. He feels the connection to her he didn't feel with Astrid and asks Holly out on a date. She accepts.",
        "Jim and Pam call each other at exactly the same time and leave similar messages, finishing the day still having not reached each other."
    ],
    "quotes": [
        "Jim: Jan is about to have a baby with a sperm donor - and Michael is preparing for the birth of a watermelon with Dwight. Now, this baby will be related to Michael, through...delusion.",
        "Dwight: Babies are one of my many areas of expertise. Growing up, I performed my own circumcision.",
        "Michael: When you first...became a baby-daddy, did you have...an immediate connection with that baby, like - the first time that you held it, did you find that...with your baby-baby?\nDarryl: Hell yeah!...You know why? Because that was my baby!"
    ]
}