{
    "season": 5,
    "title": "Baby Shower",
    "episode": "4",
    "episodes": [
        4
    ],
    "coldOpens": [
        "Dwight and Michael prepare for Jan's baby by using a watermelon. Jim says that Michael and Jan's baby are connected through delusion."
    ],
    "storylines": [
        "Dwight acts out the process of childbirth with a watermelon so Michael can be prepared for the arrival of Jan's baby. Dwight eventually drops the watermelon from his apron, which bursts onto the floor. Michael insists that the Party Planning Committee give him a Golden Shower just like they gave Phyllis for her wedding. Oscar deems the whole thing pointless as the baby isn't even related to Michael. Angela plans a \"Guess Whose Baby Picture\" game for the shower and gets angry when Andy unintentionally makes fun of her picture. Stanley gets irritated at pregnant women in the office when they complain about swollen ankles, constant hunger, varicose veins, and nipple chafing. He has the same problems and doesn't make them everyone's business.",
        "Jim and Pam have a hard time trying to communicate with each other throughout the day, with Pam telling the documentary crew that the two of them would be having an \"off\" day even if she were in Scranton, which she is not.",
        "When Jan arrives, everyone's surprised to see that her baby girl, Astrid, has already been born. The shower is held anyway with Michael doing his best to placate Jan by being cold to Holly (to whom he gave a head's up prior to the shower).",
        "The office employees pitched in money to buy a stroller for Jan who has already bought a $1200 Orbit stroller. Dwight can't imagine a stroller should cost as much as his bomb shelter. He takes the Orbit out to test its durability. While the shower continues, he straps a watermelon into the stroller and pushes it into fences, throws it over small cliffs and ties it to the back of his car for a bumper test.",
        "Michael loves children. He never misses an opportunity to hold one. But when he holds Astrid, he feels nothing. He seeks advice from another \"baby-daddy,\" Darryl. Darryl explains that Michael doesn't have any attachment to Astrid because she's not his baby.",
        "Despite Michael's pretense at the hostility toward Holly, Jan recognizes his attraction to her. After retrieving Astrid from Angela and Andy's vegetable photo shoot, she prepares to leave, but not before telling Michael not to date Holly. He agrees. Then he goes into the building and hugs Holly. He feels the connection to her he didn't feel with Astrid and asks Holly out on a date. She accepts.",
        "Jim and Pam call each other at exactly the same time and leave similar messages, finishing the day still having not reached each other."
    ],
    "quotes": [
        [
            {
                "speaker": "Jim",
                "content": " Jan is about to have a baby with a sperm donor - and Michael is preparing for the birth of a watermelon with Dwight. Now, this baby will be related to Michael, through...delusion."
            }
        ],
        [
            {
                "speaker": "Dwight",
                "content": " Babies are one of my many areas of expertise. Growing up, I performed my own circumcision."
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " When you first...became a baby-daddy, did you have...an immediate connection with that baby, like - the first time that you held it, did you find that...with your baby-baby?"
            },
            {
                "speaker": "Darryl",
                "content": " Hell yeah!...You know why? Because that was my baby!"
            }
        ]
    ]
}