{
    "season": 5,
    "title": "Crime Aid",
    "episode": "5",
    "episodes": [
        5
    ],
    "episodeDetails": {
        "sections": [
            {
                "title": "Crime Aid",
                "level": 1,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "\"Crime Aid\" is the fifth episode of the fifth season of The Office and the 77th episode overall. It was written by Charlie Grandy and directed by Jennifer Celotta. It first aired October 23, 2008. It was viewed by 7.74 million people."
                    }
                ],
                "images": []
            },
            {
                "title": "Summary",
                "level": 2,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Pam finds that living in New York has become too expensive. Michael assists her by getting her a job at the Dunder Mifflin corporate office, though she believes he did that so he could call her constantly."
                    },
                    {
                        "type": "paragraph",
                        "text": "It is revealed that Michael and Holly are happily dating. One night, the two have sex in the stairwell in the office building and forget to lock the building door when they finish. As a result, thieves break in to the building and the Dunder Mifflin office and steal the computers and various other belongings."
                    },
                    {
                        "type": "paragraph",
                        "text": "Realizing the robbery was their fault, Michael and Holly decide to set up an auction in the warehouse to raise money to match the value of items stolen. Jim finds a message from the night before on his work phone from an intoxicated Pam, who was out with friends at the time, and Jim jokingly remarks that she is the \"future mother of [his] children\"."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael allows all the staff to auction off any item they choose.  For his part, Michael has let it be known that he possesses two front-row seats and backstage passes to a Bruce Springsteen show, which generates buzz for the event. Holly decides to auction off a yoga lesson, which Michael is the only one to place a bid for, and Phyllis decides to auction off a hug. Darryl auctions off an opportunity for someone to join him and the rest of the warehouse workers at a bar for beers at that exact moment. Michael tries to make a bid, but Darryl denies his bid, saying it would be a \"conflict of interests\". Jim makes a bid, and Darryl immediately accepts it and they leave. The auction seems to be a complete failure until CFO David Wallace arrives to help raise money by auctioning off a weekend at his place in Martha's Vineyard."
                    },
                    {
                        "type": "paragraph",
                        "text": "Meanwhile, Angela and Andy have set a date for their wedding, which upsets Dwight. Phyllis, knowing Dwight's connection with Angela, attempts to console him. She suggests that he give Angela an ultimatum: call off the wedding or lose out on him. Angela ultimately says no to Dwight, so he asks Phyllis for more advice. Phyllis tells him that since she rejected him and his ultimatum that he should move on. Dwight then becomes bitter towards Phyllis, but later realizes she was trying to help, so he shows his appreciation by bidding for her hug in the auction, which he loses to her husband, Bob Vance. The hug actually sells for one thousand dollars, making it the most successful item at the auction."
                    },
                    {
                        "type": "paragraph",
                        "text": "At the bar, Jim encounters Pam's ex, Roy, who joins him and the warehouse workers for some beers. (For curiosity's sake, the beers that Jim drank at the bar were Lionshead and Stegsmaier Gold Medal which are both produced by Lion Brewery, Inc in Wilkes-Barre, PA). Jim reveals to Roy that he is engaged to Pam, which Roy congratulates him on, and also mentions that Pam is at art school in New York. He tells Roy about the night before which she spent with friends, to which he responds that Jim was also once her friend, suggesting that Pam may do to Jim what she did to Roy. Jim then decides to drive to New York to visit Pam, but just before getting onto I-80 towards New York turns around because he is not \"that guy\" and he and Pam are not \"that couple\"."
                    },
                    {
                        "type": "paragraph",
                        "text": "When the time comes to open bidding for the Springsteen tickets, Michael claims he can't find them and tells everyone that they were stolen in the robbery. At the end of the episode, Michael tells Holly that he lied about the tickets being stolen and about the tickets in general. They kiss, catching the eye of a visibly displeased David Wallace."
                    }
                ],
                "images": []
            },
            {
                "title": "Deleted scenes",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Michael calls Pam and asks her to get him a slice of pizza from New York. Later, Michael opens an overnight envelope and takes out a slice of pizza, which he eats.",
                                "elements": []
                            },
                            {
                                "text": "Pam and Jim talk on the phone about an episode of West Wing they watched together. In a talking head interview, Pam explains that West Wing was a compromise: Jim wanted Battlestar Galactica, and Pam wanted Cranford. Pam confides, \"Next, we're gonna watch Cranford.\" In a separate talking head interview Jim says, \"We're never going to watch Cranford.\"",
                                "elements": []
                            },
                            {
                                "text": "Michael asks Jim to hear out his date ideas. He has one wild card and two sure things. He starts with the wild card which was dinner and a movie. Jim can tell that the sure things will be absolute disasters. The first sure thing is Michael blindfolds Holly, they go to the Houdini museum and then she ties Michael up, Jim stops him right there because he knows where it is leading. The second sure thing is that Michael and Holly go to the mall and go to the bed store, she picks out any bed and they have sex on it. Jim tells him that the wild card is the best one and he should use that, but Michael obviously thinks it isn’t special enough because it's a \"big\" third date.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Trivia",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "The picture of Hank on his CD is of Hank in his security uniform, in front of the Scranton Business Park building, with the same guitar he's playing at the fundraiser.",
                                "elements": []
                            },
                            {
                                "text": "The title of Hank's CD is Hank Doyle Is the Blues, even though Hank's name tag reads Tate. It is unclear whether this is intentional. (Perhaps he performs under the name Hank Doyle?)",
                                "elements": []
                            },
                            {
                                "text": "After Jim has left for his drink with the warehouse guys the next item is Creed's. In the cut to the shot of Creed, Jim is still sitting behind him.",
                                "elements": []
                            },
                            {
                                "text": "Creed reveals that the last person to steal from him was a person of the same name implying that he killed him and stole his identity.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Amusing Details",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "During Phyllis and Dwight's first conversation, Dwight tells her that Angela introduced him to \"Monotheism\" and \"Preventative Medicine\".",
                                "elements": []
                            },
                            {
                                "text": "Ryan can be seen hiding his face when David Wallace enters.",
                                "elements": []
                            },
                            {
                                "text": "After Dwight talks to Phyllis in the elevator, the door closes right after Phyllis left even though Dwight never pressed the close doors button.",
                                "elements": []
                            },
                            {
                                "text": "Kevin offers to do someone's taxes during the auction, though in another episode he admits that he has Oscar do his taxes.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Cultural references",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Michael calls out Paaaaamolaaaaa, in the style of the advertisements for Ricola cough drops.",
                                "elements": []
                            },
                            {
                                "text": "One of the foods for which New York City is known is its pizza.",
                                "elements": []
                            },
                            {
                                "text": "The West Wing is a television series about a fictitious president. It ran from 1999 to 2006.",
                                "elements": []
                            },
                            {
                                "text": "Battlestar Galactica is a television science fiction series which ran from 2004 to 2009.",
                                "elements": []
                            },
                            {
                                "text": "Cranford is a 2007 television series set in Cranford, England in the 1840s.",
                                "elements": []
                            },
                            {
                                "text": "Michael says that Crime Aid will be like FarmAid, except the stopping AIDS part.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Connections to previous episodes",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Michael took a picture of Meredith as she exposed her breasts in Christmas Party.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Cast",
                "level": 2,
                "content": [],
                "images": []
            },
            {
                "title": "Main cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Steve Carell as Michael Scott",
                                "elements": []
                            },
                            {
                                "text": "Rainn Wilson as Dwight Schrute",
                                "elements": []
                            },
                            {
                                "text": "John Krasinski as Jim Halpert",
                                "elements": []
                            },
                            {
                                "text": "Jenna Fischer as Pam Beesly",
                                "elements": []
                            },
                            {
                                "text": "B.J. Novak as Ryan Howard",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Supporting cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Ed Helms as Andy Bernard",
                                "elements": []
                            },
                            {
                                "text": "Leslie David Baker as Stanley Hudson",
                                "elements": []
                            },
                            {
                                "text": "Brian Baumgartner as Kevin Malone",
                                "elements": []
                            },
                            {
                                "text": "Creed Bratton (actor) as Creed Bratton",
                                "elements": []
                            },
                            {
                                "text": "Kate Flannery as Meredith Palmer",
                                "elements": []
                            },
                            {
                                "text": "Mindy Kaling as Kelly Kapoor",
                                "elements": []
                            },
                            {
                                "text": "Angela Kinsey as Angela Martin",
                                "elements": []
                            },
                            {
                                "text": "Oscar Nunez as Oscar Martinez",
                                "elements": []
                            },
                            {
                                "text": "Craig Robinson as Darryl Philbin",
                                "elements": []
                            },
                            {
                                "text": "Phyllis Smith as Phyllis Vance",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Special guest cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Amy Ryan as Holly Flax",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Recurring cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "David Denman as Roy Anderson",
                                "elements": []
                            },
                            {
                                "text": "Andy Buckley as David Wallace",
                                "elements": []
                            },
                            {
                                "text": "Bobby Ray Shafer as Bob Vance",
                                "elements": []
                            },
                            {
                                "text": "Hugh Dane as Hank Tate",
                                "elements": []
                            },
                            {
                                "text": "Calvin Tenner as Calvin (Uncredited)",
                                "elements": []
                            },
                            {
                                "text": "Hidetoshi Imura as Hidetoshi Hasagawa (Uncredited)",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Guest cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Stephen Saux as Justin Spitzer",
                                "elements": []
                            },
                            {
                                "text": "Jennifer Ann Burton as Corporate Employee",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            }
        ]
    },
    "quotesDetails": {
        "sections": [
            {
                "title": "Crime Aid Quotes",
                "level": 1,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Creed: Nobody steals from Creed Bratton and gets away with it. The last person to do this disappeared. His name? [whispering] Creed Bratton."
                    }
                ],
                "images": []
            }
        ]
    },
    "coldOpens": [
        "Pam runs out of money in New York so Michael arranges for her to get a job at Corporate."
    ],
    "storylines": [
        "Pam finds that living in New York has become too expensive. Michael assists her by getting her a job at the Dunder Mifflin corporate office, though she believes he did that so he could call her constantly.",
        "It is revealed that Michael and Holly are happily dating. One night, the two have sex in the stairwell in the office building and forget to lock the building door when they finish. As a result, thieves break in to the building and the Dunder Mifflin office and steal the computers and various other belongings.",
        "Realizing the robbery was their fault, Michael and Holly decide to set up an auction in the warehouse to raise money to match the value of items stolen. Jim finds a message from the night before on his work phone from an intoxicated Pam, who was out with friends at the time, and Jim jokingly remarks that she is the \"future mother of [his] children\".",
        "Michael allows all the staff to auction off any item they choose.  For his part, Michael has let it be known that he possesses two front-row seats and backstage passes to a Bruce Springsteen show, which generates buzz for the event. Holly decides to auction off a yoga lesson, which Michael is the only one to place a bid for, and Phyllis decides to auction off a hug. Darryl auctions off an opportunity for someone to join him and the rest of the warehouse workers at a bar for beers at that exact moment. Michael tries to make a bid, but Darryl denies his bid, saying it would be a \"conflict of interests\". Jim makes a bid, and Darryl immediately accepts it and they leave. The auction seems to be a complete failure until CFO David Wallace arrives to help raise money by auctioning off a weekend at his place in Martha's Vineyard.",
        "Meanwhile, Angela and Andy have set a date for their wedding, which upsets Dwight. Phyllis, knowing Dwight's connection with Angela, attempts to console him. She suggests that he give Angela an ultimatum: call off the wedding or lose out on him. Angela ultimately says no to Dwight, so he asks Phyllis for more advice. Phyllis tells him that since she rejected him and his ultimatum that he should move on. Dwight then becomes bitter towards Phyllis, but later realizes she was trying to help, so he shows his appreciation by bidding for her hug in the auction, which he loses to her husband, Bob Vance. The hug actually sells for one thousand dollars, making it the most successful item at the auction.",
        "At the bar, Jim encounters Pam's ex, Roy, who joins him and the warehouse workers for some beers. (For curiosity's sake, the beers that Jim drank at the bar were Lionshead and Stegsmaier Gold Medal which are both produced by Lion Brewery, Inc in Wilkes-Barre, PA). Jim reveals to Roy that he is engaged to Pam, which Roy congratulates him on, and also mentions that Pam is at art school in New York. He tells Roy about the night before which she spent with friends, to which he responds that Jim was also once her friend, suggesting that Pam may do to Jim what she did to Roy. Jim then decides to drive to New York to visit Pam, but just before getting onto I-80 towards New York turns around because he is not \"that guy\" and he and Pam are not \"that couple\".",
        "When the time comes to open bidding for the Springsteen tickets, Michael claims he can't find them and tells everyone that they were stolen in the robbery. At the end of the episode, Michael tells Holly that he lied about the tickets being stolen and about the tickets in general. They kiss, catching the eye of a visibly displeased David Wallace."
    ],
    "quotes": [
        "Creed: Nobody steals from Creed Bratton and gets away with it. The last person to do this disappeared. His name? [whispering] Creed Bratton."
    ]
}