{
    "season": 5,
    "title": "Business Trip",
    "episode": "8",
    "episodes": [
        8
    ],
    "coldOpens": [
        "Michael tells the office about local customs in foreign lands."
    ],
    "storylines": [
        "CFO David Wallace sends Michael on a foreign sales call to Winnipeg to help alleviate the stress of having Holly taken away from him. He brings along Andy as a foreign language translator and Oscar as the \"numbers guy\". David Wallace tells him to go to the concierge to find activities to do in the city. Michael finds himself attracted to the concierge (whose name is Marie), and, thinking that the concierge is the Winnipeg version of a Geisha, mistakes her as some kind of prostitute.",
        "Michael runs into Marie at a bar later that night. They have a few drinks and head back to her hotel room to have sex. After supposedly brief and impersonal intercourse, Marie kicks Michael out of her room and he walks away, depressed and barefoot. As he heads down the hall, she opens the door. Michael turns around expectantly, but she opened the door only to return his shoes.",
        "Back at the bar, Oscar wishes to be left alone, but Andy attempts to set him up with a couple of guys. A few drinks later, Oscar asks Andy what he sees in Angela. Andy says he sees something behind her strict behavior before mentioning that they have not had sex yet. Oscar is shocked and tells Andy to call Angela about this. Andy, drunk, calls Angela, who is with Dwight. Andy tells her he does not like the fact they have not had sex yet. Angela berates him for calling her whilst drunk and hangs up on him.",
        "The next morning, Andy and Oscar reminisce about the night before, with Oscar bringing up Andy's call to Angela. Andy, now sober, is horrified to find that he really did call Angela. (Upon waking that morning, he thought the call had just been a dream, he tells Oscar.) He calls Angela to apologize. He says afterward that Angela has put them back on \"first base\", which for her means that Andy gets to \"kiss her forehead\". Andy tells Oscar he appreciated his company on the trip, and Oscar feels the same way about Andy.",
        "Michael secures the sale with the client and calls David Wallace, who congratulates him. Michael then tells him he had a terrible time in Winnipeg and berates him for taking Holly away from him before abruptly hanging up. He then gets on the plane back to Scranton, mentioning he has stayed with the company for a long time because they give him enough respect that he could talk down his boss and nothing would happen to him.",
        "Back in Scranton, Jim and the rest of the staff are eagerly counting down the days until Pam returns from art school, with the staff awkwardly and intrusively showing their excitement for Jim. Pam is upset that she failed a class and calls Jim to tell him that she would need to stay in New York for another three months to retake it. Pam is unsure if she wants to spend another three months away from Jim, but Jim reminds her that she went to New York for her own personal benefit and should only return to Scranton \"the right way\".",
        "The rest of the staff finds out about her situation and feels sorry for the two of them, save Dwight who criticizes Pam's painting of the office building on the wall. At the end of the day, Jim finds Pam waiting in the parking lot. Pam tells Jim that she is coming back \"the wrong way\" not because of him, but because she ultimately did not like graphic design and that Scranton is her home. Jim welcomes her back and they kiss.",
        "Meanwhile, Ryan moves back to the annex with Kelly in preparation for Pam's return and starts showing off by doing push ups in front of her. Kelly says she has no intention of breaking up with Darryl and restarting a relationship with Ryan, but the two begin making out passionately. Ryan tells Kelly to break up with Darryl via text message, and Darryl responds immediately saying merely \"it's cool\". Ryan is shocked at Darryl letting it go easily, and Darryl is shown happily walking to his truck.",
        "At the end of the episode, Ryan and Kelly confirm they are back together, with Ryan visibly uncomfortable like he was before in their relationship."
    ],
    "quotes": [
        [
            {
                "speaker": "Michael",
                "content": " A concierge is like the Winnipeg equivalent of a geisha. This is a woman who has been trained in the fine art of fanciness and pleasure. And when you meet one, it is intoxicating. Just what the doctor ordered."
            }
        ]
    ]
}