{
    "season": 6,
    "title": "Secret Santa",
    "episode": "13",
    "episodes": [
        13
    ],
    "coldOpens": [
        "Jim and Dwight unveil the new office Christmas tree, but the office is not amused. "
    ],
    "storylines": [
        "Michael is outraged when Jim promises Phyllis she can be Santa. Michael tries to undermine her by also dressing as Santa. Kevin sits on Michael's lap, putting Michael in pain. Michael tries to get an unwilling Ryan to sit on his lap but Jim intervenes. Michael poutingly puts his Santa hat in the punch and storms into his office. He takes off his Santa suit and puts it back on inside out, emerging as Jesus. Angela is seen looking very happy when seeing Michael as Jesus. While Phyllis is giving the office employees their Secret Santa presents, Michael belittles many of them, including Stanley for cheating on his wife (as was revealed in Gossip). However, Michael tries to redeem himself, and smiles when Dwight gets his present. Angela is extremely offended after Michael says Jesus \"ruined the party\".",
        "Meanwhile, Jim and Dwight (who is taking a break from his diabolical plan, revealed in Scott's Tots) try to get the office into the Christmas spirit, despite the uncertainty in Dunder Mifflin's future. Dwight thinks he may be depressed. They unveil the office Christmas tree, but the rest of the employees (including Pam) are displeased to see it's artificial and undecorated. Jim says he was hoping they could all decorate it together.",
        "Dwight gets a gift in pieces that he must assemble from his Secret Santa. He is desperate to know what it is and creates a list of the things he believes it could be. Michael continues throughout the episode to deliver pieces. At first Dwight thinks it is a gun, but it is really a nutcracker. Jim ultimately plans a successful party, which Pam loves. The warehouse even comes to the party, including Madge and Calvin, who have not been seen in a while.",
        "Oscar has a secret crush on Matt, a new warehouse worker. Pam notices Oscar watching Matt play football. Oscar holds off giving Matt his pay check so he can deliver it in person, but Matt isn't there. Darryl hints that he suspects something between them, and Oscar leaves. Pam continues to secretly watch Oscar throughout. Pam is openly supportive in two talking heads telling the crew, \"they are the only two gay guys I know\". Pam sets them up, but Oscar purposefully mistakes Matt's name as \"Mark\". Pam looks at Oscar inquisitively, but Oscar assures her he knows what he's doing.",
        "Michael calls David Wallace, who tells him Dunder Mifflin is being bought out. When Michael tells everyone they are losing their jobs, they all conference-call David from Michael's office. David clarifies that everyone from corporate will lose their jobs, but that the Scranton branch is safe. Jim sympathizes with David while Meredith randomly tells him his wife is a very lucky woman. The whole office is thrilled and Michael jumps into the crowd. They decide to continue the Christmas party.",
        "All the while Andy has been giving Erin The 12 Days of Christmas, including the many animals, for Secret Santa. According to Erin, her cat killed a turtle dove and the French hens have started pulling out her hair to make a nest. She comes in the office with a deep scar. Erin tries to figure out who her Secret Santa is since her gift is causing her injury and begs them to stop. Andy awkwardly denies giving Erin the present and begs Phyllis not to tell Erin. Phyllis willingly agrees. However, during Michael's snarky Jesus routine, he reveals that Andy was, in fact, Erin's Secret Santa. Erin asks Andy what he was thinking, but seems thrilled when Andy gets twelve drummers drumming to play for her in the last scene."
    ],
    "quotes": [
        [
            {
                "speaker": "Dwight",
                "content": " \"For several weeks, my Secret Santa has been giving me pieces of a machine that I've been attempting to assemble. I'm suspicious of this because I had exactly the same idea, for catching Osama bin Laden. I would simply send him a different piece each day. He would assemble it, to find himself... in jail!\""
            }
        ]
    ]
}