{
    "season": 6,
    "title": "Scott's Tots",
    "episode": "12",
    "episodes": [
        12
    ],
    "coldOpens": [
        "After Michael tells Andy he has received complaints about Andy's baby voice, Andy gives Michael tips about his Elvis impression."
    ],
    "storylines": [
        "In the cold open, Michael talks to Andy about his \"baby voice\" which Michael tells him, \"makes him look like he hires babies.\" Andy then tells him that some office employees find his Elvis imitation annoying, but tells him that he, himself likes the voice. Michael and Andy then finish talking to each other in Elvis and baby voices once again.",
        "Andy tells Jim that morale is not good in the office and then suggests setting up an employee of the month program. Jim decides to adopt the plan, and Andy is thrilled. While Erin tries to organize Michael's computer by deleting e-mails, Jim comes into his office to tell him that an employee of the month program would be a good idea, and Michael accepts the idea, after thinking he would be given the award. Michael also tells Jim that he made a horrible decision, and tells Erin to go away.",
        "Meanwhile, Dwight is trying to get Andy to believe that the employee of the month was his idea so that his plan can't get traced back to him. Dwight explains that Jim will later be fired by David Wallace. Dwight tries to convince Jim that he should get the employee of the month award and gives Jim a rundown of all the people in the office's work ethic. Jim decides to take it, however Dwight made sure that the people with the highest numbers are Jim and Pam.",
        "Erin asks Michael about Scott's Tots. Stanley begins to laugh and asks if it's been ten years already. It is revealed that, 10 years ago, in a moment of weakness while visiting an elementary school, Michael promised a group of third-graders college tuition if they graduated from high school. It had been a serious offer. Michael had assumed his salary would increase over time and he would be able to afford the tuition. Pam tells Michael he did a \"terrible, terrible thing\" and refuses to accompany him to the school, a visit he's been putting off for weeks. She's no longer the receptionist and tells Erin that she must make sure Michael shows up. Michael and Erin go to the school and see a girl, Mikela, who is thrilled to see Michael. It is clear that Michael has invested emotionally in these kids, knowing their names, going to their plays and other activities and even had a reading room at the school named after him. Michael heads into the classroom, and sees people clapping for him.",
        "Michael is then given a presentation where a bunch of the \"tots\" are thanking them because they are going to graduate this year. They sing an impromptu song, and Michael awkwardly claps, but begins to realize the scope of his promise. A teacher calls Michael a dream-maker and gets emotional. A kid tells Michael that he wants to be a president and also tells Michael that he is his hero. Michael starts to cry. Michael stands up and tries to tell the tots that he cannot pay for their tuition, however, they take it as a joke. When Michael insists that he cannot pay for the tuition, they become extremely angry. Michael offers them lithium computer batteries.",
        "Meanwhile, Dwight goes up to Kevin and Oscar and collects twenty dollars from each of them for the employee of the month award, which Jim had never agreed upon. When the time comes to pull the number, he ends up pulling his own. He tries to explain it was a mistake as he cannot be the Employee of the Month, then draws Pam's number next. Pam has no problem believing she deserves the award as she's doubled her sales from two to four. The others protest what they believe is a rigged process in the Halperts' favor. Jim also denies there was ever a monetary award involved.",
        "To make matters worse, Dwight ordered a custom cake, saying \"It could only be you,\" which the employees believe Jim ordered for himself. After Dwight calls David Wallace posing as Stanley, Toby, and Kevin to complain, Wallace lectures Jim, then apologizes. Later on, Dwight listens to his hidden recording device (a fountain pen in Jim's office) in hopes of hearing David Wallace reprimand Jim. Instead, Dwight hears David encouraging Jim's work, saying that he's got a great deal on his mind and knows Jim is doing his best, and they will be meeting for dinner soon. Dwight is stunned.",
        "A student tells Michael that what he did was wrong. Michael promises to pay for his books and writes him a post-dated check. In the car, Erin starts to sing the \"Hey Mr. Scott\" tune and Michael tells her to stop. Erin tells Michael that the group of Scott's Tots has a greater graduating rate than other classes, and his promise (although he did not deliver) helped to motivate the students to complete school. Michael apologizes to Erin, and asks her about her goals with Dunder Mifflin, where she explains that she wants to try accounting, although she is doubtful of her math skills. Michael explains that he hired Kevin as an accountant, even when he applied in the warehouse because he had a \"feeling about him\". Michael then tells Erin that he has a feeling about her too, and the two begin to sing \"Hey Mr. Scott\" for the rest of the ride.",
        "Ryan finds a copy of the Diabolical Plan in the copier and tells Dwight he wants to take down Jim Halpert. They agree to work together to do this."
    ],
    "quotes": [
        [
            {
                "speaker": "Michael and Erin",
                "content": " Hey Mr. Scott, What you gonna do, What you gonna do make our dreams come true. Hey Mr. Scott, What you gonna do, What you gonna do make our dreams come true."
            }
        ]
    ]
}