{
    "season": 6,
    "title": "Shareholder Meeting",
    "episode": "11",
    "episodes": [
        11
    ],
    "coldOpens": [
        "Jim gives us a history on the evolution of Dwight's alter ego, \"Recyclops.\" "
    ],
    "storylines": [
        "When invited to be honored at the Dunder Mifflin shareholders meeting in New York by CFO David Wallace, Michael is enthusiastic and prepares to present himself in a fashionable manner. When Michael is informed that a limo was sent by corporate, Michael believes it was a town car sent to pick him up, only to find out it was indeed a limo. Michael is exalted, as well as the rest of the staff, and decides to bring Andy, Oscar, and Dwight along to the meeting with him. On the way, the group enjoy their time in the limo until reaching New York. Michael meets up with Wallace and several members of corporate, and is then escorted to prepare for the conference. Meanwhile, Andy and Oscar are finding a seat for the conference, only Oscar criticizes corporate's decision on spending money on the meeting. Andy reacts by telling Oscar to express his opinions, only to have Oscar berate him for endangering his job. While Andy and Oscar are discussing what was to be done, Dwight waits in a severely long line to ask a question, only to run into trouble with the people waiting.",
        "As the meeting commences, the audience jeers and heckles each member coming onto the stage, with Michael uncomfortable with the situation. After strongly condemned by the audience and starting of a break, Michael counters the company's critics by explaining a 45 day plan is on the way to resolve the crisis, only to make matters more difficult. Unable to figure out how to resolve the crisis, Michael invites Oscar to join the representatives, only to be embarrassed in front of the members. After Chris O'Keefe, former U.S. Congressman and board member of Dunder Mifflin, insults Michael, he counters the comments made by demanding more praise and insulting O'Keefe. Michael, alarmed when O'Keefe angrily states he and his colleagues can take the bus, then makes a run for the limo with Andy, Oscar and Dwight and immediately heads back to Scranton. The camera then focuses on Dunder Mifflin's stock on a ticker tape which has dropped severely. It is later revealed that Dwight was up and able to speak at the microphone in the line, only to criticize about how the line for the microphone was slow and unproductive; this ends up confusing the entire audience and makes the CEO impatient with Dwight.",
        "Meanwhile, Jim, being placed in charge during Michael's absence, is frustrated with Ryan and his incompetence to work in the office. Jim also becomes further annoyed when Ryan spreads rumors that Jim is \"not manager type like Michael\" and is teased by the other employees. Meeting with Pam, Jim decides to make an example out of Ryan, only to be discouraged from yelling at Ryan by Pam. Jim, when catching Ryan playing games, has everyone pay attention and relocates Ryan to a broom closet, furnished with a desk and computer. Ryan, embarrassed, attempts to apologize and ends up with the door shutting behind him with everyone watching."
    ],
    "quotes": [
        [
            {
                "speaker": "Andy",
                "content": " I've always been the guy who can rally other people to rebel. In high school I organized a walk out over standardized testing. Got over 500 students to just skip the SATs. At the last second I chickened out, took it anyway, got a 1220, always regretted it. I feel lachrymose."
            }
        ]
    ]
}