{
    "season": 6,
    "title": "Gossip",
    "episode": "1",
    "episodes": [
        1
    ],
    "coldOpens": [
        "Andy, Dwight, and Michael parkour around the office. "
    ],
    "storylines": [
        "In the opening, Michael, Dwight and Andy are seen practicing \"parkour\" while wrecking the office and bothering the employees. Jim, in a talking head interview, explains briefly that the goal of parkour is to get from Point A to Point B as creatively as possible. He briefly jokes that the guys are likely to end up in the hospital. After practicing around the office, Andy proposes they jump from the top of a truck onto two refrigerator boxes, a dumpster and pallets, before doing a backflip into a trash can. Andy, overexcited, injures himself when he jumps onto what turns out to be an empty refrigerator box.",
        "As someone who wants to be popular, Michael is distressed when he is left out of the rumor mill. He finds a nugget of gossip when the summer interns reveal they saw Stanley dancing with a woman at the club they were at the previous night. Michael chuckles about the normally-choleric Stanley doing any dancing when he reveals his tidbit to the salespeople. Phyllis dismisses him because she knows that Stanley's wife, Teri, is out of town. Furthermore, they all know Stanley isn't the type to like crowded public places.",
        "After confronting the interns, who are adamant that they saw Stanley dancing with someone, Michael realizes that he may have uncovered a bigger secret. Now, he replaces his dancing story by telling everyone that Stanley is having an affair. Jim tells him to stop spreading the rumor as he doesn't even know if it is true and he could be ruining Stanley's life.",
        "In the parking lot, Michael confronts Stanley who resignedly admits it's true. He became involved with his physical therapist, Cynthia, after his heart attack. He was just going to meet her to call the whole thing off and implores Michael not to tell anyone. Having already told the entire office, Michael decides to fix the problem by spreading all kinds of made-up rumors about the rest of the staff to cover himself. One of them turns out to be inadvertently correct: Michael tells them that Pam is pregnant. While Jim and Pam ponder how Michael knew this as they've told no one at the office, the other rumors cause rampant confusion and anger, especially when Andy - who everyone has been told is gay - tries to get more information from Oscar. When the rumors are traced back to Michael, he decides to confess and admits that only one of them is true. He starts to reveal Stanley's affair, only to be interrupted by Jim who reveals that Pam is pregnant.",
        "Later, Michael gets a return phone call from Stanley's wife whom he accidentally calls Cynthia. It turns out that she already suspect of Stanley affair since she saw him go with Cynthia.",
        "As his secret exposed, Stanley bashes Michael's car at the end of the episode."
    ],
    "quotes": [
        [
            {
                "speaker": "Michael",
                "content": " How do you un-tell something? You can't. You can't put words back in your mouth. What you can do is spread false gossip so that people think that everything that's been said is untrue, including \"Stanley is having an affair.\" It's like the end of Spartacus. I've seen that movie half a dozen times, and I still don't know who the real Spartacus is, and that is what makes that movie a classic whodunit."
            }
        ]
    ]
}