{
    "season": 6,
    "title": "Manager and Salesman",
    "episode": "16",
    "episodes": [
        16
    ],
    "coldOpens": [
        "Michael cancels a hotel reservation in Vancouver. "
    ],
    "storylines": [
        "Michael calls the hotel where he had reserved a room for the first week of the Vancouver Olympics. The staff member cannot find his reservation in the system and implies he is trying to make a reservation at the last minute. Dwight searches through Michael's e-mail to find the confirmation number and finds that Michael lied about not receiving his e-Vite to Dwight's barbecue. Dwight also finds the confirmation number and the hotel employee apologizes to Michael, stating that she couldn't find the reservation due to the hotel having changed their computer system. His reservation definitely confirmed, Michael then cancels the reservation and is billed a cancellation fee.",
        "The office is eager to welcome Sabre CEO Jo Bennett to Scranton, and are dazzled by her southern ways. Jo, along with her huge dogs and Gabe Lewis, comes to the office and takes a look around. She compliments everyone; however, when she realizes that there are two managers, she decides that one will go to sales and one will remain a manager.",
        "Andy gives everyone Valentine's Day cards so he can give one to his love, Erin. When he throws an envelope at Meredith, she receives a paper cut on her throat, something she apparently is used to and dislikes.",
        "Michael insults Jo Bennett's intelligence and the state of Florida. Jo tells Jim and Michael that they are just trying to save their positions and uses folksy sayings to explain her point. Jim and Michael both want the position as regional manager and are reluctant to give it up. Jo Bennett tells them she will pick who is to remain manager and tells them to go away. Later, she tells the documentary crew straightforwardly about herself and ends remarking that she is pleased to meet them.",
        "Andy awkwardly gives Erin her Valentine's Day card, and Pam smirks. Andy implies that he loves Erin, however, Erin continues to be oblivious of his feelings. Andy's plans backfire when he accidentally gives Kelly a romantic card and Kelly concludes that he must love her. Kelly is flattered although she thought he was \"annoying and homosexual.\"",
        "Jo Bennett has a meeting with the whole office and tells Angela to sit down. Jo gives everyone a Sabre handbook and her autobiography. Jo humorously tells them about Sabre and their printers and tells them that they are going to take their \"arm\" and bring the Northeast printers. Michael repeatedly incorporates the word \"manage\" into his speech so Jo will see him as the true manager.",
        "Pam tells Jim that he could make more money as a salesman than as manager and Jim goes to tell Michael that he will be the salesman. Michael accepts this idea eagerly and begins to brag about getting the job. Oscar tells Michael he wants to be a salesman too because Sabre has no caps on commission. Michael tells the crew he has been hustled and tells Jo and Jim that he wants to be the salesman. Jo accepts Michael's decision and welcomes Jim as the new regional manager of Dunder Mifflin Scranton. Michael sarcastically congratulates Jim and mentions his future commission checks.",
        "As Erin helps Michael set up his desk in the sales section, Dwight calls a meeting with Ryan to think of ways to take Jim down. A tardy Ryan angers Dwight with his terrible ideas. They ultimately try getting Nick, the new IT guy, to align with them, to no avail. Meanwhile, Michael has a difficult time adjusting to sales, particularly since the procedures he used are obsolete and he does not enjoy sitting with the employees. He tells Jim that he wants the manager job back and they both tell Jo, who allows them to do so. When Dwight taunts Jim about his demotion, Jim puts Dwight's tie in his coffee mug as Pam grins. At the end of the episode, Dwight and Ryan decide to go out for drinks to celebrate Jim's demotion, but they end up arguing about where to go.",
        "Kelly kisses Andy, to his disgust. When he tells Kelly he likes someone else, she asks who. He struggles to say anything and doesn't; however, Erin is relieved that Andy doesn't like Kelly."
    ],
    "quotes": [
        [
            {
                "speaker": "Jo Bennett",
                "content": " I'm a Breast Cancer survivor, close personal friends with Nancy Pelosi, and Truman Capote and I slept with three of the same guys. Pleased to meet you."
            }
        ],
        [
            {
                "content": "[cut to conference room]"
            }
        ],
        [
            {
                "speaker": "Jo Bennett",
                "content": " [to Angela, filing into the conference room] Uh, just choosin' seats. Not gettin' married! Chop chop, little onion!"
            }
        ],
        [
            {
                "speaker": "Andy",
                "content": " Look alive. [tosses a card at Meredith]"
            }
        ],
        [
            {
                "speaker": "Meredith",
                "content": " Ow! Geez you gave me a paper cut on my throat!"
            }
        ],
        [
            {
                "content": "[cut to talking head]"
            }
        ],
        [
            {
                "speaker": "Meredith",
                "content": " Yeah I have this thing about men cutting or threatening to cut my throat. Don't try to cut my throat!"
            }
        ],
        [
            {
                "speaker": "Dwight",
                "content": " Bobcat, this is Dragon."
            }
        ],
        [
            {
                "speaker": "Dwight Schrute",
                "content": " The new IT guy. Nick."
            }
        ],
        [
            {
                "speaker": "Ryan",
                "content": " Nick."
            }
        ],
        [
            {
                "speaker": "Dwight Schrute",
                "content": " I think he is the key. He is very trusting, he's looking for friends. He's been given an awesome amount of power and does not know how to wield it."
            }
        ],
        [
            {
                "speaker": "Ryan",
                "content": " Like Frodo."
            }
        ],
        [
            {
                "speaker": "Dwight Schrute",
                "content": " Why don't you just let me handle the Tolkien references. OK, Dumb Jock?"
            }
        ],
        [
            {
                "speaker": "Ryan",
                "content": " Well I think he can be corrupted. Like Gollum."
            }
        ],
        [
            {
                "speaker": "Dwight Schrute",
                "content": " Smeagle, was corrupted and became Gollum."
            }
        ],
        [
            {
                "content": "[cut to talking head]"
            }
        ],
        [
            {
                "speaker": "Dwight Schrute",
                "content": " I might start a diabolical plot against him after this one."
            }
        ],
        [
            {
                "speaker": "Jo Bennett",
                "content": " [yelling at Jim and Michael], You two are grown ass men!"
            }
        ]
    ]
}