{
    "season": 6,
    "title": "The Banker",
    "episode": "14",
    "episodes": [
        14
    ],
    "coldOpens": [
        "Michael outlines his plan to impress someone who is trying to determine the branch's worth to possible investors. "
    ],
    "storylines": [
        "An investment banker comes to Scranton to perform a \"due diligence\" check on Dunder Mifflin to verify that the company can be purchased without any hidden liabilities. Michael is devoted to making the branch look good, including replacing Stanley Hudson with an attractive young man and having Dwight pose as the branch HR representative. The second ruse is exposed when Toby returns to his desk, however. The banker asks Toby about any misconduct in the company (for example, time wasting), and after every question, several flashbacks are shown from previous episodes regarding the topic being discussed. Toby admits to the documentary crew that he doesn't want to lie, \"and I don't want to tell the truth.\"",
        "Michael comes to talk to the banker. When the banker asks a question about if anyone is near retirement age, Michael and Toby awkwardly look at each other and flashbacks of Creed are shown. Dwight eavesdrops on the banker checking back with the main office and begins to get suspicious that the banker may not sign off on the deal.",
        "Over Toby's objection, Michael brings up that many people in the office have been in sexual relationships. Scenes of many office relationships are shown.",
        "After the banker leaves, Michael expresses sympathy for the banker because he must determine the value of the office. Michael says that he doesn't care about the banker's opinion. Everyone waits for the banker to say he'll buy the company, however, it never happens."
    ],
    "quotes": [
        [
            {
                "speaker": "Michael",
                "content": " The principles that I'm applying to the office are the same ones that made Lady Gaga a star. Or any number of drag queens."
            }
        ],
        [
            {
                "speaker": "Pam",
                "content": " Hola! Bonjour! Ni Hao!"
            }
        ],
        [
            {
                "speaker": "Pam",
                "content": " For the record, not on board with fake Stanley. [pause] But I get it."
            }
        ],
        [
            {
                "speaker": "Toby",
                "content": " I don't want to lie. And I don't want to tell the truth."
            }
        ]
    ]
}