{
    "season": 6,
    "title": "Gossip",
    "episode": "1",
    "episodes": [
        1
    ],
    "episodeDetails": {
        "sections": [
            {
                "title": "Gossip",
                "level": 1,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "\"Gossip\" is the first episode of the sixth season of The Office. It was written and directed by Paul Lieberstein. Overall, it was the show's 101st episode. It originally aired on September 17, 2009. It was viewed by 8.20 million people."
                    }
                ],
                "images": []
            },
            {
                "title": "Synopsis",
                "level": 2,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "In the opening, Michael, Dwight and Andy are seen practicing \"parkour\" while wrecking the office and bothering the employees. Jim, in a talking head interview, explains briefly that the goal of parkour is to get from Point A to Point B as creatively as possible. He briefly jokes that the guys are likely to end up in the hospital. After practicing around the office, Andy proposes they jump from the top of a truck onto two refrigerator boxes, a dumpster and pallets, before doing a backflip into a trash can. Andy, overexcited, injures himself when he jumps onto what turns out to be an empty refrigerator box."
                    },
                    {
                        "type": "paragraph",
                        "text": "As someone who wants to be popular, Michael is distressed when he is left out of the rumor mill. He finds a nugget of gossip when the summer interns reveal they saw Stanley dancing with a woman at the club they were at the previous night. Michael chuckles about the normally-choleric Stanley doing any dancing when he reveals his tidbit to the salespeople. Phyllis dismisses him because she knows that Stanley's wife, Teri, is out of town. Furthermore, they all know Stanley isn't the type to like crowded public places."
                    },
                    {
                        "type": "paragraph",
                        "text": "After confronting the interns, who are adamant that they saw Stanley dancing with someone, Michael realizes that he may have uncovered a bigger secret. Now, he replaces his dancing story by telling everyone that Stanley is having an affair. Jim tells him to stop spreading the rumor as he doesn't even know if it is true and he could be ruining Stanley's life."
                    },
                    {
                        "type": "paragraph",
                        "text": "In the parking lot, Michael confronts Stanley who resignedly admits it's true. He became involved with his physical therapist, Cynthia, after his heart attack. He was just going to meet her to call the whole thing off and implores Michael not to tell anyone. Having already told the entire office, Michael decides to fix the problem by spreading all kinds of made-up rumors about the rest of the staff to cover himself. One of them turns out to be inadvertently correct: Michael tells them that Pam is pregnant. While Jim and Pam ponder how Michael knew this as they've told no one at the office, the other rumors cause rampant confusion and anger, especially when Andy - who everyone has been told is gay - tries to get more information from Oscar. When the rumors are traced back to Michael, he decides to confess and admits that only one of them is true. He starts to reveal Stanley's affair, only to be interrupted by Jim who reveals that Pam is pregnant."
                    },
                    {
                        "type": "paragraph",
                        "text": "Later, Michael gets a return phone call from Stanley's wife whom he accidentally calls Cynthia. It turns out that she already suspect of Stanley affair since she saw him go with Cynthia."
                    },
                    {
                        "type": "paragraph",
                        "text": "As his secret exposed, Stanley bashes Michael's car at the end of the episode."
                    }
                ],
                "images": []
            },
            {
                "title": "Gossip that Michael created",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Andy is gay.",
                                "elements": []
                            },
                            {
                                "text": "Pam is pregnant. (True)",
                                "elements": []
                            },
                            {
                                "text": "Angela is dating an 81 year old billionaire Quizno's owner.",
                                "elements": []
                            },
                            {
                                "text": "Creed has asthma.",
                                "elements": []
                            },
                            {
                                "text": "Dwight uses store-bought manure.",
                                "elements": []
                            },
                            {
                                "text": "Stanley is having an affair. (True)",
                                "elements": []
                            },
                            {
                                "text": "Michael is a J. Crew model.",
                                "elements": []
                            },
                            {
                                "text": "Kevin has another person inside his body, working him with controls.",
                                "elements": []
                            },
                            {
                                "text": "Kelly is anorexic.",
                                "elements": []
                            },
                            {
                                "text": "Erin is a bad worker and will probably be fired.",
                                "elements": []
                            },
                            {
                                "text": "Oscar is the voice of the Taco Bell dog.",
                                "elements": []
                            },
                            {
                                "text": "Toby is a virgin.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Trivia",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Megan was the high school student from the Season 4 episode, Job Fair.",
                                "elements": []
                            },
                            {
                                "text": "When Michael and Kevin are playing Hangman, it can clearly be seen that Kevin guessed every single letter in the alphabet before guessing \"t\" (even q, x, y, and z).",
                                "elements": []
                            },
                            {
                                "text": "Michael previously called Andy gay in Stress Relief.",
                                "elements": []
                            },
                            {
                                "text": "This is the second time Jim uses the word “delusion” in a talking head interview. The first time was in “Baby Shower”. Both times he is referring to something Michael is taking part in or doing.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Deleted Scenes",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Ryan asks the intern to make 20 copies of a paper, and he replies \"you know you're not supposed to talk to me\". Apparently, Ryan made him get tons of pennies from the bank to search for rare coins, getting Ryan banned from speaking with them. He said that it wasn't as bad as Dwight making them pass around messages instead of using IMs.",
                                "elements": []
                            },
                            {
                                "text": "Dwight is teaching useless info to the interns through flash cards, and the intern says they should reference it later when they might need it. Dwight tells a story of a restaurant customer talking to the waiter about the paper info. The waiter gets fired, starts their own paper company and hires the customer. The customer becomes rich. Dwight says that their generation would suck in a war, and he would fight in the Boer War in South Africa.",
                                "elements": []
                            },
                            {
                                "text": "Dwight has the interns bring in a cake and they spaced on getting the candles. He says that if he said to duck and jump because a wrecking ball was coming towards your head and a sword to your feet, if you spaced on one you would die. He said that they suffered because the cake was for them. Pam and Jim taught them the defense for it and slapped Dwight in the head and kicked him when we was wondering what the defense was for it.",
                                "elements": []
                            },
                            {
                                "text": "Dwight was given a paper apple by the intern. He said in the interview, \"There must be 40 folds in this thing. 40 folds!\"",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Cultural References",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Parkour is a physical discipline of French origin involving the \"traceur\", or parkour practitioner, to traverse through obstacles from point A to point B in an efficient manner. It often involves serious training and can be dangerous at times when performed improperly (as demonstrated by Andy when jumping into the refrigerator box).",
                                "elements": []
                            },
                            {
                                "text": "Jim, when explaining parkour, mentions that it had made an appearance in a \"Bond film\", referring to the 2006 version of Casino Royale.",
                                "elements": []
                            },
                            {
                                "text": "Spartacus is a movie based on the life of Spartacus, the leader of a slave revolt from 73 to 71 BC. In the movie's climactic scene, the group of slaves is offered leniency in exchange for turning over Spartacus. Before Spartacus can offer himself, the slaves each individually proclaim, \"I am Spartacus\" and all share in his punishment. Michael is confused by this gesture of solidarity.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Amusing Details",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "No move that Michael, Dwight, and Andy demonstrated in their \"parkour\" has anything to do with the moves actually performed in parkour.",
                                "elements": []
                            },
                            {
                                "text": "Meredith is very excited when Pam shows her ultrasound, although earlier in the episode, when she is told that Pam is pregnant, she says \"She's gonna hate being a mom.\"",
                                "elements": []
                            },
                            {
                                "text": "The term \"gainer\", as noted by Andy, is an actual movement in freerunning which refers to performing a backflip while achieving forward momentum.",
                                "elements": []
                            },
                            {
                                "text": "Michael spreads the rumor that Toby is a virgin, even though he has a young daughter.",
                                "elements": []
                            },
                            {
                                "text": "Michael does not spread a rumor about Jim, Phyllis, Ryan, or Meredith.",
                                "elements": []
                            },
                            {
                                "text": "Creed appears to be working towards some scuba related retirement. He is extremely concerned about this when the rumor is spread that he has asthma.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Cast",
                "level": 2,
                "content": [],
                "images": []
            },
            {
                "title": "Main Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Steve Carell as Michael Scott",
                                "elements": []
                            },
                            {
                                "text": "Rainn Wilson as Dwight Schrute",
                                "elements": []
                            },
                            {
                                "text": "John Krasinski as Jim Halpert",
                                "elements": []
                            },
                            {
                                "text": "Jenna Fischer as Pam Beesly",
                                "elements": []
                            },
                            {
                                "text": "B.J. Novak as Ryan Howard",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Supporting Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Ed Helms as Andy Bernard",
                                "elements": []
                            },
                            {
                                "text": "Leslie David Baker as Stanley Hudson",
                                "elements": []
                            },
                            {
                                "text": "Brian Baumgartner as Kevin Malone",
                                "elements": []
                            },
                            {
                                "text": "Creed Bratton (actor) as Creed Bratton",
                                "elements": []
                            },
                            {
                                "text": "Kate Flannery as Meredith Palmer",
                                "elements": []
                            },
                            {
                                "text": "Mindy Kaling as Kelly Kapoor",
                                "elements": []
                            },
                            {
                                "text": "Ellie Kemper as Erin Hannon",
                                "elements": []
                            },
                            {
                                "text": "Angela Kinsey as Angela Martin",
                                "elements": []
                            },
                            {
                                "text": "Paul Lieberstein as Toby Flenderson",
                                "elements": []
                            },
                            {
                                "text": "Oscar Nunez as Oscar Martinez",
                                "elements": []
                            },
                            {
                                "text": "Phyllis Smith as Phyllis Vance",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Guest Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Max Carver as Eric",
                                "elements": []
                            },
                            {
                                "text": "Elvy Yost as Megan",
                                "elements": []
                            },
                            {
                                "text": "Keli'i Miyata as Maurie",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            }
        ]
    },
    "quotesDetails": {
        "sections": [
            {
                "title": "Gossip Quotes",
                "level": 1,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Michael: How do you un-tell something? You can't. You can't put words back in your mouth. What you can do is spread false gossip so that people think that everything that's been said is untrue, including \"Stanley is having an affair.\" It's like the end of Spartacus. I've seen that movie half a dozen times, and I still don't know who the real Spartacus is, and that is what makes that movie a classic whodunit."
                    }
                ],
                "images": []
            }
        ]
    },
    "coldOpens": [
        "Andy, Dwight, and Michael parkour around the office. "
    ],
    "storylines": [
        "In the opening, Michael, Dwight and Andy are seen practicing \"parkour\" while wrecking the office and bothering the employees. Jim, in a talking head interview, explains briefly that the goal of parkour is to get from Point A to Point B as creatively as possible. He briefly jokes that the guys are likely to end up in the hospital. After practicing around the office, Andy proposes they jump from the top of a truck onto two refrigerator boxes, a dumpster and pallets, before doing a backflip into a trash can. Andy, overexcited, injures himself when he jumps onto what turns out to be an empty refrigerator box.",
        "As someone who wants to be popular, Michael is distressed when he is left out of the rumor mill. He finds a nugget of gossip when the summer interns reveal they saw Stanley dancing with a woman at the club they were at the previous night. Michael chuckles about the normally-choleric Stanley doing any dancing when he reveals his tidbit to the salespeople. Phyllis dismisses him because she knows that Stanley's wife, Teri, is out of town. Furthermore, they all know Stanley isn't the type to like crowded public places.",
        "After confronting the interns, who are adamant that they saw Stanley dancing with someone, Michael realizes that he may have uncovered a bigger secret. Now, he replaces his dancing story by telling everyone that Stanley is having an affair. Jim tells him to stop spreading the rumor as he doesn't even know if it is true and he could be ruining Stanley's life.",
        "In the parking lot, Michael confronts Stanley who resignedly admits it's true. He became involved with his physical therapist, Cynthia, after his heart attack. He was just going to meet her to call the whole thing off and implores Michael not to tell anyone. Having already told the entire office, Michael decides to fix the problem by spreading all kinds of made-up rumors about the rest of the staff to cover himself. One of them turns out to be inadvertently correct: Michael tells them that Pam is pregnant. While Jim and Pam ponder how Michael knew this as they've told no one at the office, the other rumors cause rampant confusion and anger, especially when Andy - who everyone has been told is gay - tries to get more information from Oscar. When the rumors are traced back to Michael, he decides to confess and admits that only one of them is true. He starts to reveal Stanley's affair, only to be interrupted by Jim who reveals that Pam is pregnant.",
        "Later, Michael gets a return phone call from Stanley's wife whom he accidentally calls Cynthia. It turns out that she already suspect of Stanley affair since she saw him go with Cynthia.",
        "As his secret exposed, Stanley bashes Michael's car at the end of the episode."
    ],
    "quotes": [
        "Michael: How do you un-tell something? You can't. You can't put words back in your mouth. What you can do is spread false gossip so that people think that everything that's been said is untrue, including \"Stanley is having an affair.\" It's like the end of Spartacus. I've seen that movie half a dozen times, and I still don't know who the real Spartacus is, and that is what makes that movie a classic whodunit."
    ]
}