{
    "season": 6,
    "title": "St. Patrick's Day",
    "episode": "19",
    "episodes": [
        19
    ],
    "coldOpens": [
        "The office, particularly Meredith, show their enthusiasm for St. Paddy's. "
    ],
    "storylines": [
        "It's St. Patrick's Day in Scranton and everyone in the office is thrilled, since it is one of the biggest holidays in Scranton. Meredith left her kids somewhere, while everyone looks forward to go to the parade. Everyone dresses up in green, and many things across the office are green as well.",
        "Jim is welcomed back by the rest of the office from paternity leave, but comes back to see Dwight using three desks to make up a huge \"megadesk,\" which Jim takes apart. Dwight is extremely angry that his megadesk is getting destroyed. Later, Dwight sets up megadesk again, to the dismay of Jim, who takes it apart on seeing it. Jim and Pam talk about Cecilia, and Jim is sad that he is missing it. Dwight tries to get him to go back home so that he can have megadesk and tries to convince him that Cecilia is finding the world without him and that Mose was scarred without his father. Although Jim realizes what Dwight is doing, he realizes that he is missing her and Pam.",
        "Dwight starts to play \"Cat's in the Cradle\" loudly to show Jim that he is missing fatherhood. Jim calls Pam and decides to keep working for the meantime, but he is surprised that Dwight's plan is working. Dwight continues to try to get Jim to leave.",
        "Jo Bennett comes back to the office and is thrilled to see everyone in team spirit for St. Patrick's Day. It is her last day at Dunder Mifflin Scranton for awhile, and she says that the people at the branch are lovely. Michael comes to talk to Jo and gives her a gift. She thanks him and offers him a room at her house in Tallahassee, which he takes very seriously. Jo holds an office meeting and asks if anyone has any ideas relating to the business. Michael bothers Jo by telling her about everyone who asks her a question and tries to get her to like him. Darryl tells Jo about how Sabre's delivery system isn't efficient, and he catches her eye. Jo accepts Darryl's plan and offers Darryl Jim's old office. Gabe tells her that he is working there, but scared of Jo, tells her that it's okay and he will go clean it out immediately.",
        "Michael hugs Jo and tells her he bought tickets and planned a trip. Jo is surprised, and says that he should check with her office. When Michael continues to bother her, she snaps and tells Michael, \"enough,\" leaving the office surprised. Michael is sad that Jo still doesn't like him despite his attempts. Michael asks Jo out to lunch, and she tells him to do some work. Michael asks Darryl why Jo likes him and asks him if her family owes him something. Michael says that he is going home for the day, and Jo says that he can go if he believes that he did a great day of work, but she decides to stay to work. Michael tells everyone not to leave because Jo wants them to stay until they did superb work, and Michael is trying to get Jo to like him. Kevin is outraged.",
        "Dwight tries to bail out early by claiming to have a late meeting with a client, but Jim gets in ahead of him. Erin lucks out and sneezes, causing a sympathetic Jo to urge her to go home and get some rest. When Andy, who's wearing his sister's field hockey skirt as a kilt, pretends to be sick so he can visit Erin, Jo sends him home, too, telling him to put some pants on. Michael calls an inebriated Todd Packer who's been drinking since three and complains that the girls are fat and ugly. Calvin and the rest of the warehouse workers come to ask Darryl to come back, but he refuses. The cleaning crew comes to the office, but can't do anything since Jo and everyone else is still there. While Angela wants to leave so she can protest St. Patrick's Day, Gabe helps get Jo's bags and explains that he has no time for a personal life because Jo is very demanding. Michael enters the conference room, explains to Jo that it's a holiday and he is dismissing his hard-working employees so they can enjoy their evening. He also lets her know that he's cancelled his Florida trip, but is looking forward to their working relationship. She is looking forward to it, as well.",
        "Todd Packer and Michael enjoy the St. Patrick's Day party at Cooper's. Michael says that he rather be with people he likes than Jo. Todd Packer is humped by a drunken Meredith.",
        "Erin and Andy are going on their first date, despite Erin being sick. Angela is disgusted by her being sick, while Jo sends her home, because she doesn't want her dogs to catch a bug. Andy decides to pretend to be sick in front of Jo, who sends him home. Andy comes to Erin's house, even though she is sick. Andy and Erin hold hands and watch a movie. It is revealed that Erin was a foster child and lives with her foster brother, who seems to have an interest in her. Andy realizes this and becomes threatened by the thought that someone else likes Erin.",
        "Andy leaves the date, and Erin kisses him on the cheek. Jim sets up a \"Quad-Desk\" with three desks, and Dwight is angry."
    ],
    "quotes": [
        [
            {
                "content": "For the episode, see St. Patrick's Day."
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " Green M&M's! Nature's Viagra!"
            }
        ],
        [
            {
                "speaker": "Todd Packer",
                "content": " What's up, Butt plug?"
            }
        ]
    ]
}