{
    "season": 6,
    "title": "Secret Santa",
    "episode": "13",
    "episodes": [
        13
    ],
    "episodeDetails": {
        "sections": [
            {
                "title": "Secret Santa",
                "level": 1,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "\"Secret Santa\" is the thirteenth episode of the sixth season of The Office and the 113th episode overall. It was written by Mindy Kaling, who most recently co-wrote Niagara with Greg Daniels, and was directed by Randall Einhorn, who most recently directed The Meeting. It originally aired on December 10, 2009, and a producer's cut was released on December 18, 2009, which contained nine minutes of footage not shown in the televised episode. It was viewed by 8.51 million people."
                    }
                ],
                "images": []
            },
            {
                "title": "Synopsis",
                "level": 2,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Michael is outraged when Jim promises Phyllis she can be Santa. Michael tries to undermine her by also dressing as Santa. Kevin sits on Michael's lap, putting Michael in pain. Michael tries to get an unwilling Ryan to sit on his lap but Jim intervenes. Michael poutingly puts his Santa hat in the punch and storms into his office. He takes off his Santa suit and puts it back on inside out, emerging as Jesus. Angela is seen looking very happy when seeing Michael as Jesus. While Phyllis is giving the office employees their Secret Santa presents, Michael belittles many of them, including Stanley for cheating on his wife (as was revealed in Gossip). However, Michael tries to redeem himself, and smiles when Dwight gets his present. Angela is extremely offended after Michael says Jesus \"ruined the party\"."
                    },
                    {
                        "type": "paragraph",
                        "text": "Meanwhile, Jim and Dwight (who is taking a break from his diabolical plan, revealed in Scott's Tots) try to get the office into the Christmas spirit, despite the uncertainty in Dunder Mifflin's future. Dwight thinks he may be depressed. They unveil the office Christmas tree, but the rest of the employees (including Pam) are displeased to see it's artificial and undecorated. Jim says he was hoping they could all decorate it together."
                    },
                    {
                        "type": "paragraph",
                        "text": "Dwight gets a gift in pieces that he must assemble from his Secret Santa. He is desperate to know what it is and creates a list of the things he believes it could be. Michael continues throughout the episode to deliver pieces. At first Dwight thinks it is a gun, but it is really a nutcracker. Jim ultimately plans a successful party, which Pam loves. The warehouse even comes to the party, including Madge and Calvin, who have not been seen in a while."
                    },
                    {
                        "type": "paragraph",
                        "text": "Oscar has a secret crush on Matt, a new warehouse worker. Pam notices Oscar watching Matt play football. Oscar holds off giving Matt his pay check so he can deliver it in person, but Matt isn't there. Darryl hints that he suspects something between them, and Oscar leaves. Pam continues to secretly watch Oscar throughout. Pam is openly supportive in two talking heads telling the crew, \"they are the only two gay guys I know\". Pam sets them up, but Oscar purposefully mistakes Matt's name as \"Mark\". Pam looks at Oscar inquisitively, but Oscar assures her he knows what he's doing."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael calls David Wallace, who tells him Dunder Mifflin is being bought out. When Michael tells everyone they are losing their jobs, they all conference-call David from Michael's office. David clarifies that everyone from corporate will lose their jobs, but that the Scranton branch is safe. Jim sympathizes with David while Meredith randomly tells him his wife is a very lucky woman. The whole office is thrilled and Michael jumps into the crowd. They decide to continue the Christmas party."
                    },
                    {
                        "type": "paragraph",
                        "text": "All the while Andy has been giving Erin The 12 Days of Christmas, including the many animals, for Secret Santa. According to Erin, her cat killed a turtle dove and the French hens have started pulling out her hair to make a nest. She comes in the office with a deep scar. Erin tries to figure out who her Secret Santa is since her gift is causing her injury and begs them to stop. Andy awkwardly denies giving Erin the present and begs Phyllis not to tell Erin. Phyllis willingly agrees. However, during Michael's snarky Jesus routine, he reveals that Andy was, in fact, Erin's Secret Santa. Erin asks Andy what he was thinking, but seems thrilled when Andy gets twelve drummers drumming to play for her in the last scene."
                    }
                ],
                "images": []
            },
            {
                "title": "Cultural references",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Christmas celebrates the birth of Jesus, the central figure in Christianity. As popularly practiced, it is a gift-giving holiday.",
                                "elements": []
                            },
                            {
                                "text": "The spirit of Christmas is personified by Santa Claus, a rotund man dressed in red and white who gives presents to well-behaved children. \"Kris Kringle\" (mentioned by Phyllis) also refers to Santa Claus.",
                                "elements": []
                            },
                            {
                                "text": "It is traditional for children to sit on Santa's lap and tell him what they want for Christmas.",
                                "elements": []
                            },
                            {
                                "text": "Twilight is a popular vampire book-movie series circulated around teenage girls. Unsurprisingly, Kelly likes it.",
                                "elements": []
                            },
                            {
                                "text": "The song Dwight sings during karaoke is \"Boulevard of Broken Dreams\" by Green Day, an American punk rock band. The song debuted on their 2004 album American Idiot.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Secret Santa",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Ryan had Toby and got him a kite.",
                                "elements": []
                            },
                            {
                                "text": "Michael had Dwight and got him a nutcracker.",
                                "elements": []
                            },
                            {
                                "text": "Jim had Kelly and got her a Twilight poster.",
                                "elements": []
                            },
                            {
                                "text": "Andy had Erin and got her a gift based on the 12 Days of Christmas.",
                                "elements": []
                            },
                            {
                                "text": "Whomever had Angela got her gray fabric. (It probably was Phyllis since she, as \"Santa\", gave her the fabric.)",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Producer's cut",
                "level": 2,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "NBC made a Producer's Cut of the episode online, which includes the following new material:"
                    },
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Jim explains how he and Dwight organized the Christmas party. David Wallace suggested that they try something new, but the rest of the office wanted to keep old traditions: karaoke, playing Secret Santa, and eating foods.",
                                "elements": []
                            },
                            {
                                "text": "Jim thinks that the office likes the party.",
                                "elements": []
                            },
                            {
                                "text": "Michael's foot goes numb as a result of Kevin sitting on his lap, and he bangs it against Pam's desk in an attempt to restore sensation.",
                                "elements": []
                            },
                            {
                                "text": "Andy slowly reveals to Erin that he is, in fact, her Secret Santa.",
                                "elements": []
                            },
                            {
                                "text": "Oscar Martinez tells Darryl he will wait to give Matt's check to him, \"in the spirit of Christmas\".",
                                "elements": []
                            },
                            {
                                "text": "Michael announces to the warehouse, including an Asian dockworker, Calvin, Madge, and Darryl that he is Jesus. Darryl jokingly says that everybody needs to stop working and watch Michael. Michael thanks Darryl.",
                                "elements": []
                            },
                            {
                                "text": "Michael invites the warehouse workers to the office party, and Darryl responds, \"Hell, yeah.\" Michael sings while the dockworkers come up the stairs.",
                                "elements": []
                            },
                            {
                                "text": "While Michael invites the warehouse workers into the conference room, Jim tells him that they have only enough food for them, and that he would have loved a head's up, but Michael rebuts that he wanted to be \"the central gift-giving figure\", and that Christmas time isn't about getting whatever you want.",
                                "elements": []
                            },
                            {
                                "text": "Angela tells the documentary crew that she can hardly pretend to like the people in the office, and can't decide what she's going to tell Arte, apparently a warehouse worker.",
                                "elements": []
                            },
                            {
                                "text": "In gratitude for Phyllis agreeing not to reveal him as Erin's Secret Santa, Andy tells Phyllis that if Santa were a woman, that he would kiss her.",
                                "elements": []
                            },
                            {
                                "text": "Andy asks some of the warehouse workers if they have a cleaning lady, because his maid died.",
                                "elements": []
                            },
                            {
                                "text": "Calvin talks to Stanley and Kevin and tells them that he can provide them a nutrition/weight loss program. Kevin replies that his dream is to look like a \"big, white, you\".",
                                "elements": []
                            },
                            {
                                "text": "In a talking head, Ryan tells the crew he will show them how he feels about the warehouse coming to the office party and takes a picture of himself with only the corner of his head showing.",
                                "elements": []
                            },
                            {
                                "text": "Pam tells Matt that Oscar loves biking, classical movies, French films, and classical music and Oscar awkwardly tells Matt he also likes, \"New music. Radiohead.\" Matt says he also likes Radiohead, and Pam suggests they all go to a concert together and asks Oscar, \"Are we still doing the thing where we take new people from the office to a concert?\" Jim drags Pam away.",
                                "elements": []
                            },
                            {
                                "text": "Pam leaves Oscar and Matt, saying she wants piggies in a blanket, and Matt mistakes Oscar's name for Victor. Oscar says that his name is, in fact, Victor.",
                                "elements": []
                            },
                            {
                                "text": "Jim tells the warehouse staff, who is taking too much food, that it is really finger food, and Madge comes in, nicknamed Garfield because she can't resist eating a whole pan of lasagna. She tells Jim she must eat the whole pan, and says that it is hurtful to her that lasagna has that much power over her.",
                                "elements": []
                            },
                            {
                                "text": "Angela tells Jim and Pam that one of the warehouse staff stunk up the bathroom because of their poos, and because they don't eat food of as high a quality because they're poor and says it is science. Pam tells Angela that is offensive and thought out. Jim begins to say that, \"maybe if they get to know them...\" but then a shot is seen with Madge eating the whole lasagna from the pan and the warehouse chanting \"Garfield!\" and Meredith saying, \"That woman is a beast.\"",
                                "elements": []
                            },
                            {
                                "text": "Darryl tells Michael he looks like Gandalf, and that his Jesus costume is offensive.",
                                "elements": []
                            },
                            {
                                "text": "Before opening his gift, Creed tells Phyllis he loves his present.",
                                "elements": []
                            },
                            {
                                "text": "When David gives Michael the news, he tells Michael he is sorry he can't be Santa.",
                                "elements": []
                            },
                            {
                                "text": "Michael says that the workplace is the point of Christmas and Jim says that is not true.",
                                "elements": []
                            },
                            {
                                "text": "Michael tells Oscar he is his neighbor who moved in next door because of Urban Renewal. He tells Stanley he is their mailman.",
                                "elements": []
                            },
                            {
                                "text": "An extended scene with Andy singing. The office smiles and enjoys the performance.",
                                "elements": []
                            },
                            {
                                "text": "Pam kisses Jim and tells him it was a great party. Pam asks if he bought the company, jokingly, and Jim replies that he will not buy anything without telling Pam.",
                                "elements": []
                            },
                            {
                                "text": "Dwight offers Michael a fresh nut.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Amusing details",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "When Dwight hears the drummers he says, \"Everyone get down!\"",
                                "elements": []
                            },
                            {
                                "text": "Dwight's talking head is zoomed out more than usual due to his hat.",
                                "elements": []
                            },
                            {
                                "text": "Once again, the stuffed Homer Simpson wears a Santa hat.",
                                "elements": []
                            },
                            {
                                "text": "Michael's Pincode is YMCA. If you look that up on a phone pad those letters correspond with 9622.",
                                "elements": []
                            },
                            {
                                "text": "Mistletoe hangs in the doorway between the bullpen and the kitchen.",
                                "elements": []
                            },
                            {
                                "text": "Mindy Kaling, B.J. Novak, Ed Helms, Rainn Wilson, and Ellie Kemper laugh when Michael bangs his foot against Pam's desk in a deleted scene.",
                                "elements": []
                            },
                            {
                                "text": "Creed sits on Phyllis's lap.",
                                "elements": []
                            },
                            {
                                "text": "When Dwight finishes building his present, he has bandaids an all of his fingers.",
                                "elements": []
                            },
                            {
                                "text": "Kelly can be seen laughing and smiling when Kevin sits on Michael's lap.",
                                "elements": []
                            },
                            {
                                "text": "Dwight's list of guesses for his present:",
                                "elements": [
                                    {
                                        "text": "Aardvark Trap",
                                        "elements": []
                                    },
                                    {
                                        "text": "Beaver Trap",
                                        "elements": []
                                    },
                                    {
                                        "text": "Gun",
                                        "elements": []
                                    },
                                    {
                                        "text": "Chipmunk Trap",
                                        "elements": []
                                    },
                                    {
                                        "text": "Possum Trap",
                                        "elements": []
                                    },
                                    {
                                        "text": "Skunk trap",
                                        "elements": []
                                    },
                                    {
                                        "text": "Lobster Trap",
                                        "elements": []
                                    },
                                    {
                                        "text": "Man trap",
                                        "elements": []
                                    },
                                    {
                                        "text": "Lathe",
                                        "elements": []
                                    },
                                    {
                                        "text": "Abdominizer",
                                        "elements": []
                                    },
                                    {
                                        "text": "Speculum",
                                        "elements": []
                                    }
                                ]
                            },
                            {
                                "text": "Michael appears to confuse Russia with the Soviet Union, saying \"and then the KGB would arrest you and send you to Siberia. It's a good thing that Russia doesn't exist anymore.\"",
                                "elements": []
                            },
                            {
                                "text": "Michael also appears to confuse leprosy with leopards, saying Jesus can \"heal leopards.\"",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Connections to previous episodes, Caution here be spoilers",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Madge has not been seen since the Season 5 episode Heavy Competition, Calvin since the Season 4 episode Fun Run.",
                                "elements": []
                            },
                            {
                                "text": "Andy mentions that his maid died, harking back to the episode Dream Team.",
                                "elements": []
                            },
                            {
                                "text": "Jim tells Pam he would never buy anything without telling her, harking back to the episode Frame Toby when Jim buys Pam a house without telling her. (In the producers cut, Jim said he promised not to buy a COMPANY without telling her. This is more of a foreshadowing of Season 9.)",
                                "elements": []
                            },
                            {
                                "text": "Dwight's elf ears have not been seen since the Season 2 episode Christmas Party.",
                                "elements": []
                            },
                            {
                                "text": "The karaoke machine was last used in the Season 3 episode A Benihana Christmas.",
                                "elements": []
                            },
                            {
                                "text": "The photoshopped Christmas card of Michael with Carol and her kids from Season 3's A Benihana Christmas appears on Erin's desk.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Cast",
                "level": 2,
                "content": [],
                "images": []
            },
            {
                "title": "Main cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Steve Carell as Michael Scott",
                                "elements": []
                            },
                            {
                                "text": "Rainn Wilson as Dwight Schrute",
                                "elements": []
                            },
                            {
                                "text": "John Krasinski as Jim Halpert",
                                "elements": []
                            },
                            {
                                "text": "Jenna Fischer as Pam Halpert",
                                "elements": []
                            },
                            {
                                "text": "B.J. Novak as Ryan Howard",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Supporting cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Ed Helms as Andy Bernard",
                                "elements": []
                            },
                            {
                                "text": "Leslie David Baker as Stanley Hudson",
                                "elements": []
                            },
                            {
                                "text": "Brian Baumgartner as Kevin Malone",
                                "elements": []
                            },
                            {
                                "text": "Creed Bratton (actor) as Creed Bratton",
                                "elements": []
                            },
                            {
                                "text": "Kate Flannery as Meredith Palmer",
                                "elements": []
                            },
                            {
                                "text": "Mindy Kaling as Kelly Kapoor",
                                "elements": []
                            },
                            {
                                "text": "Ellie Kemper as Erin Hannon",
                                "elements": []
                            },
                            {
                                "text": "Angela Kinsey as Angela Martin",
                                "elements": []
                            },
                            {
                                "text": "Paul Lieberstein as Toby Flenderson",
                                "elements": []
                            },
                            {
                                "text": "Oscar Nunez as Oscar Martinez",
                                "elements": []
                            },
                            {
                                "text": "Craig Robinson as Darryl Philbin",
                                "elements": []
                            },
                            {
                                "text": "Phyllis Smith as Phyllis Vance",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Recurring cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Andy Buckley as David Wallace (Voice Only)",
                                "elements": []
                            },
                            {
                                "text": "Bobby Ray Shafer as Bob Vance",
                                "elements": []
                            },
                            {
                                "text": "Karly Rothenberg as Madge Madsen",
                                "elements": []
                            },
                            {
                                "text": "Calvin Tenner as Calvin",
                                "elements": []
                            },
                            {
                                "text": "Sam Daly as Matt",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Guest cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Suzanne Watson as Stephanie",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            }
        ]
    },
    "quotesDetails": {
        "sections": [
            {
                "title": "Secret Santa Quotes",
                "level": 1,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Dwight: \"For several weeks, my Secret Santa has been giving me pieces of a machine that I've been attempting to assemble. I'm suspicious of this because I had exactly the same idea, for catching Osama bin Laden. I would simply send him a different piece each day. He would assemble it, to find himself... in jail!\""
                    }
                ],
                "images": []
            }
        ]
    },
    "coldOpens": [
        "Jim and Dwight unveil the new office Christmas tree, but the office is not amused. "
    ],
    "storylines": [
        "Michael is outraged when Jim promises Phyllis she can be Santa. Michael tries to undermine her by also dressing as Santa. Kevin sits on Michael's lap, putting Michael in pain. Michael tries to get an unwilling Ryan to sit on his lap but Jim intervenes. Michael poutingly puts his Santa hat in the punch and storms into his office. He takes off his Santa suit and puts it back on inside out, emerging as Jesus. Angela is seen looking very happy when seeing Michael as Jesus. While Phyllis is giving the office employees their Secret Santa presents, Michael belittles many of them, including Stanley for cheating on his wife (as was revealed in Gossip). However, Michael tries to redeem himself, and smiles when Dwight gets his present. Angela is extremely offended after Michael says Jesus \"ruined the party\".",
        "Meanwhile, Jim and Dwight (who is taking a break from his diabolical plan, revealed in Scott's Tots) try to get the office into the Christmas spirit, despite the uncertainty in Dunder Mifflin's future. Dwight thinks he may be depressed. They unveil the office Christmas tree, but the rest of the employees (including Pam) are displeased to see it's artificial and undecorated. Jim says he was hoping they could all decorate it together.",
        "Dwight gets a gift in pieces that he must assemble from his Secret Santa. He is desperate to know what it is and creates a list of the things he believes it could be. Michael continues throughout the episode to deliver pieces. At first Dwight thinks it is a gun, but it is really a nutcracker. Jim ultimately plans a successful party, which Pam loves. The warehouse even comes to the party, including Madge and Calvin, who have not been seen in a while.",
        "Oscar has a secret crush on Matt, a new warehouse worker. Pam notices Oscar watching Matt play football. Oscar holds off giving Matt his pay check so he can deliver it in person, but Matt isn't there. Darryl hints that he suspects something between them, and Oscar leaves. Pam continues to secretly watch Oscar throughout. Pam is openly supportive in two talking heads telling the crew, \"they are the only two gay guys I know\". Pam sets them up, but Oscar purposefully mistakes Matt's name as \"Mark\". Pam looks at Oscar inquisitively, but Oscar assures her he knows what he's doing.",
        "Michael calls David Wallace, who tells him Dunder Mifflin is being bought out. When Michael tells everyone they are losing their jobs, they all conference-call David from Michael's office. David clarifies that everyone from corporate will lose their jobs, but that the Scranton branch is safe. Jim sympathizes with David while Meredith randomly tells him his wife is a very lucky woman. The whole office is thrilled and Michael jumps into the crowd. They decide to continue the Christmas party.",
        "All the while Andy has been giving Erin The 12 Days of Christmas, including the many animals, for Secret Santa. According to Erin, her cat killed a turtle dove and the French hens have started pulling out her hair to make a nest. She comes in the office with a deep scar. Erin tries to figure out who her Secret Santa is since her gift is causing her injury and begs them to stop. Andy awkwardly denies giving Erin the present and begs Phyllis not to tell Erin. Phyllis willingly agrees. However, during Michael's snarky Jesus routine, he reveals that Andy was, in fact, Erin's Secret Santa. Erin asks Andy what he was thinking, but seems thrilled when Andy gets twelve drummers drumming to play for her in the last scene."
    ],
    "quotes": [
        "Dwight: \"For several weeks, my Secret Santa has been giving me pieces of a machine that I've been attempting to assemble. I'm suspicious of this because I had exactly the same idea, for catching Osama bin Laden. I would simply send him a different piece each day. He would assemble it, to find himself... in jail!\""
    ]
}