{
    "season": 6,
    "title": "New Leads",
    "episode": "20",
    "episodes": [
        20
    ],
    "coldOpens": [
        "Michael tries to prove to Jim that he has seen Johnny Depp in his condo complex. "
    ],
    "storylines": [
        "In the cold open Michael calls Jim into his office and shows him photos of allegedly Johnny Depp at his condo. Jim messes with Michael before bluntly telling him that there is no way it is Johnny Depp. After a short argument Michael relents after stating that the name on the mail box was \"M. Shulman.\" Jim, who is on his way out, pauses and asks, \"M. Night Shulman?\", to which a shocked Michael has no reply.",
        "Michael holds a meeting but Stanley and Dwight interrupt Michael demanding if there are any sales topics or any news on the $50,000 leads that Sabre bought them. Michael lets them know they aren't here yet. The salespeople are especially anxious to get the leads which is causing them to snap at Michael and their co-workers. They abruptly leave the conference room. Michael tells Dwight that he would like his undivided attention. Dwight responds coldly, \"You couldn't handle my undivided attention.\" Michael explains that Sabre's policy of \"Sales is King\" means that the company emphasizes the importance of the sales staff which reduces the rest of the office to support them. This has gone to the salespeople's heads and is creating tension in the office.",
        "Dwight comes into Michael's office to ask him patronizingly about news on the leads. Jim texts a potential client, ignoring Micheal when he tries to speak to him and has to literally force his hand to sign Jim's commission check. Phyllis refuses to answer Angela's repeated emails. Andy demands a pencil from Darryl during a sale and wrestles him for it when Darryl refuses. Darryl tells Michael he needs to put the salespeople in their place.",
        "Thus, when the leads arrive, Michael refuses to hand them out, especially when Phyllis demands, \"hand them over numbnuts\". While this earns him the appreciation of the rest of the branch, Gabe explains that it is Michael's job to hand those leads over. So Michael hands them to the non-sales staff. Jim tries to convince Michael that this plan isn't going to work. Michael responds by giving Jim a list of clues to find his share of the leads which he has hidden all over the industrial park.",
        "Phyllis asks Angela for her share of the leads. Angela agrees to do so as soon as Phyllis fills out a stack of paperwork that Angela plans to shred in front of her as soon as she's done. Stanley wins leads from Ryan and Kelly by agreeing to both their arguments in a relationship debate. Jim decides to call Pam, tells her about the situation at Dunder Mifflin and Pam helps him solve some of the clues.",
        "Erin hides her share of the leads, and plays the hot-cold game with Andy which awkwardly leads his hands moving towards her chest before she reveals them underneath her keyboard.",
        "When Dwight returns from his sales call and demands his share of the leads, Michael advises him, \"If you want to find your leads, go to the man who never breeds.\" Dwight immediately identifies Kevin, who attempts to humiliate Dwight but only results in getting strangled. After a few seconds of being choked by Dwight, Kevin tells him that the leads are in the trash, but Erin already threw it away. Dwight heads to the dumpster, to find nothing there. Michael realizes that it's Friday and runs out into the street where a garbage truck can be seen driving away.",
        "Michael asks everyone to go to the dump with him to find the leads, but only Dwight will, fearing that Michael won't be able to find them on his own. While at the dump, Michael confronts Dwight about how Dwight no longer shows him respect. Dwight admits that he resents how being under Michael's tutelage hasn't gone as far as he thought it would. He believes he would have been in a higher position at another company had he accepted one of the other job offers he'd been given. As a result, he's still just a salesman at a company that failed under a boss that isn't going anywhere. \"I hitched my wagon to a horse with no legs.\" This results in a short trash fight, which ends when Michael accidentally dumps a sink of garbage water onto himself. The two, exhausted, rest on a bathtub and resume their friendship after a short conversation, acknowledging they'll never find the leads. Jim meanwhile convinces the sales-staff to acknowledge their behavior and to give up 2% of their commissions to appease the rest of the office.",
        "Jim, Andy, Phyllis, and Stanley present the non-sales staff with a platter of pastries. The other employees are so delighted that Jim realizes that that's all it takes to earn their forgiveness. The 2% commission offer is never made. Michael and Dwight return with a dirty bean bag chair that Dwight exclaims is, \"For me and Michael only!\", showing they have become friends again.",
        "At the end of the episode, Erin and Andy are at the dump, and Erin gives Andy her coat after he states he is cold. Andy tells her that she is the nicest person he has ever met, and they have their first kiss in the landfill."
    ],
    "quotes": [
        [
            {
                "speaker": "For the episode, see",
                "content": " New Leads."
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " The last few weeks things have been changing here. Sabre says it is our duty to support the sales team. And the salesmen are letting it go to their heads. I think it's kind of screwed up. Because the way this place used to work was, make friends first, make sales second, make love, third. In no particular order."
            }
        ],
        [
            {
                "speaker": "Dwight",
                "content": " Michael you were supposed to tell me when the leads came in!"
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " Well Bigshot, if you want to find your leads, go to the man who never breeds."
            }
        ],
        [
            {
                "speaker": "Dwight Schrute",
                "content": " [pauses] Kevin!"
            }
        ]
    ]
}