{
    "season": 6,
    "title": "Body Language",
    "episode": "23",
    "episodes": [
        23
    ],
    "episodeDetails": {
        "sections": [
            {
                "title": "Body Language",
                "level": 1,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "\"Body Language\" is the twenty-third episode of the sixth season and the 123rd episode of The Office overall. It was written by Justin Spitzer, who also wrote Shareholder Meeting and Michael Scott Paper Company and directed by Mindy Kaling who directed The Office: Subtle Sexuality. It originally aired on April 29, 2010. It was viewed by 7.01 million people."
                    }
                ],
                "images": []
            },
            {
                "title": "Synopsis",
                "level": 2,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Michael is trying to speak in Spanish because he believes that everyone in the country should speak the language. Michael reveals that he is also going to Cancun. Jim speaks Spanish to Michael, however, Michael can't respond. While Dwight believes that it is a waste since everyone will be speaking German-Chinese, Oscar tries to teach Michael the words. Michael uses genitalia to represent whether the word is feminine or masculine."
                    },
                    {
                        "type": "paragraph",
                        "text": "Jim and Pam plan their sales pitch, while Dwight is angry that he isn't getting the client. Pam makes lame jokes. Donna, Jim and Pam's client, and the manager of the bar from Happy Hour, comes into the office, much happier than she was before. Michael asks her if she is a hooker, however, she takes it jokingly. Donna believes that Jim and Pam are twins at first, but realizes they are married. As Jim tries to explain to Donna the prices, Michael barges in and offers Donna a Victoria's Secret catalog."
                    },
                    {
                        "type": "paragraph",
                        "text": "Meanwhile, Gabe talks to Darryl about a minority program. Dwight wants to join the program (\"Print in All Colors\"), however, only minorities can join. Dwight is angry because Darryl is competent, so he has a chance at succeeding. Knowing that Kelly has no chance at succeeding, he goes up to her and asks her to consider the program. Dwight tells Kelly that she could be the CEO. While she'd rather be a superstar, she accepts the offer to be in the minority program."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael, continuing to ruin Jim and Pam's sale, shows Donna a slide show. Michael uses pictures of himself every other slide, and the other slides are pictures that \"turn her [Donna] on,\" so that she will associate Michael with being turned on. The last slide reads, \"SEX.\" Donna is acting nice, but Michael takes it too far by trying to kiss her, however, she declines, leaving both of them embarrassed. Jim and Pam, watching, are shocked."
                    },
                    {
                        "type": "paragraph",
                        "text": "Jim tells Michael that he shouldn't kiss people at work, while Pam says that if she wasn't interested she would have left by now out of anger. Michael agrees with Pam and tells Jim that he and Pam did a lot more than kiss. Donna says that it wasn't professional, but was flattering. Michael apologizes for ruining their sale, Jim is shocked when Pam lets Michael finish the sale with Jim.  Dwight continues to talk to Kelly about being a minority, as Jim and Michael talk to Donna. Michael tries to get Jim to offer a lower price, despite Jim and Oscar telling him that the company will lose money. Jim says that Donna could be flirting to get a lower price. Pam says that Donna likes Michael, while Jim doesn't believe she does. Kelly says that she is going to go in the program and be an executive, and Ryan will become a manager, which will cause them to fire most of the employees. Dwight is shocked and angry."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael continues to flirt with Donna, by giving her a mint. However, things turn awkward, when Donna offers Michael a mint, and Michael picks it up with a tongue in her hand. This time, Donna is angry. Michael asks everyone what to do, and everyone says that Michael should end it. Pam, however, says that it is not impossible for her to still like him."
                    },
                    {
                        "type": "paragraph",
                        "text": "Dwight tries to convince Gabe that Kelly is not applicable, and Darryl is far better at the job, however, Darryl dropped out. Kelly is acting more ethnic so she can prove that she is a true minority. Kelly, however, continues to be unaware of her culture. Donna and Michael say goodbye to each other, and Donna has no hard feelings towards Michael, but Michael continues to awkwardly follow her. Donna tries to be nice, however, Michael keeps following her, but eventually stops. Michael is saddened that Donna left.   Dwight talks to Stanley and Oscar about the minority program, and no one wants to do it. Erin drops in, but Dwight tells her to go away. Kelly says that she likes many of the things that Indian people like. Dwight introduces Hide to Gabe, and Hide tells him about his life in Japan as a surgeon."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael, sad because Donna isn't interested in him, sits on the couch. Pam tells Michael that she thought Donna was interested. Phyllis and Andy try to console Michael, while Erin tells him that Donna forgot her hair clip. Michael wants to return it to her, and everyone tells him not to, but he runs down to see her anyway. Donna is still in the parking lot, and Michael gives her the hair clip. Michael tells Donna that he thought she was interested in him. Donna says that he was actually right, and they kiss."
                    },
                    {
                        "type": "paragraph",
                        "text": "Kelly is accepted into the minority training program, and Gabe is happy because \"the program is too black,\" which he immediately regrets saying. Michael tells everyone that Donna and he kissed, however, no one believes him because he didn't give her the hair clip. Michael says that he doesn't care, but tries to convince people that he did, anyway."
                    }
                ],
                "images": [
                    {
                        "src": "https://vignette.wikia.nocookie.net/theoffice/images/7/7b/Bodylanguage1.jpg/revision/latest/scale-to-width-down/160?cb=20100430182139",
                        "caption": "Michael uses genitalia to represent words."
                    },
                    {
                        "src": "https://vignette.wikia.nocookie.net/theoffice/images/0/04/Bodylanguage2.jpg/revision/latest/scale-to-width-down/180?cb=20100430182220",
                        "caption": "Kelly tries to act more \"Indian.\""
                    },
                    {
                        "src": "https://vignette.wikia.nocookie.net/theoffice/images/0/0d/Bodylanguage3.jpg/revision/latest/scale-to-width-down/192?cb=20100430182245",
                        "caption": "Michael confronts Donna."
                    }
                ]
            },
            {
                "title": "Deleted scenes",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Attempting to bolster Kelly's chances for the executive training program, Dwight challenges Gabe to name an Indian CEO. Gabe names several, including Indra Nooyi. Dwight then challenges him to name one female Indian CEO. Gabe points out that Indra Nooyi is a woman. Dwight then asks him to name a female Indian CEO of a paper company, after which \"I'm out of your hair.\" Gabe names one. Dwight then challenges Gabe to name two.",
                                "elements": []
                            },
                            {
                                "text": "In Michael's office, Donna sits at his desk and plays with his toys while mentioning that in her business, she offers free onion rings to her friends. Michael continues to have trouble reading Donna's behavior.",
                                "elements": []
                            },
                            {
                                "text": "Talking head interviews with Michael, Andy, and Stanley on how to tell if someone is interested in you.",
                                "elements": []
                            },
                            {
                                "text": "Kelly visits Ryan in his workspace (the closet) and is disgusted that Yale's mascot is a bulldog. (Recall that the executive training program includes two weeks study at Yale Business School.) Ryan reassures her that nobody actually wears the clothes from their school. Andy proves them wrong by showing his undershirt, his socks, and pulls up his underpants, accidentally giving himself a \"front wedgie.\"",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Cultural references",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Sid & Dexter's is a fictitious bar (the location of the episode Happy Hour) based on the real bar Dave & Buster's.",
                                "elements": []
                            },
                            {
                                "text": "Victoria's Secret is a chain of stores selling women's clothing and lingerie. It is known for its provocative catalogs.",
                                "elements": []
                            },
                            {
                                "text": "The Yale School of Management is the graduate business school of Yale University, a member of the prestigious Ivy League.",
                                "elements": []
                            },
                            {
                                "text": "Cinderella is a folk tale in which a mistreated girl triumphs over her situation. In common use, it is used to describe a situation in which an unappreciated person meets with sudden success.",
                                "elements": []
                            },
                            {
                                "text": "Texting, short for text messaging, is a form of short-message communication over mobile devices. Although laws prohibiting texting while driving became popular in the United States starting in 2008, there was no law specifically banning texting while driving in Pennsylvania at the time the episode aired.",
                                "elements": []
                            },
                            {
                                "text": "Bill Gates and Ted Turner are well-known business magnates. Julia Roberts is an award-winning actress.",
                                "elements": []
                            },
                            {
                                "text": "Michael shows a picture of his Shrek-green eyes. Shrek is a green ogre, the lead character in a series of animated movies.",
                                "elements": []
                            },
                            {
                                "text": "Michael inserts a subliminal message into his presentation by showing very briefly a slide consisting of the word SEX.",
                                "elements": []
                            },
                            {
                                "text": "M&M's candies are candy-covered chocolates. They are Kevin's favorite candy.",
                                "elements": []
                            },
                            {
                                "text": "Pam wishes Jim luck as Michael's wingman, an informal term for somebody who helps a friend approach potential sexual partners.",
                                "elements": []
                            },
                            {
                                "text": "Kelly creates a fake IM account, short for instant messaging.",
                                "elements": []
                            },
                            {
                                "text": "Altoid is a brand of breath mints, previously seen in \"Phyllis' Wedding\".",
                                "elements": []
                            },
                            {
                                "text": "Rudy is a 1993 sports film about Daniel \"Rudy\" Ruettiger who overcomes a series of setbacks (including being rejected three times) to enroll in the University of Notre Dame and play on the football team. The movie is not a comedy.",
                                "elements": []
                            },
                            {
                                "text": "Michael asks Donna if she needs validation, short for parking validation. Some parking lots intended for use by customers of a particular business or collection of businesses charge for parking but will waive the fee if the driver demonstrates that they made a qualifying purchase at a participating business.",
                                "elements": []
                            },
                            {
                                "text": "Dwight calls Erin paleface, an insulting term for \"white people\" originally used by Native Americans to describe European settlers.",
                                "elements": []
                            },
                            {
                                "text": "Dwight says, \"speaking of rainbows\" when addressing Oscar. The gay movement adopted the rainbow flag as its symbol.",
                                "elements": []
                            },
                            {
                                "text": "Andy mentions tearing his scrote (short for scrotum) and that the urologist was performing examinations to charge his HMO, short for health maintenance organization, an organization which manages health insurance.",
                                "elements": []
                            },
                            {
                                "text": "The red dot on Kelly's forehead is a bindi, a traditional decoration for women in South Asia. Although it carried meaning in the past, in modern times it is used merely as a fashion accessory.",
                                "elements": []
                            },
                            {
                                "text": "The Indian CEOs named by Gabe are Vikram Pandit (Citigroup), Surya Mohapatra (Quest Diagnostics), Dinesh Paliwal (Harman International Industries), and Indra Nooyi (PepsiCo). Paper company CEO Nisha Das appears to be fictitious.",
                                "elements": []
                            },
                            {
                                "text": "Michael says that 50 years ago, dating was much simpler, citing Mad Men, a dramatic television program set at an advertising agency in the 1960s.",
                                "elements": []
                            },
                            {
                                "text": "Kelly wishes she was going to Harvard instead of Yale so it would be just like Legally Blonde, a 2001 comedy movie about a sorority girl who attends Harvard Law School. Harvard is also a member of the Ivy League.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Amusing details",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Jim says \"Soy fantástico\" (I'm fantastic), implying he is not fluent in Spanish, as the correct way to phrase that would be \"Estoy fantástico\" (I'm feeling/currently fantastic).",
                                "elements": []
                            },
                            {
                                "text": "Kelly is rude to the customer service representative on the phone, even though her own job is customer service.",
                                "elements": []
                            },
                            {
                                "text": "Dwight wears his cell phone on his belt, a trait Kelly mentioned her dislike for earlier in the episode.",
                                "elements": []
                            },
                            {
                                "text": "Dwight mentions that he is a Cholera survivor, a disease that has long not affected developed society.",
                                "elements": []
                            },
                            {
                                "text": "Kelly says she cannot name \"any CEO, any race\", even though the CEO of Sabre Jo Bennett visited the Scranton branch episodes earlier.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Connections to previous episodes",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Dwight pretends to call 911 to report the Scranton Strangler.",
                                "elements": []
                            },
                            {
                                "text": "Andy mentions his torn scrotum, an injury he suffered in the episode Niagara.",
                                "elements": []
                            },
                            {
                                "text": "Jim jokes about Pam being a golddigger in Customer Survey.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Flashbacks",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Donna tells Michael to get off the table. Michael tells Donna that she can not talk to him like that in front of his friends (Happy Hour).",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Cast",
                "level": 2,
                "content": [],
                "images": []
            },
            {
                "title": "Main cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Steve Carell as Michael Scott",
                                "elements": []
                            },
                            {
                                "text": "Rainn Wilson as Dwight Schrute",
                                "elements": []
                            },
                            {
                                "text": "John Krasinski as Jim Halpert",
                                "elements": []
                            },
                            {
                                "text": "Jenna Fischer as Pam Halpert",
                                "elements": []
                            },
                            {
                                "text": "B.J. Novak as Ryan Howard",
                                "elements": []
                            },
                            {
                                "text": "Ed Helms as Andy Bernard",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Supporting cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Leslie David Baker as Stanley Hudson",
                                "elements": []
                            },
                            {
                                "text": "Brian Baumgartner as Kevin Malone",
                                "elements": []
                            },
                            {
                                "text": "Creed Bratton (actor) as Creed Bratton",
                                "elements": []
                            },
                            {
                                "text": "Kate Flannery as Meredith Palmer",
                                "elements": []
                            },
                            {
                                "text": "Mindy Kaling as Kelly Kapoor",
                                "elements": []
                            },
                            {
                                "text": "Ellie Kemper as Erin Hannon",
                                "elements": []
                            },
                            {
                                "text": "Angela Kinsey as Angela Martin",
                                "elements": []
                            },
                            {
                                "text": "Oscar Nunez as Oscar Martinez",
                                "elements": []
                            },
                            {
                                "text": "Craig Robinson as Darryl Philbin",
                                "elements": []
                            },
                            {
                                "text": "Phyllis Smith as Phyllis Vance",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Recurring cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Zach Woods as Gabe Lewis",
                                "elements": []
                            },
                            {
                                "text": "Amy Pietz as Donna",
                                "elements": []
                            },
                            {
                                "text": "Hidetoshi Imura as Hidetoshi Hasagawa",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            }
        ]
    },
    "quotesDetails": {
        "sections": [
            {
                "title": "Body Language Quotes",
                "level": 1,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Pam: You can flirt with someone to get what you want and also be attracted to them. How do you think we got together?"
                    },
                    {
                        "type": "paragraph",
                        "text": "Jim: 'Cause I stopped by your desk like fifteen times a day!"
                    },
                    {
                        "type": "paragraph",
                        "text": "Pam: I was after your money!"
                    },
                    {
                        "type": "paragraph",
                        "text": "Jim: Well the joke was on you."
                    },
                    {
                        "type": "paragraph",
                        "text": "Pam: Yes, it was."
                    }
                ],
                "images": []
            }
        ]
    },
    "coldOpens": [
        "Michael wants everyone in the office to speak Spanish as he prepares for a trip to Cancun but has difficulty with the feminine and masculine forms of the language. "
    ],
    "storylines": [
        "Michael is trying to speak in Spanish because he believes that everyone in the country should speak the language. Michael reveals that he is also going to Cancun. Jim speaks Spanish to Michael, however, Michael can't respond. While Dwight believes that it is a waste since everyone will be speaking German-Chinese, Oscar tries to teach Michael the words. Michael uses genitalia to represent whether the word is feminine or masculine.",
        "Jim and Pam plan their sales pitch, while Dwight is angry that he isn't getting the client. Pam makes lame jokes. Donna, Jim and Pam's client, and the manager of the bar from Happy Hour, comes into the office, much happier than she was before. Michael asks her if she is a hooker, however, she takes it jokingly. Donna believes that Jim and Pam are twins at first, but realizes they are married. As Jim tries to explain to Donna the prices, Michael barges in and offers Donna a Victoria's Secret catalog.",
        "Meanwhile, Gabe talks to Darryl about a minority program. Dwight wants to join the program (\"Print in All Colors\"), however, only minorities can join. Dwight is angry because Darryl is competent, so he has a chance at succeeding. Knowing that Kelly has no chance at succeeding, he goes up to her and asks her to consider the program. Dwight tells Kelly that she could be the CEO. While she'd rather be a superstar, she accepts the offer to be in the minority program.",
        "Michael, continuing to ruin Jim and Pam's sale, shows Donna a slide show. Michael uses pictures of himself every other slide, and the other slides are pictures that \"turn her [Donna] on,\" so that she will associate Michael with being turned on. The last slide reads, \"SEX.\" Donna is acting nice, but Michael takes it too far by trying to kiss her, however, she declines, leaving both of them embarrassed. Jim and Pam, watching, are shocked.",
        "Jim tells Michael that he shouldn't kiss people at work, while Pam says that if she wasn't interested she would have left by now out of anger. Michael agrees with Pam and tells Jim that he and Pam did a lot more than kiss. Donna says that it wasn't professional, but was flattering. Michael apologizes for ruining their sale, Jim is shocked when Pam lets Michael finish the sale with Jim.  Dwight continues to talk to Kelly about being a minority, as Jim and Michael talk to Donna. Michael tries to get Jim to offer a lower price, despite Jim and Oscar telling him that the company will lose money. Jim says that Donna could be flirting to get a lower price. Pam says that Donna likes Michael, while Jim doesn't believe she does. Kelly says that she is going to go in the program and be an executive, and Ryan will become a manager, which will cause them to fire most of the employees. Dwight is shocked and angry.",
        "Michael continues to flirt with Donna, by giving her a mint. However, things turn awkward, when Donna offers Michael a mint, and Michael picks it up with a tongue in her hand. This time, Donna is angry. Michael asks everyone what to do, and everyone says that Michael should end it. Pam, however, says that it is not impossible for her to still like him.",
        "Dwight tries to convince Gabe that Kelly is not applicable, and Darryl is far better at the job, however, Darryl dropped out. Kelly is acting more ethnic so she can prove that she is a true minority. Kelly, however, continues to be unaware of her culture. Donna and Michael say goodbye to each other, and Donna has no hard feelings towards Michael, but Michael continues to awkwardly follow her. Donna tries to be nice, however, Michael keeps following her, but eventually stops. Michael is saddened that Donna left.   Dwight talks to Stanley and Oscar about the minority program, and no one wants to do it. Erin drops in, but Dwight tells her to go away. Kelly says that she likes many of the things that Indian people like. Dwight introduces Hide to Gabe, and Hide tells him about his life in Japan as a surgeon.",
        "Michael, sad because Donna isn't interested in him, sits on the couch. Pam tells Michael that she thought Donna was interested. Phyllis and Andy try to console Michael, while Erin tells him that Donna forgot her hair clip. Michael wants to return it to her, and everyone tells him not to, but he runs down to see her anyway. Donna is still in the parking lot, and Michael gives her the hair clip. Michael tells Donna that he thought she was interested in him. Donna says that he was actually right, and they kiss.",
        "Kelly is accepted into the minority training program, and Gabe is happy because \"the program is too black,\" which he immediately regrets saying. Michael tells everyone that Donna and he kissed, however, no one believes him because he didn't give her the hair clip. Michael says that he doesn't care, but tries to convince people that he did, anyway."
    ],
    "quotes": [
        "Pam: You can flirt with someone to get what you want and also be attracted to them. How do you think we got together?",
        "Jim: 'Cause I stopped by your desk like fifteen times a day!",
        "Pam: I was after your money!",
        "Jim: Well the joke was on you.",
        "Pam: Yes, it was."
    ]
}