{
    "season": 6,
    "title": "Happy Hour",
    "episode": "21",
    "episodes": [
        21
    ],
    "coldOpens": [
        "Michael challenges the office and allows anyone who can do 25 push-ups the day off. "
    ],
    "storylines": [
        "Michael completes his 25th push-up and one girl push-up and challenges the office employees to do 26 push-ups of their own. Those who do can go home. While Angela, Jim, and the rest of the office try and fail, the office cheers on Stanley, who remains dedicated to the task. Oscar states that it is remarkable, however, Michael says that it is unfair because his weight is pushing him down to the floor. Stanley completes the goal, and the office yells in excitement for him. Stanley leaves.",
        "Oscar comes in early to encounter Matt, and says that he is always early, but Calvin tells Matt he never comes in early. When Oscar tries the door he realizes that the office won't open for two hours. Oscar suggests to Darryl that everyone go to happy hour. Darryl says that he'll invite Matt and then makes a pun: he tells Oscar that he knows about his liking Matt and says that he can be gay with Matt but be straight with him. Oscar then asks the office if they would like to go to happy hour and Phyllis agrees. She says she likes to wear something low-cut, because when someone flirts with her, Bob Vance beats them up. The documentary crew is shocked, but Phyllis only remarks, \"What?\" Jim says that he can not go because the baby is with Pam and she wouldn't want to leave the baby. When Jim calls Pam, to ask her if she wants to go to happy hour, she is ecstatic and begs to go, yelling that she could be around adults and desperately misses everyone.",
        "Meanwhile, Erin and Andy try to keep their relationship under wraps, quiet and free of drama. Erin pretends to hate Andy, but they both agree to go to happy hour together. Kevin suspects their relationship quickly and starts to make crude gestures while the couple are in a talking head, which Andy and Erin find pretty funny.",
        "Michael also decides to go to happy hour. Everyone from the office arrives at happy hour, and Pam invites her friends, Isabel and Julie; she plans to set up Michael with Julie. Pam sees Kevin, who is trying to get Pam's breasts to leak by crying like a baby. Michael meets Julie, and they hit it off. Isabel comes and flirts with Dwight, who is talking to Angela at the time. Angela notices Dwight's interest in Isabel and starts to become jealous. Julie says that she likes Michael, however things take a turn for the worse when Jim alerts Michael that he is on a date. Michael then becomes \"Date Mike.\"  While Hide talks to Oscar, Michael starts to act boorish and outlandish. Kevin continues his quest to make Pam's breasts leak. Kelly and Ryan play Dance Dance Revolution. Erin and Andy want to play it, but decide that playing together would make people aware of their relationship. While Isabel and Dwight talk and flirt with each other, Angela follows them, leading him to get closer to Isabel while they play whac-a-mole. Michael continues to be obnoxious and the date gets worse. Later, Andy gets signals that people know about his relationship with Erin, and he says that he doesn't want the drama.",
        "Dwight tells Angela that they had a good run, but that it's over; he offers to release her from their contract. Michael continues to act irrational and starts to dance on the pool table. When the bar manager, Donna, sees Michael, she calls security and asks him to stop, which he does. Michael goes up to Donna and they fight, however, they soon begin to flirt. Erin and Andy flirt with different people, but when Erin gropes someone, trying to be like people from the movies, Andy tells her to stop and yells at her in the picture booth. Julie decides to leave, and Pam tells her that Michael is not always like this, but can't tell her what he is really like. Donna asks Michael when he is coming back to the bar.",
        "Darryl tells Oscar that Matt is dumb, and Oscar momentarily agrees, but as soon as Matt shows up he eagerly goes with him to play hoops. Looking at the pictures of his yelling at Erin, Andy realizes that his and Erin's relationship is becoming dysfunctional. Not wanting a relationship like that, he goes to the microphone and announces to everyone that they are dating. Then he admits he likes the drama anyway. Angela confronts Dwight and Isabel. Isabel 'whacks' Angela lightly, when Angela says that she is taking Dwight to court. Isabel and Dwight then make out. Michael says that he and a woman hit it off. Jim and Pam, thinking he meant Julie, obviously disagree. Michael says that his success with women is due to Date Mike. A drunk Kelly starts to cry when Erin spills her drink, and she and Ryan decide to go home. Kelly's crying starts Pam's breasts leaking, to Kevin's delight.",
        "At the end of the episode the Asian dockworker, Hide, says that he was a heart surgeon in Japan and that he killed a Yakuza boss on purpose during an operation; when he came to America, he got a new car, a new woman, children, and says that Darryl is a life saver. He explains he was the best surgeon."
    ],
    "quotes": [
        [
            {
                "speaker": "For the episode, see",
                "content": " Happy Hour."
            }
        ],
        [
            {
                "speaker": "Dwight",
                "content": " Angela versus Isabelle. Height, advantage Isabelle. Birthing hips, advantage Isabelle. Remaining childbearing years, advantage Isabelle. Legal obligation, advantage Angela."
            }
        ],
        [
            {
                "speaker": "Erin",
                "content": " [falsely to Andy to hide their relationship] Talk to me that way again, and I'll cut your face off!"
            }
        ],
        [
            {
                "speaker": "Andy",
                "content": " We just have to throw everyone off the scent, a little. So... follow my lead. [finds a seat next to a stranger] I don't normally do this but--"
            }
        ],
        [
            {
                "speaker": "Woman",
                "content": " What?"
            }
        ],
        [
            {
                "speaker": "Andy",
                "content": " Just sit down next to a beautiful woman and just start talking to myself to confuse other people?"
            }
        ],
        [
            {
                "speaker": "Erin",
                "content": " [to a random man] Hey Big Boy. [rubs his leg] Do you like it when I do that?"
            }
        ],
        [
            {
                "speaker": "Andy",
                "content": " [Andy spits out his drink] What are you doing!"
            }
        ],
        [
            {
                "speaker": "Erin",
                "content": " What we said to do."
            }
        ],
        [
            {
                "speaker": "Andy",
                "content": " We didn't say we were gonna like, start groping strangers!"
            }
        ],
        [
            {
                "speaker": "Erin",
                "content": " I was flirting with a man!"
            }
        ],
        [
            {
                "speaker": "Andy",
                "content": " Get in here. [pushed Erin into a photo booth] Where did you learn to talk like that?"
            }
        ],
        [
            {
                "speaker": "Erin",
                "content": " Movies? I dunno."
            }
        ],
        [
            {
                "speaker": "Andy",
                "content": " What movie! Black Snake Moan?"
            }
        ],
        [
            {
                "speaker": "Kevin",
                "content": " Well when a new mom, hears a baby cry, her you-know-whats fill up with you-know-what? And then her shirt gets... you know. [giggles to himself] That would be funny!"
            }
        ]
    ]
}