{
    "season": 6,
    "title": "Secretary's Day",
    "episode": "22",
    "episodes": [
        22
    ],
    "coldOpens": [
        "The office collects around Oscar's computer to watch a funny video of cookie monster with Kevin's voice. "
    ],
    "storylines": [
        "It's Secretary's Day, and Andy tries to make Erin's special holiday a memorable one. He convinces a reluctant Michael to take her to lunch to a place of her choosing. While they are out, Michael accidentally reveals to Erin that Andy used to date, and was engaged to, fellow office worker Angela. However, Andy has not yet revealed this fact to Erin. She becomes visually disturbed, but tries to keep it in as best she can. Back at the office, during the main party, Andy begins to serenade her and she hurls a piece of cake at his face. She angrily reveals that she knows about Angela and Andy's relationship from Michael, and begins to accuse the other women in the office of sleeping with Andy. Despite numerous attempts from fellow office workers to help console and calm her, Erin ultimately decides to take some time away from Andy. At the end of the day, Andy looks on as it is Michael who makes her happy on Secretary's Day.",
        "Meanwhile, Oscar circulates a video he made, which compares Kevin's voice to Cookie Monster's. Kevin finds it offensive rather than funny, and complains to Gabe about the video. In an effort to assert his authority, Gabe bans the office from talking about the video and about Cookie Monster. However, this doesn't stop Pam and Jim from sharing a laugh, while Kevin is at Erin's desk. In retaliation, Gabe suspends Pam without pay for contradicting his orders, then Jim for defending her, and eventually (and ironically) Dwight for applauding Gabe's actions. It all comes apart when Gabe calls corporate and finds out he has virtually no power. He returns to the office to try to undo the damage and make everyone forget about the incident, but Toby tips off Pam about the mistake. Pam and Jim team up and reverse the situation, getting a \"two day paid vacation,\" while Dwight apologizes and kisses Gabe's hand instead. After Jim and Pam leave, he decides to save face and mock Kevin as well (\"I WANT COOKIES\"), but does a poor impression. Kevin finally retaliates by doing an impression of Gabe, and the rest of the office joins in on mocking Gabe as he leaves the room humiliated.",
        "At the end of the episode, Kevin tries to get Oscar back by making his own parody video by using Oscar's voice and comparing him to The Count. However, everyone finds it in poor taste, but Michael ends up finding it funny, probably just because he thought that everybody else did."
    ],
    "quotes": [
        [
            {
                "speaker": "Jim",
                "content": " (Imitating Kevin Malone/Cookie Monster) Michael, can I have an advance on my paycheck because of Ms. Feld Cookie just opened up at the mall? Sorry, Gabe, but that show hasn't been on in many cookies."
            }
        ]
    ]
}