{
    "season": 6,
    "title": "The Chump",
    "episode": "25",
    "episodes": [
        25
    ],
    "episodeDetails": {
        "sections": [
            {
                "title": "The Chump",
                "level": 1,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "\"The Chump\" is the twenty-fifth episode of the sixth season and the 125th episode of The Office overall. It was written by Aaron Shure, who also wrote The Meeting, Two Weeks and Baby Shower and directed by Randall Einhorn, who directed St. Patrick's Day and Secret Santa. It aired on May 13th, 2010. It was viewed by 6.60 million people."
                    }
                ],
                "images": []
            },
            {
                "title": "Synopsis",
                "level": 2,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "The entire office braces for the emotional breakdown of Michael after his discovery that his girlfriend Donna is already married, but surprisingly, Michael appears unaffected. The office soon realizes that Michael is still seeing Donna. Michael defends himself by calling out Stanley and Phyllis as cheaters, though he quickly amends his remarks to suggest that Phyllis cheated on her diet. Andy, having been cheated on himself, steps up and makes Michael confront his girlfriend's husband. They both go to visit him while he's coaching a high school baseball team, and Andy manages to get the two of them to talk. However, this does little to sway Michael toward ending the affair. On the contrary, Michael is emboldened by the encounter."
                    },
                    {
                        "type": "paragraph",
                        "text": "Meanwhile, Dwight and Angela are dealing with fallout from the baby contract they signed a few months earlier. Instead of going to court, they have asked a mediator to sort out their issues. After studying the contract line by line, the mediator concludes that the contract is basically a valid surrogate parent contract. However, one cannot force two people to have sexual relations and produce a baby. Instead, Angela could sue Dwight for damages up to thirty thousand dollars for breach of contract. Knowing that Dwight would never want to pay her damages, she offers him a \"settlement\" that consists of five separate sessions of intercourse. He accepts, gloating that \"thirty thousand for sex isn't bad at all.\" Before the first \"session\", Dwight subjects himself to various ordeals in order to sterilize himself."
                    },
                    {
                        "type": "paragraph",
                        "text": "Jim and Pam are both exhausted from the long nights with their new baby, and it's adversely affecting their work. Gabe catches them both sleeping at their desks and reprimands them privately. He also asks them what they would do about the rumors of printers catching fire, but they both nearly fall asleep listening to him. Darryl catches the couple discussing how to get enough energy to make it through the day and informs them of a secret sleeping place in the warehouse. From this location, Jim and Pam inadvertently overhear Dwight and Angela's first \"session.\""
                    },
                    {
                        "type": "paragraph",
                        "text": "After returning from the baseball game, Michael shows no sincere change in attitude towards cheating with Donna, despite having talked with her husband. The rest of the office turns cold towards him. No one, not even Meredith or Creed, agrees with what Michael is doing. When he tries to defend his position in front of everyone, they snap back. He leaves to secretly meet Donna at a motel for sex, but on the way there he has a change of heart and breaks up with her via text message instead. He consoles himself, alone, with his favorite ice cream after returning heartbroken."
                    },
                    {
                        "type": "paragraph",
                        "text": "At the end of the episode, Michael is ambushed by the media. He believes that they are confronting him with the affair, but they are really questioning him about how Sabre printers can catch on fire."
                    }
                ],
                "images": []
            },
            {
                "title": "Deleted scenes",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Dwight demands that Mr. Barr, the mediator, prove that he is not related to Angela. He explains that he was chosen out of the Yellow Pages at random. Dwight is unsatisfied because Angela chose which Yellow Pages. Mr. Barr asks about a clause which says that the child shall be taught the skills of \"the raper.\" Dwight explains that it should read \"the rapier\" and attempts to have the contracted voided as a result of the typographical error. Angela counters that she agreed to the terms out of reluctance and that \"guns are better.\" In a joint talking head interview, Dwight and Angela disagree over whether their agreement is a contract.",
                                "elements": []
                            },
                            {
                                "text": "Jim and Pam walk away from a meeting with Gabe. Neither has any recollection of what happened or what they agreed to do.",
                                "elements": []
                            },
                            {
                                "text": "Andy tells the office that he employed his \"Trevor\" persona to take Michael to confront Donna's husband. In a talking head interview, Andy describes his \"Trevor\" character in elaborate detail.",
                                "elements": []
                            },
                            {
                                "text": "In a talking head interview, Michael explains that people don't like heroes any more. They root for the bad guy.",
                                "elements": []
                            },
                            {
                                "text": "In a talking head interview, Darryl confesses that he used to be a cheater, but he reformed after watching the scene in Love, Actually in which Emma Thompson plays the Joni Mitchell song \"Both Sides Now\". He also confesses that he hasn't been in a relationship since then either.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Trivia",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "In the cold open, Andy is visibly excited to have been picked for the role of Osama Bin Laden.",
                                "elements": []
                            },
                            {
                                "text": "After the episode aired, NBC posted a (redacted) copy of the Dwight Schrute/Angela Martin child contract. (The use of the name Morpheus to refer to Dwight in the contract, introduced in The Delivery, appears to have been dropped.)",
                                "elements": []
                            },
                            {
                                "text": "Michael's lips are stained with lipstick, specifically in his talking heads.",
                                "elements": []
                            },
                            {
                                "text": "Andy's drinking container is labeled Nard-Dog, one of his most common nicknames.",
                                "elements": []
                            },
                            {
                                "text": "In the second deleted scene, Jim's notes read \"Third quarter maximize check filet? Proscribernation?”[1]",
                                "elements": []
                            },
                            {
                                "text": "There was no Billy Joel Rock Band at the time the episode aired; Joel had not allowed any of his music to be used in a video game. In a review of the episode on Entertainment Weekly, the reviewer responded to the concept of Billy Joel Rock Band with \"let's hope [it] never actually exists ever.\" After reading the review, the singer told his people, \"Get me on that Rock Band game.\" The Office was therefore ultimately responsible for making Billy Joel Rock Band a reality.[2]",
                                "elements": []
                            },
                            {
                                "text": "This is the 6th season's 25th episode. Michael Jackson died on June 25. Michael Scott asks for a 10 minute moment of silence honoring Michael Jackson.",
                                "elements": []
                            },
                            {
                                "text": "This is not the first time Pam and Jim have tried asking Michael to dinner to get him to reveal something.",
                                "elements": []
                            },
                            {
                                "text": "Gabe asks Jim and Pam to see him in his office, but he doesn't have an office.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Connections to previous episodes",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Toby's desire to have the office tested for radon dates back to Goodbye Toby* and was reiterated in The Surplus.",
                                "elements": []
                            },
                            {
                                "text": "Ryan's attempt to engage Erin in a threesome continues an effort begun in The Mentor: BFFs?. See Ryan-Erin Relationship for details.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Cultural references",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Creed's favorite James McAvoy movie is Wanted, an Academy-Award-nominated movie about an office worker who becomes an assassin. In the movie, McAvoy's character learns to fire bullets which curve around obstacles.",
                                "elements": []
                            },
                            {
                                "text": "In the movie Obsessed, Ali Larter plays the woman who attempts to seduce the husband of the character played by Beyoncé Knowles. The husband is played by Idris Elba, who played Charles Miner on The Office.",
                                "elements": []
                            },
                            {
                                "text": "Kelly confuses anthropology with Anthropologie, a chain of high-end women's clothing.",
                                "elements": []
                            },
                            {
                                "text": "Michael lists a number of fictitious anti-heroes: Tony Soprano, Nurse Jackie, and the woman from Weeds (Nancy Botwin).",
                                "elements": []
                            },
                            {
                                "text": "Darryl talks about the romantic comedy movie Love, Actually. In the scene he cites, Emma Thompson's character breaks down crying when she comes to the conclusion that her husband is having an affair.",
                                "elements": []
                            },
                            {
                                "text": "Michael (when asked about still seeing Donna by Pam) says \"You know what? I am declaring a moment of silence right now, ten minutes of silence honoring Michael Jackson. Just sit there and think about Michael Jackson\" (Due to Michael Jackson's death).",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Cast",
                "level": 2,
                "content": [],
                "images": []
            },
            {
                "title": "Main cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Steve Carell as Michael Scott",
                                "elements": []
                            },
                            {
                                "text": "Rainn Wilson as Dwight Schrute",
                                "elements": []
                            },
                            {
                                "text": "John Krasinski as Jim Halpert",
                                "elements": []
                            },
                            {
                                "text": "Jenna Fischer as Pam Halpert",
                                "elements": []
                            },
                            {
                                "text": "B.J. Novak as Ryan Howard",
                                "elements": []
                            },
                            {
                                "text": "Ed Helms as Andy Bernard",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Supporting cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Leslie David Baker as Stanley Hudson",
                                "elements": []
                            },
                            {
                                "text": "Brian Baumgartner as Kevin Malone",
                                "elements": []
                            },
                            {
                                "text": "Creed Bratton (actor) as Creed Bratton",
                                "elements": []
                            },
                            {
                                "text": "Kate Flannery as Meredith Palmer",
                                "elements": []
                            },
                            {
                                "text": "Mindy Kaling as Kelly Kapoor",
                                "elements": []
                            },
                            {
                                "text": "Ellie Kemper as Erin Hannon",
                                "elements": []
                            },
                            {
                                "text": "Angela Kinsey as Angela Martin",
                                "elements": []
                            },
                            {
                                "text": "Paul Lieberstein as Toby Flenderson",
                                "elements": []
                            },
                            {
                                "text": "Oscar Nunez as Oscar Martinez",
                                "elements": []
                            },
                            {
                                "text": "Craig Robinson as Darryl Philbin",
                                "elements": []
                            },
                            {
                                "text": "Phyllis Smith as Phyllis Vance",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Recurring cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Zach Woods as Gabe Lewis",
                                "elements": []
                            },
                            {
                                "text": "Amy Pietz as Donna Newton",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Guest cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Larkin Campbell as Shane",
                                "elements": []
                            },
                            {
                                "text": "Bruno Oliver as Mr. Barr",
                                "elements": []
                            },
                            {
                                "text": "Tina Huang as Reporter",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            }
        ]
    },
    "quotesDetails": {
        "sections": [
            {
                "title": "The Chump Quotes",
                "level": 1,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Michael: If I had a gun with two bullets and I was in a room with Hitler, Bin Laden and Toby, I would shoot Toby twice."
                    }
                ],
                "images": []
            }
        ]
    },
    "coldOpens": [
        "In the conference room, an office safety meeting led by Toby turns into a discussion on how to get rid of Bin Laden, Hitler, and Toby at once. "
    ],
    "storylines": [
        "The entire office braces for the emotional breakdown of Michael after his discovery that his girlfriend Donna is already married, but surprisingly, Michael appears unaffected. The office soon realizes that Michael is still seeing Donna. Michael defends himself by calling out Stanley and Phyllis as cheaters, though he quickly amends his remarks to suggest that Phyllis cheated on her diet. Andy, having been cheated on himself, steps up and makes Michael confront his girlfriend's husband. They both go to visit him while he's coaching a high school baseball team, and Andy manages to get the two of them to talk. However, this does little to sway Michael toward ending the affair. On the contrary, Michael is emboldened by the encounter.",
        "Meanwhile, Dwight and Angela are dealing with fallout from the baby contract they signed a few months earlier. Instead of going to court, they have asked a mediator to sort out their issues. After studying the contract line by line, the mediator concludes that the contract is basically a valid surrogate parent contract. However, one cannot force two people to have sexual relations and produce a baby. Instead, Angela could sue Dwight for damages up to thirty thousand dollars for breach of contract. Knowing that Dwight would never want to pay her damages, she offers him a \"settlement\" that consists of five separate sessions of intercourse. He accepts, gloating that \"thirty thousand for sex isn't bad at all.\" Before the first \"session\", Dwight subjects himself to various ordeals in order to sterilize himself.",
        "Jim and Pam are both exhausted from the long nights with their new baby, and it's adversely affecting their work. Gabe catches them both sleeping at their desks and reprimands them privately. He also asks them what they would do about the rumors of printers catching fire, but they both nearly fall asleep listening to him. Darryl catches the couple discussing how to get enough energy to make it through the day and informs them of a secret sleeping place in the warehouse. From this location, Jim and Pam inadvertently overhear Dwight and Angela's first \"session.\"",
        "After returning from the baseball game, Michael shows no sincere change in attitude towards cheating with Donna, despite having talked with her husband. The rest of the office turns cold towards him. No one, not even Meredith or Creed, agrees with what Michael is doing. When he tries to defend his position in front of everyone, they snap back. He leaves to secretly meet Donna at a motel for sex, but on the way there he has a change of heart and breaks up with her via text message instead. He consoles himself, alone, with his favorite ice cream after returning heartbroken.",
        "At the end of the episode, Michael is ambushed by the media. He believes that they are confronting him with the affair, but they are really questioning him about how Sabre printers can catch on fire."
    ],
    "quotes": [
        "Michael: If I had a gun with two bullets and I was in a room with Hitler, Bin Laden and Toby, I would shoot Toby twice."
    ]
}