{
    "season": 6,
    "title": "Body Language",
    "episode": "23",
    "episodes": [
        23
    ],
    "coldOpens": [
        "Michael wants everyone in the office to speak Spanish as he prepares for a trip to Cancun but has difficulty with the feminine and masculine forms of the language. "
    ],
    "storylines": [
        "Michael is trying to speak in Spanish because he believes that everyone in the country should speak the language. Michael reveals that he is also going to Cancun. Jim speaks Spanish to Michael, however, Michael can't respond. While Dwight believes that it is a waste since everyone will be speaking German-Chinese, Oscar tries to teach Michael the words. Michael uses genitalia to represent whether the word is feminine or masculine.",
        "Jim and Pam plan their sales pitch, while Dwight is angry that he isn't getting the client. Pam makes lame jokes. Donna, Jim and Pam's client, and the manager of the bar from Happy Hour, comes into the office, much happier than she was before. Michael asks her if she is a hooker, however, she takes it jokingly. Donna believes that Jim and Pam are twins at first, but realizes they are married. As Jim tries to explain to Donna the prices, Michael barges in and offers Donna a Victoria's Secret catalog.",
        "Meanwhile, Gabe talks to Darryl about a minority program. Dwight wants to join the program (\"Print in All Colors\"), however, only minorities can join. Dwight is angry because Darryl is competent, so he has a chance at succeeding. Knowing that Kelly has no chance at succeeding, he goes up to her and asks her to consider the program. Dwight tells Kelly that she could be the CEO. While she'd rather be a superstar, she accepts the offer to be in the minority program.",
        "Michael, continuing to ruin Jim and Pam's sale, shows Donna a slide show. Michael uses pictures of himself every other slide, and the other slides are pictures that \"turn her [Donna] on,\" so that she will associate Michael with being turned on. The last slide reads, \"SEX.\" Donna is acting nice, but Michael takes it too far by trying to kiss her, however, she declines, leaving both of them embarrassed. Jim and Pam, watching, are shocked.",
        "Jim tells Michael that he shouldn't kiss people at work, while Pam says that if she wasn't interested she would have left by now out of anger. Michael agrees with Pam and tells Jim that he and Pam did a lot more than kiss. Donna says that it wasn't professional, but was flattering. Michael apologizes for ruining their sale, Jim is shocked when Pam lets Michael finish the sale with Jim.  Dwight continues to talk to Kelly about being a minority, as Jim and Michael talk to Donna. Michael tries to get Jim to offer a lower price, despite Jim and Oscar telling him that the company will lose money. Jim says that Donna could be flirting to get a lower price. Pam says that Donna likes Michael, while Jim doesn't believe she does. Kelly says that she is going to go in the program and be an executive, and Ryan will become a manager, which will cause them to fire most of the employees. Dwight is shocked and angry.",
        "Michael continues to flirt with Donna, by giving her a mint. However, things turn awkward, when Donna offers Michael a mint, and Michael picks it up with a tongue in her hand. This time, Donna is angry. Michael asks everyone what to do, and everyone says that Michael should end it. Pam, however, says that it is not impossible for her to still like him.",
        "Dwight tries to convince Gabe that Kelly is not applicable, and Darryl is far better at the job, however, Darryl dropped out. Kelly is acting more ethnic so she can prove that she is a true minority. Kelly, however, continues to be unaware of her culture. Donna and Michael say goodbye to each other, and Donna has no hard feelings towards Michael, but Michael continues to awkwardly follow her. Donna tries to be nice, however, Michael keeps following her, but eventually stops. Michael is saddened that Donna left.   Dwight talks to Stanley and Oscar about the minority program, and no one wants to do it. Erin drops in, but Dwight tells her to go away. Kelly says that she likes many of the things that Indian people like. Dwight introduces Hide to Gabe, and Hide tells him about his life in Japan as a surgeon.",
        "Michael, sad because Donna isn't interested in him, sits on the couch. Pam tells Michael that she thought Donna was interested. Phyllis and Andy try to console Michael, while Erin tells him that Donna forgot her hair clip. Michael wants to return it to her, and everyone tells him not to, but he runs down to see her anyway. Donna is still in the parking lot, and Michael gives her the hair clip. Michael tells Donna that he thought she was interested in him. Donna says that he was actually right, and they kiss.",
        "Kelly is accepted into the minority training program, and Gabe is happy because \"the program is too black,\" which he immediately regrets saying. Michael tells everyone that Donna and he kissed, however, no one believes him because he didn't give her the hair clip. Michael says that he doesn't care, but tries to convince people that he did, anyway."
    ],
    "quotes": [
        [
            {
                "speaker": "Pam",
                "content": " You can flirt with someone to get what you want and also be attracted to them. How do you think we got together?"
            }
        ],
        [
            {
                "speaker": "Jim",
                "content": " 'Cause I stopped by your desk like fifteen times a day!"
            }
        ],
        [
            {
                "speaker": "Pam",
                "content": " I was after your money!"
            }
        ],
        [
            {
                "speaker": "Jim",
                "content": " Well the joke was on you."
            }
        ],
        [
            {
                "speaker": "Pam",
                "content": " Yes, it was."
            }
        ]
    ]
}