{
    "season": 6,
    "title": "The Cover-Up",
    "episode": "24",
    "episodes": [
        24
    ],
    "coldOpens": [
        "Jim and Pam learn Morse Code, sending Dwight into paranoia. "
    ],
    "storylines": [
        "Jim and Pam prank Dwight by discussing him using Morse code in front of him. Dwight, who knows Morse code, asks Michael to intervene but cannot prove that the couple are doing anything more than clicking their office equipment. Michael, in a good mood due to his wildly successful relationship with Donna, is unsympathetic to Dwight's plight.",
        "During a meeting, Michael asks the office for recommendation for an upcoming trip with Donna. In the meeting, the other members of the office, particularly Ryan and Kelly, convince him that she might be cheating on him. Worried sick, Michael hires Dwight to tail her to see if she is spending time with anyone else. Dwight follows Donna to her gym and attempts to seduce her. Donna rebukes him and calls security on him, whereby he openly admits he was sent there by Michael to watch her. Dwight comes back to the office and says to Michael that Donna isn't cheating, and that Michael has to pay for his gym membership (since he must pay for any of the fees Dwight had during the investigation). An enraged Donna comes to the office to talk to Michael about the whole situation, but the two forgive each other and reconcile by planning a private vacation together.",
        "Andy receives a call from a concerned customer that a Sabre printer he bought caught fire during a routine print-job. Andy becomes frustrated when Gabe fails to take his customer's complaint seriously. Capitalizing on his fears, Darryl pranks Andy into believing he has uncovered a major conspiracy. Darryl is pranking Andy in retaliation for his blaming one of his mistakes on the warehouse a few years earlier, an act that put Darryl's career at Dunder Mifflin in jeopardy. After pretending to help Andy to not get fired for knowing that the printers may be dangerous, Darryl agrees to film Andy testing a printer in a typical fashion to test his burning printer theory. During the shooting of the video, while Darryl is pranking Andy into speaking with a high pitch voice, the printer indeed catches fire and explodes. This confirms Andy's suspicions, and terrifies Darryl who vows to never prank again.",
        "Both Pam and Kelly become suspicious when Donna, wearing earrings that no woman would buy for herself, cannot remember where she got them. While Donna and Michael are planning their trip, Pam investigates Donna's Facebook account and finds pictures of her hugging and kissing another man. At first she and Jim had been skeptical of Donna cheating, and even berated Michael for having destructive tendencies with his personal life, as well as his eating a bowl of mayonnaise and olives due to stress. But now they realize his fears had been correct and try to warn him as best they can. Pam shows Michael the pictures she found and he confronts Donna with the evidence. At the end of the episode, Donna reveals that she is indeed cheating, but not on Michael - with Michael. She is actually married to someone.",
        "In the last scene, Dwight is taking a spin class at Donna's gym. While Dwight is instructing the class (with an imaginary scenario involving going up a hill and cycling off a cliff), the instructor tries to regain control. Everyone in the class ends up listening to Dwight."
    ],
    "quotes": [
        [
            {
                "speaker": "Andy",
                "content": " [in old Michael Scott Paper Company's \"office\"] We're printing on 24-pound premium stock paper, approximately 300 sheets in. So far, no signs of distress. [Darryl is filming Andy's demonstration]"
            }
        ],
        [
            {
                "speaker": "Darryl",
                "content": " You haven't even introduced yourself."
            }
        ],
        [
            {
                "speaker": "Andy",
                "content": " Right. My name is Andrew Baines Bernard, and if you're watching this, it's because I've turned State's witness because I'm in danger because I know too much."
            }
        ],
        [
            {
                "speaker": "Darryl",
                "content": " You should talk in a higher voice 'cause the camera makes you sound weird."
            }
        ],
        [
            {
                "speaker": "Andy",
                "content": " Higher? Okay. [speaking slightly higher] Recently certain events have come to my attention..."
            }
        ],
        [
            {
                "speaker": "Darryl",
                "content": " Higher. [motions with hand to go up more]"
            }
        ],
        [
            {
                "speaker": "Andy",
                "content": " Make it higher? Okay."
            }
        ],
        [
            {
                "speaker": "Darryl",
                "content": " Mm-hmm"
            }
        ],
        [
            {
                "speaker": "Andy",
                "content": " [high-pitched] I have come to the conclusion that the Sabre corporation..."
            }
        ],
        [
            {
                "speaker": "Darryl",
                "content": " One more, yeah. [Again motions to go even higher]"
            }
        ],
        [
            {
                "speaker": "Andy",
                "content": " [higher] May be overlooking certain safety regulations. At the danger... [printer starts smoking and explodes] ah! [speaking lower] It's smoking. [in normal voice] It's smo... I knew it!"
            }
        ],
        [
            {
                "speaker": "Darryl",
                "content": " This... [removes camera headset]"
            }
        ],
        [
            {
                "speaker": "Andy",
                "content": " We are blowin' the roof off! Blowin' the roof off! [Darryl discharges fire extinguisher onto printer] Nice. Nice. This is my partner, Darryl Philbin. He's been my partner through this entire thing."
            }
        ]
    ]
}