{
    "season": 6,
    "title": "The Promotion",
    "episode": "3",
    "episodes": [
        3
    ],
    "coldOpens": [
        "Dwight asks Jim to sign the expense reports, and tries filing a complaint against Jim. "
    ],
    "storylines": [
        "The office is still trying to adjust to having both Michael and Jim as bosses, with Jim getting a newly built personal office space in the main section. Michael and Jim constantly find themselves at odds with each other as Michael keeps having \"conference room meetings\" while Jim wants to keep productivity in the office place. They get a call from CFO David Wallace who tells them that not everyone in the branch will get their desired raise and that they will have to decide how to disperse it among the employees. Michael gets annoyed when Jim keeps making pros and cons lists for each idea. Jim decides to give the raises to the sales staff since they bring money to the company. Michael is against the idea, but invites Jim to announce it to the office.",
        "Jim tells the office that they are only going to give raises to the sales staff, which clearly upsets the non-sales staff. Dwight, not wanting Jim as a boss, complains about the unfairness of Jim's decision despite being a salesperson. Michael, who was scoffing at Jim, is then asked to give his idea, but he does not speak coherently about it, leading everyone to say that Jim was at least being direct despite having a bad idea. Michael and Jim go back into the conference room to decide how to handle the raise issue. They ultimately decide that the raises should be performance-based, and decide to take turns placing beans on employee pictures to determine how much of a raise each person deserves. Jim believes that it is a good idea, but when Michael and Jim leave the conference room, Dwight goes into the conference room and shows the employees their plan. Everyone gets upset at Michael and Jim for this, particularly Pam, whose picture did not have any beans, as Jim was trying to remain unbiased.",
        "With the entire office now upset with both Michael and Jim, Dwight uses this opportunity to start an uprising against Jim personally. However, everyone in the office refuses to as they are more concerned about the raise issue. Michael then goes into Jim's office to check on him. Michael explains he felt terrible having to make those kinds of decisions on his own and he leaves to get Jim something. Jim comments that Michael is currently his only friend in the office at the moment, as everyone else, even probably Pam, is upset at him about the raise situation. Michael returns to give Jim his own new \"World's Best Boss\" mug and they share some gin together.",
        "Meanwhile, Pam is trying to discreetly ask everyone to give cash as wedding gifts instead of actual gifts. She first tries Phyllis to no avail. She then manages to get Kevin to write her a check, and starts to feel guilty about asking people for simple cash, but she gets ecstatic when she sees that the check is made out to \"Mrs. Pam Halpert.\" At the end of the episode, Ryan gives her an offer of either having $100 now or $5,000 in a year. She initially wants the $100, but after he tells her about an algorithm that can determine the winner of any college basketball game, she agrees to the $5,000. However, this allegedly requires a $50 investment from her, which she gives, later regretting it."
    ],
    "quotes": [
        [
            {
                "speaker": "Kelly",
                "content": " I love rivalries-- Michael or Jim, Paris or Nicole, Heidi or L.C. It's so much fun. But I guess if I'm really thinking about it and answering your question honestly, I'd have to go with L.C. Heidi's a bad friend, and her skin is terrible."
            }
        ],
        [
            {
                "speaker": "Dwight",
                "content": " I deserve that promotion, not Jim. (sighs) Man, it makes me want to put him in a triangle choke-hold, and force him down to the ground and just keep pressing and pressing, and flip him over and put him in a hammer-lock, and he's gasping and he's panting every last breath, and the crowd goes crazy, and BOOM! I emerge victorious! (Claps hands) Ha-ha! $18,000 and a chance at the title! Hoo-Ha!"
            }
        ],
        [
            {
                "speaker": "Creed",
                "content": " (To Meredith) Hey, why haven't we ever, umm... (likely referring to sexual activity)"
            }
        ],
        [
            {
                "speaker": "Meredith",
                "content": " We have."
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " Sometimes the smartest people don't think at all."
            }
        ]
    ]
}