{
    "season": 6,
    "title": "Niagara",
    "episode": "4/5",
    "episodes": [
        4,
        5
    ],
    "episodeDetails": {
        "sections": [
            {
                "title": "Niagara",
                "level": 1,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "\"Niagara\" is a two-part episode of the Season 6 of The Office. Because of its extended hour-long runtime, it was considered to be the fourth and fifth episodes in the season's episode count. It was the 104th (and 105th) episode overall. It was written by Greg Daniels and Mindy Kaling, and directed by Paul Feig. It originally aired on October 8, 2009 and was viewed by 9.42 million people."
                    },
                    {
                        "type": "paragraph",
                        "text": "The highly-anticipated episode revolved around the wedding of Jim and Pam at Niagara Falls."
                    }
                ],
                "images": []
            },
            {
                "title": "Synopsis",
                "level": 2,
                "content": [],
                "images": []
            },
            {
                "title": "Part One",
                "level": 3,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "In the cold open, Pam tells the office not to eat pungent foods, but Dwight refuses. When he is eating an egg, Pam throws up. Andy, Angela, Erin and then everyone else throws up, except for Creed who for some reason eats at a faster rate while watching the staff throw up, Dwight looks in horror, after which Pam gives a look to Dwight."
                    },
                    {
                        "type": "paragraph",
                        "text": "After giving strict directions not to tell Pam's family about her being pregnant, Jim and Pam head up to Niagara Falls for their wedding, and the rest of the office follows them. After decorating his car to say \"Going to a Wedding,\" Michael and Dwight seek women to hook up with while Andy pursues Erin. Kevin and Oscar meet Pam's sister Penny, who accidentally offends Oscar by thinking Kevin was his boyfriend, Gil. Pam's mother Helene is visibly disturbed at the fact that Pam's father, and Helene's ex-husband, William Beesly has come to the wedding with his new girlfriend who is half his age."
                    },
                    {
                        "type": "paragraph",
                        "text": "Everyone except Pam's grandmother, Memaw, is aware of Pam's pregnancy, so they are told not to mention it. At the rehearsal dinner, Jim gives a moving and romantic toast to his soon-to-be wife. However, closing the toast, Jim accidentally alludes to Pam's pregnancy. Both Jim and Michael try to cover up the fact but only embarrass themselves further. In a final bid to end the embarrassment, Michael privately tells Memaw that this kind of behavior should be encouraged nowadays and gives her false hope that the baby will be named after her. While walking to the bar, Pam bumps into Angela who likens the visit to kicking Pam in the stomach."
                    },
                    {
                        "type": "paragraph",
                        "text": "Andy hosts a dance party in his room later that night, with the office staff attending. Andy punctures his scrotum trying to do a split. The guests rouse Pam, the only sober person, to take him to the hospital. Pam reluctantly agrees."
                    }
                ],
                "images": []
            },
            {
                "title": "Part Two",
                "level": 3,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Michael and Dwight try their luck with women at the bar. Dwight, despite embarrassing both of them, is successful in getting Pam's friend Isabel Poreba to spend the night with him. Michael spends the night alone in the ice machine room as he had failed to make a reservation in advance."
                    },
                    {
                        "type": "paragraph",
                        "text": "Prior to the ceremony, Pam accidentally tears her veil and tearfully phones Jim. They meet in private, where Pam expresses her regret over their choice to invite their families and the office staff. Pam is visibly uplifted when Jim cuts off his tie in an effort to console her. They are then seen running away from the church together."
                    },
                    {
                        "type": "paragraph",
                        "text": "While everyone in the church wonders where they went, Michael and Helene begin to bond over their failed relationships. Dwight callously rebuffs Isabel's attempts at further contact. The rest of the office staff grow impatient, bickering about their right to take their gifts back.   Jim and Pam finally return to the church after an hour with no explanation of their absence, and the ceremony begins."
                    },
                    {
                        "type": "paragraph",
                        "text": "Meemaw is seen at the church, indicating Michael's attempts at getting her to stay were successful.   Michael, Dwight, and others close to Jim and Pam interrupt the ceremony by recreating the dance routines as featured in the JK Wedding Entrance Dance. Despite having asked their guests specifically not to re-enact the video, Jim and Pam react with good humor."
                    },
                    {
                        "type": "paragraph",
                        "text": "During the dance sequence, a flashback reveals Jim and Pam's adventure during their absence: They are shown boarding the Maid of the Mist, a ferry boat, and being married by the ship's captain below the falls. Jim explains to the camera that he had prepared the ferry marriage in advance after seeing the video, in anticipation of the likely chaos at the ceremony. It being plan C, plan B being the church, and plan A, marrying her a long time ago. The camera then cuts back to Jim holding Pam close to him and with her head on his shoulder, as they look out into the distance at Niagara Falls."
                    },
                    {
                        "type": "paragraph",
                        "text": "Jim looks at the camera and smiles warmly."
                    },
                    {
                        "type": "paragraph",
                        "text": "The very end of the episode shows Kevin soothing his feet in the hotel ice machine, while Helene lustfully pulls Michael into her hotel room."
                    }
                ],
                "images": [
                    {
                        "src": "https://vignette.wikia.nocookie.net/theoffice/images/4/42/MaidoftheMist.jpg/revision/latest/scale-to-width-down/200?cb=20091220135350",
                        "caption": "Pam and Jim on the Maid of the Mist"
                    },
                    {
                        "src": "https://vignette.wikia.nocookie.net/theoffice/images/1/11/Niagara1.jpg/revision/latest/scale-to-width-down/250?cb=20091213102337",
                        "caption": ""
                    },
                    {
                        "src": "https://vignette.wikia.nocookie.net/theoffice/images/8/8a/NiagaraWeddingDance.jpg/revision/latest/scale-to-width-down/180?cb=20091223014952",
                        "caption": "The wedding montage based on the JK Wedding Dance"
                    }
                ]
            },
            {
                "title": "Cultural references",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Michael asks to give his toast third, \"sorta bat cleanup.\" The cleanup hitter in baseball is the team's strongest hitter. However, the cleanup hitter bats fourth, not third, as Michael believes.",
                                "elements": []
                            },
                            {
                                "text": "Sylvia was watching Brüno, a mockumentary comedy film about a gay Austrian fashion journalist.",
                                "elements": []
                            },
                            {
                                "text": "Dwight wears the Three Wolf Moon t-shirt, made famous by humorous reviews on Amazon, before going out to the hotel bar with Michael to pick up women, commenting on its \"powerful forces of attraction\" on them. He also comments they are howling at the moon \"to imitate howling during sex\".",
                                "elements": []
                            },
                            {
                                "text": "The dance down the church aisle to Chris Brown's \"Forever\" is a \"remake\" of the popular 2009 YouTube viral video, \"JK Wedding Entrance Dance\", in which a young couple (JK standing for \"Jill and Kevin\") dance down the aisle to the song along with their wedding party. Pam mentions that the song was specifically put on a \"Do Not Play List\", but was choreographed by the wedding guests and office workers regardless.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Amusing details",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Penny mistakes Kevin for Gil, even though Oscar and Gil had been broken up for over two years.",
                                "elements": []
                            },
                            {
                                "text": "Mindy Kaling explained that she writes less romance-y stuff than show-runner Greg Daniels.",
                                "elements": []
                            },
                            {
                                "text": "While everyone throws up in the office, Creed is seen calmly eating noodles.",
                                "elements": []
                            },
                            {
                                "text": "Jim's dad wore a kilt, marking the second person to have Scottish roots. (Michael said he was Scottish and 2/15 Native American in Diversity Day).",
                                "elements": []
                            },
                            {
                                "text": "On a sign to the reception dinner, it says \"Halpret\" instead of \"Halpert\" (see List of Signs). The same error is made on the daily events sign in the hotel lobby.",
                                "elements": []
                            },
                            {
                                "text": "When Michael stands up to make his “comedic” toast and goes on to talk about Smart cars, he talks with his eyes closed the majority of the time.",
                                "elements": []
                            },
                            {
                                "text": "Even though Kevin explicitly calls his makeshift shoes \"Kleenex shoes,\" the \"Kleenex\" branding on the boxes has been changed to a generic tissue label, likely to avoid product placement and/or copyright issues.",
                                "elements": []
                            },
                            {
                                "text": "You can see Michael, Pete Halpert, and Dwight making signals to each other when they “hijack” the wedding music right before Pam’s sister was supposed to walk down the aisle.",
                                "elements": []
                            },
                            {
                                "text": "In Booze Cruise when Pam is asked if she wants to get married on the boat she declines and says she wants her parents there when she gets married. However, in this episode Pam gets married on a boat without her parents being there.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Trivia",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Robert Pine (Mr. Halpert) is the father of Chris Pine, who starred as James T. Kirk in the 2009 Star Trek film, directed and co-produced by J.J. Abrams as Kirk's older brother, though much of his part was cut, and for the one sequence that did make the film, he was made into a different character.",
                                "elements": []
                            },
                            {
                                "text": "The flower girl is played by Greg Daniels' daughter Charlotte.",
                                "elements": []
                            },
                            {
                                "text": "Mindy Kaling likes to write Dwight being able to easily get girls. In Night Out (another Mindy Kaling written episode), Dwight makes out with a tall women's basketball player but later leaves her to her dismay.",
                                "elements": []
                            },
                            {
                                "text": "When Andy says \"What happens in Niagara, stays in Niagara\", it is a reference to the movie The Hangover, also starring Ed Helms, which takes place in Las Vegas (\"What happens in Vegas, stays in Vegas\"). This is of course based on the famous R&R Partners ad campaign.",
                                "elements": []
                            },
                            {
                                "text": "The hotel in Niagara is the Red Coach Inn. The hotel interiors were shot at the Sportsmen's Lodge Hotel in Los Angeles. The hotel lobby scenes were shot in the hotel's auxiliary lobby. The rehearsal dinner was shot at The Smokehouse in Burbank. In the show, the hotel's name is the Statler Falls Hotel.",
                                "elements": []
                            },
                            {
                                "text": "Many of the tourists on the Maid of the Mist were real tourists. The Maid of the Mist management did not want to shut down the entire boat for filming. The production crew had exclusive access only to the bow of the boat. Anybody else who happened to be on the boat got to watch the scene being filmed.",
                                "elements": []
                            },
                            {
                                "text": "Relatives of crew members were enlisted as extras for the Maid of the Mist scenes. In particular, the couple directly behind Pam and Jim in the ticket line are Brian Baumgartner's parents, who happened to be in the area on vacation.",
                                "elements": []
                            },
                            {
                                "text": "This is the second wedding in the series; the first being Phyllis and Bob Vance's.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Goofs",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "The timeline of the baby doesn't add up. In Part 1 Pam has sensitive stomach and morning sickness, but Dwight says the fetus is 3 ounces, putting it at 16 weeks, which is after morning sickness stops. In Part 2 Pam says she is 5 months, which is almost 22 weeks.",
                                "elements": []
                            },
                            {
                                "text": "In a deleted scene, Jim talks in front of the Statler Falls Hotel. The awning of the Red Coach Inn was redressed to read \"Statler Falls Hotel\", but two signs for the Red Coach Inn were left intact (one to the left of the awning and another in front of it).",
                                "elements": []
                            },
                            {
                                "text": "In the boat scene by Niagara Falls, you can see Jim wearing his full tie although he had cut the lower portion of his tie off in a previous scene when he was consoling Pam as she had torn her veil.",
                                "elements": []
                            },
                            {
                                "text": "Just before Michael tries checking in at Niagara, there is a sign announcing the events. The first two are Jim and Pam's wedding. On both events, they spell Jim Halpert as Jim Halpret. It is a running joke throughout the show that their names are misspelled/mispronounced. Pam's last name is spelled multiple ways and the correct one isn't obvious, and in Christening the minister announces them as the \"Halberts\".",
                                "elements": []
                            },
                            {
                                "text": "While in the church you can see a gray and orange LA METRO city bus drive by through the open door, even though the wedding is set in Niagara Falls.",
                                "elements": []
                            },
                            {
                                "text": "Since Jim and Pam got married on the Canadian side of Niagara Falls they would have been required to have  passports to enter the Canadian border.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Connections to previous episodes",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Since early on, Kevin has had smelly feet. It was mentioned in Diwali when Angela is disgusted that Kevin took off his shoes at the Diwali festival.",
                                "elements": []
                            },
                            {
                                "text": "This is the second episode where Pam is seen wearing glasses. The first instance was in Did I Stutter?.",
                                "elements": []
                            },
                            {
                                "text": "Pam's mother was last seen in Sexual Harassment but was played by Shannon Cochran. She is played by Linda Purl for the remainder of her appearances in the series.",
                                "elements": []
                            },
                            {
                                "text": "Stanley asks if anyone has room for a toaster. In Gay Witch Hunt, Stanley says in a talking head that he bought a toaster as a wedding gift for Pam and Roy, and couldn't return it when the wedding was called off. He also gets a toaster for Phyllis in Phyllis' Wedding and is peeved when he finds out Jim and Karen brought the same gift.",
                                "elements": []
                            },
                            {
                                "text": "While Michael is giving his speech during the rehearsal dinner, Bob Vance (Phyllis' husband) looks over at Phyllis and they both look worried and annoyed. This is in connection to the episode Phyllis' Wedding when Michael gave a long and awkward speech during Bob and Phyllis' wedding dinner. Coincidentally. Michael also gets cut off mid-speech in both episodes.",
                                "elements": []
                            },
                            {
                                "text": "The montage shot of Pam resting her head against Jim, and Jim smiling to the camera, mirrors one of the earliest interactions on the show between the two, during Diversity Day. This connection is later specifically highlighted during the \"romance montage\" of the clip-based episode The Banker.",
                                "elements": []
                            },
                            {
                                "text": "Stanley brought Cynthia to the wedding, the woman that he is having an affair with as established in Gossip, instead of his wife, Teri.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Quotes",
                "level": 2,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "For quotes, see: Niagara Quotes."
                    }
                ],
                "images": []
            },
            {
                "title": "Cast",
                "level": 2,
                "content": [],
                "images": []
            },
            {
                "title": "Main cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Steve Carell as Michael Scott",
                                "elements": []
                            },
                            {
                                "text": "Rainn Wilson as Dwight Schrute",
                                "elements": []
                            },
                            {
                                "text": "John Krasinski as Jim Halpert",
                                "elements": []
                            },
                            {
                                "text": "Jenna Fischer as Pam Beesly",
                                "elements": []
                            },
                            {
                                "text": "B.J. Novak as Ryan Howard",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Supporting cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Ed Helms as Andy Bernard",
                                "elements": []
                            },
                            {
                                "text": "Leslie David Baker as Stanley Hudson",
                                "elements": []
                            },
                            {
                                "text": "Brian Baumgartner as Kevin Malone",
                                "elements": []
                            },
                            {
                                "text": "Creed Bratton (actor) as Creed Bratton",
                                "elements": []
                            },
                            {
                                "text": "Kate Flannery as Meredith Palmer",
                                "elements": []
                            },
                            {
                                "text": "Mindy Kaling as Kelly Kapoor",
                                "elements": []
                            },
                            {
                                "text": "Ellie Kemper as Erin Hannon",
                                "elements": []
                            },
                            {
                                "text": "Angela Kinsey as Angela Martin",
                                "elements": []
                            },
                            {
                                "text": "Paul Lieberstein as Toby Flenderson",
                                "elements": []
                            },
                            {
                                "text": "Oscar Nunez as Oscar Martinez",
                                "elements": []
                            },
                            {
                                "text": "Phyllis Smith as Phyllis Vance",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Recurring cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Linda Purl as Helene Beesly",
                                "elements": []
                            },
                            {
                                "text": "Bobby Ray Shafer as Bob Vance",
                                "elements": []
                            },
                            {
                                "text": "Kelen Coleman as Isabel Poreba",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Guest cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Anna Camp as Penny Beesly",
                                "elements": []
                            },
                            {
                                "text": "Blake Robbins as Tom Halpert",
                                "elements": []
                            },
                            {
                                "text": "Tug Coker as Pete Halpert",
                                "elements": []
                            },
                            {
                                "text": "Peggy Stewart as Sylvia \"Meemaw\"",
                                "elements": []
                            },
                            {
                                "text": "Robert Pine as Gerald Halpert",
                                "elements": []
                            },
                            {
                                "text": "Perry Smith as Betsy Halpert",
                                "elements": []
                            },
                            {
                                "text": "Rick Overton William Beesly",
                                "elements": []
                            },
                            {
                                "text": "Algerita Wynn Lewis as Cynthia",
                                "elements": []
                            },
                            {
                                "text": "Michelle Gunn as Hotel Receptionist",
                                "elements": []
                            },
                            {
                                "text": "Nicholas Shaffer as Hotel Manager",
                                "elements": []
                            },
                            {
                                "text": "Deena Adar as Woman at Bar",
                                "elements": []
                            },
                            {
                                "text": "Ken Kreps as Minister",
                                "elements": []
                            },
                            {
                                "text": "Randy Cordray as Ship's Captain",
                                "elements": []
                            },
                            {
                                "text": "Charlotte Daniels as Flower Girl",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "References",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "↑ http://www.officetally.com/niagara-qa-with-mindy-kaling",
                                "elements": []
                            },
                            {
                                "text": "↑ http://www.officetally.com/niagara-qa-with-mindy-kaling/3",
                                "elements": []
                            },
                            {
                                "text": "↑ http://www.officetally.com/niagara-qa-with-mindy-kaling/4",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            }
        ]
    },
    "quotesDetails": {
        "sections": [
            {
                "title": "Niagara Quotes",
                "level": 1,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Dwight: Pam is constantly throwing up because of the pregnancy. If she eats something the fetus doesn't like, she's screwed. It's amazing. A three ounce fetus is calling the shots. It's so badass."
                    },
                    {
                        "type": "paragraph",
                        "text": "Pam: I guess, it's just the end of courtesy in the workplace.  Pam: Okay. All of these things are important to remember, but the most important thing is no one say anything about my pregnancy at the wedding."
                    },
                    {
                        "type": "paragraph",
                        "text": "Jim: Absolutely. 'Cause not everyone knows and some people may be offended."
                    },
                    {
                        "type": "paragraph",
                        "text": "Angela: Decent people everywhere will get offended."
                    },
                    {
                        "type": "paragraph",
                        "text": "Pam: Well, we're thinking of my grandmother, who we haven't told and is very old fashioned."
                    },
                    {
                        "type": "paragraph",
                        "text": "Angela: Well, you're lucky you have a grandmother. Some us have to be our own grandmother."
                    },
                    {
                        "type": "paragraph",
                        "text": "Jim: That's nice.  Michael: I'll see you in Viagara Falls. Pam: Hey, my aunt told me something neat."
                    },
                    {
                        "type": "paragraph",
                        "text": "Jim: Yeah?"
                    },
                    {
                        "type": "paragraph",
                        "text": "Pam: She said everything with the wedding goes by so fast, we should try to take mental pictures of the high points.  Kevin: I'm not gay. I'm Kevin."
                    },
                    {
                        "type": "paragraph",
                        "text": "Stanley: Anybody got anything they wanna trade for a toaster?"
                    },
                    {
                        "type": "paragraph",
                        "text": "Kevin: Does it have slots for hot dogs?"
                    },
                    {
                        "type": "paragraph",
                        "text": "Stanley: No."
                    },
                    {
                        "type": "paragraph",
                        "text": "Kevin: Then, who'd want it?  Jim: I bought those tickets the day I saw that YouTube video. I knew we'd need a backup plan. The boat was actually Plan C, the church was Plan B, and Plan A was marrying her a long, long time ago. Pretty much the day I met her. Kevin: What an awesome party. The best wedding I have ever been to. I got six numbers. One more would have been a complete telephone number. This was epic. *takes off toupee and sits in a chair* My Kleenex shoes were a huge conversation piece, but man, my dogs are barking. *takes Kleenex tissue boxes off feet and puts feet in the hotel's ice cooler* My feet were so sweaty, I can't even feel the cold. What a lovely hotel."
                    }
                ],
                "images": []
            }
        ]
    },
    "coldOpens": [
        "Pam asks the employees to be mindful of her sensitive nose, leading to everyone vomiting around the office."
    ],
    "storylines": [],
    "quotes": [
        "Dwight: Pam is constantly throwing up because of the pregnancy. If she eats something the fetus doesn't like, she's screwed. It's amazing. A three ounce fetus is calling the shots. It's so badass.",
        "Pam: I guess, it's just the end of courtesy in the workplace.  Pam: Okay. All of these things are important to remember, but the most important thing is no one say anything about my pregnancy at the wedding.",
        "Jim: Absolutely. 'Cause not everyone knows and some people may be offended.",
        "Angela: Decent people everywhere will get offended.",
        "Pam: Well, we're thinking of my grandmother, who we haven't told and is very old fashioned.",
        "Angela: Well, you're lucky you have a grandmother. Some us have to be our own grandmother.",
        "Jim: That's nice.  Michael: I'll see you in Viagara Falls. Pam: Hey, my aunt told me something neat.",
        "Jim: Yeah?",
        "Pam: She said everything with the wedding goes by so fast, we should try to take mental pictures of the high points.  Kevin: I'm not gay. I'm Kevin.",
        "Stanley: Anybody got anything they wanna trade for a toaster?",
        "Kevin: Does it have slots for hot dogs?",
        "Stanley: No.",
        "Kevin: Then, who'd want it?  Jim: I bought those tickets the day I saw that YouTube video. I knew we'd need a backup plan. The boat was actually Plan C, the church was Plan B, and Plan A was marrying her a long, long time ago. Pretty much the day I met her. Kevin: What an awesome party. The best wedding I have ever been to. I got six numbers. One more would have been a complete telephone number. This was epic. *takes off toupee and sits in a chair* My Kleenex shoes were a huge conversation piece, but man, my dogs are barking. *takes Kleenex tissue boxes off feet and puts feet in the hotel's ice cooler* My feet were so sweaty, I can't even feel the cold. What a lovely hotel."
    ]
}