{
    "season": 6,
    "title": "Niagara",
    "episode": "4/5",
    "episodes": [
        4,
        5
    ],
    "coldOpens": [
        "Pam asks the employees to be mindful of her sensitive nose, leading to everyone vomiting around the office."
    ],
    "storylines": [],
    "quotes": [
        [
            {
                "speaker": "Dwight",
                "content": " Pam is constantly throwing up because of the pregnancy. If she eats something the fetus doesn't like, she's screwed. It's amazing. A three ounce fetus is calling the shots. It's so badass."
            }
        ],
        [
            {
                "speaker": "Pam",
                "content": " I guess, it's just the end of courtesy in the workplace.  Pam: Okay. All of these things are important to remember, but the most important thing is no one say anything about my pregnancy at the wedding."
            }
        ],
        [
            {
                "speaker": "Jim",
                "content": " Absolutely. 'Cause not everyone knows and some people may be offended."
            }
        ],
        [
            {
                "speaker": "Angela",
                "content": " Decent people everywhere will get offended."
            }
        ],
        [
            {
                "speaker": "Pam",
                "content": " Well, we're thinking of my grandmother, who we haven't told and is very old fashioned."
            }
        ],
        [
            {
                "speaker": "Angela",
                "content": " Well, you're lucky you have a grandmother. Some us have to be our own grandmother."
            }
        ],
        [
            {
                "speaker": "Jim",
                "content": " That's nice.  Michael: I'll see you in Viagara Falls. Pam: Hey, my aunt told me something neat."
            }
        ],
        [
            {
                "speaker": "Jim",
                "content": " Yeah?"
            }
        ],
        [
            {
                "speaker": "Pam",
                "content": " She said everything with the wedding goes by so fast, we should try to take mental pictures of the high points.  Kevin: I'm not gay. I'm Kevin."
            }
        ],
        [
            {
                "speaker": "Stanley",
                "content": " Anybody got anything they wanna trade for a toaster?"
            }
        ],
        [
            {
                "speaker": "Kevin",
                "content": " Does it have slots for hot dogs?"
            }
        ],
        [
            {
                "speaker": "Stanley",
                "content": " No."
            }
        ],
        [
            {
                "speaker": "Kevin",
                "content": " Then, who'd want it?  Jim: I bought those tickets the day I saw that YouTube video. I knew we'd need a backup plan. The boat was actually Plan C, the church was Plan B, and Plan A was marrying her a long, long time ago. Pretty much the day I met her. Kevin: What an awesome party. The best wedding I have ever been to. I got six numbers. One more would have been a complete telephone number. This was epic. *takes off toupee and sits in a chair* My Kleenex shoes were a huge conversation piece, but man, my dogs are barking. *takes Kleenex tissue boxes off feet and puts feet in the hotel's ice cooler* My feet were so sweaty, I can't even feel the cold. What a lovely hotel."
            }
        ]
    ]
}