{
    "season": 6,
    "title": "Mafia",
    "episode": "6",
    "episodes": [
        6
    ],
    "episodeDetails": {
        "sections": [
            {
                "title": "Mafia",
                "level": 1,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "\"Mafia\" is the sixth episode of the sixth season of The Office and the 106th episode overall. It was written by Brent Forrester, who most recently wrote the episodes \"Blood Drive\" and \"Business Trip\". It was directed by David Rogers. It aired on October 15, 2009. It was viewed by 8.10 million people."
                    }
                ],
                "images": []
            },
            {
                "title": "Synopsis",
                "level": 2,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Michael meets with a tenacious insurance salesman named Angelo Grotti in the office and is later convinced by Dwight and Andy that he is part of the mafia. Oscar and Ryan try to convince them otherwise to no avail and Oscar later notes that since Jim and Pam are on their honeymoon in Puerto Rico, the \"coalition for reason\" in the office is very weak. Oscar tries to call them about the situation but they urge him not to bother them on their honeymoon unless it's a dire emergency. Michael calls for a lunch meeting with Grotti to finalize a deal, convinced by Dwight and Andy to meet him in a public place where Grotti can't become violent. They accompany him to the meeting, despite Andy's reluctance."
                    },
                    {
                        "type": "paragraph",
                        "text": "Andy comes disguised as a mechanic and brings a tire iron so he can hit Grotti, in the event he tries to harm Michael. At the lunch meeting, Grotti successfully convinces Michael to sign the deal despite reservations from Dwight and Andy. A woman with her child at the restaurant then asks Andy, mistaking him for an actual mechanic, to help jump start her car, which he is unable to actually do. Michael later starts feeling guilty about the situation, particularly since it cost so much, so he calls Jim for help, but Jim blows him off by pretending to lose his signal and hangs up on him. Dwight and Andy then tell Michael that Grotti wasn't part of the mafia, and that he was just scaring Michael into a deal. Michael calls Grotti to cancel the deal, much to Grotti's dismay. When he hangs up, Dwight and Andy say that he was part of the mafia and congratulate Michael on standing up to him. When Michael announces this to the rest of the office, Oscar says that he was an actual insurance salesman from Mutual of Harrisburg, but Michael ignores him."
                    },
                    {
                        "type": "paragraph",
                        "text": "Meanwhile, Kevin uses Jim's office to pass gas in and eventually sets up a temporary workspace in there. Jim's credit card company calls his office phone inquiring about some unusual charges and Kevin uses one of Jim's pay stubs to give them his address and social security number. They say that there have been charges that occurred in Puerto Rico and that they will cancel his card. Kevin tries to stop them after realizing his mistake, but to no avail, and Oscar tells Kevin he just committed identity fraud. At the end of the episode, Kevin calls Pam to admit what he did, but after receiving a harsh message from Pam to not bother them during their honeymoon, especially after receiving information that their credit cards were canceled, he instead just tells her to say hi to Jim, without them knowing it was his fault."
                    }
                ],
                "images": []
            },
            {
                "title": "Amusing Details",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "In the last scene, a placard saying \"Kevin Malone\" is visible on Jim's desk.",
                                "elements": []
                            },
                            {
                                "text": "After Dwight realizes that Michael needs to cancel the insurance he bought from Grotti and he goes to Andy to tell him that they need to help, Andy comes up with the idea that they need to “remove the fear center” from Michael’s brain, Dwight turns down the idea in a disgusted way, which is strange because in the episode \"Broke\" from Season 5, when David Wallace and Charles Minor were talking strategies on how to recover from the damage Michael Scott Paper Company was doing, Dwight was suggesting borderline insane things, like using bees to attack Michael or even kidnapping his kids (if Michael had them).",
                                "elements": []
                            },
                            {
                                "text": "This is the only episode where Jim and Pam do not make a physical appearance instead they are only heard on the phone.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Goofs",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Michael asks Erin to bring him coffee from \"Stop & Shop\". According to its website (and as of the time of the show's airing), The Stop & Shop Supermarket Company does not maintain any stores in or around Scranton, Pennsylvania. The closest location is approximately 2 hours away by car.",
                                "elements": []
                            },
                            {
                                "text": "When Michael calls Jim for help with what to do about Grotti, Jim states that he and Pam are on a catamaran. However, when Jim hangs up, it is the sound of a landline phone being thrown down.",
                                "elements": []
                            },
                            {
                                "text": "Michael calls Jim while he is on a catamaran in San Juan; however this would be impossible as Jim would not have cell phone reception if he was out at sea. It is also possible that the catamaran was close enough to shore to have cell phone reception.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Cultural references",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Although it is not known if Jim had actually entered the area, the \"Bermuda Triangle\" is an area which supposedly has serious paranormal anomalies. The site is notorious for many unexplained disappearances of planes and ships.",
                                "elements": []
                            },
                            {
                                "text": "The Mafia, also known as the \"Cosa Nostra\", is a criminal organization stemming from Sicilian roots during the 19th century. Mobsters were known to earn money from businesses through \"protection money\" secured through intimidating business owners in their territory.",
                                "elements": []
                            },
                            {
                                "text": "When Andy says to Michael that if he tells the police about the mafia, he will get a \"dead horse's chopped-off head in your bed\". This is a reference to The Godfather, where someone refuses to listen to Vito Corleone (the godfather in the film), and later wakes up with a chopped-off horse head in his bed.",
                                "elements": []
                            },
                            {
                                "text": "When Dwight tells Michael that he couldn't find something behind the toilet, he is referencing The Godfather when Michael (Corleone not Scott) murders two people in a resturant with a gun behind a toilet",
                                "elements": []
                            },
                            {
                                "text": "When Andy says that mobsters always have a front, he suggests waste management and sanitation, an industry that mafia boss Tony Soprano uses as a front in The Sopranos. In the restaurant, Michael tries to order \"gabagool,\" an Italian-American slang term for the luncheon meat capicola. This is another reference to The Sopranos, which popularized the term.",
                                "elements": []
                            },
                            {
                                "text": "After Kevin moves into Jim's office, a football with the logo of the Arena Football League can be seen on the desk. One of the arena teams that compete in this league is located in Philadelphia called the Philadelphia Soul.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Deleted scenes",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Erin ruins Pam's painting from \"Business School\" after Creed distracts her when she tries to clean it. While this scene was deleted, it remains present in the synopsis of the episode given on Netflix and other streaming devices.",
                                "elements": []
                            },
                            {
                                "text": "Kelly tries to help Erin, and takes her necklace, which she needs for seizures. Kelly draws a rainbow, and Erin is shocked.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Cast",
                "level": 2,
                "content": [],
                "images": []
            },
            {
                "title": "Main cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Steve Carell as Michael Scott",
                                "elements": []
                            },
                            {
                                "text": "Rainn Wilson as Dwight Schrute",
                                "elements": []
                            },
                            {
                                "text": "John Krasinski as Jim Halpert",
                                "elements": []
                            },
                            {
                                "text": "Jenna Fischer as Pam Halpert",
                                "elements": []
                            },
                            {
                                "text": "B.J. Novak as Ryan Howard",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Supporting cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Ed Helms as Andy Bernard",
                                "elements": []
                            },
                            {
                                "text": "Leslie David Baker as Stanley Hudson",
                                "elements": []
                            },
                            {
                                "text": "Brian Baumgartner as Kevin Malone",
                                "elements": []
                            },
                            {
                                "text": "Creed Bratton (actor) as Creed Bratton",
                                "elements": []
                            },
                            {
                                "text": "Kate Flannery as Meredith Palmer",
                                "elements": []
                            },
                            {
                                "text": "Mindy Kaling as Kelly Kapoor",
                                "elements": []
                            },
                            {
                                "text": "Ellie Kemper as Erin Hannon",
                                "elements": []
                            },
                            {
                                "text": "Angela Kinsey as Angela Martin",
                                "elements": []
                            },
                            {
                                "text": "Paul Lieberstein as Toby Flenderson",
                                "elements": []
                            },
                            {
                                "text": "Oscar Nunez as Oscar Martinez",
                                "elements": []
                            },
                            {
                                "text": "Phyllis Smith as Phyllis Vance",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Guest cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Mike Starr as Grotti",
                                "elements": []
                            },
                            {
                                "text": "Deborah Puette as Alice",
                                "elements": []
                            },
                            {
                                "text": "Tucker Albrizzi as Son",
                                "elements": []
                            },
                            {
                                "text": "Rae Latt as Mother",
                                "elements": []
                            },
                            {
                                "text": "Jake Radaker as Boy at table (uncredited)",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            }
        ]
    },
    "quotesDetails": {
        "sections": [
            {
                "title": "Mafia Quotes",
                "level": 1,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Kevin: Jim's gone on his honeymoon. So I started borrowing his office to fart in. Then one day I came in and I just stayed. Cause this place is awesome. It feels like home now. Even better than my home. My home sucks."
                    }
                ],
                "images": []
            }
        ]
    },
    "coldOpens": [
        "Michael holds a conference room meeting about the fundamentals of business."
    ],
    "storylines": [
        "Michael meets with a tenacious insurance salesman named Angelo Grotti in the office and is later convinced by Dwight and Andy that he is part of the mafia. Oscar and Ryan try to convince them otherwise to no avail and Oscar later notes that since Jim and Pam are on their honeymoon in Puerto Rico, the \"coalition for reason\" in the office is very weak. Oscar tries to call them about the situation but they urge him not to bother them on their honeymoon unless it's a dire emergency. Michael calls for a lunch meeting with Grotti to finalize a deal, convinced by Dwight and Andy to meet him in a public place where Grotti can't become violent. They accompany him to the meeting, despite Andy's reluctance.",
        "Andy comes disguised as a mechanic and brings a tire iron so he can hit Grotti, in the event he tries to harm Michael. At the lunch meeting, Grotti successfully convinces Michael to sign the deal despite reservations from Dwight and Andy. A woman with her child at the restaurant then asks Andy, mistaking him for an actual mechanic, to help jump start her car, which he is unable to actually do. Michael later starts feeling guilty about the situation, particularly since it cost so much, so he calls Jim for help, but Jim blows him off by pretending to lose his signal and hangs up on him. Dwight and Andy then tell Michael that Grotti wasn't part of the mafia, and that he was just scaring Michael into a deal. Michael calls Grotti to cancel the deal, much to Grotti's dismay. When he hangs up, Dwight and Andy say that he was part of the mafia and congratulate Michael on standing up to him. When Michael announces this to the rest of the office, Oscar says that he was an actual insurance salesman from Mutual of Harrisburg, but Michael ignores him.",
        "Meanwhile, Kevin uses Jim's office to pass gas in and eventually sets up a temporary workspace in there. Jim's credit card company calls his office phone inquiring about some unusual charges and Kevin uses one of Jim's pay stubs to give them his address and social security number. They say that there have been charges that occurred in Puerto Rico and that they will cancel his card. Kevin tries to stop them after realizing his mistake, but to no avail, and Oscar tells Kevin he just committed identity fraud. At the end of the episode, Kevin calls Pam to admit what he did, but after receiving a harsh message from Pam to not bother them during their honeymoon, especially after receiving information that their credit cards were canceled, he instead just tells her to say hi to Jim, without them knowing it was his fault."
    ],
    "quotes": [
        "Kevin: Jim's gone on his honeymoon. So I started borrowing his office to fart in. Then one day I came in and I just stayed. Cause this place is awesome. It feels like home now. Even better than my home. My home sucks."
    ]
}