{
    "season": 6,
    "title": "Mafia",
    "episode": "6",
    "episodes": [
        6
    ],
    "coldOpens": [
        "Michael holds a conference room meeting about the fundamentals of business."
    ],
    "storylines": [
        "Michael meets with a tenacious insurance salesman named Angelo Grotti in the office and is later convinced by Dwight and Andy that he is part of the mafia. Oscar and Ryan try to convince them otherwise to no avail and Oscar later notes that since Jim and Pam are on their honeymoon in Puerto Rico, the \"coalition for reason\" in the office is very weak. Oscar tries to call them about the situation but they urge him not to bother them on their honeymoon unless it's a dire emergency. Michael calls for a lunch meeting with Grotti to finalize a deal, convinced by Dwight and Andy to meet him in a public place where Grotti can't become violent. They accompany him to the meeting, despite Andy's reluctance.",
        "Andy comes disguised as a mechanic and brings a tire iron so he can hit Grotti, in the event he tries to harm Michael. At the lunch meeting, Grotti successfully convinces Michael to sign the deal despite reservations from Dwight and Andy. A woman with her child at the restaurant then asks Andy, mistaking him for an actual mechanic, to help jump start her car, which he is unable to actually do. Michael later starts feeling guilty about the situation, particularly since it cost so much, so he calls Jim for help, but Jim blows him off by pretending to lose his signal and hangs up on him. Dwight and Andy then tell Michael that Grotti wasn't part of the mafia, and that he was just scaring Michael into a deal. Michael calls Grotti to cancel the deal, much to Grotti's dismay. When he hangs up, Dwight and Andy say that he was part of the mafia and congratulate Michael on standing up to him. When Michael announces this to the rest of the office, Oscar says that he was an actual insurance salesman from Mutual of Harrisburg, but Michael ignores him.",
        "Meanwhile, Kevin uses Jim's office to pass gas in and eventually sets up a temporary workspace in there. Jim's credit card company calls his office phone inquiring about some unusual charges and Kevin uses one of Jim's pay stubs to give them his address and social security number. They say that there have been charges that occurred in Puerto Rico and that they will cancel his card. Kevin tries to stop them after realizing his mistake, but to no avail, and Oscar tells Kevin he just committed identity fraud. At the end of the episode, Kevin calls Pam to admit what he did, but after receiving a harsh message from Pam to not bother them during their honeymoon, especially after receiving information that their credit cards were canceled, he instead just tells her to say hi to Jim, without them knowing it was his fault."
    ],
    "quotes": [
        [
            {
                "speaker": "Kevin",
                "content": " Jim's gone on his honeymoon. So I started borrowing his office to fart in. Then one day I came in and I just stayed. Cause this place is awesome. It feels like home now. Even better than my home. My home sucks."
            }
        ]
    ]
}