{
    "season": 6,
    "title": "The Lover",
    "episode": "7",
    "episodes": [
        7
    ],
    "coldOpens": [
        "Jim and Pam return from their honeymoon; Michael plays Blind Guy McSqueezy."
    ],
    "storylines": [
        "Pam and Jim come back from their honeymoon in Puerto Rico. Everyone is happy that they are back, and Pam and Jim share that they loved their trip to Puerto Rico. Michael uses Blind Guy McSqueezy, a character of his who is blind, to welcome them back. Meredith asks Pam what she got for them and Pam says candy. Meredith asks, \"What else?\"",
        "Pam tells Erin to put her candy on the desk, but Erin tells Pam that she is going to ask Michael for permission first. It is learned that Michael is dating Helene, Pam's mother. Jim is shocked and outraged that Michael is dating Helene and begs Michael not to tell Pam.",
        "Meanwhile, Dwight tries to get information on Jim by putting a wooden mallard in his office, which contains a listening device. Jim gives the duck to Kelly and Ryan. Dwight takes it back and gives it to Jim again. Jim sees it and makes Dwight wash and buff his car as punishment. After everyone has left for the day, Dwight tells the documentary crew that he used the mallard as a diversion. His real listening device was a pen that recorded Jim's entire workday. As he is listening to Jim's customer calls, Dwight proudly tells the camera that he got eight hours of this.",
        "Pam eventually learns that Michael is, in fact, dating her mother. She is outraged, shocked and belittles Michael all day. She has awkward encounters with Oscar when he tells her she is going overboard. Angela, cheery, asks Pam how her day is going. Pam calls her mom to tell her she is crazy for dating Michael. Toby tries to calm Pam down, after Michael treats Toby like a friend, but Toby doesn't succeed. Michael calls him a jackass. Michael leaves while Jim tries to calm her down with thoughts about their honeymoon, including a couple they met named Frank and Benny (\"Frank and Beans\") and a brother and sister named Jim and Pam.",
        "Jim shows Pam that Dwight is washing their car and they reminisce about their honeymoon. Pam continues to think that she is not going overboard, and Jim agrees."
    ],
    "quotes": [
        [
            {
                "speaker": "Dwight",
                "content": " I inserted a listening device into the belly of the mallard. Now I can observe Jim, trap Jim, and destroy Jim, just like in the Bavarian fairy tale. Only this time, the mallard skins the toad alive. And of course in this version you lose the whole veiled critique of the Kaiser thing."
            }
        ]
    ]
}