{
    "season": 6,
    "title": "Koi Pond",
    "episode": "8",
    "episodes": [
        8
    ],
    "coldOpens": [
        "Jim is annoyed when a client insists on Michael attending a meeting instead of just him.",
        "The staff puts together a haunted warehouse for their children, but the scares fall flat, that is until Michael pretends to hang himself. ((\"Koi Pond\") - original airing)"
    ],
    "storylines": [
        "Michael accompanies Jim to a client meeting. While there, Michael accidentally trips and falls into their koi pond. Word spreads around the office, causing all types of puns and jokes at Michael's expense. Michael, unable to handle humor directed at him, gets angry. Jim tries to calm Michael down and get him to see the humor in the situation. If he shows that he can take a few jokes, it will probably cause them to end more quickly. He starts off well, lobbing a few hardballs at himself, but inevitably goes too far in mocking his friendship challenges and storms off. Then Meredith is sent a video of the incident. Jim attempts to convince the group to leave things alone, but Michael decides to let it be shown. The video captures Jim deliberately bending backward to avoid grabbing Michael as he falls.",
        "In Michael's office, Jim admits he resented that Michael didn't trust him to handle the meeting himself. Michael can't believe that Jim is jealous of him.",
        "Meanwhile, Andy and Pam, the two poorest-performing salesmen, are sent on cold calls. The potential clients assume that the two are a married couple which causes some awkward moments and quick denials. Eventually, they decide to pose as a married couple in hopes of landing a sale. Andy takes the ruse too far which makes Pam and the client uncomfortable. They land no sales. On the car ride back to the office, Andy admits to liking Erin, and Pam tries to help the two get together."
    ],
    "quotes": [
        [
            {
                "speaker": "Dwight",
                "content": " Jim is my enemy. But it turns out that Jim is also his own worst enemy. And the enemy of my enemy is my friend. So, Jim is actually my friend. But... because he is his own worst enemy, the enemy of my friend is my enemy. So, actually Jim is my enemy. But-"
            }
        ],
        [
            {
                "speaker": "https",
                "content": "//twitter.com/michaelgclump/status/949061042658619393?lang=en"
            }
        ]
    ]
}