{
    "season": 6,
    "title": "Double Date",
    "episode": "9",
    "episodes": [
        9
    ],
    "coldOpens": [
        "Dwight brings fresh bagels from New York for the entire office in exchange for their allegiance against Jim. "
    ],
    "storylines": [
        "In a plan to take down Jim Halpert, Dwight brings the whole office bagels so that they will all owe him a favor. Dwight reveals his plan to the documentary crew. He even tries to get Michael and Pam to turn on Jim.",
        "Meanwhile, Pam and Jim are going on an early lunch with Helene and Michael because it is Helene's birthday, although Pam wishes the relationship would have died out.",
        "Ryan gets into photography. He takes pictures of \"places with unlikely beauty,\" including a sewer, homeless people, and graffiti. He asks Erin if she has ever been photographed before, and then shows her a topless picture of Kelly, for a series titled Exposure in the Workplace. Erin is seemingly shocked.",
        "Michael is thrilled that he can prove to Pam on the birthday lunch that he really likes her mom. Angela snidely asks Pam if she's going to introduce the office to \"Michael's girlfriend\". Helene reveals that Michael got her two presents. When Kevin suggests that Helene and Michael had sex, Pam is outraged. As Helene, Jim, Pam, and Michael leave, Pam gets a \"phone call\" and tries to stay at the office by saying to the couple that her client is having a shipping emergency. However, Jim, who is having none of it, takes the phone and acts as if he's resolved the issue; he hangs up and the foursome leave for the double date.",
        "On the car ride, Pam tells her mother that she likes sales. Helene suggests that Pam's sales are mediocre, and Pam reflects that she shouldn't have gotten in the car.",
        "While Pam endures the date, Andy repays Dwight by giving him his suitcase back, which he polished. Not to be outdone, they awkwardly keep giving each other little favors on the way back to their desks from the break room. Dwight says that Andy is complicating everything, but that he is not afraid.",
        "Meanwhile, Pam is shocked when the waitress calls Helene, Michael, Jim and Pam the \"Scott Family.\" She shows open disdain towards Michael in a talking head. It is revealed that Michael decorated the area where the double date takes place, which causes Pam to warm up a bit.",
        "Michael, however, begins to realize how old Helene is when he says he'd like to go to Italy someday, but instead of echoing his desire she says he can have her guidebooks and that she's \"done with those really long plane rides\". Helene then jokingly says that she is 49 for the 9th year. Michael uses a pen and paper to add 49 and 9; \"you're 54 years old!\" he says when done. Helene corrects him and says she's 58. Michael says in interview that he's not robbing the cradle, he's robbing the grave. Back at the table, he is mortified when Pam and Jim suggest that Helene be called \"grandma\" and he knocks back the rest of his wine. To probe Helene's attitude towards her age, Michael tries to get her to participate in a triathlon. She says no, but she might have done it when she was younger, confirming Michael's fears.",
        "At Dunder Mifflin, Andy takes \"a page out of the old Schrute book of niceness\" and buys lunch for the whole office. They all eat the tacos, except Angela. Dwight tries to maintain his edge by offering to make everyone's tacos for them.",
        "Michael begins to signal that he doesn't want to be with Helene. Michael downplays the gift he got Helene - a scrapbook with mementos of their relationship and a cutesy poem -- which Pam, unaware of Michael's change in attitude, calls a \"home run\". Pam and Jim are pleased at Michael, finally.",
        "After a stop at the bar, Michael says in interview that he thought he was going to grow old with Holly Flax. Then he met Helene and although she already knows and has done everything Michael wants to do, he wants to do those things himself. At the table, Michael tells Helene that he wants her to enjoy her cake before he tells her a \"terrible terrible thing\". Michael then announces he can't continue to date Helene \"in good conscience\" because of Pam's disapproval. Pam tells him that it is okay and that she's come around. Michael abandons that line of argument, and instead breaks up with Helene by telling her, in essence, that she is too old for him. Pam is angry, and Helene is seemingly ruined by the news.",
        "While Helene tries to get over the breakup, Dwight continues to help Andy, assisting him get something off a high shelf only to realize that it is in fact a gift for him (a $15 Starbucks gift card from the whole office).",
        "Michael, bribing Pam, offers to give her a raise on the condition that she stops being mad. When she's not happy with that, Michael invites Pam to hit him, and Pam says she will. She tells him that she will hit him that day after work, in the parking lot, as hard as she can, in front of everyone.",
        "Kelly and Ryan come to see Michael and to tell him that he is going to get punched hard. Nervously, Michael goes to Jim to ask him to stop Pam, but Jim toys with Michael, saying he needs some time to make a decision about it; \"no more than a week... maybe two weeks\".",
        "Toby talks to Pam and tells her that the punch needs to be off company property. He then advises her on how to punch with more force.",
        "The whole office waits outside to see Pam punch Michael, who is late. Once he shows up and says he's ready, as he's about to be hit he keeps wincing and blocking the anticipated punch with his hands. Michael then tells Pam that he is sorry, and after extracting some clarification on what he's sorry for, Pam lets him off the hook, warning him never to date a family member of hers again. He says okay, but as Pam turns away, he tries to get the last word by saying that \"for the record\" Helene came onto him. Pam abruptly turns around and slaps him hard, drawing a shocked reaction from the gathered crowd. Pam asks Michael if he is okay, but when he says \"no!\" like a crybaby, she brushes him off and walks away. Jim asks Pam if she feels better, but she says \"no, you were right\".",
        "Afterward, Dwight aids Michael by holding a frozen chicken part against his swollen cheek. Michael tells Dwight he owes him one. Dwight, not missing a beat, tells Michael he's cashing in the favor and that he wants Michael to fire Jim and promote him to \"tri-managers\". Michael refuses, and Dwight storms off, chicken in hand."
    ],
    "quotes": [
        [
            {
                "speaker": "Dwight",
                "content": " Can't a guy just buy some bagels for his friends so they'll owe him a favor which he can use to get someone fired who stole a co-manager position from him anymore? Geez. When did everyone get so cynical?"
            }
        ],
        [
            {
                "speaker": "Pam",
                "content": " (to Michael) Don't ever date a member of my family again."
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": "Okay, I promise. (as Pam is walking away): For the record your mom came on to me. (Pam slaps him)"
            }
        ]
    ]
}