{
    "season": 7,
    "title": "China",
    "episode": "10",
    "episodes": [
        10
    ],
    "coldOpens": [
        "When Dwight attempts to use his feet as hands around the office, Jim proves to him how his experiment will fail."
    ],
    "storylines": [
        "After reading a magazine article about the rise of China's economy, Michael gets frightened that the United States will fall victim to an evil ploy by the Chinese government due to its immense size. In an announcement, Michael asks the staff for ideas on how to boost the American economy and states a figure about how many cities China has that have over a million people. Oscar tries to correct him, but Ryan and Stanley research it which proves Michael correct.",
        "The entire staff jokes with Oscar for the rest of the day about being less intelligent than Michael, so Oscar invites Michael to coffee to one-up him in another conversation about China. Jim and Andy try to coach him, but Michael fumbles the conversation and Oscar nearly walks away victorious and smug from the debate. Michael, at the last minute, rebuts with an argument about friendship and conversation which has no relevance to the conversation but is delivered so passionately that the audience of Erin, Kelly, Ryan, Jim and Andy all applaud and congratulate him.",
        "As the new building owner, Dwight has made financial cutbacks, including installing motion-activated light sensors and half-ply toilet paper. Pam starts to argue against these changes, and as the new office administrator decides to find a new building to move into. Pam finds a new space for the office in a plush building. Dwight begins to get worried, but finds out she made up the office as leverage. He starts to put pressure on her, and she confides in Jim that she doesn't want to be a failure as office administrator.",
        "Dwight overhears and sets up a ploy for Pam to find out about tenant rights, which she uses against Dwight. He makes the changes and confides in the camera that it was because he is not a compassionate person, although a candid smile may reveal otherwise.",
        "Darryl confronts Andy about sending him stupid text messages, but Andy continues to text him. Darryl draws the line and gives Andy one more do-or-be-blocked message. Andy texts him about pigeons in the parking lot, and Darryl reluctantly goes but ends up enjoying the birds eating ice cream."
    ]
}