{
    "season": 7,
    "title": "PDA",
    "episode": "16",
    "episodes": [
        16
    ],
    "coldOpens": [
        "Darryl's grandmother has passed away. Pam attempts to console him with a signed card from Dunder-Mifflin employees, but it was mistaken for a birthday card, thus prompting a party celebration. Darryl sheds a tear for the camera."
    ],
    "storylines": [
        "In the cold open, Pam comes into Darryl's office and tries to comfort him because of the loss of his nearly 97 year old grandmother. She hands him a card and he opens it. He reads aloud some notes from co-workers that tell him things like \"days like this don't come often enough.\" Pam tells him some people might have thought it was his birthday. The suspicion is confirmed when Dwight and Andy come in and give Darryl birthday wishes. He turns to the camera as Andy gives him a playful punch, a tear rolling out of his eye.",
        "Michael and Holly have started dating again, and their public displays of affection start to make everyone in the office uncomfortable, despite the fact they are all happy for the couple. Gabe holds a meeting about PDA, saying that Sabre is tolerant of office relationships, but not PDA, pointing the finger at Michael and Holly (who are shocked that the PDA meeting is about them). They both agree to stop, but while Holly follows through, Michael can't help himself.",
        "Michael then declares to the office that he genuinely loves Holly, who is at first taken aback, but then reciprocates. When Michael and Holly make a scene complaining about not being able to touch each other, Gabe reprimands them, suggesting that they are acting this way to have a full on relationship before Toby returns from jury duty, which would send Holly back to Nashua. Michael then becomes worried that they will have to break up again, but Holly assures him that they can make it work. Michael points out that they broke up the last time because of that and can't see Holly for the rest of the day.",
        "Michael then confronts Holly to tell her that he is breaking up with her. Holly, however, says that they should decide for themselves and not let the company decide their future. They both resolve to move in together and announce it to the office.",
        "Jim and Pam have too much champagne during lunch, causing complications when they have to return to work. During the PDA meeting, Dwight mentions a list of people who have had sex in the workplace, and Jim and Pam (along with Kevin, Oscar, Stanley, Erin, Andy, and Gabe) are not mentioned. Due to their intoxication, they both agree to give it a try, but they have a hard time finding a place to do it, from hidden places in the warehouse to Ryan's closet. They eventually return from the closet by accounting with ruffled hair and wrinkled clothing. The two tell the interviewers that they left for a walk, but Pam smirks at the camera as the scene ends.",
        "Andy tags along on a romantic treasure hunt Gabe has made for Erin, despite the fact that he is dating a friend of Darryl's named Rachel, who was the only other Caucasian at one of Darryl's parties. Andy is at first reluctant but relents at Erin's friendly urging. The hunt starts with a puzzle picture, which leads to Gabe's stereo in Darryl's office, which leads to glow in the dark stars in Ryan's closet, leading to sparkling cider with Hank the security guard, and finally to a Valentine's cookie in the break room. When the cookie tells her to enjoy her Valentine's kiss, Erin thinks she's supposed to kiss Andy. Andy points out Gabe blowing a kiss through the window and leaves awkwardly."
    ],
    "quotes": [
        [
            {
                "speaker": "Michael",
                "content": " Holly and I are like Romeo and Juliet, and the office is like the dragon that kept them apart."
            }
        ],
        [
            {
                "speaker": "Erin",
                "content": " So tell me about your new girlfriend."
            }
        ],
        [
            {
                "speaker": "Andy",
                "content": " She's neat. I met her at Darryl's cousin's party. We were the only two white people there."
            }
        ],
        [
            {
                "speaker": "Erin",
                "content": " Aw, cute."
            }
        ],
        [
            {
                "speaker": "Dwight",
                "content": " I have had intercourse in the office."
            }
        ],
        [
            {
                "speaker": "Michael",
                "content": " Alright--"
            }
        ],
        [
            {
                "speaker": "Dwight",
                "content": " As has Angela."
            }
        ],
        [
            {
                "speaker": "Angela",
                "content": " Dwight!"
            }
        ],
        [
            {
                "speaker": "Dwight",
                "content": " As has Ryan, as has Kelly, as has Meredith, as has Phyllis, as has Darryl, as has Creed, as has Michael and as has Holly!"
            }
        ],
        [
            {
                "speaker": "Kevin",
                "content": " As has Kevin."
            }
        ],
        [
            {
                "speaker": "Angela",
                "content": " With who?"
            }
        ],
        [
            {
                "speaker": "Kevin",
                "content": " She goes to another school."
            }
        ],
        [
            {
                "speaker": "Ryan",
                "content": " Anybody can be Prince Charming one day a year, with the dinner and the flowers and all that, but you know what impresses me? When a guy can do that no days a year"
            }
        ]
    ]
}