{
    "season": 7,
    "title": "The Seminar",
    "episode": "14",
    "episodes": [
        14
    ],
    "episodeDetails": {
        "sections": [
            {
                "title": "The Seminar",
                "level": 1,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "\"The Seminar\" is the fourteenth episode of the seventh season of the American television comedy series The Office and the 140th episode overall. It was written by Steve Hely and directed by B.J. Novak. It originally aired on January 27, 2011. It was viewed by 7.93 million people."
                    }
                ],
                "images": []
            },
            {
                "title": "Synopsis",
                "level": 2,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "In the cold open, Michael bumps into David Brent outside an elevator. After realizing David is English, Michael tells him about a character he came up with and they immediately begin to tell each other racist jokes about British and Chinese people. When David points out the politically-incorrect nature of their joking, Michael corrects him saying it's just comedy and David agrees, saying, \"Comedy is a place where the mind goes to tickle itself\", then adding Michael's favorite catch phrase \"That's what she said.\" Michael then gives David a hug, and David asks if Dunder Mifflin is hiring. Michael says \"not right now\" and David asks him to drop a line if they do have any openings."
                    },
                    {
                        "type": "paragraph",
                        "text": "In order to improve his worst-in-office sales totals Andy decides to hold a seminar on starting a small business. He originally enlists Jim to be one of the guest speakers, but Jim abruptly pulls out when he sees one of the audience members and quickly leaves. Seeing Jim leave, the other speakers (Dwight, Phyllis and Stanley) also pull out leaving Andy to replace them with Kevin, Creed and Ryan. Kevin's speech goes bad when he gets ill from running around the room and vomits in front of the audience. Kelly, who replaces Ryan, makes things slightly better when she calls up an old professor from her management training time at Yale (whom she may have slept with) to talk business lessons, but Creed ruins it when he goes into a speech about the Loch Ness Monster."
                    },
                    {
                        "type": "paragraph",
                        "text": "Meanwhile, Erin is trying to beat Gabe in a game of Scrabble. Unfortunately, she's not very good, and the winner of their Scrabble games always picks the movie they watch. Since Gabe has already subjected her to numerous horror movies such as The Shining and The Ring, Erin desperately needs a win. With the help of Oscar and Pam, she almost beats Gabe but loses on the last turn, because she doesn't realize Oscar is trying to feed her a winning word (\"apoplexy\") and instead puts in the word \"ape\"."
                    },
                    {
                        "type": "paragraph",
                        "text": "After Jim spends all day outside of the office, Pam forces him to tell the camera crew why he's avoiding the guy he saw at the seminar. He and the man were childhood friends who were placed in separate reading groups in school (Jim was in the superior one). After his mom told him to hang out with his \"smart\" friends, Jim told his friend that \"mom says you're too dumb to hang out with.\" Jim eventually bumps into the guy in the break room, and tries to laugh off their history, but the guy mocks Jim for not being as successful as his superior intellect would have indicated, and snarks \"Where's your jet pack, Zuckerberg?\""
                    },
                    {
                        "type": "paragraph",
                        "text": "Back at Andy's seminar, Dwight talks to one of the attendees, a man who owns a golf supply business, and realizes that this could actually be a good opportunity for the sales team. He, along with Phyllis and Stanley, try to rejoin Andy, who refuses at Darryl's prompting. At the end of the seminar, Andy is able to sell three packages, thanks to the advice of Michael, who has taken a Greek persona of \"Mykonos\" in order to impress Holly, who has broken up with AJ. With Holly playing his wife \"Necropolis\", Michael professes his love to her (in character). She amusedly walks away but Michael is hopeful."
                    },
                    {
                        "type": "paragraph",
                        "text": "At the end of the day, Gabe shows Erin the movie they'll be watching that night, Hardware, which involves a killer robot (calling it a compromise because Erin wanted to watch WALL-E). As he is leaving, a confident Andy, who is still trying to win Erin back, hands her a copy of Shrek 2, leaving Erin visibly pleased."
                    }
                ],
                "images": []
            },
            {
                "title": "Cultural references",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Michael meets David Brent, his counterpart from the original UK series The Office.",
                                "elements": []
                            },
                            {
                                "text": "Andy calls Jim \"Tuna Turner\", this is a play of words combining Andy's nickname for Jim (Big Tuna) and the singer Tina Turner. He also calls Jim \"simply the best\", like in Turner's hit song \"The Best\".",
                                "elements": []
                            },
                            {
                                "text": "Amuse-bouche is a single, bite-sized first course meal.",
                                "elements": []
                            },
                            {
                                "text": "Erin lists the movies Gabe has picked for them to watch: The Shining, Rosemary's Baby and The Ring, all horror movies.",
                                "elements": []
                            },
                            {
                                "text": "Mykonos calls the musical Grease \"home\", most likely because it sounds like \"Greece\", even though there's nothing Greek about the story of it.",
                                "elements": []
                            },
                            {
                                "text": "Creed describes something he believes to be the Loch Ness Monster.",
                                "elements": []
                            },
                            {
                                "text": "Gabe wants to watch Suspiria, another horror film, while Erin's film of choice is the computer-animated romantic sci-fi WALL-E.",
                                "elements": []
                            },
                            {
                                "text": "Gabe thinks Erin is living out some sort of Slumdog Millionaire situation. This is reference to the movie where the main character plays \"Who Wants to be a Millionaire\" and surprisingly answers all the questions correctly because they all related to his childhood and upbringing. This movie was also referenced in Company Picnic, as the skit Michael and Holly performed was a Dunder Mifflin-themed parody of the movie.",
                                "elements": []
                            },
                            {
                                "text": "Tom calls Jim Zuckerberg, the inventor of Facebook who was a billionaire by the age of 23.",
                                "elements": []
                            },
                            {
                                "text": "When Oscar gives Erin the phone to put in the final word to beat Gabe, he says he will have \"apoplexy\" if she doesn't win. Apoplexy is unconsciousness from a stroke, and Oscar is also hinting that this is the word she must put in.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Connections to previous episodes",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Michael tells David about his character Ping (The Dundies).",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Trivia/Continuity",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "This episode is rich in people's different characters/brands:",
                                "elements": []
                            }
                        ]
                    },
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Kelly's are \"the business bitch, the diet bitch, the shopping bitch, the etiquette bitch\";",
                                "elements": []
                            },
                            {
                                "text": "Michael mentions Ping and Reginald Poofter, then spends his day as Mykonos;",
                                "elements": []
                            },
                            {
                                "text": "Holly does a foreign impression;",
                                "elements": []
                            },
                            {
                                "text": "David Brent does his Chinese character, much to Michael's joy.",
                                "elements": []
                            }
                        ]
                    },
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Andy is outsold by Madge, Hidetoshi, and Glenn who are all warehouse delivery drivers.",
                                "elements": []
                            },
                            {
                                "text": "Both Michael and David have an offensive Chinese character.",
                                "elements": []
                            },
                            {
                                "text": "David asks Michael if Dunder Mifflin-Sabre had any jobs going, and later in the season David does a web interview for an opening.",
                                "elements": []
                            },
                            {
                                "text": "Stanley does not appear on Andy's flier for his business seminar, however he is one of the speakers who eventually backs out.",
                                "elements": []
                            },
                            {
                                "text": "Jim outsells Dwight in November, December, and January, even though Dwight is often regarded as the best salesman in the company. This may be partly explained by the \"hot sales streak\" Jim was on in WUPHF.com, which aired in November.",
                                "elements": []
                            },
                            {
                                "text": "Judging by the way that he answers the phone, it appears Kelly had a relationship with the professor while at Yale.",
                                "elements": []
                            },
                            {
                                "text": "Gabe has a Macbook Pro on his desk instead of a normal PC like all the other desks in the office have.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Cast",
                "level": 2,
                "content": [],
                "images": []
            },
            {
                "title": "Main Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Steve Carell as Michael Scott",
                                "elements": []
                            },
                            {
                                "text": "Rainn Wilson as Dwight Schrute",
                                "elements": []
                            },
                            {
                                "text": "John Krasinski as Jim Halpert",
                                "elements": []
                            },
                            {
                                "text": "Jenna Fischer as Pam Halpert",
                                "elements": []
                            },
                            {
                                "text": "B.J. Novak as Ryan Howard",
                                "elements": []
                            },
                            {
                                "text": "Ed Helms as Andy Bernard",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Supporting Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Leslie David Baker as Stanley Hudson",
                                "elements": []
                            },
                            {
                                "text": "Brian Baumgartner as Kevin Malone",
                                "elements": []
                            },
                            {
                                "text": "Creed Bratton (actor) as Creed Bratton",
                                "elements": []
                            },
                            {
                                "text": "Kate Flannery as Meredith Palmer",
                                "elements": []
                            },
                            {
                                "text": "Mindy Kaling as Kelly Kapoor",
                                "elements": []
                            },
                            {
                                "text": "Ellie Kemper as Erin Hannon",
                                "elements": []
                            },
                            {
                                "text": "Angela Kinsey as Angela Martin",
                                "elements": []
                            },
                            {
                                "text": "Oscar Nunez as Oscar Martinez",
                                "elements": []
                            },
                            {
                                "text": "Craig Robinson as Darryl Philbin",
                                "elements": []
                            },
                            {
                                "text": "Phyllis Smith as Phyllis Vance",
                                "elements": []
                            },
                            {
                                "text": "Zach Woods as Gabe Lewis",
                                "elements": []
                            },
                            {
                                "text": "Amy Ryan as Holly Flax",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Recurring Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Hugh Dane as Hank Tate",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Guest Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Greg Tuculescu as Tom",
                                "elements": []
                            },
                            {
                                "text": "Michael Tuba Heatherton as Seminar Attendee",
                                "elements": []
                            },
                            {
                                "text": "Janet Hoskins as Seminar Attendee",
                                "elements": []
                            },
                            {
                                "text": "Kim Kim as Seminar Attendee",
                                "elements": []
                            },
                            {
                                "text": "Christopher Nicholas Smith as Seminar Attendee",
                                "elements": []
                            },
                            {
                                "text": "Janet Song as Seminar Attendee",
                                "elements": []
                            },
                            {
                                "text": "Charles C. Stevenson Jr. as Seminar Attendee",
                                "elements": []
                            },
                            {
                                "text": "Ricky Gervais as David Brent (Uncredited)",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            }
        ]
    },
    "quotesDetails": {
        "sections": [
            {
                "title": "The Seminar Quotes",
                "level": 1,
                "content": [],
                "images": []
            }
        ]
    },
    "coldOpens": [
        "Ricky Gervais guest stars when Michael Scott and his British The Office counterpart, David Brent, meet at last. "
    ],
    "storylines": [
        "In the cold open, Michael bumps into David Brent outside an elevator. After realizing David is English, Michael tells him about a character he came up with and they immediately begin to tell each other racist jokes about British and Chinese people. When David points out the politically-incorrect nature of their joking, Michael corrects him saying it's just comedy and David agrees, saying, \"Comedy is a place where the mind goes to tickle itself\", then adding Michael's favorite catch phrase \"That's what she said.\" Michael then gives David a hug, and David asks if Dunder Mifflin is hiring. Michael says \"not right now\" and David asks him to drop a line if they do have any openings.",
        "In order to improve his worst-in-office sales totals Andy decides to hold a seminar on starting a small business. He originally enlists Jim to be one of the guest speakers, but Jim abruptly pulls out when he sees one of the audience members and quickly leaves. Seeing Jim leave, the other speakers (Dwight, Phyllis and Stanley) also pull out leaving Andy to replace them with Kevin, Creed and Ryan. Kevin's speech goes bad when he gets ill from running around the room and vomits in front of the audience. Kelly, who replaces Ryan, makes things slightly better when she calls up an old professor from her management training time at Yale (whom she may have slept with) to talk business lessons, but Creed ruins it when he goes into a speech about the Loch Ness Monster.",
        "Meanwhile, Erin is trying to beat Gabe in a game of Scrabble. Unfortunately, she's not very good, and the winner of their Scrabble games always picks the movie they watch. Since Gabe has already subjected her to numerous horror movies such as The Shining and The Ring, Erin desperately needs a win. With the help of Oscar and Pam, she almost beats Gabe but loses on the last turn, because she doesn't realize Oscar is trying to feed her a winning word (\"apoplexy\") and instead puts in the word \"ape\".",
        "After Jim spends all day outside of the office, Pam forces him to tell the camera crew why he's avoiding the guy he saw at the seminar. He and the man were childhood friends who were placed in separate reading groups in school (Jim was in the superior one). After his mom told him to hang out with his \"smart\" friends, Jim told his friend that \"mom says you're too dumb to hang out with.\" Jim eventually bumps into the guy in the break room, and tries to laugh off their history, but the guy mocks Jim for not being as successful as his superior intellect would have indicated, and snarks \"Where's your jet pack, Zuckerberg?\"",
        "Back at Andy's seminar, Dwight talks to one of the attendees, a man who owns a golf supply business, and realizes that this could actually be a good opportunity for the sales team. He, along with Phyllis and Stanley, try to rejoin Andy, who refuses at Darryl's prompting. At the end of the seminar, Andy is able to sell three packages, thanks to the advice of Michael, who has taken a Greek persona of \"Mykonos\" in order to impress Holly, who has broken up with AJ. With Holly playing his wife \"Necropolis\", Michael professes his love to her (in character). She amusedly walks away but Michael is hopeful.",
        "At the end of the day, Gabe shows Erin the movie they'll be watching that night, Hardware, which involves a killer robot (calling it a compromise because Erin wanted to watch WALL-E). As he is leaving, a confident Andy, who is still trying to win Erin back, hands her a copy of Shrek 2, leaving Erin visibly pleased."
    ]
}