{
    "season": 7,
    "title": "Garage Sale",
    "episode": "19",
    "episodes": [
        19
    ],
    "coldOpens": [
        "The office holds a garage sale in the warehouse. After Dwight lets the cold air from outside into the warehouse, Andy wrestles him to try and close the door. "
    ],
    "storylines": [
        "Michael decides to propose to Holly, and runs into trouble thinking of how to do it in the most elaborate way possible with his expensive diamond ring (bought with a \"three year's salary\"). His original idea is to pour gasoline in the parking lot in the shape of letters, light them on fire, and show it to Holly. Pam quickly stops it before Michael destroys the entire office.",
        "Everyone Michael consults, Pam, Jim, Ryan, and Oscar, believe Holly truly is \"the one\" for him and they give him anecdotes and ideas. He decides to call Holly's father to ask his permission (although he leaves a message rather than speak to him personally). Holly catches onto the idea when she calls her parents herself, but she notices her dad seeming somewhat mentally disoriented. She talks to Michael later and says she wants to move back to Colorado to be there for her dad whom she is worried about, and Michael supports her decision. She tries proposing to Michael herself, but Michael quickly ends the conversation before she can ask him, since he wants to propose and not be proposed to. She misunderstands his intentions (thinking he does not want to marry her rather than him disagreeing with the method in the proposal) and is shocked.",
        "Michael takes Holly on a walk through the office, pointing out the locations of various events throughout their courtship. He opens the door to the kitchen, revealing all of the other employees holding candles. Various members of the office ask Holly if she will marry them (all of Michael's plan) and she politely says no. Michael then leads Holly out to her desk, which is surrounded by dozens, if not hundreds of candles. Michael gets down on his knee and begins to make a speech when the sprinklers go off from the candles in the office.",
        "The water drenches everyone in the office and Michael proposes in a speech pattern similar to Yoda, reminiscent of the Season 4 finale when Holly is trying to fix her chair, as well as when Jim proposes to Pam in the rain in the Season 5 premiere. Holly accepts. They laugh and take it in stride. Everyone then begins to congratulate Michael. However, Michael announces he is moving to Colorado with Holly. The scene ends with his employees in shock.",
        "Meanwhile, Dunder Mifflin Scranton's warehouse and crew host a public garage sale. During the sale, Dwight attempts to walk away with the most expensive item by trading smaller items with his office mates beginning with a red thumbtack (a reference to One red paperclip) and continuously trading up from table to table. One item on Jim and Pam's table that piques his interest is a packet of \"miracle legumes.\" Dwight initially believes that they contain no magic, but is astonished when they reappear after Jim had seemingly destroyed the packet. Eventually, his curiosity gets the better of him and he trades Jim a telescope for the legumes. At the end of the episode, Dwight is seen planting the seeds and Jim secretly replaces the empty pots with full-grown plants. Andy, Darryl, and Kevin play and bet on the Dallas board game (which Kevin had for sale). As the instruction booklet is not with the game, Andy and Darryl make up the rules as they go along, much to Kevin's objection. Eventually, Kevin notices the money they had bet on the game with is missing, and storms out. As Darryl and Andy look at each other in confusion, Kevin reveals to the cameras that he has the money, stating, \"And that... is Dallas\", mocking Andy and Darryl's previous statement."
    ]
}