{
    "season": 7,
    "title": "Garage Sale",
    "episode": "19",
    "episodes": [
        19
    ],
    "episodeDetails": {
        "sections": [
            {
                "title": "Garage Sale",
                "level": 1,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "\"Garage Sale\" is the nineteenth episode of the seventh season of the American television comedy series The Office and is the show's 145th episode overall. It was written by Jon Vitti and directed by Steve Carell. It originally aired on March 24, 2011. It was viewed by 7.07 million people."
                    }
                ],
                "images": []
            },
            {
                "title": "Plot",
                "level": 2,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Michael decides to propose to Holly, and runs into trouble thinking of how to do it in the most elaborate way possible with his expensive diamond ring (bought with a \"three year's salary\"). His original idea is to pour gasoline in the parking lot in the shape of letters, light them on fire, and show it to Holly. Pam quickly stops it before Michael destroys the entire office."
                    },
                    {
                        "type": "paragraph",
                        "text": "Everyone Michael consults, Pam, Jim, Ryan, and Oscar, believe Holly truly is \"the one\" for him and they give him anecdotes and ideas. He decides to call Holly's father to ask his permission (although he leaves a message rather than speak to him personally). Holly catches onto the idea when she calls her parents herself, but she notices her dad seeming somewhat mentally disoriented. She talks to Michael later and says she wants to move back to Colorado to be there for her dad whom she is worried about, and Michael supports her decision. She tries proposing to Michael herself, but Michael quickly ends the conversation before she can ask him, since he wants to propose and not be proposed to. She misunderstands his intentions (thinking he does not want to marry her rather than him disagreeing with the method in the proposal) and is shocked."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael takes Holly on a walk through the office, pointing out the locations of various events throughout their courtship. He opens the door to the kitchen, revealing all of the other employees holding candles. Various members of the office ask Holly if she will marry them (all of Michael's plan) and she politely says no. Michael then leads Holly out to her desk, which is surrounded by dozens, if not hundreds of candles. Michael gets down on his knee and begins to make a speech when the sprinklers go off from the candles in the office."
                    },
                    {
                        "type": "paragraph",
                        "text": "The water drenches everyone in the office and Michael proposes in a speech pattern similar to Yoda, reminiscent of the Season 4 finale when Holly is trying to fix her chair, as well as when Jim proposes to Pam in the rain in the Season 5 premiere. Holly accepts. They laugh and take it in stride. Everyone then begins to congratulate Michael. However, Michael announces he is moving to Colorado with Holly. The scene ends with his employees in shock."
                    },
                    {
                        "type": "paragraph",
                        "text": "Meanwhile, Dunder Mifflin Scranton's warehouse and crew host a public garage sale. During the sale, Dwight attempts to walk away with the most expensive item by trading smaller items with his office mates beginning with a red thumbtack (a reference to One red paperclip) and continuously trading up from table to table. One item on Jim and Pam's table that piques his interest is a packet of \"miracle legumes.\" Dwight initially believes that they contain no magic, but is astonished when they reappear after Jim had seemingly destroyed the packet. Eventually, his curiosity gets the better of him and he trades Jim a telescope for the legumes. At the end of the episode, Dwight is seen planting the seeds and Jim secretly replaces the empty pots with full-grown plants. Andy, Darryl, and Kevin play and bet on the Dallas board game (which Kevin had for sale). As the instruction booklet is not with the game, Andy and Darryl make up the rules as they go along, much to Kevin's objection. Eventually, Kevin notices the money they had bet on the game with is missing, and storms out. As Darryl and Andy look at each other in confusion, Kevin reveals to the cameras that he has the money, stating, \"And that... is Dallas\", mocking Andy and Darryl's previous statement."
                    }
                ],
                "images": []
            },
            {
                "title": "Dwight's trades",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Dwight's thumbtack for Meredith's used candle;",
                                "elements": []
                            },
                            {
                                "text": "Meredith's candle for Kelly's Helen Fielding and Jennifer Weiner collections of books;",
                                "elements": []
                            },
                            {
                                "text": "Kelly's books for Phyllis' plastic lobster;",
                                "elements": []
                            },
                            {
                                "text": "Phyllis' lobster for Oscar's umbrella;",
                                "elements": []
                            },
                            {
                                "text": "Oscar's umbrella for Stanley's old photo album;",
                                "elements": []
                            },
                            {
                                "text": "Stanley's photo album for a box of Ryan's pesto;",
                                "elements": []
                            },
                            {
                                "text": "Ryan's pesto for Creed's harmonica;",
                                "elements": []
                            },
                            {
                                "text": "Creed's harmonica for \"a very cute squid that Erin happened to have\";",
                                "elements": []
                            },
                            {
                                "text": "Pie for Stanley's telescope;",
                                "elements": []
                            },
                            {
                                "text": "Stanley's Telescope for Jim's \"Professor Copperfield's Miracle Legumes\".",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Cultural references",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Will & Grace is the most successful TV series with gay principal characters. Oscar is not a fan of the show.",
                                "elements": []
                            },
                            {
                                "text": "Kevin's grammar mistake makes him sound like he was on Dallas, the TV series.",
                                "elements": []
                            },
                            {
                                "text": "Pesto is an Italian basil-based sauce. Salsa is a Mexican tomato-based hot sauce.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Connections to previous episodes",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Michael is selling his St. Pauli Girl neon beer sign from the episode Dinner Party. Unlike Jan, who hated it, Holly offers to have her \"neon guy\" take a look at it.",
                                "elements": []
                            },
                            {
                                "text": "Jim and Pam are selling the clown picture from Jim and Pam's house. Jim states he finally got it down, and the two laugh.",
                                "elements": []
                            },
                            {
                                "text": "Michael's call to Holly's dad combines two of his old tricks:",
                                "elements": []
                            }
                        ]
                    },
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Michael fake-fires Holly (Pam in Pilot, Stanley in Did I Stutter?, Erin in Casual Friday).",
                                "elements": []
                            },
                            {
                                "text": "He leaves an entire one-way conversation on an answering machine (Women's Appreciation).",
                                "elements": []
                            }
                        ]
                    },
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Kevin's skills at poker were previously shown in Casino Night.",
                                "elements": []
                            },
                            {
                                "text": "Michael called Holly about his herpes scare in Sex Ed.",
                                "elements": []
                            },
                            {
                                "text": "Michael Klump and obesity awareness are from Weight Loss.",
                                "elements": []
                            },
                            {
                                "text": "Holly found out about Meredith prostituting in Business Ethics.",
                                "elements": []
                            },
                            {
                                "text": "Before the sprinklers go off, Michael says \"It started with a broken-\". The next word was most likely \"chair,\" as Holly and Michael's friendship began with a broken chair in Goodbye, Toby.",
                                "elements": []
                            },
                            {
                                "text": "Michael fell in love with Holly in the Annex, at her desk, most likely the moment they sat on the ground and exchanged Yoda impressions in Goodbye, Toby. He calls this the happiest day of his life. Michael's marriage proposal and Holly's answer mirror that moment clearly.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Trivia/Continuity",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Michael claims that one of his favorite moments was when Toby announced that he was moving to Costa Rica in Night Out; however, Michael was not present when he made this announcement, as he was out clubbing in New York City with Ryan and Dwight. (someone from work may have contacted Michael the next day)",
                                "elements": []
                            },
                            {
                                "text": "This episodes shows that Dwight's Coffee Corner sells adult magazines.",
                                "elements": []
                            },
                            {
                                "text": "Holly is proposed to 6 times before Michael and Michael makes fun of almost everyone,",
                                "elements": [
                                    {
                                        "text": "Jim (Michael says nothing, possibly because of his preference for Jim)",
                                        "elements": []
                                    },
                                    {
                                        "text": "Stanley (\"That guy's got more than he can handle as it is,\" a reference to Stanley's affairs)",
                                        "elements": []
                                    },
                                    {
                                        "text": "Oscar (\"That marriage would be a sham,\" a reference to Oscar's homosexuality)",
                                        "elements": []
                                    },
                                    {
                                        "text": "Gabe (\"Easy no.\")",
                                        "elements": []
                                    },
                                    {
                                        "text": "Angela (\"That would be hot, I would pay to see that.\")",
                                        "elements": []
                                    },
                                    {
                                        "text": "Ryan (\"Only one I was kind of worried about.\")",
                                        "elements": []
                                    }
                                ]
                            },
                            {
                                "text": "Earlier in the episode, Michael makes fun of Jim's proposal to Pam for it being in the rain. During Michael's proposal, the smoke detector goes off, triggering sprinklers. A possible callback.",
                                "elements": []
                            },
                            {
                                "text": "Holly's first and last episodes in the series both include an engagement.",
                                "elements": []
                            },
                            {
                                "text": "Kevin does not recognize the difference between the words \"on\" and \"in\".",
                                "elements": []
                            },
                            {
                                "text": "Holly's father calls Holly \"Hollis\", which as seen on her name plate is her full name.",
                                "elements": []
                            },
                            {
                                "text": "Dwight's Caffeine Corner sells Hank's album.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Cast",
                "level": 2,
                "content": [],
                "images": []
            },
            {
                "title": "Main Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Steve Carell as Michael Scott",
                                "elements": []
                            },
                            {
                                "text": "Rainn Wilson as Dwight Schrute",
                                "elements": []
                            },
                            {
                                "text": "John Krasinski as Jim Halpert",
                                "elements": []
                            },
                            {
                                "text": "Jenna Fischer as Pam Halpert",
                                "elements": []
                            },
                            {
                                "text": "B.J. Novak as Ryan Howard",
                                "elements": []
                            },
                            {
                                "text": "Ed Helms as Andy Bernard",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Supporting Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Leslie David Baker as Stanley Hudson",
                                "elements": []
                            },
                            {
                                "text": "Brian Baumgartner as Kevin Malone",
                                "elements": []
                            },
                            {
                                "text": "Creed Bratton (actor) as Creed Bratton",
                                "elements": []
                            },
                            {
                                "text": "Kate Flannery as Meredith Palmer",
                                "elements": []
                            },
                            {
                                "text": "Mindy Kaling as Kelly Kapoor",
                                "elements": []
                            },
                            {
                                "text": "Ellie Kemper as Erin Hannon",
                                "elements": []
                            },
                            {
                                "text": "Angela Kinsey as Angela Martin",
                                "elements": []
                            },
                            {
                                "text": "Oscar Nunez as Oscar Martinez",
                                "elements": []
                            },
                            {
                                "text": "Craig Robinson as Darryl Philbin",
                                "elements": []
                            },
                            {
                                "text": "Phyllis Smith as Phyllis Vance",
                                "elements": []
                            },
                            {
                                "text": "Zach Woods as Gabe Lewis",
                                "elements": []
                            },
                            {
                                "text": "Amy Ryan as Holly Flax",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Recurring Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Hugh Dane as Hank Tate",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Guest Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Barbara Allyne-Bennet as Old Lady",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            }
        ]
    },
    "quotesDetails": {
        "sections": [
            {
                "title": "Garage Sale Quotes",
                "level": 1,
                "content": [],
                "images": []
            }
        ]
    },
    "coldOpens": [
        "The office holds a garage sale in the warehouse. After Dwight lets the cold air from outside into the warehouse, Andy wrestles him to try and close the door. "
    ],
    "storylines": [
        "Michael decides to propose to Holly, and runs into trouble thinking of how to do it in the most elaborate way possible with his expensive diamond ring (bought with a \"three year's salary\"). His original idea is to pour gasoline in the parking lot in the shape of letters, light them on fire, and show it to Holly. Pam quickly stops it before Michael destroys the entire office.",
        "Everyone Michael consults, Pam, Jim, Ryan, and Oscar, believe Holly truly is \"the one\" for him and they give him anecdotes and ideas. He decides to call Holly's father to ask his permission (although he leaves a message rather than speak to him personally). Holly catches onto the idea when she calls her parents herself, but she notices her dad seeming somewhat mentally disoriented. She talks to Michael later and says she wants to move back to Colorado to be there for her dad whom she is worried about, and Michael supports her decision. She tries proposing to Michael herself, but Michael quickly ends the conversation before she can ask him, since he wants to propose and not be proposed to. She misunderstands his intentions (thinking he does not want to marry her rather than him disagreeing with the method in the proposal) and is shocked.",
        "Michael takes Holly on a walk through the office, pointing out the locations of various events throughout their courtship. He opens the door to the kitchen, revealing all of the other employees holding candles. Various members of the office ask Holly if she will marry them (all of Michael's plan) and she politely says no. Michael then leads Holly out to her desk, which is surrounded by dozens, if not hundreds of candles. Michael gets down on his knee and begins to make a speech when the sprinklers go off from the candles in the office.",
        "The water drenches everyone in the office and Michael proposes in a speech pattern similar to Yoda, reminiscent of the Season 4 finale when Holly is trying to fix her chair, as well as when Jim proposes to Pam in the rain in the Season 5 premiere. Holly accepts. They laugh and take it in stride. Everyone then begins to congratulate Michael. However, Michael announces he is moving to Colorado with Holly. The scene ends with his employees in shock.",
        "Meanwhile, Dunder Mifflin Scranton's warehouse and crew host a public garage sale. During the sale, Dwight attempts to walk away with the most expensive item by trading smaller items with his office mates beginning with a red thumbtack (a reference to One red paperclip) and continuously trading up from table to table. One item on Jim and Pam's table that piques his interest is a packet of \"miracle legumes.\" Dwight initially believes that they contain no magic, but is astonished when they reappear after Jim had seemingly destroyed the packet. Eventually, his curiosity gets the better of him and he trades Jim a telescope for the legumes. At the end of the episode, Dwight is seen planting the seeds and Jim secretly replaces the empty pots with full-grown plants. Andy, Darryl, and Kevin play and bet on the Dallas board game (which Kevin had for sale). As the instruction booklet is not with the game, Andy and Darryl make up the rules as they go along, much to Kevin's objection. Eventually, Kevin notices the money they had bet on the game with is missing, and storms out. As Darryl and Andy look at each other in confusion, Kevin reveals to the cameras that he has the money, stating, \"And that... is Dallas\", mocking Andy and Darryl's previous statement."
    ]
}