{
    "season": 7,
    "title": "The Search",
    "episode": "15",
    "episodes": [
        15
    ],
    "coldOpens": [
        "Ryan and Kelly announce their pending divorce but the rest of the office was unaware of their past nuptials. "
    ],
    "storylines": [
        "Michael continues to try to ask Holly to get back together with him, but she continually refuses, stating she doesn't want a relationship with someone she works with. Michael and Jim then go out on a sales call. After landing the sale, an irritable Michael needs to stop to use the bathroom. While at a gas station, Jim gets a call from Pam's mother Helene, who was taking a feverish Cece to see the doctor when she accidentally locked the child in the car. Jim leaves to attend to Cece, but not before attempting in vain to tell Michael through the door of the bathroom; he also tells a guy in coveralls to tell Michael what happened, but the guy is a customer rather than a gas station employee and drives away. Michael is left at the gas station with no way of contacting the office, as his cell phone and wallet are with Jim and he doesn't remember the office's number, so he ends up wandering around Scranton and making stops at a pet store and a hot dog stand.",
        "Jim, now with Cece, calls Pam and tells her Michael is at the gas station, so Holly, Dwight, and Erin plan to head out before Dwight insults them both and says he'll lead the expedition. Dwight and Erin are rude to Holly, but when Dwight suggests that he walked back to the office, Holly correctly guesses that he went in the direction of the bakery next door \"just for the smell of it\". After stopping at a grocery store to get some things for Pam, Dwight and Erin notice Holly changing cell phone services at a kiosk outside the store. They and the kiosk attendant are annoyed to discover that Holly used a joke name to complete the forms in order to get a rubber stress ball, but when the attendant mentions that someone else had done the exact thing earlier, Dwight and Erin recognize a fake name that is used by Michael. Believing that Holly can subconsciously determine where Michael has been, they follow her to a Chinese restaurant, where they find his picture on the wall along with others who have dined there without paying (Creed also being among them, twice).",
        "Michael eventually runs away from the camera crew so they can't find him. Dwight demands Holly to tell him where Michael is, but Holly says she doesn't know. She suggests that they find a high vantage point at which they can try to spot him, but Dwight rejects this idea, and the two split up. Holly walks away while Dwight decides to look in a bowling alley. Holly heads up to the roof of a tall building to see if she can spot Michael from above. On the roof, she finds Michael who was similarly trying to spot the office from above. They both admit that they've missed each other and kiss. Erin, who opted to follow Holly instead of Dwight, walks in and is happy for Michael.",
        "Meanwhile, Pam notices her Sabre printer doodle on the refrigerator has funny captions that insult Sabre, and she gets the office to participate in a caption contest involving a cartoon of two dogs on a tropical island. Gabe, who finds the captions insulting, implements a list of annoying rules, stating that they can't insult Sabre or use pop culture references, and that they have to use new Sabre \"sticky quips\". The office instead decides to use an instant messenger to share quips. Gabe catches them and prints out the list of quips and reads them to the office, which start off insulting Sabre before they attack Gabe personally. The favored entry involves one where one of the dogs says he's going to piss on one of the palm trees because it reminds him of Gabe; an interview reveals that Angela came up with that one. The office continues to get good laughs out of the ones that insult Gabe, who is once again defeated and miserable."
    ]
}