{
    "season": 7,
    "title": "PDA",
    "episode": "16",
    "episodes": [
        16
    ],
    "episodeDetails": {
        "sections": [
            {
                "title": "PDA",
                "level": 1,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "\"PDA\" is the sixteenth episode of the seventh season of the American television comedy series The Office and the show's 142nd overall. It was written by Robert Padnick and directed by Greg Daniels. It originally aired on February 10, 2011. It was viewed by 6.90 million people."
                    }
                ],
                "images": []
            },
            {
                "title": "Plot",
                "level": 2,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "In the cold open, Pam comes into Darryl's office and tries to comfort him because of the loss of his nearly 97 year old grandmother. She hands him a card and he opens it. He reads aloud some notes from co-workers that tell him things like \"days like this don't come often enough.\" Pam tells him some people might have thought it was his birthday. The suspicion is confirmed when Dwight and Andy come in and give Darryl birthday wishes. He turns to the camera as Andy gives him a playful punch, a tear rolling out of his eye."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael and Holly have started dating again, and their public displays of affection start to make everyone in the office uncomfortable, despite the fact they are all happy for the couple. Gabe holds a meeting about PDA, saying that Sabre is tolerant of office relationships, but not PDA, pointing the finger at Michael and Holly (who are shocked that the PDA meeting is about them). They both agree to stop, but while Holly follows through, Michael can't help himself."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael then declares to the office that he genuinely loves Holly, who is at first taken aback, but then reciprocates. When Michael and Holly make a scene complaining about not being able to touch each other, Gabe reprimands them, suggesting that they are acting this way to have a full on relationship before Toby returns from jury duty, which would send Holly back to Nashua. Michael then becomes worried that they will have to break up again, but Holly assures him that they can make it work. Michael points out that they broke up the last time because of that and can't see Holly for the rest of the day."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael then confronts Holly to tell her that he is breaking up with her. Holly, however, says that they should decide for themselves and not let the company decide their future. They both resolve to move in together and announce it to the office."
                    },
                    {
                        "type": "paragraph",
                        "text": "Jim and Pam have too much champagne during lunch, causing complications when they have to return to work. During the PDA meeting, Dwight mentions a list of people who have had sex in the workplace, and Jim and Pam (along with Kevin, Oscar, Stanley, Erin, Andy, and Gabe) are not mentioned. Due to their intoxication, they both agree to give it a try, but they have a hard time finding a place to do it, from hidden places in the warehouse to Ryan's closet. They eventually return from the closet by accounting with ruffled hair and wrinkled clothing. The two tell the interviewers that they left for a walk, but Pam smirks at the camera as the scene ends."
                    },
                    {
                        "type": "paragraph",
                        "text": "Andy tags along on a romantic treasure hunt Gabe has made for Erin, despite the fact that he is dating a friend of Darryl's named Rachel, who was the only other Caucasian at one of Darryl's parties. Andy is at first reluctant but relents at Erin's friendly urging. The hunt starts with a puzzle picture, which leads to Gabe's stereo in Darryl's office, which leads to glow in the dark stars in Ryan's closet, leading to sparkling cider with Hank the security guard, and finally to a Valentine's cookie in the break room. When the cookie tells her to enjoy her Valentine's kiss, Erin thinks she's supposed to kiss Andy. Andy points out Gabe blowing a kiss through the window and leaves awkwardly."
                    }
                ],
                "images": []
            },
            {
                "title": "Cultural references",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "PDA stands for public displays of affection.",
                                "elements": []
                            },
                            {
                                "text": "Michael calls Dunder Mifflin a \"division of Taliban enterprises\". The Taliban is an Islamic fundamentalist political movement known for its strict ideologies.",
                                "elements": []
                            },
                            {
                                "text": "Michael also seems to think that there was a dragon that kept Romeo and Juliet apart. There were no dragons in this particular play by Shakespeare.",
                                "elements": []
                            },
                            {
                                "text": "Gabe asks Michael and Holly if they're doing MDMA \"The street name: Ecstasy\". The drug often increases sexual stamina, which relates to Michael and Holly's feverent passion toward each other.",
                                "elements": []
                            },
                            {
                                "text": "Michael has a movie idea: \"Boner Bomb: Starring Jason Statham or Jesse Eisenberg or Michael Cera\".",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Connections to previous episodes",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "In Blood Drive, Phyllis and Bob Vance have sex in a public restroom. This season it's Jim and Pam who have sex in a public place on Valentine's Day (in the closet).",
                                "elements": []
                            },
                            {
                                "text": "Michael says \"Whispering and tickling have their place in business!\" This could be a little reference to his negotiation tactics from Wikipedia in The Negotiation and the tickling method called \"fluffy fingers\" he learned from Darryl in Did I Stutter?.",
                                "elements": []
                            },
                            {
                                "text": "Jim enthusiastically jumps into a big box in the warehouse, reminiscent of Dwight in The Alliance.",
                                "elements": []
                            },
                            {
                                "text": "Gabe puts a Sticky-Quip on the radio that Erin must find. Gabe promoted Sticky-Quips as a new product from Dunder Mifflin-Sabre in the previous episode, The Search.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Trivia/Continuity",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Holly says that Michael can put both his legs behind his head. This contradicts Goodbye, Toby, where Michael tells Holly he can't even sit cross-legged, much less do yoga.",
                                "elements": []
                            },
                            {
                                "text": "As the timeline of Philip Halpert's birth is unclear, there is a slight chance that he was conceived during this episode.",
                                "elements": []
                            },
                            {
                                "text": "In the prologue of this episode, Darryl's grandmother recently passed away, and both Dwight and Andy believe it is his birthday due to the fact that they were signing a card. When Andy starts to deliver Darryl's \"birthday punches\", he begins to count his way up. The camera then cuts to Pam apologizing, and then back to Darryl, who has a tear in his eye. When the camera cuts back to Darryl, Andy's voice is not synced up with the audio playing. This may be due to the fact that actor Craig Robinson cannot cry on command, and filming needed to be cut in order to apply fake tears to Robinson's eyes.",
                                "elements": []
                            },
                            {
                                "text": "Dwight is on board with the hookup zone idea, even though he already hooked up with Angela in the warehouse closet several times.",
                                "elements": []
                            },
                            {
                                "text": "When Jim and Pam walk out of the camera crew closet, they say they went on a walk, but later in the series when we actually see this closet it is just a closet, there is no door to outside.",
                                "elements": []
                            },
                            {
                                "text": "Dwight mentions all people who have had sex in the office: Dwight, Angela, Ryan, Kelly, Meredith, Phyllis, Darryl, Creed, Michael and Holly.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Cast",
                "level": 2,
                "content": [],
                "images": []
            },
            {
                "title": "Main Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Steve Carell as Michael Scott",
                                "elements": []
                            },
                            {
                                "text": "Rainn Wilson as Dwight Schrute",
                                "elements": []
                            },
                            {
                                "text": "John Krasinski as Jim Halpert",
                                "elements": []
                            },
                            {
                                "text": "Jenna Fischer as Pam Halpert",
                                "elements": []
                            },
                            {
                                "text": "B.J. Novak as Ryan Howard",
                                "elements": []
                            },
                            {
                                "text": "Ed Helms as Andy Bernard",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Supporting Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Leslie David Baker as Stanley Hudson",
                                "elements": []
                            },
                            {
                                "text": "Brian Baumgartner as Kevin Malone",
                                "elements": []
                            },
                            {
                                "text": "Creed Bratton (actor) as Creed Bratton",
                                "elements": []
                            },
                            {
                                "text": "Kate Flannery as Meredith Palmer",
                                "elements": []
                            },
                            {
                                "text": "Mindy Kaling as Kelly Kapoor",
                                "elements": []
                            },
                            {
                                "text": "Ellie Kemper as Erin Hannon",
                                "elements": []
                            },
                            {
                                "text": "Angela Kinsey as Angela Martin",
                                "elements": []
                            },
                            {
                                "text": "Oscar Nunez as Oscar Martinez",
                                "elements": []
                            },
                            {
                                "text": "Craig Robinson as Darryl Philbin",
                                "elements": []
                            },
                            {
                                "text": "Phyllis Smith as Phyllis Vance",
                                "elements": []
                            },
                            {
                                "text": "Zach Woods as Gabe Lewis",
                                "elements": []
                            },
                            {
                                "text": "Amy Ryan as Holly Flax",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Recurring Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Hugh Dane as Hank Tate",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            }
        ]
    },
    "quotesDetails": {
        "sections": [
            {
                "title": "PDA Quotes",
                "level": 1,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Michael: Holly and I are like Romeo and Juliet, and the office is like the dragon that kept them apart."
                    },
                    {
                        "type": "paragraph",
                        "text": "Erin: So tell me about your new girlfriend."
                    },
                    {
                        "type": "paragraph",
                        "text": "Andy: She's neat. I met her at Darryl's cousin's party. We were the only two white people there."
                    },
                    {
                        "type": "paragraph",
                        "text": "Erin: Aw, cute."
                    },
                    {
                        "type": "paragraph",
                        "text": "Dwight: I have had intercourse in the office."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael: Alright--"
                    },
                    {
                        "type": "paragraph",
                        "text": "Dwight: As has Angela."
                    },
                    {
                        "type": "paragraph",
                        "text": "Angela: Dwight!"
                    },
                    {
                        "type": "paragraph",
                        "text": "Dwight: As has Ryan, as has Kelly, as has Meredith, as has Phyllis, as has Darryl, as has Creed, as has Michael and as has Holly!"
                    },
                    {
                        "type": "paragraph",
                        "text": "Kevin: As has Kevin."
                    },
                    {
                        "type": "paragraph",
                        "text": "Angela: With who?"
                    },
                    {
                        "type": "paragraph",
                        "text": "Kevin: She goes to another school."
                    },
                    {
                        "type": "paragraph",
                        "text": "Ryan: Anybody can be Prince Charming one day a year, with the dinner and the flowers and all that, but you know what impresses me? When a guy can do that no days a year"
                    }
                ],
                "images": []
            }
        ]
    },
    "coldOpens": [
        "Darryl's grandmother has passed away. Pam attempts to console him with a signed card from Dunder-Mifflin employees, but it was mistaken for a birthday card, thus prompting a party celebration. Darryl sheds a tear for the camera."
    ],
    "storylines": [
        "In the cold open, Pam comes into Darryl's office and tries to comfort him because of the loss of his nearly 97 year old grandmother. She hands him a card and he opens it. He reads aloud some notes from co-workers that tell him things like \"days like this don't come often enough.\" Pam tells him some people might have thought it was his birthday. The suspicion is confirmed when Dwight and Andy come in and give Darryl birthday wishes. He turns to the camera as Andy gives him a playful punch, a tear rolling out of his eye.",
        "Michael and Holly have started dating again, and their public displays of affection start to make everyone in the office uncomfortable, despite the fact they are all happy for the couple. Gabe holds a meeting about PDA, saying that Sabre is tolerant of office relationships, but not PDA, pointing the finger at Michael and Holly (who are shocked that the PDA meeting is about them). They both agree to stop, but while Holly follows through, Michael can't help himself.",
        "Michael then declares to the office that he genuinely loves Holly, who is at first taken aback, but then reciprocates. When Michael and Holly make a scene complaining about not being able to touch each other, Gabe reprimands them, suggesting that they are acting this way to have a full on relationship before Toby returns from jury duty, which would send Holly back to Nashua. Michael then becomes worried that they will have to break up again, but Holly assures him that they can make it work. Michael points out that they broke up the last time because of that and can't see Holly for the rest of the day.",
        "Michael then confronts Holly to tell her that he is breaking up with her. Holly, however, says that they should decide for themselves and not let the company decide their future. They both resolve to move in together and announce it to the office.",
        "Jim and Pam have too much champagne during lunch, causing complications when they have to return to work. During the PDA meeting, Dwight mentions a list of people who have had sex in the workplace, and Jim and Pam (along with Kevin, Oscar, Stanley, Erin, Andy, and Gabe) are not mentioned. Due to their intoxication, they both agree to give it a try, but they have a hard time finding a place to do it, from hidden places in the warehouse to Ryan's closet. They eventually return from the closet by accounting with ruffled hair and wrinkled clothing. The two tell the interviewers that they left for a walk, but Pam smirks at the camera as the scene ends.",
        "Andy tags along on a romantic treasure hunt Gabe has made for Erin, despite the fact that he is dating a friend of Darryl's named Rachel, who was the only other Caucasian at one of Darryl's parties. Andy is at first reluctant but relents at Erin's friendly urging. The hunt starts with a puzzle picture, which leads to Gabe's stereo in Darryl's office, which leads to glow in the dark stars in Ryan's closet, leading to sparkling cider with Hank the security guard, and finally to a Valentine's cookie in the break room. When the cookie tells her to enjoy her Valentine's kiss, Erin thinks she's supposed to kiss Andy. Andy points out Gabe blowing a kiss through the window and leaves awkwardly."
    ],
    "quotes": [
        "Michael: Holly and I are like Romeo and Juliet, and the office is like the dragon that kept them apart.",
        "Erin: So tell me about your new girlfriend.",
        "Andy: She's neat. I met her at Darryl's cousin's party. We were the only two white people there.",
        "Erin: Aw, cute.",
        "Dwight: I have had intercourse in the office.",
        "Michael: Alright--",
        "Dwight: As has Angela.",
        "Angela: Dwight!",
        "Dwight: As has Ryan, as has Kelly, as has Meredith, as has Phyllis, as has Darryl, as has Creed, as has Michael and as has Holly!",
        "Kevin: As has Kevin.",
        "Angela: With who?",
        "Kevin: She goes to another school.",
        "Ryan: Anybody can be Prince Charming one day a year, with the dinner and the flowers and all that, but you know what impresses me? When a guy can do that no days a year"
    ]
}