{
    "season": 7,
    "title": "Classy Christmas",
    "episode": "11/12",
    "episodes": [
        11,
        12
    ],
    "episodeDetails": {
        "sections": [
            {
                "title": "Classy Christmas",
                "level": 1,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "\"Classy Christmas\" is the collective name for the eleventh and twelfth episodes of the seventh season of The Office, and the show's 137th and 138th episodes overall. It was played in two separate \"parts\". It was written by Mindy Kaling and directed by Rainn Wilson. It originally aired on December 9, 2010. It was viewed by 7.18 million people."
                    }
                ],
                "images": []
            },
            {
                "title": "Summary",
                "level": 2,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Michael finds out that Holly will be replacing Toby while he is out on jury duty, and demands that Pam throw a new Christmas party to celebrate Holly's return. Michael wants the Christmas party to be \"classy\", and is resistant to doing any typical Christmas stuff that would be too childish or unsophisticated. He is under the impression that Holly will be single when she arrives, even though last time he saw her, she was dating A.J., her boyfriend from her last job. Pam gives Jim a homemade comic book for Christmas (The Adventures Of Jimmy Halpert), and worries that Jim may not like it, but he loves it and is extremely touched."
                    },
                    {
                        "type": "paragraph",
                        "text": "Meanwhile, Darryl is worried that his daughter doesn't want to spend Christmas with him. He decides that he will try and convince her to spend Christmas with him by bringing her to the office Christmas party. He is dismayed when he finds out that Michael has decided to make the party \"classy\", thus making it no fun for kids. The employees of the office team up to give Darryl's daughter a fun scavenger hunt so she will be more interested in spending Christmas with her father. In the end she chooses to spend Christmas with Darryl, and Michael eventually dresses up in a traditional Santa costume."
                    },
                    {
                        "type": "paragraph",
                        "text": "When Holly arrives, it turns out she is still dating her boyfriend, despite living far away from him. It is clear that she is somewhat disappointed that he hasn't proposed yet, and the women in the office encourage her to give him an ultimatum, which she decides to do. Michael is so upset about her still being with A.J. that he takes it upon himself to vandalize a “Toy Story” doll of Woody that A.J. gave her, which she keeps at her desk. She angrily asks who did it and after trying to frame Toby, Michael admits it was him and that he did it out of jealousy. Later he overhears her tell A.J. that she was the one who accidentally spilled food on the doll, and realizes that she’s forgiven him. Pam sees an upset Michael leave the party and follows him outside to tell him about the ultimatum, and points out that it means Holly and A.J.’s relationship probably won’t work out. Michael agrees and says he’s prepared to wait it out."
                    },
                    {
                        "type": "paragraph",
                        "text": "Dwight challenges Jim to a snowball fight, which at first is all in good fun, but eventually gets intense. Jim is haunted constantly by the threat of getting hit with a snowball, and Dwight uses fear as his main weapon, disguising himself as a snowman in the parking lot in order to pound Jim with snowballs. Jim leaves work to find the parking lot populated with snowmen and frantically smashes them as a satisfied Dwight observes from the roof."
                    }
                ],
                "images": []
            },
            {
                "title": "Cultural references",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "A comptroller is a management level position responsible for supervising the quality of accounting and financial reporting of an organization. Kevin, an accountant himself, doesn't know what a comptroller is.",
                                "elements": []
                            },
                            {
                                "text": "Michael's does a little scat singing when talking about how boring he finds jazz.",
                                "elements": []
                            },
                            {
                                "text": "Holly's doll is Woody from Toy Story.",
                                "elements": []
                            },
                            {
                                "text": "Nora Ephron was a writer best known for her romantic comedies When Harry Met Sally... and Sleepless In Seattle.",
                                "elements": []
                            },
                            {
                                "text": "The Grinch is a fictional character created by Dr. Seuss.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Trivia",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Pam gets a fake Christmas tree for the office. In Secret Santa, however, she seems disappointed when Jim and Dwight reveal a fake Christmas tree.",
                                "elements": []
                            },
                            {
                                "text": "When Jim throws a snowball at Dwight, Pam seems to be the only one that doesn't find it funny, which is very uncharacteristic of her.",
                                "elements": []
                            },
                            {
                                "text": "Dwight has a Zippo lighter in his desk, an unusual item for someone who doesn't smoke since it has to be recharged from time to time even if not used regularly.",
                                "elements": []
                            },
                            {
                                "text": "The story Michael makes up to make Holly jealous is ridiculously ill-conceived, as would be expected of Michael. He mentions going to JFK Airport to go back to Scranton, which is 2 1/2 hours from New York by car, as established in Casino Night. Also, the airport that serves Scranton doesn't have flights to or from JFK.",
                                "elements": []
                            },
                            {
                                "text": "Even though Phyllis was very set on being Santa in the previous Christmas episode, she seems very happy to see Michael in his Santa suit.",
                                "elements": []
                            },
                            {
                                "text": "When Michael gives Kelly the fast food receipt in lieu of a mall receipt, she asks him how many Number Nines he ordered. This is in reference to Michael's love of McDonald's Filet of Fish Meals, or \"Number Nines\", recalling the numerous Number Nine wrappers Ryan and Michael clean out of Michael's car in the episode \"Hot Girl\".",
                                "elements": []
                            },
                            {
                                "text": "When Holly says to Michael, \"I didn't know you had a girlfriend\", Michael responds, \"I do, she is.\", as if he expected her next question to be \"Is she real?\"",
                                "elements": []
                            },
                            {
                                "text": "Andy asks Jada if she knows the number of representatives the state of Pennsylvania is guaranteed, and when she says she doesn't know, he asks if she knows what other state has the equal number. However, if she didn't know how many representatives Pennsylvania has, then she couldn't know the state that has the equal number.",
                                "elements": []
                            },
                            {
                                "text": "The tracks \"King O' Swing\" by Gotthard Welker and \"Hark! The Herald Angels Sing\" by Stan Reynolds are featured in this episode.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Goofs",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Erin states that she does not know who Holly is, despite the fact that Erin was at the company picnic in Company Picnic, in which Holly performed in front of the whole company.",
                                "elements": []
                            },
                            {
                                "text": "Jim flinches before opening the present Dwight made look like was from Pam, shooting a snowball at his face, indicating that he knew this was going to happen although it was a surprise.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Connections to previous episodes",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "This is the second time one of the employees breaks a window in the conference room. Michael used a projector to break a window in Stress Relief. Coincidentally, both of these episodes were the first part of a two-part episode.",
                                "elements": []
                            },
                            {
                                "text": "When A.J. arrives at the office he says it’s to surprise Holly, however it’s more likely he came because of the history between Holly and Michael that he didn’t know about until Lecture Circuit Part 2 and further awkwardly witnessed in Company Picnic.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Cast",
                "level": 2,
                "content": [],
                "images": []
            },
            {
                "title": "Main Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Steve Carell as Michael Scott",
                                "elements": []
                            },
                            {
                                "text": "Rainn Wilson as Dwight Schrute",
                                "elements": []
                            },
                            {
                                "text": "John Krasinski as Jim Halpert",
                                "elements": []
                            },
                            {
                                "text": "Jenna Fischer as Pam Halpert",
                                "elements": []
                            },
                            {
                                "text": "B.J. Novak as Ryan Howard",
                                "elements": []
                            },
                            {
                                "text": "Ed Helms as Andy Bernard",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Supporting Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Leslie David Baker as Stanley Hudson",
                                "elements": []
                            },
                            {
                                "text": "Brian Baumgartner as Kevin Malone",
                                "elements": []
                            },
                            {
                                "text": "Creed Bratton (actor) as Creed Bratton",
                                "elements": []
                            },
                            {
                                "text": "Kate Flannery as Meredith Palmer",
                                "elements": []
                            },
                            {
                                "text": "Mindy Kaling as Kelly Kapoor",
                                "elements": []
                            },
                            {
                                "text": "Ellie Kemper as Erin Hannon",
                                "elements": []
                            },
                            {
                                "text": "Angela Kinsey as Angela Martin",
                                "elements": []
                            },
                            {
                                "text": "Paul Lieberstein as Toby Flenderson",
                                "elements": []
                            },
                            {
                                "text": "Oscar Nunez as Oscar Martinez",
                                "elements": []
                            },
                            {
                                "text": "Craig Robinson as Darryl Philbin",
                                "elements": []
                            },
                            {
                                "text": "Phyllis Smith as Phyllis Vance",
                                "elements": []
                            },
                            {
                                "text": "Zach Woods as Gabe Lewis",
                                "elements": []
                            },
                            {
                                "text": "Amy Ryan as Holly Flax",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Recurring Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Mark Proksch as Nate",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Guest Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Rob Huebel as A.J.",
                                "elements": []
                            },
                            {
                                "text": "Jack Coleman as State Senator Robert Lipton",
                                "elements": []
                            },
                            {
                                "text": "Taylar Holloman as Jada",
                                "elements": []
                            },
                            {
                                "text": "Jonathan Pintoff as Bassist",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            }
        ]
    },
    "quotesDetails": {
        "sections": [
            {
                "title": "Classy Christmas Quotes",
                "level": 1,
                "content": [],
                "images": []
            }
        ]
    },
    "coldOpens": [
        "The office poses for their annual Christmas card but can't decide on the right pose or get it right."
    ],
    "storylines": [
        "Michael finds out that Holly will be replacing Toby while he is out on jury duty, and demands that Pam throw a new Christmas party to celebrate Holly's return. Michael wants the Christmas party to be \"classy\", and is resistant to doing any typical Christmas stuff that would be too childish or unsophisticated. He is under the impression that Holly will be single when she arrives, even though last time he saw her, she was dating A.J., her boyfriend from her last job. Pam gives Jim a homemade comic book for Christmas (The Adventures Of Jimmy Halpert), and worries that Jim may not like it, but he loves it and is extremely touched.",
        "Meanwhile, Darryl is worried that his daughter doesn't want to spend Christmas with him. He decides that he will try and convince her to spend Christmas with him by bringing her to the office Christmas party. He is dismayed when he finds out that Michael has decided to make the party \"classy\", thus making it no fun for kids. The employees of the office team up to give Darryl's daughter a fun scavenger hunt so she will be more interested in spending Christmas with her father. In the end she chooses to spend Christmas with Darryl, and Michael eventually dresses up in a traditional Santa costume.",
        "When Holly arrives, it turns out she is still dating her boyfriend, despite living far away from him. It is clear that she is somewhat disappointed that he hasn't proposed yet, and the women in the office encourage her to give him an ultimatum, which she decides to do. Michael is so upset about her still being with A.J. that he takes it upon himself to vandalize a “Toy Story” doll of Woody that A.J. gave her, which she keeps at her desk. She angrily asks who did it and after trying to frame Toby, Michael admits it was him and that he did it out of jealousy. Later he overhears her tell A.J. that she was the one who accidentally spilled food on the doll, and realizes that she’s forgiven him. Pam sees an upset Michael leave the party and follows him outside to tell him about the ultimatum, and points out that it means Holly and A.J.’s relationship probably won’t work out. Michael agrees and says he’s prepared to wait it out.",
        "Dwight challenges Jim to a snowball fight, which at first is all in good fun, but eventually gets intense. Jim is haunted constantly by the threat of getting hit with a snowball, and Dwight uses fear as his main weapon, disguising himself as a snowman in the parking lot in order to pound Jim with snowballs. Jim leaves work to find the parking lot populated with snowmen and frantically smashes them as a satisfied Dwight observes from the roof."
    ]
}