{
    "season": 7,
    "title": "Threat Level Midnight",
    "episode": "17",
    "episodes": [
        17
    ],
    "episodeDetails": {
        "sections": [
            {
                "title": "Threat Level Midnight",
                "level": 1,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "\"Threat Level Midnight\" is the seventeenth episode of the seventh season of the American television comedy The Office and the 143rd episode overall. Written by B.J. Novak and directed by Tucker Gates, the episode aired on NBC on February 17, 2011 and was viewed by 6.41 million people."
                    }
                ],
                "images": []
            },
            {
                "title": "Summary",
                "level": 2,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Scarn is sitting at his desk, pretending to type while a worker tries to shoot him, but he fires back, killing the worker. There is a cut-back to reality where Michael explains that he has spent 10 years on the making of this movie."
                    },
                    {
                        "type": "paragraph",
                        "text": "Erin tells everyone that Michael has completed his movie and will let everyone watch it if interested. By this time, Jim and Pam are telling the camera that the movie is a great lost film and stars each employee from years' past. There was an original test of the movie, but everyone laughed because they thought it was a comedy, which Michael was easily offended by.  \"It's like a home movie if Michael Scott did your home movie,\" Pam and Jim tell the camera. While Agent Michael Scarn (played by Michael) is lying hungover in his bed, the camera pans through newspaper clippings of Scarn's rise and then downfall to the loss of his career. Scarn's robot butler, Samuel L. Chang (played by Dwight) comes to his attendance and tells Scarn that the President (Darryl) wants to see him. A cut back to the office where Dwight says that he believes Michael wanted him to be an advanced android, almost indistinguishable from a real human, which Michael contradicts, saying that Dwight doesn't play a robot. Darryl explains in another cut-back that he agreed to play the president because he wanted his daughter to see a black man as president."
                    },
                    {
                        "type": "paragraph",
                        "text": "While in the Oval Office (the conference room), The President warns Scarn that a bomb has been placed under the NHL All-Star Game stadium. The President, who owns the stadium, needs him to destroy the bomb because the stadium is his retirement plan. A coin toss, best of seven, will decide if Scarn chooses to go or to stay. After the coin decides that Scarn will stay, a scene shows everyone in the office is excited and pleased with the movie, and Michael is smiling. While the concession stands workers were all tied up and hostages to Goldenface (Jim), he explains how he didn't like the dialogue or character and only took the role to impress Pam (Hostage #1). Darryl says that he only took the role so his daughter could see a black man as president, which has become a moot point with the election of Barack Obama."
                    },
                    {
                        "type": "paragraph",
                        "text": "While Scarn is driving, the narrator (Stanley) is telling everyone how Scarn didn't know a hockey stick from a Slim Jim, so he goes to famed trainer Cherokee Jack (Creed) to find out how to play hockey since Scarn plans to sneak into stadium disguised as a player. At a pre-All-Star Game tryout between Skater #1 (Oscar), Scarn, and a masked man, the announcer (Ryan) is explaining how they only accept one civilian amateur each year to play in the All-Star Game. The masked man then reveals himself to be Goldenface, and he and Scarn have a shoot-out, but only as a distraction to make Scarn lose the speed-skating race. Scarn then proceeds to the locker room where he chokes Oscar's character with the American flag."
                    },
                    {
                        "type": "paragraph",
                        "text": "While at Scarn Manor, Samuel L. Chang receives an e-mail sent to Scarn to have him meet Jasmine Windsong (Jan) at The Funky Cat, the hippest jazz club in town. A scene shows Jan saying that Michael finishing his movie is \"great\", and then she can't get into her car. Back at the jazz club, Jasmine sings \"The hostages are under the stadium\"backward, giving Scarn clues to where the hostages are. Just then, Goldenface's henchman (Troy L. Underbridge) kills Jasmine with a blow dart. When Goldenface gets word of Scarn coming his way, he shoots Hostage #3's (Toby) head and it explodes. It proceeds to explode six different times, with a scene of Michael explaining that it was the most expensive shot of the movie, but it was \"integral\" [sic] to the plot line."
                    },
                    {
                        "type": "paragraph",
                        "text": "During the movie, Scarn and Chang bust through the gates and try to kill Goldenface. Goldenface tells Scarn that he has already murdered a hostage but Scarn tells him that man was a wanted animal rapist. Goldenface hands Scarn the puck (bomb) and says he won't kill anyone if Scarn forgives him for murdering his wife, Catherine Zeta-Scarn, and Scarn sees flashbacks in the puck. Scarn declines, and him (along with Chang) are shot. After waking up in the hospital to the sight of his nurse's (Helene Beesly) breasts, she explains that she wants to make sure everything is \"working properly.\" As they engage in sex, the heart monitor goes off, and Pam is clearly disgusted. Scarn heads back to the White House, where he learns that the President is allied with Goldenface and they try to kill him, revealing that the President was only interested in blowing up the stadium for the insurance money."
                    },
                    {
                        "type": "paragraph",
                        "text": "In the next scene, Scarn walks into the local pub, feeling down because he let everyone down. He then proceeds to talk to the bartender, Billy, (Andy) who says he is upset because his TV isn't working, and explains that there is a table of women that like to have fun. At the table, Babe #1 (Karen) asks Scarn if he's ever \"banged an entire bachelorette party,\" and it cuts to a scene of the camera crew finding Karen, and she asks why they singled out her line. To cheer Scarn up, Billy asks a kid to turn on the jukebox to \"The Scarn.\" While all the local drinkers (warehouse workers), Billy, the boy, and the babes all dance to the song, Jim is continually laughing. By the end of the song, the local drunk (Packer) explains that \"if doing the Scarn is gay, then I'm the biggest queer on earth,\" and Jim can't hold in his laughter."
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael, not wanting to repeat last time's viewing, turns off the movie, saying it wasn't good enough. Everyone says how much they love it and that Michael should enter it in festivals (or carnivals - Kevin), and Michael considers turning it back on. He asks Holly if she liked it, but she is obviously not impressed, and Michael leaves. Back in the office, Michael heads to the Annex where he explains to Holly that if he has no movie, then he has nothing, that nothing is real to him. Holly says that she's real, but Michael tells her that she is a pain in the ass (though apologizes) and heads back to watch the movie with the others."
                    },
                    {
                        "type": "paragraph",
                        "text": "During the All-Star Game, Chang tells Scarn that Cherokee Jack died. Scarn takes the puck and tries to win the game, and Michael explains that this scene was filmed at a real Scranton High School game which they had to forfeit due to interference. Michael leaves the conference room and finds Holly watching through the window. Michael tells Holly that the movie is not good and he leads her back into the screening with him."
                    },
                    {
                        "type": "paragraph",
                        "text": "Scarn eventually wins the trophy, saves the hostages and kills Goldenface and heads back to his manor where he is feeding himself and Chang (feeding him oil, which reminds Michael that Dwight was a robot). He gets a call from the President asking him to do another mission, to which he replies, \"I'm in.\" After the film, everyone is questioning Scarn's judgment because the President was evil. Dwight says that Scarn was trying to catch the President by joining him, but Michael says that Scarn was being stupid. Stanley then narrates and asks the viewers how he knew so much about Michael Scarn, before revealing Scarn sitting in a chair with Stanley's voice dubbed over him saying, \"because I AM Michael Scarn.\" At the end of the film, the credits roll, showing snapshots of the characters while Andy is singing \"Threat Level: Midnight.\""
                    }
                ],
                "images": [
                    {
                        "src": "https://vignette.wikia.nocookie.net/theoffice/images/4/43/The_Office_-_Threat_Level_Midnight/revision/latest/scale-to-width-down/297?cb=20190318012130",
                        "caption": "The Office - Threat Level Midnight \"Makes all the girlies feel alright\""
                    },
                    {
                        "src": "https://vignette.wikia.nocookie.net/theoffice/images/e/e6/Office9.png/revision/latest/scale-to-width-down/180?cb=20110403103218",
                        "caption": "Michael Scott as Michael Scarn"
                    }
                ]
            },
            {
                "title": "Cultural references",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Scarn, when recovering from gunshot wounds in the hospital, asks for more Tylenol, a mild pain reliever.",
                                "elements": []
                            },
                            {
                                "text": "Michael says he's a huge Woody Allen fan but has only seen Antz. Woody Allen mostly writes and directs romantic comedies and dramas, but Antz is a computer-animated comedy adventure film, where Allen simply provided the voice for one of the characters.",
                                "elements": []
                            },
                            {
                                "text": "Michael thought that A Bug's Life was much better than Antz.",
                                "elements": []
                            },
                            {
                                "text": "Scarn learning how to play hockey by mopping the ice is a reference to Karate Kid, in which Mr. Miyagi teaches the Karate Kid to fight by having him wax his car",
                                "elements": []
                            },
                            {
                                "text": "When Scarn enters the bar, everyone says \"Hi!\" in unison. This is a reference to the television show Cheers.",
                                "elements": []
                            },
                            {
                                "text": "Michael mocks Holly's review of his movie, saying that it's not like Oceans Eleven, and he cares how it turns out.",
                                "elements": []
                            },
                            {
                                "text": "The fast-paced string music towards the beginning of the film is taken from the soundtrack of The Bourne series of films.",
                                "elements": []
                            },
                            {
                                "text": "The name Goldenface could possibly be a reference to the villain of the James Bond movie, Goldfinger.",
                                "elements": []
                            },
                            {
                                "text": "One of the flashbacks that Michael Scarn sees in the hockey puck was copied from the movie Armageddon, in which A.J. Frost (Ben Affleck) plays with animal crackers on Grace Stamper's (Liv Tyler) stomach during their last afternoon together before he leaves on a dangerous mission in space. Another movie referenced is Die Hard when Karl tried to blow up McClane and tries it on the hostages.",
                                "elements": []
                            },
                            {
                                "text": "After the credits in the extended version, Scarn enters into his apartment hallway, asking why the audience is still here and says that the movie is over. This is copied from the movie Ferris Bueller's Day Off.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Amusing Details",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "The worker who delivers Michael Scarn a package in the cold open does not appear to be from the office like most of the other characters in the movie do.",
                                "elements": []
                            },
                            {
                                "text": "Scarn's house has Carol Stills' sign in front of it.",
                                "elements": []
                            },
                            {
                                "text": "The car that Scarn drives is very obviously not moving.",
                                "elements": []
                            },
                            {
                                "text": "Tony Gardner appears to be playing the piano at the Funky Cat. This is odd, as Tony only worked at Dunder Mifflin Scranton for less than a day.",
                                "elements": [
                                    {
                                        "text": "This would explain why Tony only appears for a couple of seconds before the piano stops and Michael is sitting on the bench.",
                                        "elements": []
                                    }
                                ]
                            },
                            {
                                "text": "The man who sold Ryan drugs while he worked at Corporate also appears in the Funky Cat.",
                                "elements": []
                            },
                            {
                                "text": "Helene appears in the movie, even though the rest of the footage seems to have been shot years earlier than when Michael was dating her.",
                                "elements": []
                            },
                            {
                                "text": "Michael Scarn's wishes to have been able to start a family with his wife mirror Michael's longing for a family in real life.",
                                "elements": []
                            },
                            {
                                "text": "One of the people doing \"The Scarn\" appears to be an employee of Vance Refrigeration, likely being one of the two guys who sold Michael \"weed\" in Frame Toby.",
                                "elements": []
                            },
                            {
                                "text": "A child jumps in while they are doing \"The Scarn\", even though they are in a bar seemingly late at night.",
                                "elements": []
                            },
                            {
                                "text": "Dwight's character slowly becomes more robotic as the movie progresses.",
                                "elements": []
                            },
                            {
                                "text": "Goldenface seems to have obtained the insurance money from destroying the stadium before it is actually destroyed because the puck flies towards him as he counts the money.",
                                "elements": []
                            },
                            {
                                "text": "Michael Scarn keeps repeating his catch phrase \"Clean up on aisle 5\", even in situations where it doesn't make any sense.",
                                "elements": []
                            },
                            {
                                "text": "Watch when Samuel tells Scarn Jack is dead, then immediately removes his hand.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Cast",
                "level": 2,
                "content": [],
                "images": []
            },
            {
                "title": "Main Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Steve Carell as Michael Scott",
                                "elements": []
                            },
                            {
                                "text": "Rainn Wilson as Dwight Schrute",
                                "elements": []
                            },
                            {
                                "text": "John Krasinski as Jim Halpert",
                                "elements": []
                            },
                            {
                                "text": "Jenna Fischer as Pam Halpert",
                                "elements": []
                            },
                            {
                                "text": "B.J. Novak as Ryan Howard",
                                "elements": []
                            },
                            {
                                "text": "Ed Helms as Andy Bernard",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Supporting Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Leslie David Baker as Stanley Hudson",
                                "elements": []
                            },
                            {
                                "text": "Brian Baumgartner as Kevin Malone",
                                "elements": []
                            },
                            {
                                "text": "Creed Bratton (actor) as Creed Bratton",
                                "elements": []
                            },
                            {
                                "text": "Kate Flannery as Meredith Palmer",
                                "elements": []
                            },
                            {
                                "text": "Mindy Kaling as Kelly Kapoor",
                                "elements": []
                            },
                            {
                                "text": "Ellie Kemper as Erin Hannon",
                                "elements": []
                            },
                            {
                                "text": "Angela Kinsey as Angela Martin",
                                "elements": []
                            },
                            {
                                "text": "Paul Lieberstein as Toby Flenderson",
                                "elements": []
                            },
                            {
                                "text": "Oscar Nunez as Oscar Martinez",
                                "elements": []
                            },
                            {
                                "text": "Craig Robinson as Darryl Philbin",
                                "elements": []
                            },
                            {
                                "text": "Phyllis Smith as Phyllis Vance",
                                "elements": []
                            },
                            {
                                "text": "Zach Woods as Gabe Lewis",
                                "elements": []
                            },
                            {
                                "text": "Amy Ryan as Holly Flax",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Special Guest Star",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Melora Hardin as Jan Levinson",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Recurring Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "David Denman as Roy Anderson",
                                "elements": []
                            },
                            {
                                "text": "Rashida Jones as Karen Filippelli",
                                "elements": []
                            },
                            {
                                "text": "David Koechner as Todd Packer",
                                "elements": []
                            },
                            {
                                "text": "Linda Purl as Helene Beesly",
                                "elements": []
                            },
                            {
                                "text": "Mike Bruner as Tony Gardner",
                                "elements": []
                            },
                            {
                                "text": "Lee Eisenberg as Gino",
                                "elements": []
                            },
                            {
                                "text": "Hidetoshi Imura as Hidetoshi Hasagawa",
                                "elements": []
                            },
                            {
                                "text": "Noel Petok as Troy Underbridge",
                                "elements": []
                            },
                            {
                                "text": "Karly Rothenberg as Madge Madsen",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Guest Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Greg Collins as Assassin",
                                "elements": []
                            },
                            {
                                "text": "Dan Goor as Bar Patron",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            }
        ]
    },
    "quotesDetails": {
        "sections": [
            {
                "title": "Threat Level Midnight Quotes",
                "level": 1,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "      Todd Packer: If doing the Scarn is Gay, then I'm the biggest Queer on Earth!"
                    }
                ],
                "images": []
            }
        ]
    },
    "coldOpens": [
        "The opening scene to Michael's movie  Threat Level Midnight opens this episode as Michael announces he is finally ready to premiere it to the office. "
    ],
    "storylines": [
        "Scarn is sitting at his desk, pretending to type while a worker tries to shoot him, but he fires back, killing the worker. There is a cut-back to reality where Michael explains that he has spent 10 years on the making of this movie.",
        "Erin tells everyone that Michael has completed his movie and will let everyone watch it if interested. By this time, Jim and Pam are telling the camera that the movie is a great lost film and stars each employee from years' past. There was an original test of the movie, but everyone laughed because they thought it was a comedy, which Michael was easily offended by.  \"It's like a home movie if Michael Scott did your home movie,\" Pam and Jim tell the camera. While Agent Michael Scarn (played by Michael) is lying hungover in his bed, the camera pans through newspaper clippings of Scarn's rise and then downfall to the loss of his career. Scarn's robot butler, Samuel L. Chang (played by Dwight) comes to his attendance and tells Scarn that the President (Darryl) wants to see him. A cut back to the office where Dwight says that he believes Michael wanted him to be an advanced android, almost indistinguishable from a real human, which Michael contradicts, saying that Dwight doesn't play a robot. Darryl explains in another cut-back that he agreed to play the president because he wanted his daughter to see a black man as president.",
        "While in the Oval Office (the conference room), The President warns Scarn that a bomb has been placed under the NHL All-Star Game stadium. The President, who owns the stadium, needs him to destroy the bomb because the stadium is his retirement plan. A coin toss, best of seven, will decide if Scarn chooses to go or to stay. After the coin decides that Scarn will stay, a scene shows everyone in the office is excited and pleased with the movie, and Michael is smiling. While the concession stands workers were all tied up and hostages to Goldenface (Jim), he explains how he didn't like the dialogue or character and only took the role to impress Pam (Hostage #1). Darryl says that he only took the role so his daughter could see a black man as president, which has become a moot point with the election of Barack Obama.",
        "While Scarn is driving, the narrator (Stanley) is telling everyone how Scarn didn't know a hockey stick from a Slim Jim, so he goes to famed trainer Cherokee Jack (Creed) to find out how to play hockey since Scarn plans to sneak into stadium disguised as a player. At a pre-All-Star Game tryout between Skater #1 (Oscar), Scarn, and a masked man, the announcer (Ryan) is explaining how they only accept one civilian amateur each year to play in the All-Star Game. The masked man then reveals himself to be Goldenface, and he and Scarn have a shoot-out, but only as a distraction to make Scarn lose the speed-skating race. Scarn then proceeds to the locker room where he chokes Oscar's character with the American flag.",
        "While at Scarn Manor, Samuel L. Chang receives an e-mail sent to Scarn to have him meet Jasmine Windsong (Jan) at The Funky Cat, the hippest jazz club in town. A scene shows Jan saying that Michael finishing his movie is \"great\", and then she can't get into her car. Back at the jazz club, Jasmine sings \"The hostages are under the stadium\"backward, giving Scarn clues to where the hostages are. Just then, Goldenface's henchman (Troy L. Underbridge) kills Jasmine with a blow dart. When Goldenface gets word of Scarn coming his way, he shoots Hostage #3's (Toby) head and it explodes. It proceeds to explode six different times, with a scene of Michael explaining that it was the most expensive shot of the movie, but it was \"integral\" [sic] to the plot line.",
        "During the movie, Scarn and Chang bust through the gates and try to kill Goldenface. Goldenface tells Scarn that he has already murdered a hostage but Scarn tells him that man was a wanted animal rapist. Goldenface hands Scarn the puck (bomb) and says he won't kill anyone if Scarn forgives him for murdering his wife, Catherine Zeta-Scarn, and Scarn sees flashbacks in the puck. Scarn declines, and him (along with Chang) are shot. After waking up in the hospital to the sight of his nurse's (Helene Beesly) breasts, she explains that she wants to make sure everything is \"working properly.\" As they engage in sex, the heart monitor goes off, and Pam is clearly disgusted. Scarn heads back to the White House, where he learns that the President is allied with Goldenface and they try to kill him, revealing that the President was only interested in blowing up the stadium for the insurance money.",
        "In the next scene, Scarn walks into the local pub, feeling down because he let everyone down. He then proceeds to talk to the bartender, Billy, (Andy) who says he is upset because his TV isn't working, and explains that there is a table of women that like to have fun. At the table, Babe #1 (Karen) asks Scarn if he's ever \"banged an entire bachelorette party,\" and it cuts to a scene of the camera crew finding Karen, and she asks why they singled out her line. To cheer Scarn up, Billy asks a kid to turn on the jukebox to \"The Scarn.\" While all the local drinkers (warehouse workers), Billy, the boy, and the babes all dance to the song, Jim is continually laughing. By the end of the song, the local drunk (Packer) explains that \"if doing the Scarn is gay, then I'm the biggest queer on earth,\" and Jim can't hold in his laughter.",
        "Michael, not wanting to repeat last time's viewing, turns off the movie, saying it wasn't good enough. Everyone says how much they love it and that Michael should enter it in festivals (or carnivals - Kevin), and Michael considers turning it back on. He asks Holly if she liked it, but she is obviously not impressed, and Michael leaves. Back in the office, Michael heads to the Annex where he explains to Holly that if he has no movie, then he has nothing, that nothing is real to him. Holly says that she's real, but Michael tells her that she is a pain in the ass (though apologizes) and heads back to watch the movie with the others.",
        "During the All-Star Game, Chang tells Scarn that Cherokee Jack died. Scarn takes the puck and tries to win the game, and Michael explains that this scene was filmed at a real Scranton High School game which they had to forfeit due to interference. Michael leaves the conference room and finds Holly watching through the window. Michael tells Holly that the movie is not good and he leads her back into the screening with him.",
        "Scarn eventually wins the trophy, saves the hostages and kills Goldenface and heads back to his manor where he is feeding himself and Chang (feeding him oil, which reminds Michael that Dwight was a robot). He gets a call from the President asking him to do another mission, to which he replies, \"I'm in.\" After the film, everyone is questioning Scarn's judgment because the President was evil. Dwight says that Scarn was trying to catch the President by joining him, but Michael says that Scarn was being stupid. Stanley then narrates and asks the viewers how he knew so much about Michael Scarn, before revealing Scarn sitting in a chair with Stanley's voice dubbed over him saying, \"because I AM Michael Scarn.\" At the end of the film, the credits roll, showing snapshots of the characters while Andy is singing \"Threat Level: Midnight.\""
    ],
    "quotes": [
        "      Todd Packer: If doing the Scarn is Gay, then I'm the biggest Queer on Earth!"
    ]
}