{
    "season": 7,
    "title": "Nepotism",
    "episode": "1",
    "episodes": [
        1
    ],
    "coldOpens": [
        "The Scranton branch make a lip dub of the Human Beinz' Nobody But Me."
    ],
    "storylines": [
        "The opening begins with various members of the office participating in a lip dub, with the exception of Toby, who is recording it.",
        "Michael reminisces over his summer, one in which he contracted West Nile virus and lost some weight. Gabe reveals that he started dating Erin over the summer, and both parties agree that they are enjoying the experience. Andy tries to remain calm at the prospect, but it is obvious he is mad at Gabe for stealing his girlfriend. He tries to calm himself by picturing himself at a calm beach, in which he sees a whale in the ocean...eating Gabe.",
        "Dwight discloses that he became the owner of the building over the summer and carries a key ring everywhere he goes. Kelly participated in the executive training program at Yale, which she claims has made her smart.",
        "The new assistant, Luke Cooper, arrives late with the employees' coffee and accidentally mixed up Darryl's order. Darryl begins to talk about his summer but expresses his dislike for Luke instead. In the break room, Oscar and Phyllis complain that they gave Luke packages to deliver to clients, none of which arrived at their destination. Michael defends Luke, however, much to the displeasure to the rest of the office.",
        "Jim tries to play a prank on Dwight by adding more keys to his key ring, but Pam laughs and exposes Jim's plan. Pam says she is sorry, but Jim is upset that he was unable to prank Dwight.",
        "As everyone in the office becomes increasingly annoyed with Luke, Michael continues to defend him. He holds a meeting for the purpose of telling everyone, \"Don't not bother Luke,\" and gets frustrated when his use of a double negative is pointed out. In the ensuing discussion, Michael makes an announcement: \"One more thing I did over the summer... I hired my nephew.\"",
        "Michael tries to justify hiring Luke by explaining that he had an ulterior motive; namely, he hoped that doing so would end hostilities between him and his half-sister (Luke's mother). He also reveals the cause of said hostilities, explaining that there was a time when he lost Luke in a forest.",
        "The rest of the office still persists in their demands for Michael to fire Luke, but he once again refuses.",
        "Pam, trying to make it up to Jim, decides to come up with a plan to prank Dwight. She seeks the help of Kevin to rewire the elevator, so the buttons do other things than what they really should. After text messaging Dwight, she boards the elevator to show him \"something in the lobby,\" but the plan backfires when they become trapped in the elevator due to the rewiring. Dwight starts to urinate in the elevator, which he states is due to all the water he has been drinking.",
        "In the parking lot, members of the office discover the packages that were never delivered all sitting in Luke's car. Meredith is able to break into the car so they retrieve the packages. With Luke now costing the office clients, Gabe and Michael confer with Sabre CEO Jo Bennett about the problem, and she sternly tells Michael to deal with the issue. When Luke continues to irritate the office, Michael gets fed up and repeatedly spanks him in front of the entire office.",
        "Luke runs away crying and quits his job, with the rest of the office satisfied that Luke will no longer be a problem to them.",
        "People from building maintenance are required to get Dwight and Pam out of the elevator. As it lowers to ground level, Jim is impressed with the prank Pam pulled on Dwight, despite the fact it had the opposite effect that Pam intended.",
        "In the final scene, Gabe informs Michael that because he spanked Luke (which was \"physical assault\" of an employee) he must either have a counseling session or be fired immediately. Michael takes the former option but finds out that the session will be with Toby, greatly upsetting Michael."
    ],
    "quotes": [
        [
            {
                "speaker": "Michael",
                "content": " Having Luke here is a pretty big deal for me, because his mother - who also happens to be my half-sister - kind of cut me off from that side of the family fifteen years ago...fourteen. The last time I saw Luke was the opening day of \"Ace Ventura II\" and that was '95, so yes, fifteen years on the dot. Anyway, I lost him in a forest."
            }
        ],
        [
            {
                "speaker": "Jim",
                "content": " Hey let me help you down."
            }
        ],
        [
            {
                "speaker": "Pam",
                "content": " Nope afraid to get cut in half. Also there's pee on the floor."
            }
        ],
        [
            {
                "speaker": "Jim",
                "content": " O..of course there is"
            }
        ]
    ]
}