{
    "season": 7,
    "title": "Ultimatum",
    "episode": "13",
    "episodes": [
        13
    ],
    "coldOpens": [
        "After returning to the office on a Saturday to retrieve his cell phone, Jim stumbles upon Dwight's neighborhood watch meeting in the conference room."
    ],
    "storylines": [
        "Michael anticipates the news regarding the status of Holly and A.J.'s relationship, after Holly's year-end ultimatum that A.J. propose to her. To prepare for either outcome, Michael prepares for himself a \"happy box\" of celebration treats and a \"sad box\" of consolation items, as well as two videos of himself to be used to calm himself down should he get too excited or too depressed.",
        "Pam (inspired by the cheerful, involved office administrator from Vance Refrigeration) puts up a New Year's Resolution Board in the office so everyone can post their resolutions. These include Michael resolving to floss, Kevin resolving to eat more vegetables, Ryan resolving to \"live life like it's an art project,\" and Creed resolving to learn how to do a cartwheel.",
        "When Dwight reveals his resolution is to \"meet loose women\", he goes out on the town along with fellow single men Darryl and Andy, in hopes of meeting some women. First they try a bookstore (where Darryl begins fulfilling his own resolution to \"read more\" by purchasing an e-book reader which he conceals from Dwight and Andy), but later end up at a roller skating rink where they fail to find women (being that the rink is almost completely empty). Dwight skates off to a nearby strip club, Darryl uses his e-book reader and later lies that he was playing in the arcade, and Andy skates around by himself to the music of Dave Matthews Band. They all end up having a great time boogieing around the rink underneath its strobe lights.",
        "When Michael sees no ring on Holly's finger, he is at first ecstatic, and launches into celebration (which includes throwing confetti and dancing to Kelly Clarkson's \"My Life Would Suck Without You\"). When he approaches Holly to talk, however, Holly receives a phone call from A.J., during which she tells him she loves him. Michael finds out later, through Phyllis and Erin, that Holly gave up on the ultimatum, and is still in a relationship with A.J..",
        "Michael becomes upset to the point of interrupting Pam's resolution-board meeting to chastise his employees for giving up on their resolutions, taking out his frustration on Kevin by force-feeding him broccoli as well as urging Creed to do a cartwheel. Holly, however, sees the parallel Michael is making between these abandoned resolutions and her own abandoned ultimatum, and leaves the room abruptly, visibly upset.",
        "Michael attempts to apologize to Holly, but when she declines to talk, he has her join Kevin and Creed in his office so he can apologize to the two of them, simultaneously apologizing to Holly indirectly. In the end, it is clear that Holly is not that happy and she is caught by the cameras telling A.J. that she wants to take a break from their relationship at least until she returns to Nashua.",
        "Meanwhile, the New Year's resolutions get out of hand. Kevin defaces Ryan's resolution by creating the word \"fart\" out of \"art\" (before audibly farting himself), and Ryan snaps back, \"Hey, was it me or you who just shoved the butt-end of a pound of broccoli into my mouth because Michael told me to?\" Meredith reverts to smoking when she sees Pam's can of soda (her resolution was \"drink less caffeine,\" though Pam states that she's had a lot to deal with today), and Erin unintentionally angers Creed by doing a cartwheel in the middle of the office. Pam decides to toss the resolution board into a dumpster, saying she's learned her lesson.",
        "The episode closes with Michael helping Creed learn how to do a cartwheel, which he performs (poorly). Michael congratulates an elated Creed (who states that the cartwheel was \"all I had to do all year\"), though Creed obliviously ignores Michael's handshake."
    ]
}