{
    "season": 7,
    "title": "The Inner Circle",
    "episode": "23",
    "episodes": [
        23
    ],
    "coldOpens": [
        "Deangelo Vickers begins his first day as the new regional manager with conference room meeting "
    ],
    "storylines": [
        "Deangelo begins his first day in the office without Michael. Quickly, he sets up an \"inner circle\" of his most trusted employees in Dunder Mifflin, consisting of Darryl, Jim, Kevin, and Gabe. Deangelo gives Dwight some coffee but Dwight throws it in the trash because he owns the coffee shop. Ryan pretends to be Kelly's supervisor as a way to suck up to the new boss, asking Kelly to play along. Dwight wants Deangelo to leave him alone. Deangelo claims to be a great juggler. He doesn't have his balls at the office, so he puts on an invisible juggling show. Later, while having lunch, Angela protests that Deangelo is sexist, and Pam asks Jim to confront him on it. After said confrontation, Deangelo responds by hiring a woman named Jordan Garfield.",
        "Afterwards, Jim finds himself replaced with Andy in the inner circle when the next meeting is called. Dwight yells to Deangelo, \"Tell your whore to leave me alone!\" Kelly breaks down and tells Deangelo the truth regarding Ryan not being her supervisor, using the movie Rango as a comparison. Deangelo states that he likes things the way they are and decides to make Ryan Kelly's supervisor for real. As Jim works his way back into the circle, Pam takes it upon herself to try to keep Deangelo quiet when his game of Nerf basketball disrupts the office. Deangelo claims he can do Michael Jordan's dunk and Jim asks him to show everybody at the real basketball hoop down in the warehouse. Deangelo accepts the offer and forces everyone to come and watch. Dwight passes but Deangelo yells, \"Damn it, Dwight! Enough! Get your ass downstairs or find a new place to sell paper!\"",
        "When attempting a dunk, Deangelo tips the basketball hoop over onto himself, and he is seen being carried off in an ambulance in the next shot. At the end, Deangelo tries to return to work while still in his hospital gown, along with many tubes, clearly suffering from brain damage of some sort. He tries to tell a bartender joke in a jumbled and muffled language before Jim and Gabe escort him out."
    ],
    "quotes": [
        [
            {
                "content": "(Deleted scene)"
            }
        ]
    ]
}