{
    "season": 7,
    "title": "Goodbye, Michael",
    "episode": "22",
    "episodes": [
        22
    ],
    "coldOpens": [
        "While Michael is sitting on the roof to prepare himself for the high altitude of Colorado, Dwight offers him a sabotaged gift for not naming him as his successor. After Michael tell Dwight that it was not his job to give, he makes amends by seeking Dwight's advice on bear attacks."
    ],
    "storylines": [
        "﻿It's Michael's last day at the office, at least he knows it is. The rest of the office is under the impression that his last day will be the day after, so Michael tries to get out all of his goodbyes that day before he heads to the airport.﻿ Michael talks to and/or gives gifts to every member of the office before he leaves. He first talks to Phyllis, Andy, and Stanley. Michael gives a chattering teeth gag gift to Phyllis, telling her to voice her opinion more often. Michael gives a mini felt pool table to Stanley, but doesn't include balls.",
        "Finally, to boost Andy's confidence, Michael gives him his ten largest clients, to which Andy responds that he will not be able to keep them all. To Darryl, Michael bestows his unfinished copy of 'Somehow I Manage', a guide to managing that Michael himself wrote (this alludes back to 'Happy Hour' in season 6). Michael gives Kevin a caricature of Kevin as a pig drooling over a pizza. Michael then rips it up, telling Kevin not to be a caricature. Michael gives Oscar a self-made scarecrow. Michael talks to Angela about her fiancé, the state senator. In every photo of Angela and Robert there is also Robert's aide, which provides more evidence to Oscar that Robert is in fact homosexual.",
        "Michael begrudgingly talks to Toby, even saying that he will talk to Toby's brother Rory. Michael leaves Kelly alone, which she claims is the greatest gift he could give her. To Ryan, Michael gives his St. Pauli Girl neon beer sign. Michael writes a letter of recommendation for Dwight, bringing Dwight close to tears. Dwight also plays paintball with Michael. Michael talks to Creed, Gabe, and Meredith. Michael tells Creed not to fear death, for Gabe not to fear dying alone, and for Meredith not to fear dying drunk in a ditch. Michael claims that he is proud he never slept with Meredith, and resists when she says she would do it with him now. Michael talks to David Wallace, revealing his intentions of leaving the company to his former boss. David tries to talk Michael out of leaving, causing Michael to almost rethink his decision.",
        "Michael has a very personal conversation with Erin, who he has become a father figure to. Michael gives her advice on her dating life and search for love. He tells her that she will know when the right guy comes around. He also tells her to call him anytime if she needs advice. Michael says his final goodbye to the group during his last conference room meeting. However, he doesn't reveal that it is his real last goodbye, so he uses one his characters, Ping, to say goodbye to the office. Jim realizes what is happening and asks to talk to Michael in private. Michael reveals that he is leaving in a few minutes. Jim promises not to tell anyone that he is leaving. Jim expresses his true feelings for Michael, telling him that he turned out to be a great boss. With this goodbye, Michael leaves the office, but not before taking the almost finished mittens that Phyllis made for him. Pam is the only person Michael was not able to say goodbye to. Pam arrives back at the office just after Michael leaves. However, Pam rushes to the airport, saying an emotional goodbye right before Michael leaves for Colorado.",
        "Parallel to the events above, Andy sets out with Deangelo to keep one of Michael's ten largest clients. Deangelo reveals that he has no sales or management background, and he was only given this job because he saved one of Jo's dogs during a mugging. Deangelo turns out to be a terrible salesman, almost blowing the sale. However, Andy goes back alone and shows his true sales ability, convincing the client to sign back with Dunder Mifflin."
    ]
}