{
    "season": 7,
    "title": "Michael's Last Dundies",
    "episode": "21",
    "episodes": [
        21
    ],
    "coldOpens": [
        "Michael and his replacement drive around and deliver Dundie nominations to their employees, particularly Jim & Pam, Stanley, Toby, and Meredith. "
    ],
    "storylines": [
        "The episode opens with Michael and Deangelo personally delivering Dundies nomination plaques to the employees of Dunder Mifflin. At the office, Michael announces to the employees that Deangelo will be his co-host at the Dundies. The idea of performance is worrisome to Deangelo though, but Michael makes him take the job. Michael brings some of the staff together in the conference room to try and help Deangelo get prepared for the show, but Deangelo has problems riffing (even Ryan's pointers don't help him).",
        "Andy tries to help him, saying he should just think of performing like conducting a meeting, but Michael objects to that, saying Deangelo should perceive it as the performance of his life. Michael tries a number of different things to help Deangelo, such as sitting on his stomach, ordering him to tell him something traumatic that happened in his childhood, and making him listen to a Walkman with the music turned up all the way so he can't hear himself talk, but none are effective.",
        "Meanwhile, Jim and Pam, coming from elsewhere, see Erin sitting in her car eating a sandwich. Afraid of being spotted, she brings them into the car to explain she's taken to eating lunch in her car to get some time away from Gabe, who she's starting to despise. Pam coaches Erin, saying if she doesn't love Gabe she should break things off with him, as to not lead him on any further. This amuses Jim, given Pam's history with Roy, and he leaves to avoid the temptation to comment on the irony of her advice. In a talking head interview, Jim claims the situation simply didn't interest him.",
        "A few hours after work, the employees arrive at Louie Volpe's (the restaurant the Dundies are being hosted at) and are treated to an opening video where Deangelo is searching for Michael to be his co-host, in which Michael plays various employees around the office. First, he's Jo Bennett. Then, he's Angela, which gets laughs, particularly from Oscar. Next, he's Jim, who he plays as sort of a stoner type character. He then finishes up as Phyllis, who he plays as being an old, enfeebled woman. Only when Deangelo \"looks into his heart\", does Michael appear before him in a bathroom mirror.",
        "After the movie, Dwight introduces Michael and Deangelo. However, moments after being introduced, Deangelo disappears into the bathroom to vomit. Eventually, Michael is able to psych him up, and the show begins. Even though he hosts it poorly, Deangelo manages to pull the ceremony off. Jim wins the \"Best Dad\" award, and in a humorous twist, not only does Pam not win \"Best Mom\", but Meredith does. Dwight wins the \"Promising Assistant Manager\" Dundie, but as he is still mad at Michael, he tosses his award in the trash.",
        "The evening takes an even more awkward turn when Erin wins the \"Cutest Redhead\" award, and she gives a speech in which she breaks up with Gabe, who takes the stage to defend himself and express his emotional pain. Michael then awards Deangelo with the \"Best Dundies Host\" award. The staff urges him to make a speech, and Deangelo, still nervous, puts on his Walkman and turns it on full blast and talks extremely loud, resulting in all of the office workers getting kicked out of the restaurant.",
        "Michael is upset that his last Dundies ended like this, but the staff manages to convince Michael to keep the Dundies going, and to host the rest of it at the office, which Michael gives in to. Dwight rides with Michael and Deangelo, and he insults the Dundies. Michael pulls over the car, and he and Dwight get into a fight, which leads to Dwight exiting the car and leaving down the highway. Back at the office, Michael and Deangelo continue to host the Dundies in the conference room. After Michael awards Andy with the \"Doobie Doobie Pothead Stoner of the Year\" Award (since Andy tried marijuana in college), he is taken by surprise when Andy leads the employees (except Dwight and Gabe, who are not present) in serenading the soon-to-depart Michael with a version (backed up on the keyboard by Darryl) of \"Seasons of Love\" with altered lyrics. Michael is touched, and in a talking-head interview held in his office, says leaving the office is going to hurt like a \"mother f**ker\".",
        "A flashback occurs where Toby gets the \"Extreme Repulsiveness\" Award. Toby mentions that he was part of the verdict in the Scranton Strangler case and is having doubts about the outcome."
    ]
}