{
    "season": 7,
    "title": "Dwight K. Schrute, (Acting) Manager",
    "episode": "24",
    "episodes": [
        24
    ],
    "coldOpens": [
        "The Party Planning Committee decide on a hospital gift for Deangelo. Jim explains how the office has been running in the absence of a boss, but corporate offers him the top spot to which he declines. When Dwight accepts the job instead, Jim regrets his decision. "
    ],
    "storylines": [
        "When Deangelo Vickers ends up in a coma, Jo Bennett makes Dwight the interim regional manager before they find a proper replacement. Dwight establishes a strict management style, from making the employees say The Pledge of Allegiance, to setting up firewalls and long passwords to use the office's various machines, and installing antique punch clocks. Jim, who had turned down the temporary manager position believing that they should not be assigned one at all, is especially unhappy with the changes, and begins pranking Dwight by suggesting that he is leading an uprising called \"The Fist\". In order to impress Jo, Dwight buys a gun, though he is more excited when he receives a holster as a gift from a relative, and uses the gun to accessorize. Pam insists that he put it away, but Dwight accidentally fires the gun right by Andy, causing him temporary hearing loss. He attempts to bribe the office workers into silence with various favors, and Jim insists that Dwight do outlandish things (such as saying, \"Shagedelic, baby!\") at certain promptings.",
        "Meanwhile, Gabe continues with his attempts to win back Erin. He invites Andy to go to the conference room to speak in private. He breaks down, and Andy promises he won't date Erin again. He confronts Andy with the promise after he sees the two hanging out together, but Andy stands up for himself and embarrasses Gabe by describing his crying fit to Erin. When asked whether or not he wants to date Erin, he does not give a straight answer, and eventually claims that it is between him and his diary.",
        "When Jo comes to visit the branch, Dwight admits to the gun incident. He attempts to divert the blame to his employees, saying that blackmail is a bigger crime than firing a gun accidentally, but Jo takes the position away from him. Jo later puts Creed, who has the most experience and seniority in the office, in charge until a committee composed of Jim, Toby, and Gabe, find a replacement. While Jim tells Dwight that Jo did the right thing, he also compliments Dwight, noting that the office got every single company order out on time when he was in charge."
    ]
}