{
    "season": 7,
    "title": "Training Day",
    "episode": "20",
    "episodes": [
        20
    ],
    "coldOpens": [
        "Michael is meeting his replacement at a hotel bar, but after the guy is late, he strikes up a conversation with a stranger (Will Ferrell) who's companion is also late. After a few minute and a few drinks, they realize they are there to meet each other. "
    ],
    "storylines": [
        "Michael is waiting in a hotel bar for his replacement Deangelo Jeremitrius Vickers (Will Ferrell) to show up. While waiting, he meets another man at the bar and the two instantly hit it off. When Michael calls Vickers to see where he is, it is revealed that the man Michael has been talking to is actually Deangelo, though it takes the two some time to actually realize this.",
        "Deangelo comes to the branch the next day, and most of the staff is eager to make a good first impression. Kevin wears his toupee, Jim and Pam believe they have started off well by showing Deangelo pictures of their baby, and Deangelo designates Andy as the office \"funny guy\" when he reveals that he carries name tags around to avoid situations like the one Deangelo and Michael were in. Meanwhile, Dwight is not pleased that he was not selected to replace Michael, believing that Michael put in a good recommendation for him. Michael becomes disturbed, however, when Deangelo wants to make some changes, such as how Erin answers the phone.",
        "While Deangelo gets annoyed with Jim and Pam, he loves the antics of Andy, who has resorted to physical comedy when his jokes fall flat, getting to the point where he pours hot coffee on his pants and (at Deangelo's urging) eats soap; Andy tells the camera with dazed sadness that \"this is my life now\". Deangelo's popularity with the employees causes Michael to get jealous to the point where he passes out peanut butter sandwiches, despite Deangelo's peanut allergy. Deangelo then assembles the staff in the \"multi purpose room\", including Dwight, who learned from Gabe that Michael did not put in a recommendation and thus snubs Michael after being approached as an ally against the new boss. Jim quietly tells Michael that he chose to resign his job and needs to come to terms with both that choice and the fact that life is going to go on at the office. Deangelo then steps out of his meeting and asks Michael for advice on how to run the meeting, saying that he's a good manager and Dunder Mifflin won't be the same without him. The two make up with a reverse hug, Deangelo telling him that he should start enjoying his retirement. Michael returns to his office while Deangelo conducts his meeting in the conference room.",
        "In another effort to impress Deangelo, Jim and Pam bring in Cece, to which Deangelo reacts positively. While they celebrate getting back on his good side, Deangelo reveals to the camera Cece could star in a show called \"Babies I Don't Care About\"."
    ]
}