{
    "season": 7,
    "title": "Counseling",
    "episode": "2",
    "episodes": [
        2
    ],
    "episodeDetails": {
        "sections": [
            {
                "title": "Counseling",
                "level": 1,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "\"Counseling\" is the second episode of the seventh season of the American comedy television series The Office, and the show's 128th episode overall. Written by B.J. Novak and directed by Jeffrey Blitz, the episode aired on NBC in the United States on September 30, 2010. It was viewed by 7.36 million people."
                    }
                ],
                "images": []
            },
            {
                "title": "Synopsis",
                "level": 2,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Michael is forced to have six hours of counseling with Toby after he physically punished his nephew, Luke. However, Michael is determined to thwart Toby's efforts. One hour into his first session, Michael realizes that simply sitting and staring at Toby doesn't count for credit toward being there. Thus, he begins telling ridiculous stories. Toby sneakily suggests that they take a break from the session, play some games, and \"talk\" to pass the remaining 6 hours. Oddly enough, Michael lets his guard down and opens up to Toby about his childhood and relationships with people. Through listening to his history, Toby determines that Michael has an inherent need to be liked. Once he realizes what is happening, Michael ends the counseling session, and yells at Toby for duping him. Rather than arguing, Toby gives up and hands Michael the official counseling form, explaining that it has to be sent to corporate. However, this enables Michael to fill out the form any way he wants. In his haste, Michael accidentally indicates on the form that he is severely depressed and homicidal."
                    },
                    {
                        "type": "paragraph",
                        "text": "Meanwhile, Pam realizes that although she has her dream job as a salesman (a position she fought for a few seasons back), she really isn't cut out for it. Since starting the position, she has made few sales, and therefore, very little money. A chance visit from a vendor gives her an idea: if she can finagle her way into being promoted to office administrator, it will probably improve her income. She informs Gabe of her promotion \"from a few months back,\" and tells him that she hasn't been paid accordingly. Gabe promises her he'll get the missing wages if she can get all of the department heads to sign off on it. While she's busy convincing everyone that she has become the new administrator, Gabe catches on that she might be lying, and confronts her about it. Using a strategy she learned from watching World Poker Tour at 2am, she stands her ground against Gabe and becomes 'de facto' Office Administrator."
                    },
                    {
                        "type": "paragraph",
                        "text": "Dwight has decided to boycott the Steamtown Mall after a shop owner refuses to serve him, going so far as to cancel orders to businesses there. Jim and the rest of the office convince Dwight to get revenge on the shop owner by making Dwight appear to be high-class as Julia Roberts did in the film Pretty Woman (\"Beautiful Girl\" according to Dwight). Using tips from the rest of the office to make himself appear more sophisticated, Dwight, with Jim and Andy, return to the shop. It is revealed Dwight came by with beet juice soaked hands, easily confused for human blood, and was refused service on security grounds. The group leaves somewhat embarrassed, but not before Dwight buys what he came here for: a pewter wizard holding a crystal ball."
                    },
                    {
                        "type": "paragraph",
                        "text": "At the end of the episode, Michael is told that he accidentally indicated he was homicidal by Toby. Although he initially blames Toby for the mishap, he turns his ire to Gabe, even making Toby laugh. Michael openly offers to return to the break room with Toby and \"bang this out\". We see them both talking and drawing pictures at the end of the episode."
                    }
                ],
                "images": []
            },
            {
                "title": "Cultural References",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Dwight's daycare center is called \"Sesame Avenue Daycare Center For Infants And Toddlers\", which was probably inspired by the name of the long-running American children's TV series Sesame Street.",
                                "elements": []
                            },
                            {
                                "text": "At Dwight's daycare, a poster for the American hip hop and horrorcore duo Insane Clown Posse is hung on the wall; however, Dwight has scribbled out the words \"Insane\" and \"Posse\" to make it fit into the daycare.",
                                "elements": []
                            },
                            {
                                "text": "On the shelf in Dwight's daycare, there is a blue and white bowling ball. This ball is the Storm Products \"Ice Storm\" plastic ball.",
                                "elements": []
                            },
                            {
                                "text": "Dwight's subplot is inspired by Julia Roberts's character in the film Pretty Woman. Dwight even attempts to use Roberts's line, \"Big mistake\", but instead renders it as, \"You made a big mistake. Huge!\"",
                                "elements": []
                            },
                            {
                                "text": "During Michael's counseling session, he sardonically tells Toby that he was probed by ALF, the alien star of the eponymous television series.",
                                "elements": []
                            },
                            {
                                "text": "Michael says he was raised by wolves (much like a feral child), but then quickly changes his story to hint that he's a werewolf.",
                                "elements": []
                            },
                            {
                                "text": "Erin misunderstands the point of disposable cameras by throwing away the entire thing, instead of just the roll of film after it's been developed.",
                                "elements": []
                            },
                            {
                                "text": "Michael and Toby later pass the time playing Connect Four.",
                                "elements": []
                            },
                            {
                                "text": "Darryl notes to Pam that he saw a TLC show about Kate Walsh's home office, and he wants one similar.",
                                "elements": []
                            },
                            {
                                "text": "Ryan's talking head is a variety of \"deep thoughts\" that fit his recent hipster persona.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Connections to previous episodes",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Jim and Pam have to drive to a day care on the other side of the town, as opposed to the one really close by the office that they visited in the episode Sabre. This is because they \"failed their interview\" after Jim walked in on the day care director in the bathroom on the toilet.",
                                "elements": []
                            },
                            {
                                "text": "The daycare that Dwight attempts to open up is in the same closet that was once the Michael Scott Paper Company. It was also used in Cafe Disco and Andy and Darryl's printer test.",
                                "elements": []
                            },
                            {
                                "text": "Pam's poor performance in sales has been a problem since she became a sales rep for Dunder Mifflin in Broke.",
                                "elements": []
                            },
                            {
                                "text": "Pam asks Gabe to just tell her if he needs a new chair, taking power into her own hands after years of trying to convince Michael to order her a new chair, like in episodes Chair Model and The Surplus.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Production",
                "level": 2,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "This episode was written by B.J. Novak, who also plays Ryan on the show. It was directed by Jeffrey Blitz, who had worked on several previous episodes of The Office. The episode features Eric Zuckerman, Vincent Angelo and Michael Schur in guest appearances as a store teller, a vendor and Mose Schrute, respectively."
                    }
                ],
                "images": []
            },
            {
                "title": "Reception",
                "level": 2,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "In its original American broadcast, \"Counseling\" was viewed by an estimated 7.36 million viewers with a 3.7 rating/10% share among adults between theages of 18 and 49 decreasing in a million viewers and 14% in the 18–49 demographic from the previous episode."
                    },
                    {
                        "type": "paragraph",
                        "text": "Joel Keller of TV Squad called it a \"vast improvement\" from last week's episode."
                    }
                ],
                "images": []
            },
            {
                "title": "Cast",
                "level": 2,
                "content": [],
                "images": []
            },
            {
                "title": "Main cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Steve Carell as Michael Scott",
                                "elements": []
                            },
                            {
                                "text": "Rainn Wilson as Dwight Schrute",
                                "elements": []
                            },
                            {
                                "text": "John Krasinski as Jim Halpert",
                                "elements": []
                            },
                            {
                                "text": "Jenna Fischer as Pam Halpert",
                                "elements": []
                            },
                            {
                                "text": "B.J. Novak as Ryan Howard",
                                "elements": []
                            },
                            {
                                "text": "Ed Helms as Andy Bernard",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Supporting cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Leslie David Baker as Stanley Hudson",
                                "elements": []
                            },
                            {
                                "text": "Brian Baumgartner as Kevin Malone",
                                "elements": []
                            },
                            {
                                "text": "Creed Bratton (actor) as Creed Bratton",
                                "elements": []
                            },
                            {
                                "text": "Kate Flannery as Meredith Palmer",
                                "elements": []
                            },
                            {
                                "text": "Mindy Kaling as Kelly Kapoor",
                                "elements": []
                            },
                            {
                                "text": "Ellie Kemper as Erin Hannon",
                                "elements": []
                            },
                            {
                                "text": "Angela Kinsey as Angela Martin",
                                "elements": []
                            },
                            {
                                "text": "Paul Lieberstein as Toby Flenderson",
                                "elements": []
                            },
                            {
                                "text": "Oscar Nunez as Oscar Martinez",
                                "elements": []
                            },
                            {
                                "text": "Craig Robinson as Darryl Philbin",
                                "elements": []
                            },
                            {
                                "text": "Phyllis Smith as Phyllis Vance",
                                "elements": []
                            },
                            {
                                "text": "Zach Woods as Gabe Lewis",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Recurring cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Michael Schur as Mose Schrute",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Guest cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Eric Zuckerman as Store Salesman",
                                "elements": []
                            },
                            {
                                "text": "Vincent Angelo as Vendor",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "External links",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "\"Counseling\" at NBC.com",
                                "elements": []
                            },
                            {
                                "text": "\"Counseling\" at the Internet Movie Database",
                                "elements": []
                            },
                            {
                                "text": "\"Counseling\" at TV.com",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            }
        ]
    },
    "quotesDetails": {
        "sections": [
            {
                "title": "Counseling Quotes",
                "level": 1,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Phyllis: I'm glad Michael's getting help. He has a lot of issues, and he's stupid."
                    }
                ],
                "images": []
            }
        ]
    },
    "coldOpens": [
        "Dwight gives Jim and Pam a tour of the day care facilities he is opening in the office."
    ],
    "storylines": [
        "Michael is forced to have six hours of counseling with Toby after he physically punished his nephew, Luke. However, Michael is determined to thwart Toby's efforts. One hour into his first session, Michael realizes that simply sitting and staring at Toby doesn't count for credit toward being there. Thus, he begins telling ridiculous stories. Toby sneakily suggests that they take a break from the session, play some games, and \"talk\" to pass the remaining 6 hours. Oddly enough, Michael lets his guard down and opens up to Toby about his childhood and relationships with people. Through listening to his history, Toby determines that Michael has an inherent need to be liked. Once he realizes what is happening, Michael ends the counseling session, and yells at Toby for duping him. Rather than arguing, Toby gives up and hands Michael the official counseling form, explaining that it has to be sent to corporate. However, this enables Michael to fill out the form any way he wants. In his haste, Michael accidentally indicates on the form that he is severely depressed and homicidal.",
        "Meanwhile, Pam realizes that although she has her dream job as a salesman (a position she fought for a few seasons back), she really isn't cut out for it. Since starting the position, she has made few sales, and therefore, very little money. A chance visit from a vendor gives her an idea: if she can finagle her way into being promoted to office administrator, it will probably improve her income. She informs Gabe of her promotion \"from a few months back,\" and tells him that she hasn't been paid accordingly. Gabe promises her he'll get the missing wages if she can get all of the department heads to sign off on it. While she's busy convincing everyone that she has become the new administrator, Gabe catches on that she might be lying, and confronts her about it. Using a strategy she learned from watching World Poker Tour at 2am, she stands her ground against Gabe and becomes 'de facto' Office Administrator.",
        "Dwight has decided to boycott the Steamtown Mall after a shop owner refuses to serve him, going so far as to cancel orders to businesses there. Jim and the rest of the office convince Dwight to get revenge on the shop owner by making Dwight appear to be high-class as Julia Roberts did in the film Pretty Woman (\"Beautiful Girl\" according to Dwight). Using tips from the rest of the office to make himself appear more sophisticated, Dwight, with Jim and Andy, return to the shop. It is revealed Dwight came by with beet juice soaked hands, easily confused for human blood, and was refused service on security grounds. The group leaves somewhat embarrassed, but not before Dwight buys what he came here for: a pewter wizard holding a crystal ball.",
        "At the end of the episode, Michael is told that he accidentally indicated he was homicidal by Toby. Although he initially blames Toby for the mishap, he turns his ire to Gabe, even making Toby laugh. Michael openly offers to return to the break room with Toby and \"bang this out\". We see them both talking and drawing pictures at the end of the episode."
    ],
    "quotes": [
        "Phyllis: I'm glad Michael's getting help. He has a lot of issues, and he's stupid."
    ]
}