{
    "season": 7,
    "title": "Search Committee",
    "episode": "25/26",
    "episodes": [
        25,
        26
    ],
    "episodeDetails": {
        "sections": [
            {
                "title": "Search Committee",
                "level": 1,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "\"Search Committee\" is the hour-long finale of the seventh season of the American television comedy series The Office and is the show's 151st/152nd episode overall. It is the season's 25th/26th episode. It was written by Paul Lieberstein and directed by Jeffrey Blitz. It originally aired on May 19, 2011. It was viewed by 7.29 million people."
                    }
                ],
                "images": []
            },
            {
                "title": "Summary",
                "level": 2,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "With Deangelo Vickers still in a coma, Dunder Mifflin-Sabre Scranton is left with Creed as interim regional manager. Jo Bennett puts Jim, Toby and Gabe into a committee to interview candidates for the manager position, including Andy, Darryl and a number of outsiders, including a personal friend of hers, Nellie Bertram, who suggests various strange methods for running an office, including a \"zen garden\" theme and removal of all official titles for Dunder Mifflin Scranton. Pam takes it upon herself to protect the office and their clients from Creed's haphazard managerial style, such as distracting him with activities and pretending to be their own clients when Creed starts calling around with the false information that Dunder Mifflin is going out of business."
                    },
                    {
                        "type": "paragraph",
                        "text": "Dwight, still upset over being demoted by Jo, stops taking care of himself and openly looks through want ads in the office. His attitude changes when he speaks with applicant Robert California, who disparages the position and the office to another manager candidate, Merv Bronte, in a manipulative effort to make him abandon his interview. Merv ruins his interview, and Dwight becomes incensed that the position might go to someone who doesn't take it seriously. He demands to be interviewed, and while Jim balks, after Dwight's persistent efforts to acquire an interview, Jo instructs Jim to grant him one, as she likes \"a little bit of crazy.\""
                    },
                    {
                        "type": "paragraph",
                        "text": "Other interviewees include David Brent, who video conferences from England and raves about his own personal qualifications, Fred Henry, who claims he has a \"three-step plan\" for the office but will not reveal it, and Warren Buffett, who asks suspicious questions about long-distance calls policies and gas incentives."
                    },
                    {
                        "type": "paragraph",
                        "text": "Darryl thinks his popularity with the staff (and his race) will make him a shoe-in, so he thinks he doesn't have to do an interview like everyone else. He is caught off guard when he actually must do an interview and they ask for his resume. Darryl writes up an overly-extensive four page resume, which Jo quickly derides, though Jim encourages Darryl by saying that the interview and resume are mere formalities for him. Darryl later brings in his daughter and attempts to use her to gain sympathy points, though he quickly realizes that it was a bad idea."
                    },
                    {
                        "type": "paragraph",
                        "text": "When Andy interviews for the manager position, Gabe hijacks the meeting in an attempt to sabotage him by asking random trivia questions, most of which Andy is able to successfully answer, although Andy is still frustrated in the end. Gabe is also dismissive of Kelly during her interview. Kelly exacts revenge by telling Jo about his relationship with Erin and his harassing behavior after their breakup. In response, Jo sends Gabe back to Sabre's Florida headquarters, and installs Kelly to Gabe's position on the search committee. Jim eventually takes the discussion to the entire office (after Kelly accepts a bribe from Dwight to cast her vote for him), but the discussion gets out of control, and Jim brings the committee back to the conference room."
                    },
                    {
                        "type": "paragraph",
                        "text": "Phyllis and Erin await the results of a DNA test to see if Erin is the daughter previously given up by Phyllis in high school. The results are negative, but Phyllis holds off on telling Erin after Andy rejects Erin's proposal to start dating again, and continues to show maternal affection toward her."
                    },
                    {
                        "type": "paragraph",
                        "text": "Meanwhile, Angela becomes engaged to her state senator boyfriend, Robert. Oscar, who strongly believes that Robert is gay, shares his feelings with Pam, and the rest of the office. They eventually decide not to tell Angela out of respect for her feelings, despite Angela's constant obnoxious and upbeat attitude about her forthcoming nuptials."
                    },
                    {
                        "type": "paragraph",
                        "text": "At the end of the episode, the cameras interview the people who were interviewed for the manager position. Andy's sure that he failed, and so is the guy with the glasses. The Finger Lakes guy is sure he succeeded, and so is Robert California. Dwight Schrute vows that he will either \"run this branch or destroy this branch.\" He then proceeds to storm out of the lobby."
                    }
                ],
                "images": []
            },
            {
                "title": "Cultural references",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Darryl calls Microsoft and asks whether they still have Clippy, an unpopular feature from Microsoft Office.",
                                "elements": []
                            },
                            {
                                "text": "Phyllis mentions that many babies were born in 1982 due to the release of the comedy film, Porky's.",
                                "elements": []
                            },
                            {
                                "text": "She also tells Erin how Bob Vance and her engaged in bestiality, sexual intercourse involving a human and a lower animal. This is not the correct term in this case because there were really no animals involved.",
                                "elements": []
                            },
                            {
                                "text": "Robert California mentions he learned how paper is made on the PBS program Sesame Street.",
                                "elements": []
                            },
                            {
                                "text": "Angela says \"It's a little flashy. I mean, what am I, Naomi Judd?\", a reference to the country music singer.",
                                "elements": []
                            },
                            {
                                "text": "Ryan insults Pam, saying that she would prefer Rachael Ray or the hosts of The View as the new manager.",
                                "elements": []
                            },
                            {
                                "text": "Andy has trouble liking the AMC drama series Mad Men.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Cameos",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Jim Carrey, Will Arnett, and Ray Romano make cameos in interviewing for Michael's job. They are all famous comedic actors like Steve Carrel and Will Ferrell.",
                                "elements": []
                            },
                            {
                                "text": "Ricky Gervais appears as his character from The Office (U.K.), David Brent, interviewing for the position.",
                                "elements": []
                            },
                            {
                                "text": "Catherine Tate (Nellie Bertram) and James Spader (Robert California) make cameos as characters that play major roles in the next season.",
                                "elements": []
                            },
                            {
                                "text": "Warren Buffett makes a cameo as a penny pincher.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Connections to previous episodes",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "David Brent from the original UK The Office returns via satellite. He previously asked Michael if there were any openings in the Scranton Branch in the episode The Seminar.",
                                "elements": []
                            },
                            {
                                "text": "Like Jan Levinson and David Wallace, Dwight seems to have crashed as a result of losing his job. This is the second time we've seen him with facial hair as a result of being depressed about his life circumstances, the first being after his breakup with Angela.",
                                "elements": []
                            },
                            {
                                "text": "Andy is shown doing a common anger management exercise in his car.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Amusing details/Trivia",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Creed is the only manager who did not come from the sales department.",
                                "elements": []
                            },
                            {
                                "text": "Robert California is one of the only characters to blatantly acknowledge the documentary crew the way he does.",
                                "elements": []
                            },
                            {
                                "text": "Ryan says that Senator Robert Lipton is \"totally gay\" because he liked his Facebook posts at three in the morning. In an earlier episode, Lipton is seen by the doc crew staring at Ryan's butt.",
                                "elements": []
                            },
                            {
                                "text": "Kelly's desk has a name plate on it that says \"Minority Executive Trainee\"",
                                "elements": []
                            },
                            {
                                "text": "Ryan casually takes cash from Kelly's wallet while talking to Oscar and Pam.",
                                "elements": []
                            },
                            {
                                "text": "On several occasions it is possible to notice that Jenna Fischer is pregnant. Only in season 8, when hiding the pregnancy would be more of a hassle did the show introduce Pam's second pregnancy.",
                                "elements": []
                            },
                            {
                                "text": "When talking about Dwight's possible interview, he and Jim are merely walking in a circle in the parking lot.",
                                "elements": []
                            },
                            {
                                "text": "Dwight attempts to text Jo his resume line by line, and the text shown is poorly spelled.",
                                "elements": []
                            },
                            {
                                "text": "Jo is angry because Dwight's texts are costing her US$0.10 a piece despite being extremely wealthy, a characteristic not unlike that of Warren Buffet, who made a cameo as one of the candidates for the position of Regional Manager.",
                                "elements": []
                            },
                            {
                                "text": "Jo's Cadillac has a Pennsylvania license plate, even though she lives in Florida. (Although, this is probably because it is a rental, as she flies everywhere.)",
                                "elements": []
                            },
                            {
                                "text": "Andy is wearing a campaign-style button that says \"Andy for Manager?\"",
                                "elements": []
                            },
                            {
                                "text": "The episode has two different end tags, depending on whether it is aired as a single episode or as a two-parter: in the former, Pam is seen distracting Creed some more, improvising an entire conversation between fake clients; in the latter, the episode ends with a series of talking heads in which several employees mention their expectations from the new manager. The extended producer's cut shows both end tags in succession.",
                                "elements": []
                            },
                            {
                                "text": "This is the first appearance of the new reception sign.",
                                "elements": []
                            },
                            {
                                "text": "The following people interview for the regional manager position:",
                                "elements": [
                                    {
                                        "text": "Fred Henry, Warren Buffett, Robert California, Darryl Philbin, Howard Klein, Deshaun Williams, Merv Bronte, Andy Bernard, Kelly Kapoor, David Brent, Nellie Bertram, \"Finger Lakes Guy,\" and Dwight Schrute.",
                                        "elements": []
                                    }
                                ]
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Cast",
                "level": 2,
                "content": [],
                "images": []
            },
            {
                "title": "Main Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Rainn Wilson as Dwight Schrute",
                                "elements": []
                            },
                            {
                                "text": "John Krasinski as Jim Halpert",
                                "elements": []
                            },
                            {
                                "text": "Jenna Fischer as Pam Halpert",
                                "elements": []
                            },
                            {
                                "text": "B.J. Novak as Ryan Howard",
                                "elements": []
                            },
                            {
                                "text": "Ed Helms as Andy Bernard",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Supporting Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Leslie David Baker as Stanley Hudson",
                                "elements": []
                            },
                            {
                                "text": "Brian Baumgartner as Kevin Malone",
                                "elements": []
                            },
                            {
                                "text": "Creed Bratton (actor) as Creed Bratton",
                                "elements": []
                            },
                            {
                                "text": "Kate Flannery as Meredith Palmer",
                                "elements": []
                            },
                            {
                                "text": "Mindy Kaling as Kelly Kapoor",
                                "elements": []
                            },
                            {
                                "text": "Ellie Kemper as Erin Hannon",
                                "elements": []
                            },
                            {
                                "text": "Angela Kinsey as Angela Martin",
                                "elements": []
                            },
                            {
                                "text": "Paul Lieberstein as Toby Flenderson",
                                "elements": []
                            },
                            {
                                "text": "Oscar Nunez as Oscar Martinez",
                                "elements": []
                            },
                            {
                                "text": "Craig Robinson as Darryl Philbin",
                                "elements": []
                            },
                            {
                                "text": "Phyllis Smith as Phyllis Vance",
                                "elements": []
                            },
                            {
                                "text": "Zach Woods as Gabe Lewis",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Recurring Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Kathy Bates as Jo Bennett",
                                "elements": []
                            },
                            {
                                "text": "Cody Horn as Jordan Garfield",
                                "elements": []
                            },
                            {
                                "text": "Hugh Dane as Hank Tate",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Guest Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "James Spader as Robert California",
                                "elements": []
                            },
                            {
                                "text": "Will Arnett as Fred Henry",
                                "elements": []
                            },
                            {
                                "text": "Ray Romano as Merv Bronte",
                                "elements": []
                            },
                            {
                                "text": "Catherine Tate as Nellie Bertram",
                                "elements": []
                            },
                            {
                                "text": "Jim Carrey as The Finger Lakes Guy",
                                "elements": []
                            },
                            {
                                "text": "Warren Buffett as Interviewee",
                                "elements": []
                            },
                            {
                                "text": "Taylar Hollomon as Jada",
                                "elements": []
                            },
                            {
                                "text": "Ricky Gervais as David Brent (Uncredited)",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            }
        ]
    },
    "quotesDetails": {
        "sections": [
            {
                "title": "Search Committee Quotes",
                "level": 1,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "See episode Search Committee"
                    }
                ],
                "images": []
            }
        ]
    },
    "coldOpens": [
        "After he arrives to work in a new Porsche, we learn that Creed has been named the new acting manager based on seniority. He is performing exactly as you would expect him to perform."
    ],
    "storylines": [
        "With Deangelo Vickers still in a coma, Dunder Mifflin-Sabre Scranton is left with Creed as interim regional manager. Jo Bennett puts Jim, Toby and Gabe into a committee to interview candidates for the manager position, including Andy, Darryl and a number of outsiders, including a personal friend of hers, Nellie Bertram, who suggests various strange methods for running an office, including a \"zen garden\" theme and removal of all official titles for Dunder Mifflin Scranton. Pam takes it upon herself to protect the office and their clients from Creed's haphazard managerial style, such as distracting him with activities and pretending to be their own clients when Creed starts calling around with the false information that Dunder Mifflin is going out of business.",
        "Dwight, still upset over being demoted by Jo, stops taking care of himself and openly looks through want ads in the office. His attitude changes when he speaks with applicant Robert California, who disparages the position and the office to another manager candidate, Merv Bronte, in a manipulative effort to make him abandon his interview. Merv ruins his interview, and Dwight becomes incensed that the position might go to someone who doesn't take it seriously. He demands to be interviewed, and while Jim balks, after Dwight's persistent efforts to acquire an interview, Jo instructs Jim to grant him one, as she likes \"a little bit of crazy.\"",
        "Other interviewees include David Brent, who video conferences from England and raves about his own personal qualifications, Fred Henry, who claims he has a \"three-step plan\" for the office but will not reveal it, and Warren Buffett, who asks suspicious questions about long-distance calls policies and gas incentives.",
        "Darryl thinks his popularity with the staff (and his race) will make him a shoe-in, so he thinks he doesn't have to do an interview like everyone else. He is caught off guard when he actually must do an interview and they ask for his resume. Darryl writes up an overly-extensive four page resume, which Jo quickly derides, though Jim encourages Darryl by saying that the interview and resume are mere formalities for him. Darryl later brings in his daughter and attempts to use her to gain sympathy points, though he quickly realizes that it was a bad idea.",
        "When Andy interviews for the manager position, Gabe hijacks the meeting in an attempt to sabotage him by asking random trivia questions, most of which Andy is able to successfully answer, although Andy is still frustrated in the end. Gabe is also dismissive of Kelly during her interview. Kelly exacts revenge by telling Jo about his relationship with Erin and his harassing behavior after their breakup. In response, Jo sends Gabe back to Sabre's Florida headquarters, and installs Kelly to Gabe's position on the search committee. Jim eventually takes the discussion to the entire office (after Kelly accepts a bribe from Dwight to cast her vote for him), but the discussion gets out of control, and Jim brings the committee back to the conference room.",
        "Phyllis and Erin await the results of a DNA test to see if Erin is the daughter previously given up by Phyllis in high school. The results are negative, but Phyllis holds off on telling Erin after Andy rejects Erin's proposal to start dating again, and continues to show maternal affection toward her.",
        "Meanwhile, Angela becomes engaged to her state senator boyfriend, Robert. Oscar, who strongly believes that Robert is gay, shares his feelings with Pam, and the rest of the office. They eventually decide not to tell Angela out of respect for her feelings, despite Angela's constant obnoxious and upbeat attitude about her forthcoming nuptials.",
        "At the end of the episode, the cameras interview the people who were interviewed for the manager position. Andy's sure that he failed, and so is the guy with the glasses. The Finger Lakes guy is sure he succeeded, and so is Robert California. Dwight Schrute vows that he will either \"run this branch or destroy this branch.\" He then proceeds to storm out of the lobby."
    ],
    "quotes": [
        "See episode Search Committee"
    ]
}