{
    "season": 7,
    "title": "The Inner Circle",
    "episode": "23",
    "episodes": [
        23
    ],
    "episodeDetails": {
        "sections": [
            {
                "title": "The Inner Circle",
                "level": 1,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "\"The Inner Circle\" is the twenty-third episode of the seventh season of the American television comedy series The Office and is the 149th episode overall. It was written by Charlie Grandy and directed by Matt Sohn. It originally aired in the United States on May 5, 2011 and was viewed by 6.90 million people."
                    }
                ],
                "images": []
            },
            {
                "title": "Cold Opening",
                "level": 2,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Deangelo lists off some good changes like sending Darryl to business school and giving Toby a new chair. He doesn't care what everybody likes. In actuality, he dislikes when people try to figure him out. Kevin, trying to suck up to the new boss, says that everything sounds great, but he could see how others see it as bad."
                    }
                ],
                "images": []
            },
            {
                "title": "Synopsis",
                "level": 2,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Deangelo begins his first day in the office without Michael. Quickly, he sets up an \"inner circle\" of his most trusted employees in Dunder Mifflin, consisting of Darryl, Jim, Kevin, and Gabe. Deangelo gives Dwight some coffee but Dwight throws it in the trash because he owns the coffee shop. Ryan pretends to be Kelly's supervisor as a way to suck up to the new boss, asking Kelly to play along. Dwight wants Deangelo to leave him alone. Deangelo claims to be a great juggler. He doesn't have his balls at the office, so he puts on an invisible juggling show. Later, while having lunch, Angela protests that Deangelo is sexist, and Pam asks Jim to confront him on it. After said confrontation, Deangelo responds by hiring a woman named Jordan Garfield."
                    },
                    {
                        "type": "paragraph",
                        "text": "Afterwards, Jim finds himself replaced with Andy in the inner circle when the next meeting is called. Dwight yells to Deangelo, \"Tell your whore to leave me alone!\" Kelly breaks down and tells Deangelo the truth regarding Ryan not being her supervisor, using the movie Rango as a comparison. Deangelo states that he likes things the way they are and decides to make Ryan Kelly's supervisor for real. As Jim works his way back into the circle, Pam takes it upon herself to try to keep Deangelo quiet when his game of Nerf basketball disrupts the office. Deangelo claims he can do Michael Jordan's dunk and Jim asks him to show everybody at the real basketball hoop down in the warehouse. Deangelo accepts the offer and forces everyone to come and watch. Dwight passes but Deangelo yells, \"Damn it, Dwight! Enough! Get your ass downstairs or find a new place to sell paper!\""
                    },
                    {
                        "type": "paragraph",
                        "text": "When attempting a dunk, Deangelo tips the basketball hoop over onto himself, and he is seen being carried off in an ambulance in the next shot. At the end, Deangelo tries to return to work while still in his hospital gown, along with many tubes, clearly suffering from brain damage of some sort. He tries to tell a bartender joke in a jumbled and muffled language before Jim and Gabe escort him out."
                    }
                ],
                "images": []
            },
            {
                "title": "Goofs",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Jim says that the free throw line is 15 feet from the baseline. It is actually 15 feet from the basket, and 19 feet from the baseline.",
                                "elements": []
                            },
                            {
                                "text": "When escorting Deangelo out of the office, John Krasinski can briefly be seen giggling at Will Ferrell's rambling.",
                                "elements": []
                            },
                            {
                                "text": "When Deangelo comes into the office from the hospital, Angela says, \"Oh, Michael...\" when she is referring to Deangelo.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Deleted/extended scenes",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Deangelo tells everybody in the conference room so that the workers will play pinball without quarters.",
                                "elements": []
                            },
                            {
                                "text": "Deangelo tells his workers to throw complaints in Deangelo's garbage.",
                                "elements": []
                            },
                            {
                                "text": "Deangelo sets up his desk.",
                                "elements": []
                            },
                            {
                                "text": "Andy made a resume of himself but in the resume, he's called Bernard Andrews so he'll not just be the funny guy.",
                                "elements": []
                            },
                            {
                                "text": "Deangelo shuffles through the resumes.",
                                "elements": []
                            },
                            {
                                "text": "Jim told Pam that Michael will have a beagle named after Pam.",
                                "elements": []
                            },
                            {
                                "text": "Jim, Gabe and Kevin make fun of their resumes.",
                                "elements": []
                            },
                            {
                                "text": "Deangelo talks to Dwight about Deangelo's brother.",
                                "elements": []
                            },
                            {
                                "text": "Dwight gave Deangelo a B because Deangelo's quality makes Dwight's skin crawl.",
                                "elements": []
                            },
                            {
                                "text": "Deangelo plans to get rid of the 2010 printers from Sabre.",
                                "elements": []
                            },
                            {
                                "text": "Angela quips to Deangelo that he only talks to Kevin. Kevin says it depends what makes the math did.",
                                "elements": []
                            },
                            {
                                "text": "When Phyllis tells Deangelo that the men have more chances, she asks Toby. In a talking head interview, Toby had a difficult time with Michael.",
                                "elements": []
                            },
                            {
                                "text": "Jim says that managers last 14 years.",
                                "elements": []
                            },
                            {
                                "text": "Jim apologizes to Deangelo.",
                                "elements": []
                            },
                            {
                                "text": "Deangelo names his team The Crazy Snakes, The Matadors or The Lancers.",
                                "elements": []
                            },
                            {
                                "text": "Jordan doesn't like working at Dunder Mifflin Scranton.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Cultural References",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Deangelo's cousin cracked a formula for a soda, which could be Coca-Cola, which could possibly be filled with cocaine.",
                                "elements": []
                            },
                            {
                                "text": "Deangelo's juggling routine is to the song \"Bring Me to Life\" by Evanescence.",
                                "elements": []
                            },
                            {
                                "text": "The Vagina Monologues is an episodic play written in 1996.",
                                "elements": []
                            },
                            {
                                "text": "NBA is a men's professional basketball league and WNBA a women's. Dwight considers the former a sport and the latter a \"joke.\"",
                                "elements": []
                            },
                            {
                                "text": "Rango is a 2011 Academy Award winning animated film about a chameleon (Johnny Depp) who accidentally ends up in the town of Dirt, an outpost that is in desperate need of a new sheriff.",
                                "elements": []
                            },
                            {
                                "text": "NASA stands for National Aeronautics and Space Administration.",
                                "elements": []
                            },
                            {
                                "text": "Deangelo references the basketball players Michael Jordan and Magic Johnson.",
                                "elements": []
                            },
                            {
                                "text": "Deangelo playing basketball references Will Ferrell's basketball movie, Semi-Pro.",
                                "elements": []
                            },
                            {
                                "text": "\"The British are coming\" is an apocryphal quote, often credited to American patriot Paul Revere.",
                                "elements": []
                            },
                            {
                                "text": "Gabe bows when Deangelo asks everyone to welcome Jordan. This is a formal way of greeting someone in Asian culture, which Gabe has been shown before to have somewhat of an obsession with.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Connections to previous episodes",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Michael wished that Phyllis would speak her mind more (Goodbye, Michael), and she does so in this episode when confronting Deangelo about his sexist ways.",
                                "elements": []
                            },
                            {
                                "text": "Even though some of Dwight's relatives were seen before, he reveals that he has seventy cousins. \"Each one better than the last.\"",
                                "elements": []
                            },
                            {
                                "text": "During Deangelo's \"juggling routine\" you can see Dwight's ant farm. In the earlier episode, Todd Packer, Erin was trying to get the ant farm to Dwight, who was temporarily relocated to the annex.",
                                "elements": []
                            },
                            {
                                "text": "Deangelo shows off his basketball skills, similarly to how Michael organized a game between the office and the warehouse in the episode \"Basketball\", and reminiscent of Michael's three-point shot without looking as he says, \"Catch ya on the flippity-flip,\" in \"Goodbye, Michael\".",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Trivia",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "This is the first episode to not feature Steve Carell as Michael Scott.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Cast",
                "level": 2,
                "content": [],
                "images": []
            },
            {
                "title": "Main Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Rainn Wilson as Dwight Schrute",
                                "elements": []
                            },
                            {
                                "text": "John Krasinski as Jim Halpert",
                                "elements": []
                            },
                            {
                                "text": "Jenna Fischer as Pam Halpert",
                                "elements": []
                            },
                            {
                                "text": "B.J. Novak as Ryan Howard",
                                "elements": []
                            },
                            {
                                "text": "Ed Helms as Andy Bernard",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Supporting Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Leslie David Baker as Stanley Hudson",
                                "elements": []
                            },
                            {
                                "text": "Brian Baumgartner as Kevin Malone",
                                "elements": []
                            },
                            {
                                "text": "Creed Bratton (actor) as Creed Bratton",
                                "elements": []
                            },
                            {
                                "text": "Kate Flannery as Meredith Palmer",
                                "elements": []
                            },
                            {
                                "text": "Mindy Kaling as Kelly Kapoor",
                                "elements": []
                            },
                            {
                                "text": "Ellie Kemper as Erin Hannon",
                                "elements": []
                            },
                            {
                                "text": "Angela Kinsey as Angela Martin",
                                "elements": []
                            },
                            {
                                "text": "Paul Lieberstein as Toby Flenderson",
                                "elements": []
                            },
                            {
                                "text": "Oscar Nunez as Oscar Martinez",
                                "elements": []
                            },
                            {
                                "text": "Craig Robinson as Darryl Philbin",
                                "elements": []
                            },
                            {
                                "text": "Phyllis Smith as Phyllis Vance",
                                "elements": []
                            },
                            {
                                "text": "Zach Woods as Gabe Lewis",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Special Guest Star",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Will Ferrell as Deangelo Vickers",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Recurring Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Cody Horn as Jordan Garfield",
                                "elements": []
                            },
                            {
                                "text": "Hideotoshi Imura as Hidetoshi Hasagawa (Uncredited)",
                                "elements": []
                            },
                            {
                                "text": "Calvin Tenner as Calvin (Uncredited)",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            }
        ]
    },
    "quotesDetails": {
        "sections": [
            {
                "title": "The Inner Circle Quotes",
                "level": 1,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "(Deleted scene)"
                    }
                ],
                "images": []
            }
        ]
    },
    "coldOpens": [
        "Deangelo Vickers begins his first day as the new regional manager with conference room meeting "
    ],
    "storylines": [
        "Deangelo begins his first day in the office without Michael. Quickly, he sets up an \"inner circle\" of his most trusted employees in Dunder Mifflin, consisting of Darryl, Jim, Kevin, and Gabe. Deangelo gives Dwight some coffee but Dwight throws it in the trash because he owns the coffee shop. Ryan pretends to be Kelly's supervisor as a way to suck up to the new boss, asking Kelly to play along. Dwight wants Deangelo to leave him alone. Deangelo claims to be a great juggler. He doesn't have his balls at the office, so he puts on an invisible juggling show. Later, while having lunch, Angela protests that Deangelo is sexist, and Pam asks Jim to confront him on it. After said confrontation, Deangelo responds by hiring a woman named Jordan Garfield.",
        "Afterwards, Jim finds himself replaced with Andy in the inner circle when the next meeting is called. Dwight yells to Deangelo, \"Tell your whore to leave me alone!\" Kelly breaks down and tells Deangelo the truth regarding Ryan not being her supervisor, using the movie Rango as a comparison. Deangelo states that he likes things the way they are and decides to make Ryan Kelly's supervisor for real. As Jim works his way back into the circle, Pam takes it upon herself to try to keep Deangelo quiet when his game of Nerf basketball disrupts the office. Deangelo claims he can do Michael Jordan's dunk and Jim asks him to show everybody at the real basketball hoop down in the warehouse. Deangelo accepts the offer and forces everyone to come and watch. Dwight passes but Deangelo yells, \"Damn it, Dwight! Enough! Get your ass downstairs or find a new place to sell paper!\"",
        "When attempting a dunk, Deangelo tips the basketball hoop over onto himself, and he is seen being carried off in an ambulance in the next shot. At the end, Deangelo tries to return to work while still in his hospital gown, along with many tubes, clearly suffering from brain damage of some sort. He tries to tell a bartender joke in a jumbled and muffled language before Jim and Gabe escort him out."
    ],
    "quotes": [
        "(Deleted scene)"
    ]
}