{
    "season": 7,
    "title": "Training Day",
    "episode": "20",
    "episodes": [
        20
    ],
    "episodeDetails": {
        "sections": [
            {
                "title": "Training Day",
                "level": 1,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "\"Training Day\" is the twentieth episode of the seventh season of the American television comedy The Office and the show's 146th overall. It was written by Daniel Chun and directed by Paul Lieberstein. It originally aired on April 14, 2011 on NBC. It was viewed by 7.87 million people."
                    }
                ],
                "images": []
            },
            {
                "title": "Synopsis",
                "level": 2,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Michael is waiting in a hotel bar for his replacement Deangelo Jeremitrius Vickers (Will Ferrell) to show up. While waiting, he meets another man at the bar and the two instantly hit it off. When Michael calls Vickers to see where he is, it is revealed that the man Michael has been talking to is actually Deangelo, though it takes the two some time to actually realize this."
                    },
                    {
                        "type": "paragraph",
                        "text": "Deangelo comes to the branch the next day, and most of the staff is eager to make a good first impression. Kevin wears his toupee, Jim and Pam believe they have started off well by showing Deangelo pictures of their baby, and Deangelo designates Andy as the office \"funny guy\" when he reveals that he carries name tags around to avoid situations like the one Deangelo and Michael were in. Meanwhile, Dwight is not pleased that he was not selected to replace Michael, believing that Michael put in a good recommendation for him. Michael becomes disturbed, however, when Deangelo wants to make some changes, such as how Erin answers the phone."
                    },
                    {
                        "type": "paragraph",
                        "text": "While Deangelo gets annoyed with Jim and Pam, he loves the antics of Andy, who has resorted to physical comedy when his jokes fall flat, getting to the point where he pours hot coffee on his pants and (at Deangelo's urging) eats soap; Andy tells the camera with dazed sadness that \"this is my life now\". Deangelo's popularity with the employees causes Michael to get jealous to the point where he passes out peanut butter sandwiches, despite Deangelo's peanut allergy. Deangelo then assembles the staff in the \"multi purpose room\", including Dwight, who learned from Gabe that Michael did not put in a recommendation and thus snubs Michael after being approached as an ally against the new boss. Jim quietly tells Michael that he chose to resign his job and needs to come to terms with both that choice and the fact that life is going to go on at the office. Deangelo then steps out of his meeting and asks Michael for advice on how to run the meeting, saying that he's a good manager and Dunder Mifflin won't be the same without him. The two make up with a reverse hug, Deangelo telling him that he should start enjoying his retirement. Michael returns to his office while Deangelo conducts his meeting in the conference room."
                    },
                    {
                        "type": "paragraph",
                        "text": "In another effort to impress Deangelo, Jim and Pam bring in Cece, to which Deangelo reacts positively. While they celebrate getting back on his good side, Deangelo reveals to the camera Cece could star in a show called \"Babies I Don't Care About\"."
                    }
                ],
                "images": []
            },
            {
                "title": "Cultural references",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "The title of this episode is a reference to the Denzel Washington movie of the same name.",
                                "elements": []
                            },
                            {
                                "text": "Michael orders a Kahlua Sombrero.",
                                "elements": []
                            },
                            {
                                "text": "\"Deangelo\" is generally an African-American name, as is his middle name \"Jeremitrius\".",
                                "elements": []
                            },
                            {
                                "text": "Deangelo mistakenly refers to Colorado as \"The Sunshine State\". Florida is the Sunshine State, while Colorado is the Centennial State.",
                                "elements": []
                            },
                            {
                                "text": "Michael then replies with \"Don't mess with Colorado\" a butchering of Texas's motto, \"Don't mess with Texas.\"",
                                "elements": []
                            },
                            {
                                "text": "Michael says he doesn't ski because he doesn't want to \"end up like Sonny Bobo\". Sonny Bono was an American recording artist who hit a tree while skiing and died.",
                                "elements": []
                            },
                            {
                                "text": "Deangelo thinks that if Michael were to try the luge once, he'd get \"hooked\".",
                                "elements": []
                            },
                            {
                                "text": "Michael and Deangelo's favorite kind of Olympics is the summer Olympics. Deangelo tried to get an animal olympics going, but \"life happened\".",
                                "elements": []
                            },
                            {
                                "text": "Michael says he's going to miss the Scranton area mountains. In fact, Colorado is the U.S. state that encompasses most of the Southern Rocky Mountains. It's possible that Michael has little idea what Colorado is like.",
                                "elements": []
                            },
                            {
                                "text": "Kevin wears his hairpiece and identifies himself as \"equally handsome, equally smart\" Kevin and not Ashton Kutcher. Kutcher actually appeared in an Emmy show skit pretending to be the new mystery branch manager right before the beginning of season 8. This was also right at the time when he was about to join the cast of Two And A Half Men, replacing Charlie Sheen after a very public scandal. The cameo-filled clip can be viewed here.",
                                "elements": []
                            },
                            {
                                "text": "Deangelo loves the American Southwest, physical comedy and has a mild peanut allergy.",
                                "elements": []
                            },
                            {
                                "text": "Kelly purposely drops her papers on the ground in order to initiate a meet cute with Deangelo, which is a type of scene often seen in romantic comedies.",
                                "elements": []
                            },
                            {
                                "text": "Michael said \"That is insane!\" much like another character acted by Steve Carell, Evan Baxter from Evan Almighty.",
                                "elements": []
                            },
                            {
                                "text": "Michael calls Jim and Pam Jap which is a slur that offends Japanese people.",
                                "elements": []
                            },
                            {
                                "text": "The O.J. verdict Deangelo somehow missed was a criminal trial that was highly covered by the U.S. media in 1995.",
                                "elements": []
                            },
                            {
                                "text": "Michael says to Deangelo, \"we should write a movie together.\" Both Will Ferrell and Steve Carell starred in Anchorman: The Legend of Ron Burgundy prior to this episode.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Trivia/Continuity",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Michael says he doesn't think DeAngelo would be a good fit for \"the office,\" which is possibly a meta reference to deciding if Will Ferrell would be a \"good fit\" for the show itself.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Goofs",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Erin is not the only receptionist that answers the phone with \"Dunder Mifflin, this is...\" Rolando, Utica's receptionist, and the corporate receptionist in New York have been shown answering the phone in the same way. However, Erin's reason that she uses this greeting is not that it is how everyone does it, but specifically that she copies Pam. Pam most likely just followed protocol.",
                                "elements": []
                            },
                            {
                                "text": "Michael claims that he is leaving after nineteen years of service; however, two years prior in New Boss, Michael was planning his fifteenth anniversary for Dunder Mifflin. ",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Cast",
                "level": 2,
                "content": [],
                "images": []
            },
            {
                "title": "Main Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Steve Carell as Michael Scott",
                                "elements": []
                            },
                            {
                                "text": "Rainn Wilson as Dwight Schrute",
                                "elements": []
                            },
                            {
                                "text": "John Krasinski as Jim Halpert",
                                "elements": []
                            },
                            {
                                "text": "Jenna Fischer as Pam Halpert",
                                "elements": []
                            },
                            {
                                "text": "B.J. Novak as Ryan Howard",
                                "elements": []
                            },
                            {
                                "text": "Ed Helms as Andy Bernard",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Supporting Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Leslie David Baker as Stanley Hudson",
                                "elements": []
                            },
                            {
                                "text": "Brian Baumgartner as Kevin Malone",
                                "elements": []
                            },
                            {
                                "text": "Creed Bratton (actor) as Creed Bratton",
                                "elements": []
                            },
                            {
                                "text": "Kate Flannery as Meredith Palmer",
                                "elements": []
                            },
                            {
                                "text": "Mindy Kaling as Kelly Kapoor",
                                "elements": []
                            },
                            {
                                "text": "Ellie Kemper as Erin Hannon",
                                "elements": []
                            },
                            {
                                "text": "Angela Kinsey as Angela Martin",
                                "elements": []
                            },
                            {
                                "text": "Oscar Nunez as Oscar Martinez",
                                "elements": []
                            },
                            {
                                "text": "Craig Robinson as Darryl Philbin",
                                "elements": []
                            },
                            {
                                "text": "Phyllis Smith as Phyllis Vance",
                                "elements": []
                            },
                            {
                                "text": "Zach Woods as Gabe Lewis",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Special Guest Star",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Will Ferrell as Deangelo Vickers",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            }
        ]
    },
    "quotesDetails": {
        "sections": [
            {
                "title": "Training Day Quotes",
                "level": 1,
                "content": [],
                "images": []
            }
        ]
    },
    "coldOpens": [
        "Michael is meeting his replacement at a hotel bar, but after the guy is late, he strikes up a conversation with a stranger (Will Ferrell) who's companion is also late. After a few minute and a few drinks, they realize they are there to meet each other. "
    ],
    "storylines": [
        "Michael is waiting in a hotel bar for his replacement Deangelo Jeremitrius Vickers (Will Ferrell) to show up. While waiting, he meets another man at the bar and the two instantly hit it off. When Michael calls Vickers to see where he is, it is revealed that the man Michael has been talking to is actually Deangelo, though it takes the two some time to actually realize this.",
        "Deangelo comes to the branch the next day, and most of the staff is eager to make a good first impression. Kevin wears his toupee, Jim and Pam believe they have started off well by showing Deangelo pictures of their baby, and Deangelo designates Andy as the office \"funny guy\" when he reveals that he carries name tags around to avoid situations like the one Deangelo and Michael were in. Meanwhile, Dwight is not pleased that he was not selected to replace Michael, believing that Michael put in a good recommendation for him. Michael becomes disturbed, however, when Deangelo wants to make some changes, such as how Erin answers the phone.",
        "While Deangelo gets annoyed with Jim and Pam, he loves the antics of Andy, who has resorted to physical comedy when his jokes fall flat, getting to the point where he pours hot coffee on his pants and (at Deangelo's urging) eats soap; Andy tells the camera with dazed sadness that \"this is my life now\". Deangelo's popularity with the employees causes Michael to get jealous to the point where he passes out peanut butter sandwiches, despite Deangelo's peanut allergy. Deangelo then assembles the staff in the \"multi purpose room\", including Dwight, who learned from Gabe that Michael did not put in a recommendation and thus snubs Michael after being approached as an ally against the new boss. Jim quietly tells Michael that he chose to resign his job and needs to come to terms with both that choice and the fact that life is going to go on at the office. Deangelo then steps out of his meeting and asks Michael for advice on how to run the meeting, saying that he's a good manager and Dunder Mifflin won't be the same without him. The two make up with a reverse hug, Deangelo telling him that he should start enjoying his retirement. Michael returns to his office while Deangelo conducts his meeting in the conference room.",
        "In another effort to impress Deangelo, Jim and Pam bring in Cece, to which Deangelo reacts positively. While they celebrate getting back on his good side, Deangelo reveals to the camera Cece could star in a show called \"Babies I Don't Care About\"."
    ]
}