{
    "season": 7,
    "title": "Counseling",
    "episode": "2",
    "episodes": [
        2
    ],
    "coldOpens": [
        "Dwight gives Jim and Pam a tour of the day care facilities he is opening in the office."
    ],
    "storylines": [
        "Michael is forced to have six hours of counseling with Toby after he physically punished his nephew, Luke. However, Michael is determined to thwart Toby's efforts. One hour into his first session, Michael realizes that simply sitting and staring at Toby doesn't count for credit toward being there. Thus, he begins telling ridiculous stories. Toby sneakily suggests that they take a break from the session, play some games, and \"talk\" to pass the remaining 6 hours. Oddly enough, Michael lets his guard down and opens up to Toby about his childhood and relationships with people. Through listening to his history, Toby determines that Michael has an inherent need to be liked. Once he realizes what is happening, Michael ends the counseling session, and yells at Toby for duping him. Rather than arguing, Toby gives up and hands Michael the official counseling form, explaining that it has to be sent to corporate. However, this enables Michael to fill out the form any way he wants. In his haste, Michael accidentally indicates on the form that he is severely depressed and homicidal.",
        "Meanwhile, Pam realizes that although she has her dream job as a salesman (a position she fought for a few seasons back), she really isn't cut out for it. Since starting the position, she has made few sales, and therefore, very little money. A chance visit from a vendor gives her an idea: if she can finagle her way into being promoted to office administrator, it will probably improve her income. She informs Gabe of her promotion \"from a few months back,\" and tells him that she hasn't been paid accordingly. Gabe promises her he'll get the missing wages if she can get all of the department heads to sign off on it. While she's busy convincing everyone that she has become the new administrator, Gabe catches on that she might be lying, and confronts her about it. Using a strategy she learned from watching World Poker Tour at 2am, she stands her ground against Gabe and becomes 'de facto' Office Administrator.",
        "Dwight has decided to boycott the Steamtown Mall after a shop owner refuses to serve him, going so far as to cancel orders to businesses there. Jim and the rest of the office convince Dwight to get revenge on the shop owner by making Dwight appear to be high-class as Julia Roberts did in the film Pretty Woman (\"Beautiful Girl\" according to Dwight). Using tips from the rest of the office to make himself appear more sophisticated, Dwight, with Jim and Andy, return to the shop. It is revealed Dwight came by with beet juice soaked hands, easily confused for human blood, and was refused service on security grounds. The group leaves somewhat embarrassed, but not before Dwight buys what he came here for: a pewter wizard holding a crystal ball.",
        "At the end of the episode, Michael is told that he accidentally indicated he was homicidal by Toby. Although he initially blames Toby for the mishap, he turns his ire to Gabe, even making Toby laugh. Michael openly offers to return to the break room with Toby and \"bang this out\". We see them both talking and drawing pictures at the end of the episode."
    ],
    "quotes": [
        [
            {
                "speaker": "Phyllis",
                "content": " I'm glad Michael's getting help. He has a lot of issues, and he's stupid."
            }
        ]
    ]
}