{
    "season": 7,
    "title": "Andy's Play",
    "episode": "3",
    "episodes": [
        3
    ],
    "coldOpens": [
        "Andy gives the office a preview of the musical, Sweeney Todd. "
    ],
    "storylines": [
        "Andy is performing in a local production of Sweeney Todd, and has the cast come into the office to perform a song for them, while persuading his co-workers to come. He makes an effort to convince most of them to go, but his main concern is Erin, whom he hopes to win back with a good performance. He personally gives Erin two tickets for her and Gabe, but Erin admits Gabe cannot come, much to Andy's delight. Ultimately though, Erin doesn't show up either, as she agreed to babysit Cece for Jim and Pam so they could come instead.",
        "On the night of the show, everything starts off smoothly. Jim and Pam are caught sitting in another couples' seats and are asked to return to their original seats, which are revealed to be next to Michael. Darryl informs Michael the lead role is his plumber, which irritates Michael a great deal since he tried out for the part and didn't make it. During intermission, the director of the play encourages Michael to keep coming back to audition for his shows, which greatly irritates Michael. He decides to swipe a bottle of wine from the concession table. During the second act, Michael, Meredith, Darryl, and Kevin are seen drinking the wine Michael stole, though Michael intended to have all the wine to himself. Andy constantly checks his phone, mid play, for messages from Erin, but doesn't get any. While he is on stage, his phone goes off in his pocket, causing him and the actor playing Sweeney Todd to break character and improvise, much to Michael's delight.",
        "To make matters worse, Michael drops the now empty bottle of wine, and it causes a lot of commotion as it starts rolling underneath the seats towards the stage. The balloons that Michael brought also escape his grip and pop as they reach the ceiling. This then causes a baby to cry, and Pam comments the baby sounds like Cece. As she looks back, she sees Erin standing in the back with Cece, exciting Andy, but angering Pam and Jim. At the end of the show everyone cheers the actor playing Sweeney Todd, but Michael angrily boos him due to the fact he auditioned for the part himself by acting out an entire episode of Law & Order. The actor later confronts Michael at the cast party. Darryl teases Michael by booing him shortly after the actor leaves the conversation.",
        "Meanwhile, Dwight and Angela continue to see each other for their sex sessions as their contract dictates. Angela hints she's trying to win Dwight back during a talking head interview. It is subtly implied that Dwight is slowly falling for Angela again, despite his denial to the camera. During the show she purposely places gum on her dress, giving her an excuse to change into more casual but tight-fitting clothing that one would wear while working on a farm in an attempt to seduce Dwight. Dwight seems to ignore the change of clothing but is seen checking her out during the intermission. As Angela leaves, Dwight tries to seduce her, but Angela has second thoughts and wants to go home, but she decides to count the night as one of their 'sessions' anyway.",
        "Andy and Erin spend some time together backstage, where they \"murder\" each other with the prop razor blades. While Andy shows Erin her potential seats for the evening, she states how happy she is that they're hanging out outside the office. Sadly, the moment ends when Gabe calls Erin and she has to leave. As a sad Andy sulks backstage, the rest of the office converges on him and cheers him up by complimenting his performance. At the request of his co-workers, Andy sings them another song (Macy Gray's \"I Try\"), as Angela drives home with a smile, Jim and Pam sip Irish Cream, and Dwight casually sings along.",
        "During the credits, Michael's Law & Order audition is shown."
    ],
    "quotes": [
        [
            {
                "speaker": "Andy",
                "content": " Women cannot resist a man singing show tunes. It's so powerful, even a lot of men can't resist a man singing show tunes."
            }
        ],
        [
            {
                "speaker": "Erin",
                "content": " The 13 year olds in this town have a complete monopoly. It's almost like a baby-sitter's club."
            }
        ]
    ]
}