{
    "season": 7,
    "title": "Andy's Play",
    "episode": "3",
    "episodes": [
        3
    ],
    "episodeDetails": {
        "sections": [
            {
                "title": "Andy's Play",
                "level": 1,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "\"Andy's Play\" is the third episode of Season 7 of the American comedy television series The Office and the show's 129th episode overall. Written by Charlie Grandy and directed by John Stuart Scott, the episode aired on NBC in the United States on October 7, 2010. This episode has received overwhelmingly positive reviews. It was viewed by 6.95 million people."
                    }
                ],
                "images": []
            },
            {
                "title": "Synopsis",
                "level": 2,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Andy is performing in a local production of Sweeney Todd, and has the cast come into the office to perform a song for them, while persuading his co-workers to come. He makes an effort to convince most of them to go, but his main concern is Erin, whom he hopes to win back with a good performance. He personally gives Erin two tickets for her and Gabe, but Erin admits Gabe cannot come, much to Andy's delight. Ultimately though, Erin doesn't show up either, as she agreed to babysit Cece for Jim and Pam so they could come instead."
                    },
                    {
                        "type": "paragraph",
                        "text": "On the night of the show, everything starts off smoothly. Jim and Pam are caught sitting in another couples' seats and are asked to return to their original seats, which are revealed to be next to Michael. Darryl informs Michael the lead role is his plumber, which irritates Michael a great deal since he tried out for the part and didn't make it. During intermission, the director of the play encourages Michael to keep coming back to audition for his shows, which greatly irritates Michael. He decides to swipe a bottle of wine from the concession table. During the second act, Michael, Meredith, Darryl, and Kevin are seen drinking the wine Michael stole, though Michael intended to have all the wine to himself. Andy constantly checks his phone, mid play, for messages from Erin, but doesn't get any. While he is on stage, his phone goes off in his pocket, causing him and the actor playing Sweeney Todd to break character and improvise, much to Michael's delight."
                    },
                    {
                        "type": "paragraph",
                        "text": "To make matters worse, Michael drops the now empty bottle of wine, and it causes a lot of commotion as it starts rolling underneath the seats towards the stage. The balloons that Michael brought also escape his grip and pop as they reach the ceiling. This then causes a baby to cry, and Pam comments the baby sounds like Cece. As she looks back, she sees Erin standing in the back with Cece, exciting Andy, but angering Pam and Jim. At the end of the show everyone cheers the actor playing Sweeney Todd, but Michael angrily boos him due to the fact he auditioned for the part himself by acting out an entire episode of Law & Order. The actor later confronts Michael at the cast party. Darryl teases Michael by booing him shortly after the actor leaves the conversation."
                    },
                    {
                        "type": "paragraph",
                        "text": "Meanwhile, Dwight and Angela continue to see each other for their sex sessions as their contract dictates. Angela hints she's trying to win Dwight back during a talking head interview. It is subtly implied that Dwight is slowly falling for Angela again, despite his denial to the camera. During the show she purposely places gum on her dress, giving her an excuse to change into more casual but tight-fitting clothing that one would wear while working on a farm in an attempt to seduce Dwight. Dwight seems to ignore the change of clothing but is seen checking her out during the intermission. As Angela leaves, Dwight tries to seduce her, but Angela has second thoughts and wants to go home, but she decides to count the night as one of their 'sessions' anyway."
                    },
                    {
                        "type": "paragraph",
                        "text": "Andy and Erin spend some time together backstage, where they \"murder\" each other with the prop razor blades. While Andy shows Erin her potential seats for the evening, she states how happy she is that they're hanging out outside the office. Sadly, the moment ends when Gabe calls Erin and she has to leave. As a sad Andy sulks backstage, the rest of the office converges on him and cheers him up by complimenting his performance. At the request of his co-workers, Andy sings them another song (Macy Gray's \"I Try\"), as Angela drives home with a smile, Jim and Pam sip Irish Cream, and Dwight casually sings along."
                    },
                    {
                        "type": "paragraph",
                        "text": "During the credits, Michael's Law & Order audition is shown."
                    }
                ],
                "images": [
                    {
                        "src": "https://vignette.wikia.nocookie.net/theoffice/images/3/39/The_Cast.jpg/revision/latest/scale-to-width-down/180?cb=20120102013917",
                        "caption": "The cast from Sweeney Todd."
                    }
                ]
            },
            {
                "title": "Trivia",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "When Andy becomes Regional Manager a play bill to \"Sweeney Todd\" is posted on a bulletin board on one of the walls.",
                                "elements": []
                            },
                            {
                                "text": "During Andy's talking head in the cold opening, the rest of the cast is out of breath from their viral performance, yet Andy shows no signs of fatigue. Given that he sings every opportunity he gets, it's likely that his vocal cords have become more durable.",
                                "elements": []
                            },
                            {
                                "text": "The copier in Dwight's office appears to be the older one from the Dunder Mifflin offices.",
                                "elements": []
                            },
                            {
                                "text": "Creed doesn't seem to notice that the murders in the play are fake.",
                                "elements": []
                            },
                            {
                                "text": "Stanley took Cynthia to the play with him. It is not mentioned as to whether he and Teri are still married.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Cultural References",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Sweeney Todd: The Demon Barber of Fleet Street is a 1979 musical thriller with music and lyrics by Stephen Sondheim and libretto by Hugh Wheeler (Erin asks Andy if he wrote the songs).",
                                "elements": []
                            },
                            {
                                "text": "Erin says that the 13-year-olds in Scranton are like the The Baby-Sitters Club, which is from a series of novels by Ann M. Martin.",
                                "elements": []
                            },
                            {
                                "text": "Michael brings balloons and Phyllis says it's like in the movie Up.",
                                "elements": []
                            },
                            {
                                "text": "Jim tries to put Cece to sleep and the tense situation reminds him of the movie The Hurt Locker. It's a war film about a bomb disposal team during the Iraq War.",
                                "elements": []
                            },
                            {
                                "text": "Michael's audition is a reenacting of an entire Law & Order episode. Law & Order is an American police procedural and legal drama television series.",
                                "elements": []
                            },
                            {
                                "text": "Darryl shushes Michael, saying \"if we don't listen to the overture we won't notice the musical themes when they come back later.\" An overture is performed live by the orchestra pit and contains musical themes from the rest of the show.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Amusing details",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "When Michael says that it would be \"too hard\" to come to Andy's play, he mouths \"That\", implying that Michael meant to say, \"That's what she said.\"",
                                "elements": []
                            },
                            {
                                "text": "When Kelly asks Ryan for the time during the play, he shows it to her on his iPad while actually wearing a watch. It's 10:07 PM.",
                                "elements": []
                            },
                            {
                                "text": "Dwight is shown brandishing a hunting knife in the opening of the episode when the cast of Andy's play comes into the office and sings. This adds to the fact that Dwight has a vast variety of weapons in the office - which has been mentioned in previous episodes.",
                                "elements": []
                            },
                            {
                                "text": "A total of four people drink the wine bottle that Michael originally intended to drink for himself: Michael, Darryl, Meredith, and Kevin.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Production",
                "level": 2,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "\"Andy's Play\" was directed by John Stuart Scott, his first directing credit for the show."
                    }
                ],
                "images": []
            },
            {
                "title": "Reception",
                "level": 2,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "In its original American broadcast, \"Andy's Play\" was viewed by an estimated 6.95 million viewers with a 3.5 rating/10% share among adults between the age of 18 and 49 coming second in its time slot going down 0.2 from last week's episode. This episode has received overwhelmingly positive reviews. James Poniewonzik said, \"Andy's Play was the kind of strong, character driven episode I've missed from the show—not just good by later season standards but an actual good Office episode, period.\" Many praised the Law & Order audition at the very end and many have made comparisons to Christopher Guest's mockumentary comedy, Waiting for Guffman."
                    }
                ],
                "images": []
            },
            {
                "title": "Cast",
                "level": 2,
                "content": [],
                "images": []
            },
            {
                "title": "Main cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Steve Carell as Michael Scott",
                                "elements": []
                            },
                            {
                                "text": "Rainn Wilson as Dwight Schrute",
                                "elements": []
                            },
                            {
                                "text": "John Krasinski as Jim Halpert",
                                "elements": []
                            },
                            {
                                "text": "Jenna Fischer as Pam Halpert",
                                "elements": []
                            },
                            {
                                "text": "B.J. Novak as Ryan Howard",
                                "elements": []
                            },
                            {
                                "text": "Ed Helms as Andy Bernard",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Supporting cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Leslie David Baker as Stanley Hudson",
                                "elements": []
                            },
                            {
                                "text": "Brian Baumgartner as Kevin Malone",
                                "elements": []
                            },
                            {
                                "text": "Creed Bratton (actor) as Creed Bratton",
                                "elements": []
                            },
                            {
                                "text": "Kate Flannery as Meredith Palmer",
                                "elements": []
                            },
                            {
                                "text": "Mindy Kaling as Kelly Kapoor",
                                "elements": []
                            },
                            {
                                "text": "Ellie Kemper as Erin Hannon",
                                "elements": []
                            },
                            {
                                "text": "Angela Kinsey as Angela Martin",
                                "elements": []
                            },
                            {
                                "text": "Oscar Nunez as Oscar Martinez",
                                "elements": []
                            },
                            {
                                "text": "Craig Robinson as Darryl Philbin",
                                "elements": []
                            },
                            {
                                "text": "Phyllis Smith as Phyllis Vance",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Recurring cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Bobby Ray Shafer as Bob Vance",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Guest cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Robert Mammana as Sweeney Todd",
                                "elements": []
                            },
                            {
                                "text": "Phil Abrams as Shelby Thomas Weems",
                                "elements": []
                            },
                            {
                                "text": "Maxwell Glick as Tobias",
                                "elements": []
                            },
                            {
                                "text": "Heather Marie Marsden as Mrs. Lovett",
                                "elements": []
                            },
                            {
                                "text": "Kelly Ebsary as Torrie Sullivan",
                                "elements": []
                            },
                            {
                                "text": "Barbara A. Fisher as an Usher",
                                "elements": []
                            },
                            {
                                "text": "David Kirk Grant as Henry Saine",
                                "elements": []
                            },
                            {
                                "text": "Randy Guiaya as Pirelli",
                                "elements": []
                            },
                            {
                                "text": "Erica Hanhahan as Johanna",
                                "elements": []
                            },
                            {
                                "text": "Algerita Wynn Lewis as Cynthia",
                                "elements": []
                            },
                            {
                                "text": "Scott Thewes as Audience Member",
                                "elements": []
                            },
                            {
                                "text": "Jen Reiter",
                                "elements": []
                            },
                            {
                                "text": "Michael Heatherton",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            }
        ]
    },
    "quotesDetails": {
        "sections": [
            {
                "title": "Andy's Play Quotes",
                "level": 1,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Andy: Women cannot resist a man singing show tunes. It's so powerful, even a lot of men can't resist a man singing show tunes."
                    },
                    {
                        "type": "paragraph",
                        "text": "Erin: The 13 year olds in this town have a complete monopoly. It's almost like a baby-sitter's club."
                    }
                ],
                "images": []
            }
        ]
    },
    "coldOpens": [
        "Andy gives the office a preview of the musical, Sweeney Todd. "
    ],
    "storylines": [
        "Andy is performing in a local production of Sweeney Todd, and has the cast come into the office to perform a song for them, while persuading his co-workers to come. He makes an effort to convince most of them to go, but his main concern is Erin, whom he hopes to win back with a good performance. He personally gives Erin two tickets for her and Gabe, but Erin admits Gabe cannot come, much to Andy's delight. Ultimately though, Erin doesn't show up either, as she agreed to babysit Cece for Jim and Pam so they could come instead.",
        "On the night of the show, everything starts off smoothly. Jim and Pam are caught sitting in another couples' seats and are asked to return to their original seats, which are revealed to be next to Michael. Darryl informs Michael the lead role is his plumber, which irritates Michael a great deal since he tried out for the part and didn't make it. During intermission, the director of the play encourages Michael to keep coming back to audition for his shows, which greatly irritates Michael. He decides to swipe a bottle of wine from the concession table. During the second act, Michael, Meredith, Darryl, and Kevin are seen drinking the wine Michael stole, though Michael intended to have all the wine to himself. Andy constantly checks his phone, mid play, for messages from Erin, but doesn't get any. While he is on stage, his phone goes off in his pocket, causing him and the actor playing Sweeney Todd to break character and improvise, much to Michael's delight.",
        "To make matters worse, Michael drops the now empty bottle of wine, and it causes a lot of commotion as it starts rolling underneath the seats towards the stage. The balloons that Michael brought also escape his grip and pop as they reach the ceiling. This then causes a baby to cry, and Pam comments the baby sounds like Cece. As she looks back, she sees Erin standing in the back with Cece, exciting Andy, but angering Pam and Jim. At the end of the show everyone cheers the actor playing Sweeney Todd, but Michael angrily boos him due to the fact he auditioned for the part himself by acting out an entire episode of Law & Order. The actor later confronts Michael at the cast party. Darryl teases Michael by booing him shortly after the actor leaves the conversation.",
        "Meanwhile, Dwight and Angela continue to see each other for their sex sessions as their contract dictates. Angela hints she's trying to win Dwight back during a talking head interview. It is subtly implied that Dwight is slowly falling for Angela again, despite his denial to the camera. During the show she purposely places gum on her dress, giving her an excuse to change into more casual but tight-fitting clothing that one would wear while working on a farm in an attempt to seduce Dwight. Dwight seems to ignore the change of clothing but is seen checking her out during the intermission. As Angela leaves, Dwight tries to seduce her, but Angela has second thoughts and wants to go home, but she decides to count the night as one of their 'sessions' anyway.",
        "Andy and Erin spend some time together backstage, where they \"murder\" each other with the prop razor blades. While Andy shows Erin her potential seats for the evening, she states how happy she is that they're hanging out outside the office. Sadly, the moment ends when Gabe calls Erin and she has to leave. As a sad Andy sulks backstage, the rest of the office converges on him and cheers him up by complimenting his performance. At the request of his co-workers, Andy sings them another song (Macy Gray's \"I Try\"), as Angela drives home with a smile, Jim and Pam sip Irish Cream, and Dwight casually sings along.",
        "During the credits, Michael's Law & Order audition is shown."
    ],
    "quotes": [
        "Andy: Women cannot resist a man singing show tunes. It's so powerful, even a lot of men can't resist a man singing show tunes.",
        "Erin: The 13 year olds in this town have a complete monopoly. It's almost like a baby-sitter's club."
    ]
}