{
    "season": 7,
    "title": "Sex Ed",
    "episode": "4",
    "episodes": [
        4
    ],
    "coldOpens": [
        "Dwight hires Nate to take care of the hornets nest."
    ],
    "storylines": [
        "Michael arrives to the office with a fake mustache to hide what he thinks is a pimple over his mouth. Everyone at work discovers the blemish by accident and they discuss how it looks like a cold sore, which is herpes. Pam quickly attempts to quell the idea that the blemish may be cancerous, stating during a talking head interview that it's best to stop a \"Michael train of thought, before it blows up and destroys the whole town\". During the discussion, Meredith also reveals to everyone how she has genital herpes, much to the discomfort of her co-workers.",
        "Andy uses the situation to host a sex ed class after the office ridicules Meredith behind her back. With some prodding from Dwight, Michael decides to tell his former lovers he has herpes, despite not yet having gone to a doctor. He calls Donna first, abruptly telling her to get tested. Michael then calls Holly, joking around with her before they have a more serious discussion about how Holly has been with her boyfriend AJ for a year and a half. Michael voices his belief that he and Holly would have started a family had she stayed in Scranton; Holly disagrees, and much to Michael's dismay, she reveals her belief that he over-romanticized their relationship. They end the call soon after and Dwight mentions that Michael forgot to mention his herpes. Michael and Dwight drive out to tell Carol, Jan and Pam's mother, Helene. ",
        "After bribing the office with free pizza, Andy hosts a sex education class, which is actually a vague attempt to subtly find out if Gabe and Erin are having sex. Distraught after realizing that they are having sex and after everyone mocks him, Andy throws a tantrum. He ends up smacking a box of pizza against the wall, hitting and staining a hanging picture, and then proceeds to storm out of the conference room.",
        "Michael and Dwight meet up with Jan, who is growing to be a fairly successful office manager for a hospital and single mother. After Jan gives Michael a brutal description of why their relationship failed and watching her play with her daughter Astrid, Michael reveals he has herpes. He states afterwards that he questions his own judgment, because he thought Jan was \"The One\" or \"at least one of The Ones\" and he was so off-base on that. He meets up with Helene, Pam's mother, at a playground and after an awkward conversation where she also points out his skewed sense of memory, he insults her and walks off. He meets up with his former Realtor Carol while she is conducting an open-house, who after attempting to be polite, also becomes abrupt and points out his faults too.",
        "Gabe takes Andy to his cubicle and admonishes him for his behavior, revealing he is aware why Andy hosted the sex ed class. He also explains to Andy that the only reason he asked Erin out was because Andy gave his blessing, which Andy reveals was just a result of his difficulty saying no to how politely Gabe asked him. Afterward, Andy walks into Darryl's office and cries, which an uncomfortable Darryl reacts to by giving him vague supportive advice (which he reveals in a talking-head cutaway) that he gives everyone.",
        "Michael calls Holly only to get her voicemail. He leaves her a heartfelt message that what she said hurt and when seeing all his exes that day, he hadn't been happy to see any of them. But when he talked to her, he was happy talking to her as much as she was happy to hear from him. He doesn't understand why she wants to downplay what they had, but he remembers the time he spent with her perfectly and considers what they had as special. Before hanging up, he awkwardly adds that she should be tested for herpes.",
        "The final scene is a confrontation between Dwight, Michael, and Oscar. Michael and Dwight want all of the names of Oscar's former lovers since Michael once kissed him. In disgust, Oscar walks out of Michael's office."
    ]
}