{
    "season": 7,
    "title": "The Sting",
    "episode": "5",
    "episodes": [
        5
    ],
    "coldOpens": [
        "Oscar brings his bike to work and Michael tries to ride it."
    ],
    "storylines": [
        "When a Dunder Mifflin client is stolen by a rival salesman named Danny Cordray, Michael, Dwight and Jim decide to set up a sting in order to uncover his sales secret. Meanwhile, Andy starts a band when he learns that one of his old college friends has a successful music career.",
        "Jim and Dwight are sent on assignment to make a sales pitch to a client named Steve Nash, and are eager to land the sale. However, their eagerness is short-lived as they see Danny Cordray, a rival and very successful paper salesman, the best in the Scranton Wilkes-Barre area, has also arrived for a sales pitch. Desperate, Jim and Dwight call in Michael, who is ecstatic at getting a chance to make a sale, to come and try to save them. However, the company ends up taking Danny's offer, even after Michael promises at-cost paper sales and weekend delivery. The trio leaves the client's office and head back home, defeated. It is also revealed by Dwight that Danny had a romantic history with Pam (while Jim was dating Karen), a fact which Pam tries to reiterate to Jim that it was only a brief relationship.",
        "During a brainstorm session, Michael, Jim, and Dwight decide to set up a sting operation to see how Danny is stealing all of their clients and observe his sales techniques. They set up Meredith, as the CEO of Solartech (a fictional company), in Dwight's office, fitted with security cameras, and watch from another room. Danny is then sent in to try to make a sale. All starts well until Meredith attempts to seduce him, forcing Dwight and Jim to send in Oscar and Ryan to save the sting. When Meridith strong arms both of them, a grossed out Michael rushes in to call the whole thing off. Danny becomes infuriated and walks off, but before he leaves the building, Michael offers him a job, mentioning how much money he could make as a traveling salesman for them. He reluctantly accepts the offer, and Michael introduces him as the new salesman to the office. The rest of the sales staff (minus a distracted Andy) act disrespectful towards him, worrying that Danny will take their clients. Michael mentions to them how well sales numbers will go up with Danny a part of the branch now, and that just because he is good doesn't mean he should be turned away. Before Dwight leaves for the day, he viciously insults Danny, then near immediately welcomes him to the company.",
        "In a final interview with the documentary crew, Michael boasts of his coup of stealing Danny, bragging that Dunder Mifflin didn't even need another traveling salesman since they have Todd Packer in the field, before immediately lamenting that he \"forgot about Packer.\"",
        "Andy starts a band after reading about how well one of his friends is doing in the music business. He manages to get Darryl and Kevin to join him in writing a song, with Andy singing from the perspective of a little girl in a falsetto. The song is poorly received by the rest of the office, and Andy returns to the drawing board. Seeing that Andy is dejected, Kevin and Darryl offer to stay and jam with him for a little extra time, and the trio come up with another, much better song."
    ]
}