{
    "season": 7,
    "title": "Costume Contest",
    "episode": "6",
    "episodes": [
        6
    ],
    "coldOpens": [
        "There is no limit to what Stanley will not notice."
    ],
    "storylines": [
        "Stanley doesn't notice he is drinking Jim's orange juice, thinking it's coffee, so Jim wonders how much Stanley won't notice. Kevin dresses as Phyllis; Andy sits at his desk shirtless; Jim places a cardboard box with the computer desktop on it over his monitor; Michael wears fake teeth; Michael talks about a Dunder Mifflin branch on Jupiter during a staff meeting where all the employees except Stanley are facing a different direction; Pam wears a mustache; Dwight brings a pony into the office; and he doesn't notice. But he does notice when it's 5:00 p.m. and time to leave work.",
        "The office becomes excited over the annual Halloween costume contest when Pam offers a Scranton-area coupon book as the prize for the winner. The coupons contain offers that total $15,000 in savings. This leads the staff (except for Oscar, who does not participate) to believe that the coupon book is literally worth $15,000. Of course, this still isn't enough to convince Jim to wear a matching couples costume (Popeye) with Pam (Olive Oyl). As the day goes on, several people realize their costume might not win, so they leave the office to switch into something more recognizable or provocative.",
        "Gabe, dressed up as Lady Gaga, informs the staff of a sales idea where delivery drivers can suggest additional products for the customers they deliver to. The idea is designed to increase overall sales for the company. Michael realizes the idea sounds similar to a suggestion made by Darryl a long time ago; Michael, however, initially shot down the idea, believing it wouldn't work. When Jim informs Michael that warehouse worker Madge has made her first sale, Michael decides to confront corporate about stealing Darryl's idea. It is then revealed that Darryl actually pitched the idea to Gabe, who sent it up to corporate, and has already received credit.",
        "New salesman Danny invites everyone to a Halloween party at his bar after work. Almost everyone in the office is aware that Danny and Pam had a two-date fling four years ago. Kevin (dressed as Michael Moore) and Andy (Bill Compton) start a false rumor that Pam doesn't want people going to Danny's party, which incites Danny to confront Jim and Pam in order to determine the validity of the rumor. The conversation quickly turns to Pam and Danny's dating history, and while the three initially laugh about how their coworkers have been exaggerating its significance, it soon becomes clear that both Jim and Pam want to know exactly why she was rejected. Danny tells Jim he didn't call back because Pam couldn't stop talking about Jim during their dates, but when Pam reveals she never mentioned Jim, Danny admits that he found her too \"dorky.\" At the end of the episode, Jim comes into the office wearing his Popeye costume, carrying Cece (dressed as Swee'Pea), much to the delight of Pam.",
        "Michael becomes progressively more agitated over the fact that Darryl went over his head and tries to get Darryl to apologize in front of everyone for 'backstabbing' him. Darryl refuses, criticizing Michael's poor judgment of his idea. In anger, Michael changes his outfit to Darryl's warehouse uniform and tries to rally the office behind him in declaring Darryl a backstabber. The two bring their argument to Gabe, where Darryl expresses his opinion that Michael has never done anything for him: Ed Truck hired him, Jo Bennett promoted him, and Gabe listened to him, whereas Michael always said no. Michael realizes he needs to listen more to his employees. Darryl apologizes to Michael, and Michael apologizes to Darryl for \"being such a jerk.\" Darryl wishes he was still operating down in the warehouse, but Andy inspires Darryl to further his career at Dunder Mifflin by recounting how he got involved with his a cappella group.",
        "At the end of the episode, Oscar, who changed out of his costume and into regular work clothing, is declared the winner of the coupon book. A series of Survivor-style interviews reveal several employees' reasons for voting for Oscar – Kelly wanted to vote on whom she thought was least likely to win; Ryan explains that as a \"Nader guy\", he always votes for the underdog; and lastly, Creed says he thought Oscar was wearing an excellent Edward James Olmos costume."
    ]
}