{
    "season": 7,
    "title": "Christening",
    "episode": "7",
    "episodes": [
        7
    ],
    "episodeDetails": {
        "sections": [
            {
                "title": "Christening",
                "level": 1,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "\"Christening\" is the seventh episode of the seventh season of The Office and the 133rd episode overall. It was written by Peter Ocko and directed by Alex Hardcastle. It originally aired on November 4, 2010. It was viewed by 7.65 million people."
                    }
                ],
                "images": []
            },
            {
                "title": "Synopsis",
                "level": 2,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Office Administrator Pam tries to discuss Sabre's tips on staying healthy to the office, but is constantly interrupted by Dwight, who believes no attempts should made to improve sanitation, and instead let his immune systems work. He then invites everyone to sneeze on him, and Jim, Erin, and Andy happily fulfill his request."
                    },
                    {
                        "type": "paragraph",
                        "text": "Jim and Pam's daughter Cece, is being christened, and Michael has invited the entire office to the service, much to their disappointment. Michael believes he is Cece's godfather but is disappointed when he learns this is not the case. Toby, who remarks on his history between himself and \"the big Man\", hesitates to enter the church. Over the course of the episode, Ryan frequently hints at his distaste for religion. He paraphrases Karl Marx's \"Opium of the masses\" statement and mentions \"Drinking the Kool-Aid\" while the church's youth group is speaking. During the service, Cece's dress is ruined when Jim changes her diaper. Jim scrambles to replace the gown, and Cece is eventually baptized in an Arcade Fire t-shirt he found in the back of his car. At the end of the mass, the minister announces there will be a reception hosted by Jim and Pam, who panic because they were expecting only family and are not prepared for so many guests."
                    },
                    {
                        "type": "paragraph",
                        "text": "At the reception, food quickly runs out and Cece goes missing after Jim asks Pam's grandmother to keep an eye on her. After finding out from guests that Cece was last seen with a \"short blonde woman\" (Pam's mother Helene, who was changing Cece), Jim thinks Angela (who has insulted Jim and Pam but adored Cece all day) has kidnapped Cece, and calls her out as she is leaving. Believing her to be the kidnapper, Kevin attacks Angela's purse, where she has hoarded some of the food meant for the guests."
                    },
                    {
                        "type": "paragraph",
                        "text": "While Dwight uses the event to try to sell paper and printers, Toby finally enters the church after the ceremony. He looks at the crucifix and simply, achingly asks, \"Why do you have to be so mean to me?\""
                    },
                    {
                        "type": "paragraph",
                        "text": "Michael is inspired by the fellow churchgoers, especially the youth ministry, which is going to Mexico to help build a school for underprivileged children. As the kids leave, Michael shakes hands with every one of them and wishes them luck, before hopping on the bus himself. The other employees try to talk him out of it (with the notable exception of Darryl), but Michael refuses. Just before they leave, Andy (in another attempt to impress Erin) boards the bus with him. Both realize their mistake 45 minutes into the trip, and force the bus to stop. They (along with a kid from the youth ministry who left with them) then have Erin drive them home while having a good laugh about it, and Michael is happy to hear that the rest of his staff went out together to see a movie."
                    }
                ],
                "images": []
            },
            {
                "title": "Cultural references",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "In the cold opening meeting, Kelly throws in a \"yo mama\" joke, also known as maternal insult.",
                                "elements": []
                            },
                            {
                                "text": "Transylvania is a historical region in the central part of Romania, often associated with vampires and the horror genre in general. Dwight claims that the wool there is expensive because of the Euro, but Romania is not in the Eurozone (it has a different currency).",
                                "elements": []
                            },
                            {
                                "text": "Ryan misstates religion as \"the opium of the masses\"; it was Karl Marx who said \"Religion is the opium of the people\".",
                                "elements": []
                            },
                            {
                                "text": "Michael appears to believe Ryan is referencing marijuana as he responds with \"Oobie doobie doo!\", once again showing his inexperience with drug lingo.",
                                "elements": []
                            },
                            {
                                "text": "Michael introduces the question about who the godfather of the child is by doing his somewhat vague Godfather impression.",
                                "elements": []
                            },
                            {
                                "text": "Cece wears an adult size Arcade Fire shirt. Arcade Fire is a Canadian indie rock band.",
                                "elements": []
                            },
                            {
                                "text": "Teach For America is an American non-profit organization that enlists high-achieving recent college graduates and professionals to teach for at least two years in low-income communities throughout the United States. Ryan says they have hotter girls than the ones at the baptism.",
                                "elements": []
                            },
                            {
                                "text": "Michael suggests that they hold a car wash to send some cheerleaders to Regionals. This is a reference to the Glee episode \"Acafellas\".",
                                "elements": []
                            },
                            {
                                "text": "Michael says that his coworkers are like the mean girls in the movie Mean Girls.",
                                "elements": []
                            },
                            {
                                "text": "While driving Michael, Andy, and the random kid, Erin turns on the radio because \"Lake Wobblegon\" is on. She is referring to Lake Wobegon, the setting for the radio show A Prairie Home Companion, on NPR. Its host, Garrison Keillor, is heard.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Amusing Details",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "When Michael enters the bus, one of the kids asks him, \"Are you coming?\" Michael surprisingly doesn't reply with his usual \"That's what she said!\" Apparently his new-found faith made him temporarily less crude.",
                                "elements": []
                            },
                            {
                                "text": "When Michael walks out of the church, next to the door there is a sign that says 'Halbert Christening Reception'.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Deleted Scenes",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Kevin comments that Cece looks just like him.",
                                "elements": []
                            },
                            {
                                "text": "Angela, Kelly, Ryan, and Oscar all talk about having a child. ",
                                "elements": [
                                    {
                                        "text": "Angela: She wants a child and believes she would be a great mother.",
                                        "elements": []
                                    },
                                    {
                                        "text": "Kelly/Ryan: Kelly wants a mixed-race child (much to Ryan's discomfort) and Ryan attempts to talk Kelly down from the idea.",
                                        "elements": []
                                    },
                                    {
                                        "text": "Oscar: He says he doesn't want a kid.",
                                        "elements": []
                                    }
                                ]
                            },
                            {
                                "text": "A family photo is taken, and Michael mistakenly believes he is supposed to be in the photo (when he's actually supposed to take the photo).",
                                "elements": []
                            },
                            {
                                "text": "Dwight puts his business card in all the bibles and hymnals.",
                                "elements": []
                            },
                            {
                                "text": "Erin claims that Gabe \"adopts families\" and in a talking head he flips through photos of many African children. He then explains that when he sent them a photo, the village sent him food (mistakenly believing him to be famished).",
                                "elements": []
                            },
                            {
                                "text": "Ryan talks about his experience volunteering at the Gulf shore, calling it a \"total f--kfest\".",
                                "elements": []
                            },
                            {
                                "text": "Andy runs on the bus and shouts, \"Beer me a shirt!\" However, they are out of shirts and can only give him a pen.",
                                "elements": []
                            },
                            {
                                "text": "Jim and Pam give a toast about Cece, but Pam gets a text from Michael, asking someone to pick them up. Erin immediately grabs her things and bolts out the door.",
                                "elements": []
                            },
                            {
                                "text": "Toby sits on a tree in front of the church, smiling, he says \"You know what Toby? You're gonna be all right.\" He then looks up and talks to a bird happily.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Connections to previous episodes",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Toby is reluctant to enter the church and says that \"It's been a while\". This could be because Toby was in a seminary for a year but dropped out because he wanted to have sex with a girl, as referenced in Casual Friday. It can also be considered a goof as Toby was laying down in a church pew in the episode Niagara, while waiting for Jim and Pam to proceed with their wedding, before being interrupted by Dwight, although he could be nervous about attending Sunday service instead of just entering the church.",
                                "elements": []
                            },
                            {
                                "text": "In Whistleblower, Nick the IT guy leaves Sabre to teach through Teach for America.",
                                "elements": []
                            },
                            {
                                "text": "In a deleted scene, Andy says, \"Beer me a shirt!\" which is most likely a reference to Product Recall where Andy explains that he likes to say \"Beer me\" to get a laugh.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Cast",
                "level": 2,
                "content": [],
                "images": []
            },
            {
                "title": "Main cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Steve Carell as Michael Scott",
                                "elements": []
                            },
                            {
                                "text": "Rainn Wilson as Dwight Schrute",
                                "elements": []
                            },
                            {
                                "text": "John Krasinski as Jim Halpert",
                                "elements": []
                            },
                            {
                                "text": "Jenna Fischer as Pam Halpert",
                                "elements": []
                            },
                            {
                                "text": "B.J. Novak as Ryan Howard",
                                "elements": []
                            },
                            {
                                "text": "Ed Helms as Andy Bernard",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Supporting cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Leslie David Baker as Stanley Hudson",
                                "elements": []
                            },
                            {
                                "text": "Brian Baumgartner as Kevin Malone",
                                "elements": []
                            },
                            {
                                "text": "Creed Bratton (actor) as Creed Bratton",
                                "elements": []
                            },
                            {
                                "text": "Kate Flannery as Meredith Palmer",
                                "elements": []
                            },
                            {
                                "text": "Mindy Kaling as Kelly Kapoor",
                                "elements": []
                            },
                            {
                                "text": "Ellie Kemper as Erin Hannon",
                                "elements": []
                            },
                            {
                                "text": "Angela Kinsey as Angela Martin",
                                "elements": []
                            },
                            {
                                "text": "Paul Lieberstein as Toby Flenderson",
                                "elements": []
                            },
                            {
                                "text": "Oscar Nunez as Oscar Martinez",
                                "elements": []
                            },
                            {
                                "text": "Craig Robinson as Darryl Philbin",
                                "elements": []
                            },
                            {
                                "text": "Phyllis Smith as Phyllis Vance",
                                "elements": []
                            },
                            {
                                "text": "Zach Woods as Gabe Lewis",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Recurring cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Bobby Ray Shafer as Bob Vance",
                                "elements": []
                            },
                            {
                                "text": "Linda Purl as Helene Beesly",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Guest cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Peggy Stewart as Sylvia \"Meemaw\"",
                                "elements": []
                            },
                            {
                                "text": "Robert Pine as Gerald Halpert",
                                "elements": []
                            },
                            {
                                "text": "Perry Smith as Betsy Halpert",
                                "elements": []
                            },
                            {
                                "text": "Rick Overton as William Beesly",
                                "elements": []
                            },
                            {
                                "text": "Zoe Jarman as Carla",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            }
        ]
    },
    "quotesDetails": {
        "sections": [
            {
                "title": "Christening Quotes",
                "level": 1,
                "content": [],
                "images": []
            }
        ]
    },
    "coldOpens": [
        "Pam hosts the Sabre Hygiene Day. Dwight exposes himself to more germs."
    ],
    "storylines": [
        "Office Administrator Pam tries to discuss Sabre's tips on staying healthy to the office, but is constantly interrupted by Dwight, who believes no attempts should made to improve sanitation, and instead let his immune systems work. He then invites everyone to sneeze on him, and Jim, Erin, and Andy happily fulfill his request.",
        "Jim and Pam's daughter Cece, is being christened, and Michael has invited the entire office to the service, much to their disappointment. Michael believes he is Cece's godfather but is disappointed when he learns this is not the case. Toby, who remarks on his history between himself and \"the big Man\", hesitates to enter the church. Over the course of the episode, Ryan frequently hints at his distaste for religion. He paraphrases Karl Marx's \"Opium of the masses\" statement and mentions \"Drinking the Kool-Aid\" while the church's youth group is speaking. During the service, Cece's dress is ruined when Jim changes her diaper. Jim scrambles to replace the gown, and Cece is eventually baptized in an Arcade Fire t-shirt he found in the back of his car. At the end of the mass, the minister announces there will be a reception hosted by Jim and Pam, who panic because they were expecting only family and are not prepared for so many guests.",
        "At the reception, food quickly runs out and Cece goes missing after Jim asks Pam's grandmother to keep an eye on her. After finding out from guests that Cece was last seen with a \"short blonde woman\" (Pam's mother Helene, who was changing Cece), Jim thinks Angela (who has insulted Jim and Pam but adored Cece all day) has kidnapped Cece, and calls her out as she is leaving. Believing her to be the kidnapper, Kevin attacks Angela's purse, where she has hoarded some of the food meant for the guests.",
        "While Dwight uses the event to try to sell paper and printers, Toby finally enters the church after the ceremony. He looks at the crucifix and simply, achingly asks, \"Why do you have to be so mean to me?\"",
        "Michael is inspired by the fellow churchgoers, especially the youth ministry, which is going to Mexico to help build a school for underprivileged children. As the kids leave, Michael shakes hands with every one of them and wishes them luck, before hopping on the bus himself. The other employees try to talk him out of it (with the notable exception of Darryl), but Michael refuses. Just before they leave, Andy (in another attempt to impress Erin) boards the bus with him. Both realize their mistake 45 minutes into the trip, and force the bus to stop. They (along with a kid from the youth ministry who left with them) then have Erin drive them home while having a good laugh about it, and Michael is happy to hear that the rest of his staff went out together to see a movie."
    ]
}