{
    "season": 7,
    "title": "Christening",
    "episode": "7",
    "episodes": [
        7
    ],
    "coldOpens": [
        "Pam hosts the Sabre Hygiene Day. Dwight exposes himself to more germs."
    ],
    "storylines": [
        "Office Administrator Pam tries to discuss Sabre's tips on staying healthy to the office, but is constantly interrupted by Dwight, who believes no attempts should made to improve sanitation, and instead let his immune systems work. He then invites everyone to sneeze on him, and Jim, Erin, and Andy happily fulfill his request.",
        "Jim and Pam's daughter Cece, is being christened, and Michael has invited the entire office to the service, much to their disappointment. Michael believes he is Cece's godfather but is disappointed when he learns this is not the case. Toby, who remarks on his history between himself and \"the big Man\", hesitates to enter the church. Over the course of the episode, Ryan frequently hints at his distaste for religion. He paraphrases Karl Marx's \"Opium of the masses\" statement and mentions \"Drinking the Kool-Aid\" while the church's youth group is speaking. During the service, Cece's dress is ruined when Jim changes her diaper. Jim scrambles to replace the gown, and Cece is eventually baptized in an Arcade Fire t-shirt he found in the back of his car. At the end of the mass, the minister announces there will be a reception hosted by Jim and Pam, who panic because they were expecting only family and are not prepared for so many guests.",
        "At the reception, food quickly runs out and Cece goes missing after Jim asks Pam's grandmother to keep an eye on her. After finding out from guests that Cece was last seen with a \"short blonde woman\" (Pam's mother Helene, who was changing Cece), Jim thinks Angela (who has insulted Jim and Pam but adored Cece all day) has kidnapped Cece, and calls her out as she is leaving. Believing her to be the kidnapper, Kevin attacks Angela's purse, where she has hoarded some of the food meant for the guests.",
        "While Dwight uses the event to try to sell paper and printers, Toby finally enters the church after the ceremony. He looks at the crucifix and simply, achingly asks, \"Why do you have to be so mean to me?\"",
        "Michael is inspired by the fellow churchgoers, especially the youth ministry, which is going to Mexico to help build a school for underprivileged children. As the kids leave, Michael shakes hands with every one of them and wishes them luck, before hopping on the bus himself. The other employees try to talk him out of it (with the notable exception of Darryl), but Michael refuses. Just before they leave, Andy (in another attempt to impress Erin) boards the bus with him. Both realize their mistake 45 minutes into the trip, and force the bus to stop. They (along with a kid from the youth ministry who left with them) then have Erin drive them home while having a good laugh about it, and Michael is happy to hear that the rest of his staff went out together to see a movie."
    ]
}