{
    "season": 7,
    "title": "Viewing Party",
    "episode": "8",
    "episodes": [
        8
    ],
    "coldOpens": [
        "The Scranton Strangler escapes his house. The Scranton Branch watch him on the news and out the window. Michael grabs dirt from the road."
    ],
    "storylines": [
        "The office employees are watching the pursuit of the Scranton Strangler live on television. They see that the chase is heading down their street, so Michael races to the windows, just in time to get a glimpse of the chase. He then goes outside and collects the gravel which the chase occurred on, thinking that it may be of value someday.",
        "Erin and Gabe invite the office over to Gabe's apartment for a Glee viewing party. Before the party, Michael becomes frustrated when Kevin refers to Gabe as his boss. When the show starts at Gabe's place, Michael and Gabe get into an argument over how high the volume should be. After taking turns raising and lowering the volume, Michael retreats to Gabe's bedroom, hoping that his employees will follow him there. Meanwhile, Pam has been having a hard time with getting Cece to go to sleep at night, so Dwight picks her up to try to calm her down. Pam is stunned to find out that Cece becomes completely quiet in Dwight's hands.",
        "Jim changes the channel from the Glee episode so he can check sports scores. Kelly yells at Jim to change the channel back to Glee, but discovers much to her horror that Erin had forgotten to record the episode. In order to avoid being the target of Kelly's anger, Jim goes into the bedroom to see Dwight holding a sleeping Cece. He is visibly uncomfortable when Pam says, \"It's a miracle. She loves him.\" Angela comes into the room and demands that Dwight meet her outside for fulfillment of their sex contract. Dwight is about to leave, but Pam persuades him to stay with the baby. Jim is then forced to feed Dwight a pizza and a beer while Pam goes outside to tell Angela that Dwight cannot see her.",
        "Andy is growing increasingly jealous of Gabe's relationship with Erin. While observing Gabe's room, he becomes intoxicated with a Chinese virility supplement (made from seahorse) Gabe has in his bedroom. The supplement initially works but soon makes Andy sick, prompting him to later admit his jealousy to Phyllis, who decides to help Andy by casually talking to Erin about her relationship with Gabe. Phyllis attempts this by describing the first time she and her husband Bob Vance saw each other naked. She says that they just stared at each other for hours before finally falling asleep. Erin becomes disgusted and walks off. Becoming irritated over the attention people are paying to the TV show, Michael goes outside and pulls the cable connection, causing it to turn off. Hysteria erupts from Kelly and many of the other Glee fans. Michael becomes self-conscious over the commotion he has caused and goes outside to fix the cable.",
        "Outside, Michael is discovered by Erin, who throughout the evening has been trying to encourage Michael to bond with Gabe. Michael, still indignant over the idea that his office views Gabe as his boss, questions Erin as to why she needs his approval, since he's not her father—a statement that is met with complete silence from Erin. Michael, realizing that Erin views him as a father figure, jokes around and tells her to go to her room, leading to a sweet moment between the two. As he leaves the party, Michael warns Gabe that he will, both figuratively and literally, kill Gabe if he breaks Erin's heart. At the end of the episode, Gabe attempts to comfort Andy by singing a song while Andy is throwing up."
    ]
}