{
    "season": 7,
    "title": "WUPHF.com",
    "episode": "9",
    "episodes": [
        9
    ],
    "coldOpens": [
        "The power and server went off. The office tried to figure out the server password which ended up being \"bigboobz\"."
    ],
    "storylines": [
        "In the cold opening, the power goes out briefly when Michael overuses an outlet. When he unplugs the item that was causing the loss of power, the power comes back on. Because of this outage, the company server has shut down and needs to be brought back up immediately. However, the server was set up eight years ago, and everyone has since forgotten the password. After a brief guessing game by the employees of Dunder Mifflin, the password turns out to be \"bigboobz\", with a \"z\". ",
        "Erin comments to Pam that Ryan's new project WUPHF.com is using a lot of Dunder Mifflin supplies after a brief scene of him collecting a large stack of papers from the printer. As the new office administrator and an investor in WUPHF.com, Pam ignores it. Michael and Ryan talk about WUPHF.com and how it has an offer to be purchased, but Ryan insists the company can be worth a lot more money if they had more investors to fine-tune it before they sell. The two make an announcement that they are inviting more people in as investors. No one bites, so the current investors - Darryl, Andy, Pam, and Stanley - meet with Ryan and Michael in the conference room. Everybody wants to sell the company that only has 9 days before bankruptcy, except Ryan, who uses Michael's friendship against him to keep the majority vote. Kelly enters the room, claiming she came up with the idea and that she wants to sue. Ryan coddles her and tells the investors that he'll take care of everything. In the break room, Pam tries to convince Michael that Ryan is using him and that other people could be hurt financially if Ryan doesn't sell WUPHF.com, which is only valuable because of its domain name that will be bought by the Washington University Public Health Fund. Michael claims he has faith in Ryan. Michael tests Pam's theory and when Ryan dodges attempts to hang out, Michael sees some truth. Later, Darryl pulls Ryan out of his closet and the four investors try to bully Ryan into selling, but Michael comes in. He eventually gives Ryan an ultimatum to make WUPHF.com profitable in 9 days. After pondering, Ryan decides to sell the domain name.",
        "Meanwhile, Jim is on a hot sales streak. After talking with Kevin and realizing he isn't getting any commission from his latest sales, he approaches Gabe. Gabe informs him of Sabre's new commission cap but insists Jim still keep busy. With no motivation, Jim grows extremely bored. He decides to focus his efforts on pranking Gabe by editing Jo Bennett's audiobook to insult Gabe and make him sit through the entire thing.",
        "As the owner of the business park, Dwight hosts a Hay Festival in the parking lot. He gets so carried away that he misses his scheduled rendezvous with Angela, who meets Robert Lipton, a widower taking his son to the Hay Festival. The two begin to flirt, and Robert asks Angela if it's alright for him to call her at home. Angela voids Dwight's contract and tapes it to the door of their sexual lounge. At the end of the festival, Dwight crowns himself \"Hay King\" to rectify years of him losing to Mose as a child."
    ]
}