{
    "season": 8,
    "title": "Christmas Wishes",
    "episode": "10",
    "episodes": [
        10
    ],
    "coldOpens": [
        "Stanley demands a traditional Christmas."
    ],
    "storylines": [
        "Andy attempts to make everyone's Christmas wishes come true. At a conference meeting, he vows to keep his promise to make wishes and asks the office members to also be nice to his new girlfriend Jessica. An emotionally confused Erin tries to be nice to Jessica, but ends up drinking too much at the party. In a drunken stupor, she tells Andy that her Christmas wish is for Jessica to die. Kelly does her part as a friend of Erin's by being mean to Jessica. Andy becomes concerned about Erin's behavior, not least because Robert has revealed that his marriage is ending and spends a good deal of the party hanging out with Erin. When Andy has to drive a drunken Meredith home, he sees Erin getting into Robert's car and he follows them with a look of panic on his face. However, he covertly witnesses Robert being a gentleman and sending Erin off to her apartment with a hug and words of encouragement, and drives away with a smile on his face.",
        "Meanwhile, Dwight and Jim's pranking has caused Kathy to ask Andy to move her to a different desk. In turn, Andy sternly tells Dwight and Jim to quit their childish behavior. He tells them that the next one to pull a prank will lose their Christmas bonus, and the target of the prank will get the prankster's share. Unfortunately, Andy's plan backfires, as both Dwight and Jim attempt to frame the other. Jim loudly releases his credit card information hoping Dwight will steal it and buy something ridiculous. However, Dwight orders a $200 dollar bouquet of flowers for Pam. Dwight then proceeds to put a porcupine in his desk and blame Jim. However, a verbal slip-up causes him to inadvertently reveal his intentions. Jim, in retaliation, defaces a picture of his daughter, Cece, and blames Dwight. After Andy mentions that defacing a picture is a fireable offense, Jim admits he staged the crime. Andy admits to Jim that he's nixing the bonus-loss plan, he just wants their behavior to not interfere with their job performances. Jim promises Andy to tone the jokes down and tells him he will tell Dwight. Meanwhile, Dwight continues to deface his own property, writing \"Jim is awesome\" on his car and \"Idiot\" on his forehead. Jim, smirking, tells the camera that he needed to tell Dwight something, but can't quite remember."
    ]
}