{
    "season": 8,
    "title": "The List",
    "episode": "1",
    "episodes": [
        1
    ],
    "coldOpens": [
        "The employees begin planking around the office. Andy is revealed as the new manager of the office and Robert California as the CEO. Pam and Angela are pregnant."
    ],
    "storylines": [
        "Robert California is appointed Regional Manager of the Scranton Branch, but quits on his first day, travels to Florida and convinces Jo Bennett to give him her position as CEO of Dunder Mifflin-Sabre. Andy is then appointed Regional Manager in Scranton, and makes it his goal for the office to receive a half day off on the Friday before the Columbus Day weekend.",
        "Erin finds Robert's notebook recording a list of Scranton's employees in two columns with a line down the middle. This causes the office to become frantic with what the list attributes to. Andy asks Robert about it, who brushes it off as \"doodles,\" and conspicuously moves Andy's name from the left column to the right. Later that day, Robert invites the employees in the left column to lunch, including Jim, Dwight, Angela, Kevin, Phyllis, Toby and Oscar. After they leave, Andy treats the remaining staff to a pizza party, but they are not happy about being left behind and do not respond to his sincere efforts to make them feel better.",
        "During lunch, the \"left-siders\" pester Robert about the list, who, in-between beers, informs them that the left-siders are \"winners\" while the right side are \"losers\". Jim is astonished, but the others become cocky. Kevin sends a mass text to the right-siders, mocking them as \"losers\", and later squirts Meredith with a water pistol. Andy does not like this and confronts Robert with a demand to alter the list. Robert refuses, and then speaks to everyone by admitting to calling certain members of the office losers, but also saying he will be working with them a long time and that his opinions on certain people may very well change, finishing with \"Winners, prove me right; losers, prove me wrong\". Andy, unfazed, lists off the qualities the right-siders have, stating that Stanley may be a grump, but has the best sales record in the office (something Robert admits to being unaware of); Meredith is persistent and does not know what the word \"no\" means; and Pam is one of the kindest people he knows. Andy concedes to Robert that putting Gabe in the losers' column was \"astute\". Andy then demands the Columbus half day, responds to Robert's comment about Columbus being responsible for genocide with \"I DON'T CARE\" and exits, prompting a respecting smile from Robert. Though the office annually gets the half day in any case, they happily wish him good evening as they depart, and Andy looks very pleased with his work as the boss.",
        "Pam is pregnant with her and Jim's second child (revealed to be a boy) and is emotional, easily brought to tears throughout the day. Angela is also pregnant, having married the state senator Robert Lipton over the summer, and says that she's \"Little Preg\" to Pam's \"Big Preg\". When Jim picks up his things to leave for the day, he knocks over a piece of paper. Pam picks it up and sees Jim's personal winners and losers list: Pam, CeCe and their new baby are on the left, and everything else is on the right. Pam tearfully vows to frame it."
    ],
    "quotes": [
        [
            {
                "speaker": "Robert",
                "content": " You want to know the truth? Fine, these are doodles."
            }
        ],
        [
            {
                "speaker": "Andy",
                "content": " What?"
            }
        ],
        [
            {
                "speaker": "Robert",
                "content": " Some people doodle when they are bored, they usually draw houses or penises- funny how the houses are always colonial and the penises are always circumcised. But I can't draw so I draw shapes and lists."
            }
        ],
        [
            {
                "speaker": "Andy",
                "content": " I'm sorry- did you just move my name from one side of the list to the other?"
            }
        ],
        [
            {
                "speaker": "Robert",
                "content": " I might as well have been sketching a cube."
            }
        ]
    ]
}