{
    "season": 8,
    "title": "Special Project",
    "episode": "14",
    "episodes": [
        14
    ],
    "coldOpens": [
        "Pam returns from maternity leave, but Angela returns much more quickly, with a better body and time to bake goodies for the employees."
    ],
    "storylines": [
        "Just as Pam's maternity leave ends, Dwight is assigned the task of forming a team and traveling down to Florida for three weeks to help Sabre launch a chain of retail stores. He and Andy must select employees to accompany Dwight to Tallahassee. At first Dwight chooses Darryl, Phyllis, Toby, Angela, and Oscar, but Andy refuses letting so many essential employees leave for three weeks. While letting Dwight have Darryl and Phyllis, Andy chooses Kelly, Kevin and Cathy to join the team instead, upsetting Dwight. After Dwight announces who will be leaving there is much argument in the office on who gets to go and who does not. Andy decides to let people convince him why they should go before making his final decision.",
        "Meanwhile Jim receives a text from Robert California inviting him on the trip to Tallahassee. After unsuccessfully trying to back out via text, Jim and Pam both agree Jim should just go. The final team includes Cathy, Ryan, Stanley, Erin and Jim, infuriating Dwight. At first he tries to convince the members to change their minds, but after realizing they all have excellent ideas for the project, he is content with the team. Erin expresses frustration that Andy is still with Jessica. After Andy and Dwight jointly choose her for the project team, she relates in a talking head that she is not going to return to Scranton once she arrives in Florida. At the end of the episode, it is revealed that Cathy has ulterior motives for the trip, intending to seduce Jim while the two are in Florida together, stating, during a cell phone conversation to an unidentified friend, that \"... Definitely we will. It's three weeks in Tallahassee. What else is there to do?\"",
        "Darryl discovers warehouse worker Val has knitted him a beanie. Unsure if she intended it as a romantic gift or simply one of friendship, Darryl decides to find out by giving her a Valentine's Day gift of an expensive pair of cashmere ladies' gloves with a romantic card. Upon discovering that Val had knitted a beanie for everyone in the warehouse, an embarrassed Darryl passes the gloves off to warehouse worker Nate, who's moved by the gift. Darryl is further disappointed when a man named Brandon calls asking for the address of the warehouse to send flowers to his girlfriend Val. He's intrigued, however, when she says the flowers were from her mother, despite him pointing out the caller had a deep voice and went by the name Brandon. Darryl decides that Val's gift was \"a love beanie\"."
    ]
}