{
    "season": 8,
    "title": "Jury Duty",
    "episode": "13",
    "episodes": [
        13
    ],
    "coldOpens": [
        "Andy dances to \"Footloose\" in the warehouse. "
    ],
    "storylines": [
        "Starting the episode, Andy goes down to the warehouse and asks Val if he could have the area to himself. He compares stress to a mayor who decrees it is illegal to dance—as in the plot of Footloose—and relieves his stress by dancing and making a mess in the warehouse. Andy later adds that sex is also a viable option to relieve stress.",
        "Jim returns from jury duty and learns that, in his absence, many of his co-workers were forced to make up for his vacancy, often suffering setbacks and inconveniences in the process. Jim reveals to the camera that, while he was called for duty, he was dismissed at noon and headed home to Pam and their two children; he saw that Pam was overwhelmed and took the rest of the week off to help take care of their children. After \"reenacting\" the crime for his interested co-workers, Dwight begins to question Jim on every detail of his case. Dwight goes to great lengths to try and get Jim to reveal the truth, and figures out Jim was lying about jury duty. Ashamed, Jim admits his guilt to Andy who, although upset, understands Jim's plight. He, therefore, agrees to help Jim cover up his story by telling the now-suspicious office workers that he drove Jim to the courthouse every morning, a ridiculous lie because Andy lives near the courthouse but a long way from Jim and Pam's home.",
        "Soon, Jim and Andy begin disagreeing whether they should continue the charade or admit the truth. Jim eventually does the latter, much to the chagrin of his fellow co-workers. Dwight is thrilled at the confession because Andy had said earlier he would fire Jim if he had lied about his absence, but Andy says he will not fire Jim, and instead gives him a mild-looking slap to the face as punishment. Dwight furiously calls up Gabe so he can turn Jim in and \"the office stickler will do what he does best...stickle!\" To smooth things over, Jim and Pam bring in their children, Cece and Phillip, to present pictures that they drew for the co-workers. It becomes clear that Jim and Pam drew the pictures themselves to appease their co-workers, but before the members of the office can berate the couple, Cece and Phillip simultaneously begin crying loudly, creating a cacophony that Jim and Pam struggle to control, and which shocks the office workers. Realizing the stress that having young children causes, the office workers, ultimately, do not blame Jim for his behavior and even suggest he leave early to help Pam.",
        "Meanwhile, Angela and her husband, state senator Robert Lipton, welcome their new baby, also named Phillip. Oscar, Kevin, Erin, and Gabe all visit Angela at the hospital. According to Angela, the baby was born prematurely, but due to the size, Oscar correctly deduces that Angela lied about the date of conception. Angela admits that the baby was conceived a month before her wedding, but makes him promise not to tell anyone. Oscar later breaks his promise to Dwight, who barges in on Angela and her husband and begins thoroughly examining the child. When the senator leaves, Dwight confronts Angela about the child, claiming that it is his. She refutes his claim, but Dwight leaves satisfied, telling the attending nurse to call off the baby's circumcision, which the nonplussed nurse refuses to do. Upon returning to Dunder Mifflin he drops his dispute with Jim, since his self-assumed fatherhood has given him a new appreciation for the duties of parenthood. The episode ends with Dwight putting a decal on his car, in honor of his covert new family member."
    ]
}