{
    "season": 8,
    "title": "Get the Girl",
    "episode": "19",
    "episodes": [
        19
    ],
    "coldOpens": [
        "The employees go down to the warehouse to see a balloon falling from the ceiling. They realize how unaccomplished their lives are and decide to kill the balloon."
    ],
    "storylines": [
        "Andy drives all the way to Florida to try and woo back Erin, where she has been living with the elderly Irene and her middle-aged grandson, Glenn (Brad Morris), as a live-in maid. He surprises Erin by popping out of a delivery box and singing \"Signed, Sealed, Delivered I'm Yours\", but she is not particularly excited to see him and states she does not want to go back to Scranton with him. The situation is further complicated when Andy reveals to Erin that he has not yet broken up with current girlfriend, Jessica. Andy tells Erin he loves her, but she rejects him; Andy subsequently leaves, his feelings crushed. Irene, who had been treating Andy with disdain over the way Erin spoke of him, sees that he is a nice person and encourages Erin to go back with him. She runs up to him in his car and they share a kiss before heading back to Scranton.",
        "Meanwhile, Nellie shows up in Scranton after Robert California allows her to have a job there. She is invited to take an open desk, and she takes Andy's manager desk, as he is currently in Florida. Jim says she cannot take Andy's job, but Robert is interested in her spontaneous behavior. As acting manager, Nellie decides to give everyone performance reviews. Both Jim and Dwight refuse to let her proceed, as she is unfamiliar with the other employees. To counter this, Nellie offers Dwight a raise on the spot, and eventually, he and the other employees relent, save for Jim. When it is Jim's turn, Jim still refuses. Everyone in the office, save for Jim and Pam, applaud her. Nellie promptly begins rearranging the office."
    ],
    "quotes": [
        [
            {
                "speaker": "Irene",
                "content": " Hmm.... what kind of tea is this?"
            }
        ],
        [
            {
                "speaker": "Erin",
                "content": " Oh, you were out of tea so I just boiled some Gatorade"
            }
        ],
        [
            {
                "speaker": "Robert California",
                "content": " Jim, would you like a sex metaphor or a nature metaphor"
            }
        ],
        [
            {
                "speaker": "Jim",
                "content": " Nature"
            }
        ],
        [
            {
                "speaker": "Robert California",
                "content": " In nature, when two animals are mating they are exhibing signs towards one anothers... you know what, this isn't helpful, let me just go with the sex metaphor."
            }
        ],
        [
            {
                "speaker": "Jim",
                "content": " Was that not the sex metaphor?"
            }
        ]
    ]
}