{
    "season": 8,
    "title": "Pool Party",
    "episode": "12",
    "episodes": [
        12
    ],
    "coldOpens": [
        "Jim pranks Dwight by placing meatballs in odd spots to make Stanley laugh. Dwight and Stanley reveal they have been scheming to get Jim to give them meatballs."
    ],
    "storylines": [
        "During Pam's absence, Jim decides to focus on Stanley as his main audience to entertain with his pranks on Dwight. After a few trial and error (e.g., replacing Dwight's desk with Lego or replacing Dwight himself with a dog dressed as him), the only kind of pranks that will make Stanley laugh are ones that involve meatballs. As Stanley bids Phyllis farewell after work, he parts ways with her and enters Dwight's car with Dwight already in the driver's seat. It is revealed that Dwight and Stanley had formed an alliance to trick Jim into buying meatballs for pranks, allowing them to collect said meatballs without having to buy it themselves.",
        "After Robert California decides to sell his mansion following his divorce, Kevin suggests that he have an office pool party. At the pool party, Andy brings along his girlfriend Jessica. Andy also brings an engagement ring his Jessica-approving mother gave him, hoping to propose. The ring goes missing from Andy's pants and he is horrified at first that he cannot find it. Kelly and Phyllis later find the ring and decide, based on the superstition of finding a lost ring, that it is evil and must be destroyed. Erin, after learning that Andy \"stalked\" her home following the Christmas party, decides to make Andy jealous by flirting with Dwight.",
        "Initially, Dwight refuses, but after realizing that Erin chose him because he was the \"manliest man in the office,\" he agrees to help her. The two flirt outrageously whenever Andy is close by, but Andy doesn't notice. In a last-ditch effort, Erin and Dwight challenge Andy and Jessica to a game of Chicken Wars. Dwight and Erin make it their mission to not go undefeated, however, Dwight passes out in the water, ending the game. When Dwight falsely tells Andy he wants to pursue a romance with Erin and avoid an \"Angela-type situation\" between them, he asks Andy for his consent. Andy then agrees but looks somber and asks if Dwight can take things slowly, leading Dwight to read his emotions and sincerely tell him \"You're an idiot\". Erin later swims up to Andy with the lost ring—it was set in the pool with a tiny pyre by Kelly—and he admits he's not sure what he's thinking, with Erin being very happy and saying she can live with him being confused.",
        "Meanwhile, Robert gives everyone a tour of his massive home. Robert spends most of the time opining about the parties he never had. He offers everyone a free bottle of wine from his wine cellar and the staff proceeds to get drunk. During these escapades, Jim attempts to find an excuse to leave the party and return to his wife and kids. However, Robert insists that Jim continue along with the tour, seeming to enjoy Jim's unease after Jim made a pointed jibe about Robert's house complaints. Finally, Robert realizes that he is hosting one of the parties he never had, at which point he jumps into the pool completely naked, followed by Gabe and Ryan, who have each been battling to impress him. Jim takes this as his cue to leave, sneaking away before anyone notices he's missing. At night's end, Gabe and Ryan are drunkenly hanging out with Robert, refusing to leave his house and concede the end of their brown-nosing battle, even as the CEO passes out."
    ],
    "quotes": [
        [
            {
                "speaker": "Robert California",
                "content": " This room was meant to watch wonderful, erotic movies like \"Last Tango in Paris\"... instead the last movies I watched in here were \"Marley and Me\" and \"On Golden F***** Pond\"."
            }
        ],
        [
            {
                "speaker": "Val",
                "content": " Does Darryl not swim?"
            }
        ],
        [
            {
                "speaker": "Kevin",
                "content": " That's racist!"
            }
        ],
        [
            {
                "speaker": "Jim",
                "content": " I am the master of leaving parties early, not to brag or anything, but I was out of New Years by 9 o'clock."
            }
        ]
    ]
}