{
    "season": 8,
    "title": "Trivia",
    "episode": "11",
    "episodes": [
        11
    ],
    "coldOpens": [
        "The employees see how long they can go without talking. Kevin breaks the streak by eating a candy bar and saying \"Oh Yeah\"."
    ],
    "storylines": [
        "The cold opening begins with Dwight making a shushing gesture to the camera crew. Jim enters via the break room to hand Stanley a cup of orange juice and on his way to his desk, Andy shows Jim the time on his watch, to which Jim replies with a thumbs up. The entire office seem to go about their usual routine, but not one person is speaking. Jim reveals in a silent Talking Head that the whole office has arranged a challenge of a silent streak that has been going on for fourteen minutes thus far. Dwight receives a call and out of fear of breaking the streak, he picks up the phone and places it back down, refusing to answer and sparking a silent acknowledgement and cheer from his colleagues. In his office, Andy spots a raccoon eating a hamburger in the parking lot and excitedly (and silently) attempts to tell his employees. Kevin opens the wrapper of his candy bar and as he eats it, he exclaims, \"Oh yeah,\" breaking the silent streak. Oscar berates Kevin on his need to vocalize his phrase while Jim proposes that the entire office attempt to beat the record of twenty minutes after they have let out as much speaking as possible. Andy finally informs the office about the raccoon, Dwight tells Jim that the banging of his pen against his desk irritates Dwight, Erin asks the office if a first-aid kit is available for the noticeable cut on her hand and Darryl showcases a new song that he has written. The scene concludes with Jim counting down to restart the silent streak challenge.",
        "Andy, who is worried that he will not be able to meet the 8% quarterly sales growth figures that Robert California asked for by $830, starts to think of creative ways to sell more paper. During a conference room meeting, he proposes that everyone in the office buy paper to alleviate some of the burden, but no one is willing. He then decides to ask Oscar to make a rounding mistake in the books, but Oscar tells Andy that he does not have time to make the mistake because he is leaving for a trivia contest in a bar in Philadelphia. He tells Andy that the prize is $1000 and his team is determined to win it. Andy, encouraged by Darryl and Jim, decides to take the entire office to Philadelphia in an attempt to win the money and make up the sales growth difference. At the bar, which turns out to be a gay bar called the Liberty Well, Andy divides the office into three teams: Dunder Mifflin A-Team (Jim, Darryl, Andy, and Ryan), Dunder-Mifflin B-Team (Stanley, Phyllis, Creed, and Cathy), and the \"Just For Fun\" team (Kevin, Kelly, Erin, and Meredith). Oscar refuses to join Andy and stays on his original team. Initially, the Dunder Mifflin A-Team does well until they soon falter. However, much to Andy's surprise, the \"Just For Fun\" team (calling themselves The Einsteins) ends up doing much better than expected because of the group's trivial knowledge on a variety of issues. Humorously, the team misses the answers to a handful of common questions, including one about their namesake. They make it to the final round against Oscar's team and eventually win thanks to Kevin's correct answers. However, the Just for Fun team's luck runs out when they later get demolished while trying to win another bar's even more lucrative trivia contest.",
        "Meanwhile, Dwight heads down to Florida to meet with Robert California at the Sabre headquarters to discuss a possible manager position. While sitting in the waiting room, Dwight talks to Gabe, who describes himself as the \"toilet of the company\" who flushes all the unwanted items away. Robert then tells Dwight that he cannot meet with him but will have him meet with Bill, another executive, much to Dwight's frustration. However, Robert manipulates the situation by secretly calling Gabe and instructing him to not let Dwight speak with Bill either, but to have Gabe listen to Dwight's pitch and then reject him. Dwight, after being told by Gabe that he is not wanted as a manager, grabs and twists Gabe's arm and forces him to be taken to Robert's Florida condo. Initially, Robert tries to spare Dwight's feelings, but eventually turns him down by telling him he's a better salesman and his drive and energy would be wasted in a manager's position. Dwight then returns to Scranton."
    ],
    "quotes": [
        [
            {
                "speaker": "Robert",
                "content": " They haven’t really improved on the OREO, have they?"
            }
        ]
    ]
}