{
    "season": 8,
    "title": "Tallahassee",
    "episode": "15",
    "episodes": [
        15
    ],
    "coldOpens": [
        "Dwight wakes up the entire Tallahassee team in the hotel extremely early. Jim pranks Dwight by pretending to have been murdered in his room."
    ],
    "storylines": [
        "Dwight discusses the plan he has for the office staff on how their trip will go. He gets up early and allows for everyone to get ready by waking them up early as well. He scares Cathy awake, gets Erin up (who fell asleep reading the mattress tag), wakes Stanley up by holding his nose, Erin pretends to seduce Ryan to get him up and the two are pranked when they go to wake Jim up. Jim, who has been up for awhile, has set his hotel room up to look like he has been targeted by a gang and then proceeds to drop out of the closet pretending to be dead upon Dwight and Erin's arrival.",
        "Dwight prepares for the important meeting they are to have with Nellie Bertram, the company's Special Projects President. Jim runs into Stanley driving a red sports convertible with sunglasses and he invites Jim for a ride. At the meeting, Jim pranks Dwight by making him believe that he has poisoned Dwight. Nellie Bertram then arrives and begins to talk about the special project they are all here to work on. Jim and Dwight are horrified when they realize that Todd Packer is here as well, having landed on his feet after they sent him to Florida to pursue a fake corporate job as a ploy to get rid of him. Dwight begins to realize that he has severe pains and realizes he has to go to the hospital. He begins to leave as he is in horrible pain but suddenly realizes that Nellie is offering the position of VP of the project to anyone who can \"wow her\". Dwight decides to ignore his injury and stay. He attempts to participate but eventually falls over and is escorted to the hospital.",
        "At the office, the staff begin to wonder why it's so quiet. They suddenly realize it's because Erin has put all the phones on silent and there is no one to be the receptionist. After a failed attempt to get Pam to fill in at reception, Andy volunteers and begins to realize he really likes the job.",
        "Dwight returns to the meeting, hours after having had an appendectomy. He joins Jim, Ryan, Cathy, Erin, and Stanley as all the people have broken off into groups to all do a sales related presentation. Dwight decides to give the presentation despite being the only group member to not do any research or help with the PowerPoint. After nearly butchering the presentation, he finally impresses Bertram by telling the audience that the only element of marketing that matters is \"desire.\" Bertram subsequently invites Packer and Dwight to have breakfast with her the following day."
    ],
    "quotes": [
        [
            {
                "speaker": "Nellie",
                "content": " Hmm, expecting a man as your Special Projects Manager? A man with a huge whopping penis? No, sorry to disappoint but I am not that person. Think of my brain as the huge whopping penis. So stop staring at my breasts- and start staring at my penis!"
            }
        ],
        [
            {
                "speaker": "Dwight",
                "content": " Philip... you are the rightful heir to Schrute Farms... please, you must kill Mose before he kills you! - calls another number- Mose... just a quick heads up!"
            }
        ]
    ]
}