{
    "season": 8,
    "title": "Test the Store",
    "episode": "17",
    "episodes": [
        17
    ],
    "coldOpens": [
        "Dwight plans the opening of the Sabre Store. Erin pretends to be a hipster in line."
    ],
    "storylines": [
        "At the Sabre store opening, Dwight Schrute attempts to put on a theatrical presentation to impress Nellie Bertram. Dwight assigns the members of his team various tasks: Erin is to act as a disaffected hipster named Tabitha, to create hype for the Sabre Pyramid, Cathy is to flirt with the bloggers, Ryan is to give a presentation to wow the critics, Todd Packer is to play the part of a sexual predator — much to Packer's chagrin.",
        "As the grand opening progresses, things begin to fall apart. Several bloggers notice Jim not using his Sabre Arrowhead phone, resulting in a reprimand from Nellie. Erin disappears with a group of seniors after Dwight drives them away, fearing their age will frighten the youth. Finally, Ryan has a panic attack and, after being consoled by Dwight and Jim — who imitate Kelly and his mother respectively in an attempt to calm him down — leaves to go to his parents' house. Jim is forced to give the presentation, which, despite a rocky start, impresses the crowd. After the opening, Dwight is named VP by Nellie.",
        "Back in Scranton, Andy tries to protect Pam from a group of kids who are throwing pine cones at her, and a young girl, Tiffany, punches him in the eye. Andy tells a false story about stepping in when a \"gang\" harassed Pam, and Toby arranges a meeting in the conference room to discuss self-defense. Andy is then humiliated when Tiffany is brought in by her mother and half-apologizes to him and Pam. However, after a provoked Kelly begins physically harassing Toby, Andy steps in between the two to break the fight up, resulting in his other eye being blackened. The rest of the office laughs but shuts up when Andy points out he got hit twice because he defended other people who were being attacked. The episode concludes with Andy noting that he took a bunch of pain medication, drank a half a bottle of wine, and took his pants off, thus greatly improving his feelings as the day ends."
    ]
}