{
    "season": 8,
    "title": "Angry Andy",
    "episode": "21",
    "episodes": [
        21
    ],
    "episodeDetails": {
        "sections": [
            {
                "title": "Angry Andy",
                "level": 1,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "\"Angry Andy\" is the twenty-first episode of the eighth season of the American comedy television series The Office and is the show's 173rd overall. It was directed by Claire Scanlon and written by Justin Spitzer. It originally aired on NBC on April 19, 2012. It was viewed by 4.35 million people."
                    }
                ],
                "images": []
            },
            {
                "title": "Synopsis",
                "level": 2,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "As it is raining, Jim makes a bet with his coworkers that if by noon Phyllis says all her rainy day cliches, he will buy them all hot chocolate. The staff all work together and prompt her to say 11 out of the 12 with the last one being \"This rain makes me want to curl up with a good book\" however they fail in getting her to say it. She reveals to the cameras that normally she would but \"everyone is being so nice today!\""
                    },
                    {
                        "type": "paragraph",
                        "text": "Andy and Erin return from their trip, but Andy's joy is short-lived when he sees Kevin wearing Andy's Cornell sweater and greatly stretching it out due to his girth. Andy realizes that the new manager, Nellie Bertram, has given all of his possessions to the various office staff. Andy also notices his wood sailor statue, \"Old Salty\" is now on Dwight's desk and has been converted into a bobblehead. Andy goes to meet Nellie and kindly asks that, whenever she gets the chance, he'd like his office back, but Nellie refuses to step down. Andy goes to get Robert in hopes that he can return his position. Robert tells Nellie that Andy is the manager and she must step down, but Nellie flirts with Robert causing him to become indecisive and rather than choose between the right thing and the easy thing he simply tells them that they can figure it out themselves. Nellie threatens to dock Andy's pay unless he gets out of \"her\" office and Angela does so when Andy refuses. Andy tries to do the same, but Angela does not display the same loyalty. Andy finally leaves when Nellie threatens to dock it $10,000. Andy appears weak in front of his coworkers and becomes impotent with Erin later that night."
                    },
                    {
                        "type": "paragraph",
                        "text": "Meanwhile Pam has set Kelly up with her and Jim's pediatrician, Ravi. Ravi is very smart and very loyal, unlike Ryan. Ryan expresses dislike for Ravi and begins to grow jealous of him. He tries several immature tactics to get Kelly back such as reminding them of all the good times they had (actually good times shortly before a fight) and telling her he has written poetry about her, but his heart would break if he read it. The office staff is skeptical of this."
                    },
                    {
                        "type": "paragraph",
                        "text": "Erin becomes concerned with Andy and asks Dwight if he experienced being impotent when he lost the manager's position. Dwight, who briefs Nellie every day, informs Nellie that she has successfully crushed Andy to nothing. Nellie expresses regret and holds a meeting about impotence which further embarrasses Andy."
                    },
                    {
                        "type": "paragraph",
                        "text": "Andy is moved back to sales and feels even more humiliated when he tells his dad and he just makes him feel even more weak. Erin, who has seen enough of Andy like this, decides to stand up to Nellie and yells at her. Andy joins in and also yells at Nellie in front of the office about how terrible she is. Robert comes out to calm Andy down, however Andy throws a chair at Robert much to the staff's surprise. Andy then punches a hole through the same wall he did in Season 3 prompting Darryl to remark, \"He does not like that wall.\""
                    },
                    {
                        "type": "paragraph",
                        "text": "Ryan's stunts to get Kelly back finally culminate with him waiting in the parking lot dressed in ceremonial Indian garb, sitting upon a horse dressed in a similar way. In a round-about way, he asks Kelly to marry him, but the proposal is more \"eventual\" rather than setting a date. Kelly tells Ryan that she loves Ravi, and she gives Ryan a goodbye hug, but it soon turns into a make out session."
                    },
                    {
                        "type": "paragraph",
                        "text": "Andy and Erin wait for Robert to make a decision on who the Regional Manager should be and the two wonder if they will both be sent to Anger Management. Robert calls them into Nellie's office and tells them he is going to put Nellie in charge and that Andy will go back to sales. Andy refuses to accept this and tells Robert no. Robert tells him that he can't say no, but Andy continues to say no. Robert then threatens that if Andy says no one more time then he will fire him. Andy thinks for a second and then once again says no. Andy is promptly fired which gives him a feeling of control and power in his life causing him to once again be able to sexually perform with Erin."
                    },
                    {
                        "type": "paragraph",
                        "text": "Pam and Jim manage to find some of Ryan's poetry in a recycling bin. They think it will be pitiful and stupid and something they can laugh at; however, it ends up being extremely powerful and emotional bringing them both to tears. Jim tells the cameras that Ryan can never know that they thought it was good."
                    }
                ],
                "images": []
            },
            {
                "title": "Cultural references",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Dwight describes his new bobblehead character, Captain Mutato, from an X-Men fan fiction: he is half man, half mermaid. The correct term for a male mermaid is merman.",
                                "elements": []
                            },
                            {
                                "text": "Robert says that the American investor Warren Buffett operates the same way as him.",
                                "elements": []
                            },
                            {
                                "text": "Dwight compares his erect penis to the Washington Monument and Eiffel Tower.",
                                "elements": []
                            },
                            {
                                "text": "Nellie \"quotes\" former prime minister of the UK, Margaret Thatcher and says she didn't really see the movie.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Connections to previous episodes",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Ryan once again only wants the girl he can't have. Previous examples include Katy (Email Surveillance), Karen  (Women's Appreciation), Pam (Dunder Mifflin Infinity) and Erin (various episodes beginning with Double Date).",
                                "elements": []
                            },
                            {
                                "text": "The neon beer sign Michael gave Ryan in Goodbye, Michael is seen in his \"office\".",
                                "elements": []
                            },
                            {
                                "text": "Andy references his anger issues from previous episodes Gay Witch Hunt and The Return. He also punches the same wall he did the last time.",
                                "elements": [
                                    {
                                        "text": "When Andy punches the wall, Darryl makes the comment \"He does not like that wall\". This is odd, since Darryl wasn't in the office at the time Andy punched the wall the first time in The Return. However, Darryl may have been told about it or have seen the aftermath.",
                                        "elements": []
                                    }
                                ]
                            },
                            {
                                "text": "Dwight tries to erect his penis during the meeting; he has previously mentioned his ability to 'retract his penis up into itself' in Blood Drive.",
                                "elements": []
                            },
                            {
                                "text": "Robert mentions Warren Buffett, who appeared in Search Committee.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Amusing details/Trivia",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Nellie says, \"Small, bigger, biggest. Sexual innuendo, not intentional!\" Michael Scott would have just said, \"That's what she said!!\"",
                                "elements": []
                            },
                            {
                                "text": "During the conference room meeting, Creed jinxes Robert by saying \"Jinx, buy me some coke\" instead of the traditional \"buy me a Coke\", a hint at Creed's obscure personal life.",
                                "elements": []
                            },
                            {
                                "text": "Also during the meeting, Gabe comments that Erin never liked having sex. This shows Erin never liked Gabe possibly.",
                                "elements": []
                            },
                            {
                                "text": "In the opening, by pausing when Jim shows his list of Phyllis' 12 rainy day clichés, they can be briefly seen. ",
                                "elements": []
                            }
                        ]
                    },
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "The plants are going to love this.",
                                "elements": []
                            },
                            {
                                "text": "I sure don't want to get stuck in this on the way home.",
                                "elements": []
                            },
                            {
                                "text": "It's raining cats and dogs.",
                                "elements": []
                            },
                            {
                                "text": "The humidity is gonna make my hair freak.",
                                "elements": []
                            },
                            {
                                "text": "The roads are slickest in the first half hour.",
                                "elements": []
                            },
                            {
                                "text": "I actually sleep better in the rain.",
                                "elements": []
                            },
                            {
                                "text": "We're paying for all the sun we got this year.",
                                "elements": []
                            },
                            {
                                "text": "This weather just makes me want to stay at home, curled up with a good book.",
                                "elements": []
                            },
                            {
                                "text": "If we lived in Seattle, every day would be like this.",
                                "elements": []
                            },
                            {
                                "text": "I wish I were allowed one rain check a year.",
                                "elements": []
                            },
                            {
                                "text": "I love the smell after it rains.",
                                "elements": []
                            },
                            {
                                "text": "Nobody knows how to drive in the rain.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Cast",
                "level": 2,
                "content": [],
                "images": []
            },
            {
                "title": "Main Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Rainn Wilson as Dwight Schrute",
                                "elements": []
                            },
                            {
                                "text": "John Krasinski as Jim Halpert",
                                "elements": []
                            },
                            {
                                "text": "Jenna Fischer as Pam Halpert",
                                "elements": []
                            },
                            {
                                "text": "B.J. Novak as Ryan Howard",
                                "elements": []
                            },
                            {
                                "text": "Ed Helms as Andy Bernard",
                                "elements": []
                            },
                            {
                                "text": "James Spader as Robert California",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Supporting Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Catherine Tate as Nellie Bertram",
                                "elements": []
                            },
                            {
                                "text": "Leslie David Baker as Stanley Hudson",
                                "elements": []
                            },
                            {
                                "text": "Brian Baumgartner as Kevin Malone",
                                "elements": []
                            },
                            {
                                "text": "Creed Bratton (actor) as Creed Bratton",
                                "elements": []
                            },
                            {
                                "text": "Kate Flannery as Meredith Palmer",
                                "elements": []
                            },
                            {
                                "text": "Mindy Kaling as Kelly Kapoor",
                                "elements": []
                            },
                            {
                                "text": "Ellie Kemper as Erin Hannon",
                                "elements": []
                            },
                            {
                                "text": "Angela Kinsey as Angela Martin",
                                "elements": []
                            },
                            {
                                "text": "Paul Lieberstein as Toby Flenderson",
                                "elements": []
                            },
                            {
                                "text": "Oscar Nunez as Oscar Martinez",
                                "elements": []
                            },
                            {
                                "text": "Craig Robinson as Darryl Philbin",
                                "elements": []
                            },
                            {
                                "text": "Phyllis Smith as Phyllis Vance",
                                "elements": []
                            },
                            {
                                "text": "Zach Woods as Gabe Lewis",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Recurring Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Mark Proksch as Nate",
                                "elements": []
                            },
                            {
                                "text": "Sendhil Ramamurthy as Ravi",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            }
        ]
    },
    "quotesDetails": {
        "sections": [
            {
                "title": "Angry Andy Quotes",
                "level": 1,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Ryan: I know we have may have no been right together in the past but its weird... I'd rather she be alone than with someone... is that love?"
                    },
                    {
                        "type": "paragraph",
                        "text": "Jim: That's about it... yeah."
                    },
                    {
                        "type": "paragraph",
                        "text": "Robert California: I never allow a sexual desire influence a business decision, so i find it best to recuse myself temporairly to make love then I go back and analyze the situation rationally... Buffet operates the same way."
                    },
                    {
                        "type": "paragraph",
                        "text": "Pam: I saw you talking to Ryan a little while ago."
                    },
                    {
                        "type": "paragraph",
                        "text": "Kelly: Yeah, he's so sweet, he pointed to my latte and said \"That would be the color of our children\""
                    },
                    {
                        "type": "paragraph",
                        "text": "Pam: Yeah he is... great... remember what it felt like when he cheated on you though?"
                    },
                    {
                        "type": "paragraph",
                        "text": "Kelly: Which time?"
                    },
                    {
                        "type": "paragraph",
                        "text": "Nellie: Take a man's job but leave him his balls... Margaret Tatcher said that... probably... don't know... don't read, didn't see the movie."
                    },
                    {
                        "type": "paragraph",
                        "text": "Nellie: No, no, no.... I myself have never been in that arena, I myself have been with several older men."
                    },
                    {
                        "type": "paragraph",
                        "text": "Robert and Creed: How old?"
                    },
                    {
                        "type": "paragraph",
                        "text": "Creed: Jinx! Buy me some coke."
                    },
                    {
                        "type": "paragraph",
                        "text": "Erin: Toby, doesn't HR have a rule against talking about this kind of stuff?"
                    },
                    {
                        "type": "paragraph",
                        "text": "Toby: Erin, HR's a joke, I can't do anything about anything."
                    },
                    {
                        "type": "paragraph",
                        "text": "Andy: AND.... YOUR STUPID OFFICE!"
                    },
                    {
                        "type": "paragraph",
                        "text": "- punches hole in the same wall he punched a hole in in Season 3 - (The Return)"
                    },
                    {
                        "type": "paragraph",
                        "text": "Darryl: He does not like that wall..."
                    }
                ],
                "images": []
            }
        ]
    },
    "coldOpens": [
        "The employees count how many cliches about the rain Phyllis says. Phyllis enjoys the fact that the other employees are listening to her, and because of this, she doesn't say the last one."
    ],
    "storylines": [
        "As it is raining, Jim makes a bet with his coworkers that if by noon Phyllis says all her rainy day cliches, he will buy them all hot chocolate. The staff all work together and prompt her to say 11 out of the 12 with the last one being \"This rain makes me want to curl up with a good book\" however they fail in getting her to say it. She reveals to the cameras that normally she would but \"everyone is being so nice today!\"",
        "Andy and Erin return from their trip, but Andy's joy is short-lived when he sees Kevin wearing Andy's Cornell sweater and greatly stretching it out due to his girth. Andy realizes that the new manager, Nellie Bertram, has given all of his possessions to the various office staff. Andy also notices his wood sailor statue, \"Old Salty\" is now on Dwight's desk and has been converted into a bobblehead. Andy goes to meet Nellie and kindly asks that, whenever she gets the chance, he'd like his office back, but Nellie refuses to step down. Andy goes to get Robert in hopes that he can return his position. Robert tells Nellie that Andy is the manager and she must step down, but Nellie flirts with Robert causing him to become indecisive and rather than choose between the right thing and the easy thing he simply tells them that they can figure it out themselves. Nellie threatens to dock Andy's pay unless he gets out of \"her\" office and Angela does so when Andy refuses. Andy tries to do the same, but Angela does not display the same loyalty. Andy finally leaves when Nellie threatens to dock it $10,000. Andy appears weak in front of his coworkers and becomes impotent with Erin later that night.",
        "Meanwhile Pam has set Kelly up with her and Jim's pediatrician, Ravi. Ravi is very smart and very loyal, unlike Ryan. Ryan expresses dislike for Ravi and begins to grow jealous of him. He tries several immature tactics to get Kelly back such as reminding them of all the good times they had (actually good times shortly before a fight) and telling her he has written poetry about her, but his heart would break if he read it. The office staff is skeptical of this.",
        "Erin becomes concerned with Andy and asks Dwight if he experienced being impotent when he lost the manager's position. Dwight, who briefs Nellie every day, informs Nellie that she has successfully crushed Andy to nothing. Nellie expresses regret and holds a meeting about impotence which further embarrasses Andy.",
        "Andy is moved back to sales and feels even more humiliated when he tells his dad and he just makes him feel even more weak. Erin, who has seen enough of Andy like this, decides to stand up to Nellie and yells at her. Andy joins in and also yells at Nellie in front of the office about how terrible she is. Robert comes out to calm Andy down, however Andy throws a chair at Robert much to the staff's surprise. Andy then punches a hole through the same wall he did in Season 3 prompting Darryl to remark, \"He does not like that wall.\"",
        "Ryan's stunts to get Kelly back finally culminate with him waiting in the parking lot dressed in ceremonial Indian garb, sitting upon a horse dressed in a similar way. In a round-about way, he asks Kelly to marry him, but the proposal is more \"eventual\" rather than setting a date. Kelly tells Ryan that she loves Ravi, and she gives Ryan a goodbye hug, but it soon turns into a make out session.",
        "Andy and Erin wait for Robert to make a decision on who the Regional Manager should be and the two wonder if they will both be sent to Anger Management. Robert calls them into Nellie's office and tells them he is going to put Nellie in charge and that Andy will go back to sales. Andy refuses to accept this and tells Robert no. Robert tells him that he can't say no, but Andy continues to say no. Robert then threatens that if Andy says no one more time then he will fire him. Andy thinks for a second and then once again says no. Andy is promptly fired which gives him a feeling of control and power in his life causing him to once again be able to sexually perform with Erin.",
        "Pam and Jim manage to find some of Ryan's poetry in a recycling bin. They think it will be pitiful and stupid and something they can laugh at; however, it ends up being extremely powerful and emotional bringing them both to tears. Jim tells the cameras that Ryan can never know that they thought it was good."
    ],
    "quotes": [
        "Ryan: I know we have may have no been right together in the past but its weird... I'd rather she be alone than with someone... is that love?",
        "Jim: That's about it... yeah.",
        "Robert California: I never allow a sexual desire influence a business decision, so i find it best to recuse myself temporairly to make love then I go back and analyze the situation rationally... Buffet operates the same way.",
        "Pam: I saw you talking to Ryan a little while ago.",
        "Kelly: Yeah, he's so sweet, he pointed to my latte and said \"That would be the color of our children\"",
        "Pam: Yeah he is... great... remember what it felt like when he cheated on you though?",
        "Kelly: Which time?",
        "Nellie: Take a man's job but leave him his balls... Margaret Tatcher said that... probably... don't know... don't read, didn't see the movie.",
        "Nellie: No, no, no.... I myself have never been in that arena, I myself have been with several older men.",
        "Robert and Creed: How old?",
        "Creed: Jinx! Buy me some coke.",
        "Erin: Toby, doesn't HR have a rule against talking about this kind of stuff?",
        "Toby: Erin, HR's a joke, I can't do anything about anything.",
        "Andy: AND.... YOUR STUPID OFFICE!",
        "- punches hole in the same wall he punched a hole in in Season 3 - (The Return)",
        "Darryl: He does not like that wall..."
    ]
}