{
    "season": 8,
    "title": "The Incentive",
    "episode": "2",
    "episodes": [
        2
    ],
    "coldOpens": [
        "Kevin speaks like an idiot to save time. Jim, Pam, and Andy convince him to stop."
    ],
    "storylines": [
        "Robert challenges office manager Andy to double sales after a rousing motivational speech. After Andy institutes a point system and promises to \"wear a dress\" for 500 points, \"run naked through the parking lot with a donut on [his] ding-dong\" for 1,000 points, and tattoo whatever his co-workers would like on \"[his] ass\" in exchange for 5,000 points, everyone in the office suddenly gets motivated to sell, eventually earning 5,000 points by the end of the day.",
        "When Andy and the crew go to the tattoo parlor, however, Andy suddenly is unnerved and admits to Jim that he isn't sure why Robert made him manager. Jim reassures Andy that he managed to pick up sales, and that no one in the office expects him to go through with the tattoo idea. Andy responds by getting the tattoo, which Pam changes, without telling Andy, to an image of a dog that has \"Nard\" written on it, a reference to Andy's nickname \"Nard Dog.\" Upon seeing his completed tattoo in a mirror, Andy is pleased with the result. Robert then reveals to the cameras that he picked Andy because he is \"all surface...uncomplicated, what you see is what you get\" and that causes people to rally behind him, because he is an underdog.",
        "Meanwhile, Pam and Angela become walking buddies at Angela's request, but after Angela says she's reported Pam to Social Services for drinking herbal tea with traces of caffeine it, a disgusted Pam tells Angela they should not have anything else to do with each other. Pam and Angela then continue to walk rapidly–and away from each other."
    ],
    "quotes": [
        [
            {
                "speaker": "Andy",
                "content": " Hello? Professor? I am a huge fan of your book - glances at cover- \"Management\"."
            }
        ],
        [
            {
                "speaker": "Tattooer",
                "content": " Uh sir? You don't have to take off your pants"
            }
        ],
        [
            {
                "speaker": "Andy",
                "content": " They are already off my good sir!"
            }
        ],
        [
            {
                "speaker": "Tattooer",
                "content": " I prefer they're on."
            }
        ]
    ]
}