{
    "season": 8,
    "title": "Fundraiser",
    "episode": "22",
    "episodes": [
        22
    ],
    "coldOpens": [
        "Ryan is distraught over the death of Smokey Robinson, but Pam thinks he is only attempting to be deep about music. Oscar finds that Smokey is alive and they try getting Ryan to go to a Smokey concert, but he refuses."
    ],
    "storylines": [
        "In order to appear sophisticated, Ryan pretends to be \"completely devastated\" about Smokey Robinson's death. Jim and Pam catch him in the lie when they reveal that Ryan cannot be a true fan because he can only name one of Smokey Robinson's songs. Oscar reads on the internet that news of Robinson's death is a hoax and Jim finds that Robinson will be playing in concert only three hours away. They try to persuade Ryan to buy tickets, but upon learning how expensive it is, Ryan pretends to back out due to the opening act.",
        "Angela excitedly tells the cameras about how her husband, \"The Senator\" is hosting a fundraiser for dogs and Robert California has purchased two tables for the entire office staff. Dwight comes in warning the office that they are all about to be murdered, as Andy is sitting in his car in the parking lot. Dwight believes that Andy is seeking revenge and may go on a shooting spree. Jim, Pam, Erin and Kevin go down to the parking lot to check on him and it is revealed Andy is down there to pickup Erin and that he is going to be her date to the fundraiser the office staff are attending. Meanwhile, Nellie tries to bond with Darryl, but fails to connect with him. She reveals that she will try to connect with him at the fundraiser.",
        "Andy arrives at the fundraiser and shares a brief and awkward reunion with the office staff. When asked how he is doing Andy talks about a rock opera he is writing and most of the staff write him off as \"on the brink of a breakdown\". Andy becomes excited about this idea and starts singing annoying many of the guests. Robert believes that Andy coming was a mistake and offers to give him money to take Erin out to a nice romantic dinner but Andy refuses. Robert then kicks Andy out of the group and Andy is forced to purchase a whole table to stay.",
        "Oscar becomes excited when Angela's husband appears to flirt with him and gives him his cell phone number. Oscar excitedly tells Pam and Jim and Pam seems excited, but Jim is skeptical and thinks that he was just schmoozing with voters. Jim decides to go talk to him and see if he gives his number out to everybody.",
        "The guests participate in a silent auction. However, Dwight believes it is \"Guess the Price\" and puts down extremely high bids. Kevin finds it amusing that Dwight is the \"idiot of the office\" and that before that \"they didn't have one\".",
        "Jim succeeds in getting The Senator's number and Oscar and Pam tease him that The Senator probably thinks he is gay.",
        "Nellie tries to bond with Darryl again and tries to talk about American food. Darryl realizes that Nellie has no idea what tacos are and offers to go buy them some. Nellie offers to pay for them and after realizing that she has no idea how much they cost Darryl takes more than they really cost.",
        "While Andy is participating in the silent auction he runs into David Wallace. The two catch each other up on events and David Wallace reveals that his vacuum cleaner toy \"Suck It!\" was sold to the military for $20 million. David tells Andy to forget about Dunder Mifflin.",
        "Robert gives a speech on how the fundraiser's purpose is to raise money to take care of elderly or disabled dogs and explains how the dogs are all unlikely to ever find homes. Andy, in an attempt to outdo Robert, offers to adopt all 12. Robert tries to stop Andy, but Andy gives his own speech about how he is actually doing something for the dogs and ends up making a fool of himself.",
        "Darryl returns with tacos and watches in amusement as Nellie attempts to eat it by shoveling the filling out of the shell into her mouth. However, Darryl decides to stop pranking her upon realizing that she is really trying to be friends.",
        "Andy realizes that all the dogs he has adopted are all very needy dogs due to their various conditions. Jim, Pam, Erin, and Kevin come to comfort Andy and assure him that his life will get better.",
        "Oscar is disappointed that the Senator isn't interested in him, but as he leaves the Senator shakes Oscar's hand and reminds him to call. He ends the hand shake by awkwardly stroking Oscar's arm and Oscar becomes very excited, as he takes it as a sign he is still attractive.",
        "Andy's problem is solved when various office staff members agree to adopt the dogs. Darryl adopts a dog that helps Darryl exercise by taking him for walks. Kevin brags about his dog, Ruby, describing how she just lies around all day, never seems to eat and smells horrible. The office staff become horrified when they realize that the dog might be dead and Kevin doesn't seem to realize it. However, a clip of Kevin and his dog show that the dog is in fact alive and is just extremely lazy."
    ],
    "quotes": [
        [
            {
                "speaker": "Kevin",
                "content": " Hey Creed! Check this out! Ninjitsu lessons! No one's raping me!"
            }
        ],
        [
            {
                "speaker": "Creed",
                "content": " Oh I don't want to get raped! 120 dollars."
            }
        ],
        [
            {
                "speaker": "Kevin",
                "content": " Hey, no! That was my idea..."
            }
        ],
        [
            {
                "speaker": "Jim",
                "content": " Sorry Oscar, but I think I've proven he was just chasing a vote."
            }
        ],
        [
            {
                "speaker": "Pam",
                "content": " Or that he thinks you're gay.."
            }
        ]
    ]
}