{
    "season": 8,
    "title": "Lotto",
    "episode": "3",
    "episodes": [
        3
    ],
    "coldOpens": [
        "The employees find a dog inside of a car in the parking lot. Oscar smashes the window to save the dog, but has to put a cardboard cover on it."
    ],
    "storylines": [
        "The six warehouse workers win $950,000 in a lottery pool, and quit in a celebratory fashion of running through the office, making a mess and mooning the staff. Darryl was originally part of the pool (with his birthday being the winning numbers) but stopped when he was promoted, and falls into a depression, unable to find any motivation to work and further dismayed when his ex-wife's response to him not winning is to ask for the number of his pool-winner friend Glenn. Everyone else speculates how they would spend a hypothetical lottery score, with Jim and Pam ultimately deciding to fuse their two main ideas into one for a lovely brownstone located in the great outdoors.",
        "Andy has a hard time finding any office workers who will step in for the day and make sure that the day's important orders ship out. Jim, Erin, Dwight and Kevin take over the process, but don't know how to use the heavy-lifting equipment and discover that they are not strong enough to fill the truck by hand. Upon Kevin's suggestion, they create an oil luge to slide the boxes across the floor, which results in a lot of damaged inventory, a failed shipment, and Phyllis losing a large client.",
        "A melancholic Darryl finally assembles a conference room meeting with several potential new hires, but utters several discouraging remarks about the job and exits, leaving Andy alone to take charge of the process. Andy doesn't know what he's doing and all of the workers simply leave. Darryl blames himself for the failure and asks Andy to fire him, but Andy refuses, thinking/hoping Darryl is speaking in code.",
        "Andy finally manages to hire three workers: a bodybuilder from Oscar's gym, Dwight's building handyman Nate, and a PhD candidate who can only work two days a week. Darryl demands anew to be fired, then switches gears: he tells Andy to give him the manager job, saying he deserves it and wants that or a pink slip. Andy then steps up and bluntly tells Darryl he not only isn't going to do that, but Darryl was not the runner-up to Andy in the selection process; as he brings up Darryl's short temper, his hiring of the unqualified Glenn, and his loss of interest in taking business education courses, Darryl finally snaps out of his funk and listens to him. Andy tells Darryl that Jo Bennett loved him and saw something in him, and he simply stopped striving after that. He convinces Darryl to stay on board, and they head down to the warehouse, only to find it has become a slick mess."
    ],
    "quotes": [
        [
            {
                "speaker": "Kevin",
                "content": " Come on Jim! Tell him what we call it!"
            }
        ],
        [
            {
                "speaker": "Jim",
                "content": " Its not important"
            }
        ],
        [
            {
                "speaker": "Andy",
                "content": " No! Come on Jim! Tell us what you call it!"
            }
        ],
        [
            {
                "speaker": "Jim",
                "content": " Señor Loadenstein"
            }
        ],
        [
            {
                "speaker": "Kevin",
                "content": " And why do we call it that?"
            }
        ],
        [
            {
                "speaker": "Jim",
                "content": " Porque es muy rapido..."
            }
        ],
        [
            {
                "speaker": "Darryl",
                "content": " Taco air is thick... its heavy... it settles at the lowest point... you can't air it out..."
            }
        ],
        [
            {
                "speaker": "Andy",
                "content": " Well... you got a great basement!"
            }
        ]
    ]
}