{
    "season": 8,
    "title": "Garden Party",
    "episode": "4",
    "episodes": [
        4
    ],
    "coldOpens": [
        "Andy places billboards all around Scranton, but finds vulgar graffiti on all of them."
    ],
    "storylines": [
        "Andy decides to throw a garden party at Schrute Farms to impress both Robert and his parents. Andy is noticeably jealous at the amount of attention his younger brother Walter Bernard, Jr. receives from his father, and he thinks that by throwing an elaborate party he can ensure his father's blessings. At first, the party goes along smoothly. Andy decides to make a toast to his fellow employees in hopes that they will toast him in return, as if to show his parents and California that he is a respected individual among his employees. His plan backfires, however, and instead many people end up praising Robert. To get everybody's mind off of Robert, Andy decides to sing \"More Than Words\" as a duet with his father. This too goes awry as his visibly-annoyed father corrects his playing and singing, and ultimately decides to sing a duet with Walter Jr. instead of Andy. Visibly upset, Andy stops their singing and storms off.",
        "Soon thereafter, Andy is confronted by his father for his \"obnoxious attitude\", which he turns into a browbeating on Andy as \"manager of some rinky dink branch\". This conversation is overheard by the other staff on the baby monitor Jim and Pam brought for their daughter, and Pam quickly turns off the monitor to let Andy save face. Darryl and Oscar later confide to the camera that they now understand why Andy feels he needs to prove himself to everyone. After his family leaves, a dejected Andy, feeling unwanted by his family and co-workers, says goodbye to the office staff as they turn the garden party into a barbecue. Darryl and Oscar, however, manage to convince Andy to stay with a cheeseburger and a beer, and they all satisfyingly watch as Dwight performs the closing ceremonies to the garden party.",
        "Meanwhile, Dwight works to make the garden party a classy event. Dwight thoroughly reads a book called The Ultimate Guide to Throwing a Garden Party that he'd bought online, thinking it was a great buy. However, the book is revealed to be an elaborate prank, secretly written by Jim under the pseudonym \"James Trickington\". The book gives outlandish advice such as announcing each guest's name as they arrive in an extremely loud manner among other absurd \"duties\" (imitating The Last Supper in the middle of a meal, randomly dancing with his party staff, etc.). Near the end of the episode, Andy and the staff look on in delight as Dwight and his workers perform a fire court dance (as part of the Trickington book) as a closing ceremonies. The episode then ends with footage of Jim abusing Dwight's announcing duties by walking past him and then walking back again, prompting Dwight to shout his name each time he does so.",
        "Also, Pam feuds with co-worker Angela over baby names. Pam and Angela learn they've both chosen the name Phillip for their soon-to-be-born sons, with Pam choosing to name her child after her deceased grandfather and Angela after the name of her favorite cat. Angela, visibly annoyed that Pam doesn't relinquish the name right away, later makes a toast to \"my son Phillip\" at the garden party—only to have Pam make the same toast but describe in great detail how the name honors her now-dead grandfather. Angela, unwilling to reveal her feline-centric reasons for the name, grouses to the camera that Pam is always copying her."
    ],
    "quotes": [
        [
            {
                "speaker": "Gabe",
                "content": " Get your head in the game Gabriel! Why didn't you toast Robert? I should've thought of that! Why have I spent all this time talking to Stanley's mistress?"
            }
        ],
        [
            {
                "speaker": "Walter Jr.",
                "content": " Hey I'm Walter Bernard."
            }
        ],
        [
            {
                "speaker": "Jim",
                "content": " Hey I'm Jim."
            }
        ],
        [
            {
                "speaker": "Walter Jr.",
                "content": " Jim?...Jim...Tuna!"
            }
        ]
    ]
}