{
    "season": 8,
    "title": "Spooked",
    "episode": "5",
    "episodes": [
        5
    ],
    "episodeDetails": {
        "sections": [
            {
                "title": "Spooked",
                "level": 1,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "\"Spooked\" is the fifth episode of the eighth season of the American television comedy series The Office and the show's 157th overall. It was the season's Halloween special. It was written by Carrie Kemper and directed by Randall Einhorn. It originally aired on NBC October 27, 2011. It was viewed by 5.53 million people."
                    }
                ],
                "images": []
            },
            {
                "title": "Summary",
                "level": 2,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Erin has been assigned to set up the Halloween party by Andy, who wants to live up to the expectations set by Robert California. Robert arrives with his son Bert and notices that the party is more tailored to kids than adults. In response, Andy asks Angela and Phyllis to help take over and re-tailor the party, much to Erin's chagrin. Andy also tells her that he wishes to speak with her at the end of the day. Worried about the party, she asks Gabe for help, and he gives her a tape to show everyone. Unaware of the fact that the video is full of disturbing images and no story, the office staff get upset when they see that there's hidden footage of them present in the video. Andy and Robert then talk with Erin in his office regarding the incident. Erin says that she got nervous when Andy wanted to have a talk with her, and she thought he was about to fire her regarding the party. However, Andy informs her that he is dating someone, and she is shocked to hear they have been out on 31 dates so far. Erin feels dejected and leaves."
                    },
                    {
                        "type": "paragraph",
                        "text": "Jim and Pam argue whether ghosts are real after she claims to have seen one at a pub where she used to work; their argument becomes extremely heated throughout the day. Meanwhile, Dwight had dressed up as Sarah Kerrigan from StarCraft, but Toby had taken off his wings as they had knives on them and Dwight was not allowed to bring in weapons, thus people do not know what Dwight is. Bert notices what his costume is supposed to be and the two bond over playing StarCraft all day, ignoring everyone else. Dwight also makes Bert pretend to fire Toby for taking away his weapons, on the grounds that he is the CEO's son."
                    },
                    {
                        "type": "paragraph",
                        "text": "Robert, having witnessed the various discussions and arguments between some employees and aware about the fears of others, tells a horror story implementing all the fears and arguments as a way to convince them not to let fear control their lives. This inspires Jim and Pam to stop their argument and Erin to talk to Andy about her feelings."
                    }
                ],
                "images": []
            },
            {
                "title": "Cultural references",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "South Park is an American animated sitcom.",
                                "elements": []
                            },
                            {
                                "text": "Kate Middleton is the maiden name of Catherine, Duchess of Cambridge, whose royal wedding Meredith and Kelly followed.",
                                "elements": []
                            },
                            {
                                "text": "Jim, Kevin, and Darryl are dressed up as professional basketball players Chris Bosh, Dwyane Wade and LeBron James, respectively.",
                                "elements": []
                            },
                            {
                                "text": "Ryan thinks Dwight is dressed up as the actress Whoopi Goldberg.",
                                "elements": []
                            },
                            {
                                "text": "Dwight dresses up as Sarah Kerrigan, a character from the video game series StarCraft.",
                                "elements": []
                            },
                            {
                                "text": "Toby narrates a montage of previous costumes worn by Dwight including dressing as Freddy Krueger, Jigsaw, and Pinhead, the primary antagonists from the A Nightmare on Elm Street, Saw, and Hellraiser franchises, respectively.",
                                "elements": []
                            },
                            {
                                "text": "Ryan is dressed as Jesse Pinkman from the T.V. series Breaking Bad, wearing the character's signature yellow hoodie and beanie.",
                                "elements": []
                            },
                            {
                                "text": "Jim teases Pam asking her to see a \"documentary\" called Ghostbusters.",
                                "elements": []
                            },
                            {
                                "text": "Gabe's \"Cinema of the unsettling\" film bears a striking resemblance to the cursed VHS from \"The Ring\".",
                                "elements": []
                            },
                            {
                                "text": "The dancing skeletons are possibly a reference to the old Disney short \"Skeleton Dance\".",
                                "elements": []
                            },
                            {
                                "text": "Oscar's costume is both a reference to former U.S. congressman Anthony Weiner, who was involved in a scandal earlier in 2011 and a play on the name of the Oscar Mayer Company, which is known for hot dogs.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Connections to previous episodes",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Angela is dressed in the same cat costume she wore in the season two episode, Halloween.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Amusing details",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Ryan, a former drug addict, is dressed like a meth cook and dealer.",
                                "elements": []
                            },
                            {
                                "text": "Despite throwing out his bobblehead in The Duel, the Dwight bobblehead was used to advertise this episode while wearing a skeleton mask. The bobblehead does reappear later, suggesting that Dwight took it out of the garbage can perhaps after a change of heart soon after.",
                                "elements": []
                            },
                            {
                                "text": "Toby, Kelly, and Gabe's skeleton costumes are not anatomically correct.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Halloween Costumes",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Andy - Construction Worker",
                                "elements": []
                            },
                            {
                                "text": "Jim - NBA player Chris Bosh",
                                "elements": []
                            },
                            {
                                "text": "Dwight - Kerrigan from the video game StarCraft",
                                "elements": []
                            },
                            {
                                "text": "Pam - Kangaroo",
                                "elements": []
                            },
                            {
                                "text": "Stanley - Some Chef",
                                "elements": []
                            },
                            {
                                "text": "Phyllis - Sexy bunny",
                                "elements": []
                            },
                            {
                                "text": "Creed - Osama Bin Laden",
                                "elements": []
                            },
                            {
                                "text": "Meredith - Kate Middleton on her wedding day",
                                "elements": []
                            },
                            {
                                "text": "Erin - Wendy's restaurant logo girl",
                                "elements": []
                            },
                            {
                                "text": "Darryl - NBA player LeBron James",
                                "elements": []
                            },
                            {
                                "text": "Kevin - NBA player Dwayne Wade",
                                "elements": []
                            },
                            {
                                "text": "Angela - A cat",
                                "elements": []
                            },
                            {
                                "text": "Oscar - \"Oscar Liar Weiner\"",
                                "elements": []
                            },
                            {
                                "text": "Ryan - Jessie Pinkman from Breaking Bad",
                                "elements": []
                            },
                            {
                                "text": "Toby - A skeleton",
                                "elements": []
                            },
                            {
                                "text": "Kelly - A skeleton",
                                "elements": []
                            },
                            {
                                "text": "Gabe - A skeleton",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Fears in Robert California's story",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Creed - Snakes",
                                "elements": []
                            },
                            {
                                "text": "Angela - Dirt/Filth",
                                "elements": []
                            },
                            {
                                "text": "Darryl - Being buried alive",
                                "elements": []
                            },
                            {
                                "text": "Kevin - Mummies",
                                "elements": []
                            },
                            {
                                "text": "Meredith - Jim",
                                "elements": []
                            },
                            {
                                "text": "Kelly - Never marrying",
                                "elements": []
                            },
                            {
                                "text": "Jim and Pam - Losing each other over an argument they couldn't get past",
                                "elements": []
                            },
                            {
                                "text": "Dwight - Getting lost in imaginary worlds",
                                "elements": []
                            },
                            {
                                "text": "Andy - Never living up to expectations of him (probably his parent's expectations)",
                                "elements": []
                            },
                            {
                                "text": "Erin - Never speaking or acting on her feelings",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Cast",
                "level": 2,
                "content": [],
                "images": []
            },
            {
                "title": "Main Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Rainn Wilson as Dwight Schrute",
                                "elements": []
                            },
                            {
                                "text": "John Krasinski as Jim Halpert",
                                "elements": []
                            },
                            {
                                "text": "Jenna Fischer as Pam Halpert",
                                "elements": []
                            },
                            {
                                "text": "B.J. Novak as Ryan Howard",
                                "elements": []
                            },
                            {
                                "text": "Ed Helms as Andy Bernard",
                                "elements": []
                            },
                            {
                                "text": "James Spader as Robert California",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Supporting Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Leslie David Baker as Stanley Hudson",
                                "elements": []
                            },
                            {
                                "text": "Brian Baumgartner as Kevin Malone",
                                "elements": []
                            },
                            {
                                "text": "Creed Bratton (actor) as Creed Bratton",
                                "elements": []
                            },
                            {
                                "text": "Kate Flannery as Meredith Palmer",
                                "elements": []
                            },
                            {
                                "text": "Mindy Kaling as Kelly Kapoor",
                                "elements": []
                            },
                            {
                                "text": "Ellie Kemper as Erin Hannon",
                                "elements": []
                            },
                            {
                                "text": "Angela Kinsey as Angela Martin-Lipton",
                                "elements": []
                            },
                            {
                                "text": "Paul Lieberstein as Toby Flenderson",
                                "elements": []
                            },
                            {
                                "text": "Oscar Nunez as Oscar Martinez",
                                "elements": []
                            },
                            {
                                "text": "Craig Robinson as Darryl Philbin",
                                "elements": []
                            },
                            {
                                "text": "Phyllis Smith as Phyllis Vance",
                                "elements": []
                            },
                            {
                                "text": "Zach Woods as Gabe Lewis",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Guest Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "David Mazouz as Bert California",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            }
        ]
    },
    "quotesDetails": {
        "sections": [
            {
                "title": "Spooked Quotes",
                "level": 1,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Toby: Every year I tell Dwight the same thing about his Halloween costume- he can't bring weapons into the office. Then every year he tells me the same thing- \"As soon as I get all my weapons back I will kill you\"... but I am always still alive by Thanksgiving so.... I'm a lucky turkey!"
                    },
                    {
                        "type": "paragraph",
                        "text": "Oscar: Is that my grandmother?"
                    }
                ],
                "images": []
            }
        ]
    },
    "coldOpens": [
        "Andy screens the Halloween costumes around the office. "
    ],
    "storylines": [
        "Erin has been assigned to set up the Halloween party by Andy, who wants to live up to the expectations set by Robert California. Robert arrives with his son Bert and notices that the party is more tailored to kids than adults. In response, Andy asks Angela and Phyllis to help take over and re-tailor the party, much to Erin's chagrin. Andy also tells her that he wishes to speak with her at the end of the day. Worried about the party, she asks Gabe for help, and he gives her a tape to show everyone. Unaware of the fact that the video is full of disturbing images and no story, the office staff get upset when they see that there's hidden footage of them present in the video. Andy and Robert then talk with Erin in his office regarding the incident. Erin says that she got nervous when Andy wanted to have a talk with her, and she thought he was about to fire her regarding the party. However, Andy informs her that he is dating someone, and she is shocked to hear they have been out on 31 dates so far. Erin feels dejected and leaves.",
        "Jim and Pam argue whether ghosts are real after she claims to have seen one at a pub where she used to work; their argument becomes extremely heated throughout the day. Meanwhile, Dwight had dressed up as Sarah Kerrigan from StarCraft, but Toby had taken off his wings as they had knives on them and Dwight was not allowed to bring in weapons, thus people do not know what Dwight is. Bert notices what his costume is supposed to be and the two bond over playing StarCraft all day, ignoring everyone else. Dwight also makes Bert pretend to fire Toby for taking away his weapons, on the grounds that he is the CEO's son.",
        "Robert, having witnessed the various discussions and arguments between some employees and aware about the fears of others, tells a horror story implementing all the fears and arguments as a way to convince them not to let fear control their lives. This inspires Jim and Pam to stop their argument and Erin to talk to Andy about her feelings."
    ],
    "quotes": [
        "Toby: Every year I tell Dwight the same thing about his Halloween costume- he can't bring weapons into the office. Then every year he tells me the same thing- \"As soon as I get all my weapons back I will kill you\"... but I am always still alive by Thanksgiving so.... I'm a lucky turkey!",
        "Oscar: Is that my grandmother?"
    ]
}