{
    "season": 8,
    "title": "Doomsday",
    "episode": "6",
    "episodes": [
        6
    ],
    "coldOpens": [
        "Andy sings \"Closing Time\" around the office every day, but the employees aren't enthusiastic. Stanley, however, sings along."
    ],
    "storylines": [
        "In the cold open, Andy, to commemorate and \"bring closure\" to the end of each work day, sings \"Closing Time\", much to the dismay of his visibly annoyed co-workers. Andy, frustrated that no one but he and Erin enjoy the tradition, starts to scold the workers until Stanley comes in happily singing the song alongside him.",
        "When Robert California confronts Andy about the number of mishaps and blunders made in the office, Dwight devises a system to find mistakes made by employees in the office. To improve efficiency, he installs a \"doomsday device\" that will send incriminating emails to Robert if they make five mistakes in one day, effectively causing them to lose their jobs. After only one day, however, the group manages to make five mistakes, and Dwight reveals that the emails will be automatically sent to Robert at 5:00 pm. Andy pleads with Dwight to deactivate the machine, but Dwight refuses, belittles the rest of the office staff for being so careless, and retreats to Schrute Farms.",
        "After Dwight abandons the group, Andy tasks Pam, Erin, and Kevin to try and change Dwight's mind. The group find Dwight digging a horse grave and offer to help him out. Andy tries to talk to Dwight about deactivating the machine, but Pam consistently quiets him, saying she knows Dwight will come to understand if they aren't pushing it. After complimenting Dwight numerous times and having a small meal, Pam makes a joke that emphasizes that everyone is human and makes mistakes. Dwight, after hearing this, deactivates the machine after the party leaves Schrute Farms. Meanwhile, Jim is tasked with tracking down Robert at a squash court and intercepting the doomsday emails before Robert has a chance to view them. To distract him, Jim plays several games, demonstrating his complete lack of skill at squash. Eventually, he discovers that the email has not come through, and prepares to leave, but Robert makes him stay and continue playing.",
        "Meanwhile, Gabe unsuccessfully tries to strike up a relationship with a new warehouse worker, Val. Gabe believes that he and Val have a connection, and constantly pursues and tries to impress her throughout the day. Darryl, observing Gabe's pitiful attempts, tries to imply that Val doesn't feel the same way, but to no avail. When Gabe does ask Val out, she politely declines and says she does not date co-workers at all. Darryl hears all of this and decides he won't pursue Val either."
    ]
}