{
    "season": 8,
    "title": "Gettysburg",
    "episode": "8",
    "episodes": [
        8
    ],
    "coldOpens": [
        "Pam fakes her water breaking to get out of doing things in the office. The employees finally catch her faking it."
    ],
    "storylines": [
        "Andy decides to motivate and inspire everyone by taking them on a field trip to Gettysburg. Much to Andy's chagrin, half of the office volunteers to stay behind and Robert California asks them to come up with Dunder Mifflin/Sabre's next big idea. However, the office fails to impress Robert with their ideas. Kevin details a very basic idea he has about cookie placement in the vending machine, but Robert gets the impression that he is extremely clever and is speaking only in metaphors. Ryan later tricks Kevin into explaining an idea he has involving the Big Mac, and Robert realizes that there was no subtext to Kevin's ideas.",
        "Meanwhile, at Gettysburg, Andy is unhappy with the lack of morale and belief in his leadership and attempts to make an analogy between running a paper company and fighting in the Civil War. Andy starts to lead a haphazard tour, and eventually most of office members sit down to rest. Jim and Darryl follow Andy after he presses on, and eventually tell him to stop trying to impress the office. They reinforce the fact that his co-workers like him the way he is.",
        "During the tour, Dwight argues with Oscar about what he claims is the northernmost battle of the Civil War: the Battle of Schrute Farms. Dwight maintains that its absence from the history books is an example of rewriting history, whereas Oscar maintains that the battle is a fictitious creation. After tracking down a historian, Dwight and Oscar learn that the Battle of Schrute Farms did in fact take place. However, the \"battle\" was really a code term. During the Civil War, Schrute Farms was a safe haven for artists and poets (and, as heavily implied, homosexuals). Oscar finds this fascinating, whereas Dwight leaves in disgust.",
        "Gabe is sidetracked by another tour group, who assume that he is an Abraham Lincoln impersonator (which Gabe notes is a frequent occurrence when he is seen by children), and he is forced to give an improvised but applauded performance."
    ]
}