{
    "season": 9,
    "title": "Promos",
    "episode": "18",
    "episodes": [
        18
    ],
    "coldOpens": [
        "Phyllis gets aroused while listening to the Fifty Shades of Grey audiobook. Dwight pours a bucket of water on her head and Andy confiscates her iPod. Andy is shown getting aroused from listening to the book and a bucket of water is quickly poured on him."
    ],
    "storylines": [
        "In the cold open, Phyllis is listening to the Fifty Shades of Grey audiobook, making everyone uncomfortable. After Andy refuses to do anything about it, Dwight takes matters into his own hands. He drenches Phyllis with a bucket of water, and Andy confiscates her phone. In his office, Andy is seen listening to the audiobook and is suddenly drenched in water the same way Phyllis was.",
        "The office is excited to see promos for the upcoming documentary The Office: An American Workplace, but many of the workers are dismayed to learn just how much of their activities have been recorded and how much of their conversations the microphones picked up. Several excuse themselves and go to the warehouse to talk, turning off their microphones in an unsuccessful effort to keep the discussion private. Pete suggests that Pam talk to dismissed crew member Brian to learn more. It's noticeable that Pam seems to miss the \"old Jim\", and she questions Brian on if he thinks Jim has changed. She reminiscences about the old times that she and Jim shared in the past. Brian also informs her that the staff's private moments were still recorded, regardless of them wearing their own microphones or not. This causes her to get upset and leave, once he tells her she practically had no privacy for the past 10 years. Meanwhile, Angela and Oscar, after some arguing, jointly call Angela's husband Sen. Robert Lipton to inform him that the documentary will probably out him and reveal that Angela slept with Dwight.",
        "Dwight makes Angela jealous when he starts dating a Brussels sprout farmer. Meanwhile, Jim and Darryl have a big meeting with Major League baseball player Ryan Howard, a meeting that ends up with Darryl and Jim reading Ryan's self-written screenplay about a baseball player turned superhero.",
        "Meanwhile, Andy enjoys reading the comments from the promos and even replies to some of them, but becomes annoyed when some of them begin insulting him. It is revealed at the end of the episode that some of the comments were from Nellie."
    ]
}