{
    "season": 9,
    "title": "Stairmageddon",
    "episode": "19",
    "episodes": [
        19
    ],
    "coldOpens": [
        "The elevator is out of order and Stanley is forced to walk up the stairs to which he tires out quickly."
    ],
    "storylines": [
        "Stanley is seen walking to work and is abruptly disturbed about the sign on the elevator, which reads, \"Elevator out of service, this is an inconvenience.\" Erin happily walks in and exclaims that it is Stairmageddon and cheers Stanley up the steps enthusiastically. Dwight is having maintenance done on the elevator.",
        "Andy comes in and announces that a review of the documentary has been published by a local newspaper. Nellie and Oscar read the review aloud for everyone to hear. As soon as Stanley is done clambering up the steps, Dwight tells him that they are going on a sales call. Nellie eavesdrops on Pam, who is talking to her mother. Pam explains that she will be watching her children tonight for her and Jim. Outside, they talk and it is revealed they are going to a marriage counseling class for their obvious straining relationship. Toby and Jim talk about marriage counseling as well and Jim explains that he and Pam are having problems. She doesn't like that Jim does certain things without her input and that she has to, in a sense, catch up. In contrast, Jim says that he wouldn't be married to her if he hadn't done things without telling her and if she can hold on a while longer, things will turn out to be great. Angela meets with the Senator.",
        "Dwight reveals a case of bull tranquilizers, and goes to Stanley, shooting him in the torso with three tranquilizers. Dwight enlists Clark, who happened to be in the break room when Dwight sedated Stanley, to help him get Stanley to the client meeting. They wrap him up in bubble wrap \"Evel Knievel style\" and push him down stairs covered in cardboard to act as a slide. Erin turns her computer monitor around to face the office and Angela is seen on screen with Senator Lipton, who announces that he is gay. Lipton recognizes Oscar as the one who helped him accept that he was gay. Lipton also recognizes and states his love for his Chief of Staff, Wesley Silver, who he has also been seeing, to Oscar's shock. Clark and Dwight have to struggle getting Stanley into the car. At a local talent agent's office, Andy meets a man who has a Saint Bernard, a cat on top of the dog, and a mouse on top of the cat. The man says there \"isn't a point\" in naming the mice because he goes through so many. At the client meeting, a drowsy Stanley spurts out random phrases, particularly about the children in the pictures on the desk. Back at Toby's office, Jim expresses that if Pam doesn't want to move the family to Philly, they will need a lot more than just counseling. Pam confirms to Nellie that she refuses to move to Philadelphia. Later, Nellie and Toby agree with each other that Jim and Pam are both very yappy. As Jim and Pam walk to their car, Jim rubs Pam shoulder, as if to reassure her. Andy is accepted as a client of a talent agent/real estate broker and has to pay only $5000 for the honor."
    ]
}