{
    "season": 9,
    "title": "New Guys",
    "episode": "1",
    "episodes": [
        1
    ],
    "coldOpens": [
        "The Dunder Mifflin crew talked about their summer. Kevin smashed a turtle."
    ],
    "storylines": [
        "While talking to the camera, Kevin reveals that he tried to save a turtle that he ran over, but only ended up killing it. Jim and Pam reveal that Jim was offered an entrepreneurial sports job by his old college friend based on an idea the two came up with together. Jim tells the camera that he turned it down, because it would not be good for his family. Pam and Jim begin to take off their microphones and Pam makes a remark, noting that, after nine years, the cameramen should have enough footage for a documentary. One of the cameramen then addresses the two, saying that they are more interested in the developments in the office workers themselves rather than the office now. Dwight tells the camera that he invented a drink made from beet runoff and that he found out that he isn't Philip's biological father",
        "Two new employees, Pete and Clark, dubbed \"The New Jim\" and \"Dwight Jr.\" are hired by the Scranton branch and cause trouble for Jim and Dwight. At first, Dwight is happy to have a protege, but soon begins to fear that Clark is after his job. Jim, on the other hand, does not feel that Pete is anything like him. However, after hearing Pete discuss his future plans, Jim realizes that he has been stuck at the same job for nine years.",
        "Meanwhile, Andy returns from Outward Bound manager training—where he became more \"decisive and confident\"—hoping for revenge on Nellie for commandeering his job last year. He takes Nellie into his office and informs her that he's \"gonna be a real bitch to [her]\". Andy sets up a slack line in the parking lot and makes the employees walk across it, humiliating Nellie as she insists on walking in her heels and fails to keep her balance. After Clark proves that he is talented at balancing, Dwight attempts to one-up him, but ends up failing repeatedly and hurting himself. Eventually, Dwight tries to prove his superiority by riding a bicycle across a tight-rope suspended between the roof and a telephone pole, but the photocopier he is using as a counterweight is not heavy enough and he ends up losing his balance and hanging from the bicycle above the parking lot. Much to his embarrassment, he has to be rescued by a team of firefighters, while Creed mistakenly believes the incident to be a circus act.",
        "While everyone is outside crowding around Dwight, Jim calls up his old college friend and tells him that he wants to be involved in the new business deal—without telling Pam. Meanwhile, Angela puts her cat up for adoption as her baby is allergic to it, although her husband, Senator Robert Lipton, is saddened at having to give up his beloved pet. Oscar agrees to adopt the cat, and it is implied that Robert is having an affair with him, further contributing to growing, widespread suspicion that Robert is gay, revealing he only adopted the cat so Robert could still spend time with his pet."
    ],
    "quotes": [
        [
            {
                "speaker": "Dwight",
                "content": " So, you a root man or a fruit man?"
            }
        ],
        [
            {
                "speaker": "Clark",
                "content": " Hey is this like, code for gay stuff?"
            }
        ],
        [
            {
                "speaker": "Nellie",
                "content": " That sounds wonderful!"
            }
        ],
        [
            {
                "speaker": "Andy",
                "content": " What are you still doing here?"
            }
        ],
        [
            {
                "speaker": "Nellie",
                "content": " Great thanks!"
            }
        ],
        [
            {
                "speaker": "Creed",
                "content": " In the parking lot today, there was a circus! The copier did tricks on the high-wire. A lady tried to give away a baby that looked like a cat. There was a Dwight impersonator and a Jim impersonator. A strong man crushed a turtle. I laughed and I cried. Not bad for a day of the life in a dog food company."
            }
        ]
    ]
}