{
    "season": 9,
    "title": "Customer Loyalty",
    "episode": "12",
    "episodes": [
        12
    ],
    "coldOpens": [
        "Dwight discovers an old prank established by Jim a long time ago, leading to a wild goose chase throughout the building."
    ],
    "storylines": [
        "Dwight is digging through some old accounting files when to his amazement, he discovers a letter from one of the company's founders, Robert Dunder, a letter detailing that he has found a rare treasure that he has hidden away for someone to find. Dwight deduces that it must be the Holy Grail and begins to follow the trail of clues to it. Pam suspects this may be one of Jim's pranks and calls him. Jim realizes that it is and that he set that prank up years ago and refers to it as The Dunder Code. However, he has forgotten what happens when Dwight gets to the end of the trail. Pam and the others watch as Dwight follows the clues and eventually ends up searching the warehouse. Pam tells Jim that they didn't find anything, but it is shown that the goblet Jim had placed at the end of the trail has wound up as a coffee cup for a warehouse worker.",
        "Nellie has assembled a Youth Task Force made up of Pete and Erin. Their goal was to create a Facebook page for the company. They explain how they have created several fake profiles and liked the page in order for the company to appear very popular. Nellie is very proud that she chose those two to work together.",
        "Jim is excited as he is coming back to Scranton to see Cece in a ballet that she has been practicing for awhile. He and Pam agree to meet and catch up after a meeting with an investor.",
        "Darryl comes in with a bag with Jim's company printed on the side. Dwight laughs at the name \"Athlead\" and mocks Jim for his new job. Darryl defends Jim and also mentions how he soon will be working full-time for them. Dwight is horrified that Jim is taking Darryl away and suspects that Jim is planning to steal each employee one by one.",
        "Pam asks Angela if the Senator has mentioned anything about a mural. Pam reveals that the Senator recently helped her submit her design for an Irish-American Cultural Center mural downtown and she hopes to be the one picked.",
        "Dwight asks Clark to print out any customer complaints on Darryl however the old printer leads to very slow printing.",
        "Nellie congratulates Pete and Erin on their great job after the company's Facebook page gets its first real like, but she soon realizes that there is an attraction between the two. Nellie is horrified with herself as she is the one who paired them up on the project. She plans to keep them apart to help Andy as she wants to pay Andy back for writing the recommendation letter for her to the adoption agency.",
        "Dwight pretends to be willing to go out and get everyone coffee by having everyone sign their names on a sheet, but Phyllis discovers that the sheet is actually a document asking for a pledge of loyalty to the company. Darryl tells Dwight that he is overreacting. Dwight holds a meeting where he tries to convince people to stay as loyalty is important. Nellie also uses the opportunity to talk about a different kind of loyalty, loyalty to your partner. Kevin brings up how he believes that Pete and Erin are flirting with each other to which both deny.",
        "Dwight tries again to convince Darryl to stay, but Darryl tells Dwight he will be leaving the company.",
        "Pam calls Jim to see if he is close, but Jim reveals he is still in Philadelphia. Jim talks about how the meeting has gone on for a very long time because the investor they were meeting with got nervous and has decided to back out of the deal. Jim is very sad that he will not be able to see Cece's ballet recital and asks Pam if she can record it on her phone. He is nervous as Pam is usually not very good with her phone, but Pam insists she can do it.",
        "Darryl is told he is needed to go on a paper delivery and climbs into the truck. The driver has their head low and a hat pulled over their face. It is then revealed that the driver is Dwight. Dwight tells Darryl that they are going on a paper delivery together so that Dwight can show Darryl all the fun there is in working at a paper company.",
        "Nellie is happy to see that she has saved Andy's girlfriend from going to Pete, but when she talks to Toby, Toby reveals that Andy did not treat her very well and that Nellie may have broken up a very real and happy relationship. Nellie resolves to fix this, but she is somewhat perplexed when Toby starts holding her hand and comments that \"they don't have what we do\". Nellie suddenly remembers that she kissed Toby at the Christmas party and appears regretful.",
        "When Pam is recording Cece's ballet recital, her phone goes off much to the annoyance of the other parents in the audience. Pam becomes very excited when she learns that the call is telling her that she has been picked to paint the mural.",
        "Dwight tries several tactics to make Darryl have fun including playing loud music, playing sports, getting fast food, and throwing a milkshake at an employee as a practical joke. Darryl does not find Dwight's prank amusing and steals the keys so Dwight can't drive away. The manager then makes Dwight clean it up and another driver throws one at him.",
        "Jim is still very stressed out as he attempts to persuade the investor to come back. The investor still appears reluctant.",
        "Things are now very awkward between Pete and Erin and as Nellie observes this, she feels guilty and decides to get them back together.",
        "Pam tries to show the video of Cece's ballet recital to Kevin and Oscar, but Pam accidentally turned the video off when she took the phone call and she never got the rest of it. Angela accuses Pam of choosing a phone call over her child. Pam says that it was an important phone call, but does not tell them what the phone call was about. She tells the cameras that she wants Jim to be the first one to know that she will be the one to paint the mural as she likes it when Jim gets very excited about her art.",
        "Nellie calls Pete and Erin into the conference room and tells them that she will be reassembling the Youth Task Force and that they will have no choice but to keep talking to each other. Pete and Erin seem very happy about this and leave with smiles on their faces. However, Nellie seems rather uncomfortable when Toby congratulates her and begins to give her a shoulder massage.",
        "Jim calls Pam to tell her how the meeting went. Jim is very stressed and annoyed as the investor has decided to back out. He asks Pam if she can send him the video recording of Cece to cheer him up and Pam admits she did not get it. She tries to make light of it by making self-deprecating jokes, but Jim goes off and berates Pam for not being able to film it. The two soon get in a heated argument before they hang up. Pam starts crying and one of the documentary crew members, Brian, asks Pam if she is okay. He proceeds to comfort her and tells the other crew members to shut the cameras off.",
        "Darryl watches the video of the driver who hit Dwight with a drink as he was cleaning up the kitchen from when he threw a drink on the fast food employee. Darryl laughs as he watches it several times. He then admits that this will be a part of the job that he will miss."
    ]
}