{
    "season": 9,
    "title": "Vandalism",
    "episode": "14",
    "episodes": [
        14
    ],
    "coldOpens": [
        "Darryl has began working for Jim's company in Philadelphia and has to sneak out of work. Erin distracts the office when he sneaks out and uses a giant teddy bear dressed like him to make him appear as though he is in his office."
    ],
    "storylines": [
        "Erin helps Darryl sneak out of the office early. Someone vandalizes Pam's warehouse mural by drawing lewd pictures on it. In a talking head interview Pam expresses that she feels no one's there to help her, and feels alone. The boom mic then taps her on the head and Pam smiles. Distraught, she seeks the help of Dwight and Nellie, who both eagerly help her track down the vandal. The three eventually find out that the criminal was a warehouse worker named Frank. Pam and Dwight take revenge by painting childish pictures on his beloved truck with washable paint. However, Frank overreacts and begins to show signs that he is going to physically assault Pam. Brian, the documentary crew's boom mic operator, breaks protocol and intervenes by hitting the warehouse employee across the face with his mic. In the end, the audience learns that both Frank and Brian have been fired from Dunder Mifflin and the documentary, respectively. As Brian leaves, he tells Pam that he will always be there for her if she needs someone.",
        "Meanwhile, in their Philadelphia apartment, Darryl is uncomfortable with Jim's lack of cleanliness. After Jim accidentally uses Darryl's labeled coffee mug, the two begin bickering; both feel that the other is being unreasonable. Eventually, Jim decides to try and make an effort to keep the apartment clean, and Darryl tries not to be so retentive about the cleanliness of his things.",
        "Angela and Robert Lipton celebrate their son Phillip's first birthday. Angela is shocked to learn that Robert invited Oscar to the party, even though she told Robert she didn't want him there. Angela invites Dwight, but after he refuses, Angela then invites Kevin, both in retaliation and to keep him from being alone with the office's accounts. Oscar, who believes he is invited because he thinks Robert is in love with him, soon realizes that he was only invited to boost Robert's opinion in the polls among Latino voters. After the party Kevin thanks Angela and Robert for the food, but tells Robert that he is a terrible person for using his friends to gain political support."
    ]
}