{
    "season": 9,
    "title": "Moving On",
    "episode": "16",
    "episodes": [
        16
    ],
    "coldOpens": [
        "David Wallace yells at Andy for lying however he decides not to fire Andy since he got David to buy the company."
    ],
    "storylines": [
        "Andy learns that Pete and Erin are dating each other, which they've been holding in secrecy from him. After attempting to fire Pete, Andy is lectured by both Erin and Pete to move on. Seeking revenge, Andy hires both Alice, Pete's ex-girlfriend and Gabe Lewis, who is still attracted to Erin, in order to make Pete and Erin feel uncomfortable. The plan inevitably works as the new couple's past relationship issues surface with Gabe making several uncomfortable remarks and Alice bringing up Pete's immature past, prompting arguments to break out in the conference room. Andy smugly tells the camera that seeing Erin and Pete unhappy makes him feel better.",
        "Pam interviews for a job in Philadelphia, where she is amused to find her potential manager, Mark, reminiscent of her former Dunder Mifflin regional manager Michael Scott. When Pam realizes that she is simply interviewing for a glorified receptionist's job, she turns down the offer. Pam later tells Jim, during a romantic dinner, that she does not really want to move to Philadelphia, despite Jim having started his own business. Pam's admission leaves their conversation in awkward silence.",
        "Dwight acquires the help of Angela in order to give his elderly Aunt Shirley a bath. Dwight initially wants to merely take his aunt out and spray her with a hose, but Angela talks him into letting her do it in a more dignified manner. Dwight agrees, and through the process, the two begin to remember their feelings for each other. At the end of the day, Angela and Dwight begin kissing, but Angela reminds Dwight that she is married. Dwight dejectedly tells her that, while he still loves her, she should be faithful to her husband.",
        "In the episode's other subplots, Toby goes to the local prison to talk to the person accused of being the notorious local murderer, the Scranton Strangler; Toby had been discussing the details of the case for some time, forcing Nellie to tell him to do something about it, or to stop talking. Toby believes he may be innocent, but he is proven wrong when he is nearly strangled to death in prison. However, he does have his spirits lifted after Nellie gives him a lift from the hospital and commends him for his bravery. During the last scene of the show, Oscar queues up a television show on his computer, and while the ad loads, he tries to do gravity boot sit-ups. While he is struggling to get down, the camera pans over to Oscar's computer and zooms in on an upcoming television guide on his screen that reveals that the in-series documentary—called The Office: An American Workplace—will air in May."
    ],
    "quotes": [
        [
            {
                "speaker": "Andy",
                "content": " My whole life is a booger bubble!"
            }
        ],
        [
            {
                "speaker": "Gabe",
                "content": " I don't have the lung capacity to blow a whistle"
            }
        ]
    ]
}