{
    "season": 9,
    "title": "Junior Salesman",
    "episode": "13",
    "episodes": [
        13
    ],
    "coldOpens": [
        "Pam thanks Brian for his support however he tells Pam that his agency does not want the camera crew to talk to the office staff. Meredith then tries to flirt with Brian and he happily tells her the same thing."
    ],
    "storylines": [
        "Dunder Mifflin CEO David Wallace has tasked Dwight with finding a part-time replacement for Jim. Clark feels he is ready for the position after 12 grueling weeks of work at Dunder Mifflin, but Dwight makes it clear he doesn't want Clark to get the job. Instead, he brings in a bizarre gallery of his relatives and close friends, including his cousin Mose, best friend Rolf, part-time private investigator Trevor, former Corporate executive Troy, karate teacher Sensei Ira, and a few others.",
        "Pam and Jim are both concerned about Dwight's ideas, as Pam is worried about who will take over Jim's desk and Jim feels guilty that his work in Philadelphia will leave Pam at the mercy of Dwight's questionable judgment. It quickly becomes apparent, though, that none of Dwight's candidates are remotely qualified to be paper salesmen, and while Dwight dismisses Clark again after he aces his interview, he is too committed to making a good hire to actually give the job to someone like Mose, Rolf or Trevor.",
        "Dwight gets a few cheap shots in at Jim's expense when Jim makes a phone call to Wallace in hopes of getting the CEO to invest in Athlead. Jim is forced to have the conversation on speaker phone, and gets double-punched when Wallace first says that Jim's salary is going to be cut to reflect his part-time status, and then bluntly shoots down the idea of putting any money towards Athlead.",
        "Meanwhile, Dwight is stuck between not being able to honestly hire any of his friends and being afraid they will hate him if he doesn't just pick one of them. He tries to get Jim to take over for him, and Jim refuses, but they agree to a plan where Jim will let everyone down easy by claiming he made the call to hire no one.",
        "Unfortunately, Dwight completely overplays his \"anger\" at Jim for not hiring them, and Rolf and everyone else immediately realize Dwight lied to them and wasted their time. They elect to play paintball without him, later sending a rude e-mail that says \"Glad you're not here\", and Dwight sadly notes that he lost all of his friends in just three hours. Clark does get the salesman job, and Pam briefly lifts Dwight's spirits by suggesting they \"haze the new guy\", though she makes Dwight stop that plan when he nearly suffocates Clark with shrink wrap. It is also hinted at that Brian, the boom mike operator for the documentary crew, has developed a crush on Pam."
    ]
}