{
    "season": 9,
    "title": "Roy's Wedding",
    "episode": "2",
    "episodes": [
        2
    ],
    "coldOpens": [
        "The Dunder Mifflin crew set up the chore wheel."
    ],
    "storylines": [
        "In the cold open, Pam creates a Chore Wheel when the office janitor takes a month long vacation, but after everyone else in the office notes that the wheel is no fun, Pam changes the wheel so that it barely relates to chores or work at all, which goes over well.",
        "Pam and Jim are invited to Pam's former fiancé Roy's wedding, which takes place at 8 AM before work. They are both surprised by Roy's beautiful home and the elegant wedding details, and Roy tells them he runs a very successful gravel company. During his wedding toast, Roy stuns his lovely bride by performing \"She's Got A Way\" by Billy Joel on the piano, saying that he told her he was taking boxing lessons as a cover for learning some music for her instead. Pam and Jim, convinced they already know everything about one another but stunned by Roy's transformation, try to find things about themselves the other does not know. This is exacerbated by Jim's frequent calls about a new business he is starting with a friend, because Jim and Pam agreed that the venture was not right for them, but Jim then signed onto it without telling his wife he'd done so. Pam tries unsuccessfully to bait Jim to find out what the secret is and becomes increasingly annoyed that her husband is lying to her.",
        "Dwight reacts to Nellie's mandatory charity initiative by maintaining that he will donate the money he raises to the Taliban. Nellie then makes Dwight sign a contract in \"a ridiculous font\" to live by Taliban rules in the office. Subsequently, Nellie steals Dwight's pen and challenges him to cut her hand off for doing so, hoping he will capitulate and pick a legitimate charity. Dwight spends an inordinate amount of time preparing to do so before the two end up watching 127 Hours together upon the advice of Darryl.",
        "Clark hits on Erin by dangling a fake newscaster job. After receiving some not-so-helpful advice from her coworkers (especially Andy and Darryl, who is now assistant regional manager), Clark invites Erin to his apartment for the fake audition. However, Pete, who has come to dislike Clark, invites himself and Andy along under the pretense of helping with the audition, ruining Clark's seduction plan. Andy ends up throwing himself into the fake plan and more or less dismissing Erin, who in turns goes out for dinner with Pete and appears to be enjoying time spent with him."
    ],
    "quotes": [
        [
            {
                "speaker": "Jim",
                "content": " Roy doesn't sing does he?"
            }
        ],
        [
            {
                "speaker": "Pam",
                "content": " Roy? No."
            }
        ],
        [
            {
                "content": "-Roy starts singing beautifully-"
            }
        ],
        [
            {
                "content": "-Jim and Pam stare in shock"
            }
        ],
        [
            {
                "speaker": "Creed",
                "content": " The Taliban is the worst. Great heroine, though."
            }
        ]
    ]
}