{
    "season": 9,
    "title": "Finale",
    "episode": "24/25",
    "episodes": [
        24,
        25
    ],
    "coldOpens": [
        "Dwight recaps his first year as Regional Manager. A flashback of Stanley retiring and Kevin and Toby getting fired is shown."
    ],
    "storylines": [
        "The premise of the episode is that the documentary crew has returned to film bonus footage for the DVD release of the documentary. As the office prepares for Dwight and Angela's wedding, they also prepare for a panel regarding the documentary at a local theater. Underwhelming attendance to the event leads to disappointment until they realize the people haven't all been let in yet and are waiting outside. The panel reveals the identity of Erin's birth parents, and Pam reveals she is working on something big to pay Jim back for his DVD shown in A.A.R.M.. That night, Jim and Pam throw bachelor and bachelorette parties for Dwight and Angela, respectively. Jim takes Dwight and the guys to a pub where Dwight is oblivious to the waitress being a stripper. Pam and the girls are at a small house, where Jake Palmer returns as the stripper the girls hired for Angela. Everyone except Meredith thinks this is inappropriate considering Jake's mother is present, and Angela does not want a stripper anyway. Phyllis inadvertently causes Angela to be kidnapped by Mose Schrute when she tells Angela that a noise is only the wind. Dwight then must search for Angela, as it is revealed this is another absurd Schrute tradition. The search ends at Kevin's bar, where Dwight and Kevin make amends.",
        "The following day is the wedding. Jim pulls one final prank on Dwight: he insists that he cannot be his best man, as Dwight is older than Jim. When Dwight tries to change his mind, Jim directs his attention to Michael Scott, standing in the doorway. An excited Dwight exclaims, \"Michael! I can't believe you came!\" to which Michael replies, \"That's what she said\". In the bridal chamber, it is decided Phyllis will carry Angela down the aisle due to Angela's leg pain from having been in a car trunk for several hours. The two are married (standing in their own graves, as is Schrute tradition \"as a reminder that this is the only escape from what they are about to do\"), and everyone heads to the reception. At the reception, Jim and Pam dance and kiss, and Jim states that Pam no longer owes him anything. Michael and Pam talk, and she reveals he has kids (and takes so many pictures of them he needs two phones). Michael does one final talking head from his table, saying that he feels like all his kids grew up and married each other, which is \"every parent's dream\". Ryan and Kelly run away together, passing Ryan's son to Ravi who then gives the baby to Kevin. Ravi tells him to report an abandoned baby to child services, but Nellie instead takes the child as her own and tells the camera that if Ryan wants his baby back he can find them \"somewhere in Europe.\"",
        "Jim and Pam head home and are surprised to find Carol, Michael's former Realtor/ex-girlfriend, showing their house. Pam reveals she has been showing the house for two months, so that if they got an offer, Jim would have no reason not to rejoin Athlead. The couple being shown the house decide they want to buy it, and Jim and Pam agree to sell.",
        "That night there is a DVD release party at the warehouse. Pam reveals her mural, a painting of the office and everyone who works in it. After a group picture, everyone heads up to the office to hang out. Creed is revealed to be living in one of the office's supply closets. Seeing that Erin is busy, Pam takes one final call as the receptionist, which coincidentally is for Jim Halpert. She replies, \"I'm sorry, Jim Halpert doesn't work here anymore.\" Soon after they announce their plans to leave to Dwight, who fires them so that they can both receive large severance packages. Creed sings a song while they tell the cameras about how the documentary has affected them. As everyone leaves the office, Pam takes her painting of the office building from the wall. A flashback shows the moment Michael first put it up."
    ]
}