{
    "season": 9,
    "title": "Paper Airplane",
    "episode": "20",
    "episodes": [
        20
    ],
    "coldOpens": [
        "The office talk about the paper airplane contest they are competing in. Pam accidentally hits Toby in the eye with her paper airplane."
    ],
    "storylines": [
        "The employees hold a paper airplane competition, Andy gets an acting role in a workplace safety video, and Jim and Pam's marriage tensions continue to build.",
        "There is a paper airplane contest in the warehouse, and Angela and Dwight compete for the prize. Meanwhile, Andy is preparing for an industrial film. He remarks that things in eyes freak him out, when he sees Toby, who got hit in the eye by Pam when she threw her paper airplane. Andy is rather stressed out, and once he overcomes his fear is willing to stick his eyes in the chemical eye washer twice. Back in the office, Jim and Pam confirm they are in couple's counseling. After the first session, they become more honest with each other, lightening the stress on their relationship somewhat. At the end of the episode, Pam runs after Jim when he says he's going to Philly again. She runs out to the taxi to give him his umbrella, which he left on his desk by mistake. They embrace, although Pam is hesitant at first, but passionately kisses Jim. A Bible reading from Jim's brother at their wedding plays in the background about love. They share a synchronized \"I love you\" as the episode comes to an end, repairing and mending the breaks in their past."
    ],
    "quotes": [
        [
            {
                "speaker": "Darryl",
                "content": " Andy Bernard might not be able to stick his eyes into that water, but do you know who can?"
            }
        ],
        [
            {
                "content": "-checks Andy's nametag-"
            }
        ],
        [
            {
                "content": "...\"Older Male Lab Assistant Number One\""
            }
        ],
        [
            {
                "speaker": "Clark",
                "content": " Hey, are you guys high? Because if so, to speak my truth I would really appreciate it if you were to let me in, on your kind buds."
            }
        ]
    ]
}