{
    "season": 9,
    "title": "A.A.R.M.",
    "episode": "22/23",
    "episodes": [
        22,
        23
    ],
    "episodeDetails": {
        "sections": [
            {
                "title": "A.A.R.M.",
                "level": 1,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "\"A.A.R.M.\" is the twenty-second/twenty-third episode of the ninth season of the American television comedy series The Office and is the show's 198th/199th episode overall. It is the second to last episode of the series. It aired on May 9, 2013."
                    },
                    {
                        "type": "paragraph",
                        "text": "As the office readies for the premiere of the documentary that night, Jim convinces Dwight, who is planning to propose to Esther, that he needs an Assistant to the Assistant to the Regional Manager, and holds tryouts to find the best candidate. Angela brings her baby to work after her daycare turns her away. Meanwhile, Andy attends auditions for America's Next A Cappella Sensation."
                    }
                ],
                "images": []
            },
            {
                "title": "Synopsis",
                "level": 2,
                "content": [
                    {
                        "type": "paragraph",
                        "text": "Jim convinces Dwight that he needs to choose someone to act as an Assistant to the Assistant to the Regional Manager (A.A.R.M.); the two subsequently hold tryouts for the position. The tryouts consist of several office-oriented challenges and it is found, through Jim's scheming, that Dwight is the most qualified for the newly founded A.A.R.M. position. Angela is forced to bring her son, Phillip, to work, after her daycare turns her child away. Dwight, who initially wanted to marry his current girlfriend Esther, begins to think that Angela's son is actually his. He confronts her, but she tells him that this is not the case. Dwight then confers with Jim, who tells Dwight that if he truly loves Angela then that's who he should pursue. Dwight makes up his mind and proposes to Angela, who says yes. Angela finally reveals to Dwight that Phillip is indeed his son."
                    },
                    {
                        "type": "paragraph",
                        "text": "Meanwhile, Darryl returns to Scranton, after quietly quitting a week ago to work full-time at Athlead, the sports marketing company that Jim founded. When the others spot him, they are upset that he left without saying goodbye and demand to spend some time with him one way or another before he leaves for good. The office ultimately decides on one final dance together."
                    },
                    {
                        "type": "paragraph",
                        "text": "When Darryl runs into Pam, he tells her about Athlead's success and how Jim is missing out by staying in Scranton. Pam begins to worry that she is making Jim do something that he does not want to do. She later confronts her husband and admits that she thinks she might not be enough for him; he tries to tell her that she is the most important thing in his life. Later, he decides to get the documentary crew's help; the crew makes a DVD of many of the highlights of Jim and Pam's relationship throughout the series. The final scene is from the second season Christmas episode \"Christmas Party\" in which Jim gives Pam a teapot as a gift, but takes back his very emotional note that expresses his feelings for Pam before she notices it. After the DVD plays, Jim presents Pam with the actual, unopened note. She reads it, and the two happily embrace."
                    },
                    {
                        "type": "paragraph",
                        "text": "Meanwhile, Andy auditions for America's Next A Cappella Sensation. Andy meets an exuberant and like-minded lady, Casey Dean from Cincinnati, Ohio. However, before he is able to tryout in front of the judges—who include Aaron Rodgers, Clay Aiken, and Santigold—the auditions close, and Andy makes a fool of himself. Dejected, he journeys to Poor Richard's Pub, where he meets up with the rest of his former office workers. Altogether, the office watches the official airing of the documentary on PBS' Scranton affiliate station, WVIA-TV. As the office workers stare at the screen, the audience hears the opening dialogue from the series' first episode, \"Pilot\"."
                    }
                ],
                "images": []
            },
            {
                "title": "Cultural references",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Dwight's test to see if Phillip is his son—in which Dwight offered the child either a check for \"one million dollars\", or a beet, and saw which one he chose—has been compared to a similar scene in the 1997 film Kundun, in which Tibetan monks practice a similar ritual.",
                                "elements": []
                            },
                            {
                                "text": "The song that plays over the montage of Pam and Jim's DVD is \"Open Your Eyes\" by Snow Patrol.",
                                "elements": []
                            },
                            {
                                "text": "Darryl and the rest of the office dance to the song \"Boogie Wonderland\" by Earth, Wind, and Fire.",
                                "elements": []
                            },
                            {
                                "text": "Oscar, during the office dance portion of the episode, seems to do an admittedly shoddy version of \"voguing\". This is a form of dance derived from the gay ball culture of New York from the 1920s onwards, and more recently, a hit Madonna song.",
                                "elements": []
                            },
                            {
                                "text": "The show Andy auditions for America's Next A Cappella Sensation, is a parody of popular singing shows like American Idol, The Voice, and The Sing-Off.",
                                "elements": [
                                    {
                                        "text": "The fictional show is hosted by Mark McGrath, the lead singer from the rock band Sugar Ray.",
                                        "elements": []
                                    },
                                    {
                                        "text": "Judge Aaron Rodgers is an American football quarterback for the Green Bay Packers.",
                                        "elements": []
                                    },
                                    {
                                        "text": "Judge Clay Aiken is a singer who gained prominence following the second season of American Idol in 2003.",
                                        "elements": []
                                    },
                                    {
                                        "text": "Judge Santigold is an American singer, songwriter, and producer.",
                                        "elements": []
                                    }
                                ]
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Connections to previous episodes",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "In the last few moments of the episode, you can hear the opening lines from Pilot.",
                                "elements": []
                            },
                            {
                                "text": "Dwight is his own assistant during the brief hours when he is Regional Manager in The Job.",
                                "elements": []
                            },
                            {
                                "text": "Jim finally decides to give Pam the note he wrote for her in Christmas Party, when he gives her the teapot letter he originally took back from her in the same episode.",
                                "elements": []
                            },
                            {
                                "text": "Dwight hangs paintings of himself around the office when he becomes acting manager in Dwight K. Schrute, (Acting) Manager.",
                                "elements": []
                            },
                            {
                                "text": "While Philip is crying, Dwight offers to try to calm him down, even saying, \"Pam can attest, there's no one better at getting brats to shut their yaps\", referencing the episode Viewing Party, when he was able to quiet down Cece, Jim and Pam's daughter, just by holding her in his arms. ",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Goofs",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Phillip is seen as a baby two episodes ago yet was acted by a toddler in the episode.",
                                "elements": []
                            },
                            {
                                "text": "Angela admits she lied about Phillip not being Dwight's baby. However, Dwight was informed of the opposite by a geneticist in the episode New Guys. (Greg Daniels explained that they shot but cut a scene in which it is explained that Dwight grabbed the wrong diaper.)",
                                "elements": []
                            },
                            {
                                "text": "When Andy is auditioning for the singing competition, he claims he is singing the Cornell fight song (\"Give my Regards to Davy\"). He is actually singing the Cornell Alma Mater (\"Far Above Cayuga's Waters\").",
                                "elements": []
                            },
                            {
                                "text": "Jim's video misspells Pam's last name as \"Beesley\" instead of \"Beesly\".",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Amusing details/Trivia",
                "level": 2,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "John Krasinski actually wrote a personal letter to Jenna Fischer inside the card from the teapot, which Jim finally gives to Pam in this episode. She was not aware of this beforehand and reads the letter for the first time on camera.",
                                "elements": []
                            },
                            {
                                "text": "This marks the last day the documentary crew is actually filming for the initial documentary. As we learn in Finale, twelve months passed between this episode and the last episode, Dwight also says they sent another crew for Finale.",
                                "elements": []
                            },
                            {
                                "text": "In the painting hung in the conference room, Dwight is portrayed in the same manner as DPRK president Kim Il-sung in his statue at Mansu Hill Grand Monument in Pyongyang.",
                                "elements": []
                            },
                            {
                                "text": "In this episode, Kevin acts like many former only children do when the parents bring home a new baby. Oscar and Angela perform the common practice of giving the child (Kevin) a gift and saying that it's from the baby to make them feel better.",
                                "elements": []
                            },
                            {
                                "text": "There is no implication that Dwight leaves work to get a beet, meaning he already had one in the office.",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Cast",
                "level": 2,
                "content": [],
                "images": []
            },
            {
                "title": "Main Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Rainn Wilson as Dwight Schrute",
                                "elements": []
                            },
                            {
                                "text": "John Krasinski as Jim Halpert",
                                "elements": []
                            },
                            {
                                "text": "Jenna Fischer as Pam Halpert",
                                "elements": []
                            },
                            {
                                "text": "Ed Helms as Andy Bernard",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Supporting Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Catherine Tate as Nellie Bertram",
                                "elements": []
                            },
                            {
                                "text": "Leslie David Baker as Stanley Hudson",
                                "elements": []
                            },
                            {
                                "text": "Brian Baumgartner as Kevin Malone",
                                "elements": []
                            },
                            {
                                "text": "Creed Bratton as Creed Bratton",
                                "elements": []
                            },
                            {
                                "text": "Clark Duke as Clark Green",
                                "elements": []
                            },
                            {
                                "text": "Kate Flannery as Meredith Palmer",
                                "elements": []
                            },
                            {
                                "text": "Ellie Kemper as Erin Hannon",
                                "elements": []
                            },
                            {
                                "text": "Angela Kinsey as Angela Martin",
                                "elements": []
                            },
                            {
                                "text": "Jake Lacy as Pete Miller",
                                "elements": []
                            },
                            {
                                "text": "Paul Lieberstein as Toby Flenderson",
                                "elements": []
                            },
                            {
                                "text": "Oscar Nunez as Oscar Martinez",
                                "elements": []
                            },
                            {
                                "text": "Craig Robinson as Darryl Philbin",
                                "elements": []
                            },
                            {
                                "text": "Phyllis Smith as Phyllis Vance",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "Guest Cast",
                "level": 3,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Clay Aiken as Himself",
                                "elements": []
                            },
                            {
                                "text": "Hugh Dane as Hank",
                                "elements": []
                            },
                            {
                                "text": "Nora Kirkpatrick as Esther",
                                "elements": []
                            },
                            {
                                "text": "Mark McGrath as Himself",
                                "elements": []
                            },
                            {
                                "text": "Mark Proksch as Nate",
                                "elements": []
                            },
                            {
                                "text": "Aaron Rodgers as Himself",
                                "elements": []
                            },
                            {
                                "text": "Santigold as Herself",
                                "elements": []
                            },
                            {
                                "text": "Jessica St. Clair as Casey Dean",
                                "elements": []
                            },
                            {
                                "text": "Nico Evers-Swindell as Cpl. Miller",
                                "elements": []
                            },
                            {
                                "text": "Ryan Kyler Bailey as Producer",
                                "elements": []
                            },
                            {
                                "text": "Rachel Crow as Gabriella",
                                "elements": []
                            },
                            {
                                "text": "Scot Robinson as The Bartender",
                                "elements": []
                            },
                            {
                                "text": "Calvin Tenner as Glenn",
                                "elements": []
                            },
                            {
                                "text": "Steve Carell as Michael Scott (Stock Footage Voice Only) (uncredited)",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            }
        ]
    },
    "quotesDetails": {
        "sections": [
            {
                "title": "A.A.R.M. Quotes",
                "level": 1,
                "content": [
                    {
                        "type": "list",
                        "elements": [
                            {
                                "text": "Erin: The tea in Nepal is very hot.",
                                "elements": []
                            },
                            {
                                "text": "Kevin: But the coffee in Peru is much hotter.",
                                "elements": []
                            },
                            {
                                "text": "Dwight: But the coffee in Peru is far hotter./The coffee in Paraguay is far hotter./ The coffee in Paraguay is colder.",
                                "elements": []
                            },
                            {
                                "text": "Dwight: Break protocol! Break protocol! Break protocol!",
                                "elements": []
                            },
                            {
                                "text": "Creed: Oh, I'm saving on a fortune for dry cleaning!",
                                "elements": []
                            }
                        ]
                    }
                ],
                "images": []
            }
        ]
    },
    "coldOpens": [
        "Kevin enters the office using the new security door Dwight installed. Dwight later tries to use it himself and gets the password wrong causing him to get blasted by steam "
    ],
    "storylines": [
        "Jim convinces Dwight that he needs to choose someone to act as an Assistant to the Assistant to the Regional Manager (A.A.R.M.); the two subsequently hold tryouts for the position. The tryouts consist of several office-oriented challenges and it is found, through Jim's scheming, that Dwight is the most qualified for the newly founded A.A.R.M. position. Angela is forced to bring her son, Phillip, to work, after her daycare turns her child away. Dwight, who initially wanted to marry his current girlfriend Esther, begins to think that Angela's son is actually his. He confronts her, but she tells him that this is not the case. Dwight then confers with Jim, who tells Dwight that if he truly loves Angela then that's who he should pursue. Dwight makes up his mind and proposes to Angela, who says yes. Angela finally reveals to Dwight that Phillip is indeed his son.",
        "Meanwhile, Darryl returns to Scranton, after quietly quitting a week ago to work full-time at Athlead, the sports marketing company that Jim founded. When the others spot him, they are upset that he left without saying goodbye and demand to spend some time with him one way or another before he leaves for good. The office ultimately decides on one final dance together.",
        "When Darryl runs into Pam, he tells her about Athlead's success and how Jim is missing out by staying in Scranton. Pam begins to worry that she is making Jim do something that he does not want to do. She later confronts her husband and admits that she thinks she might not be enough for him; he tries to tell her that she is the most important thing in his life. Later, he decides to get the documentary crew's help; the crew makes a DVD of many of the highlights of Jim and Pam's relationship throughout the series. The final scene is from the second season Christmas episode \"Christmas Party\" in which Jim gives Pam a teapot as a gift, but takes back his very emotional note that expresses his feelings for Pam before she notices it. After the DVD plays, Jim presents Pam with the actual, unopened note. She reads it, and the two happily embrace.",
        "Meanwhile, Andy auditions for America's Next A Cappella Sensation. Andy meets an exuberant and like-minded lady, Casey Dean from Cincinnati, Ohio. However, before he is able to tryout in front of the judges—who include Aaron Rodgers, Clay Aiken, and Santigold—the auditions close, and Andy makes a fool of himself. Dejected, he journeys to Poor Richard's Pub, where he meets up with the rest of his former office workers. Altogether, the office watches the official airing of the documentary on PBS' Scranton affiliate station, WVIA-TV. As the office workers stare at the screen, the audience hears the opening dialogue from the series' first episode, \"Pilot\"."
    ],
    "quotes": [
        null
    ]
}