{
    "season": 9,
    "title": "Work Bus",
    "episode": "4",
    "episodes": [
        4
    ],
    "coldOpens": [
        "Andy makes a fail reel of the summer softball tournament."
    ],
    "storylines": [
        "Andy presents the office staff a video compilation of the team's softball season. While the staff are initially excited they soon realize it is Andy's horrible attempt to engage in the internet craze of making a \"fail video\". The video consists of the staff doing whatever was considered normal and Andy making vulgar noises over it. In retaliation Jim pulls up a video of Andy trying to carry the full water cooler, which ends with Andy falling down and spilling the water all over himself. The office staff begin to chant \"Fail! Fail!\" at Andy to which he eventually gets angry and leaves.",
        "Toby and Erin are testing for electromagnetic field hotspots around the office due to non-insulated wiring and they find many spots, which they mark with red tape. Dwight scoffs at needing to insulate the wires, stating that he refuses to do so because it is too costly.",
        "Jim meanwhile is being extremely nice to Pam due to her being supportive of Jim wanting to go to Philadelphia to work with his friend on their new business. He is looking for a way to pay her back.",
        "Nellie is looking eagerly to fulfill her lifelong dream of adopting a child. She asks Andy if he is willing to help her out by writing a character reference, but Andy rejects her, still hating her for what she did to him.",
        "The office staff are still angry at Dwight for caring more about money than about their own safety. Dwight argues that in order to insulate the wires they would have to open the walls and close the office building down for a week. Pam makes a comment about how she would love a week off work and Jim immediately sets off to work on achieving this. He puts a popcorn bag in the microwave and only pops one kernel before placing it under Dwight's desk. He achieves making Dwight believe the electromagnetic radiation caused it to occur and finally scares Dwight when Jim tells him it may cause infertility.",
        "Jim believes he got them a week off work, but Dwight reveals he has gotten them a new workspace for the week, a bus. The office staff find it cramped and uncomfortable. Meanwhile, Erin learns of Nellie wanting to adopt a child, and having been a foster kid herself, offers to help Nellie write her letter.",
        "Jim, having failed at getting Pam a week off work, decides to cheer her up by convincing Dwight to drive the bus to LaVerne's pie stand, Pam's favorite pie shop. Dwight refuses at first but after convincing Andy and the rest of the office staff Dwight is forced to do so. The bus drives off, leaving Clark and Darryl behind but they don't seem to mind in the least.",
        "While the bus drives along it picks up a hitchhiker, Creed, who smiles and loudly announces that he is playing hooky from work, before realizing that the entire office staff is on the bus.",
        "Nellie submits her letter to Andy, and he loudly and rudely tells Nellie how poorly written the letter is and how her dream will never come true. Nellie quietly goes to the front of the bus and behind a curtain. Erin has clearly heard this as well.",
        "Dwight decides to stop the bus, as he is tired of being pushed around by Jim. The fact that Philip was not his child has been gnawing away at him, and he climbs out the emergency exit door in the roof and goes off to sulk. Pam notices this is uncharacteristic of Dwight and tells Jim to go find out if he is okay.",
        "After some awkward conversation about how Dwight is sad that he is still childless after all this time he eventually comes to the realization that the office staff are kind of like his children. Jim is finally able to convince him to go to the pie stand.",
        "Andy hears who he believes to be Nellie sobbing behind the curtain and jokes with Pete about British women being over-emotional, but Pete remarks, \"I don't think that's Nellie.\" It's revealed that Erin is crying from what Andy said about the letter and Nellie is comforting her.",
        "Jim and Pam make up while eating pie and Kevin tries to get Oscar to hit him in the face with his pie and Oscar eventually does. Andy feels terrible about what he said and adds a few sentences to Nellie's letter about how she would make a wonderful mother and signs it.",
        "Once back at the office building, Andy insists they keep playing the games they played while on the road and annoys the office staff with his constant singing and banjo playing."
    ],
    "quotes": [
        [
            {
                "speaker": "Andy Bernard presents",
                "content": " Summer Softball Epic Fails!"
            }
        ]
    ]
}