{
    "season": 9,
    "title": "The Boat",
    "episode": "6",
    "episodes": [
        6
    ],
    "coldOpens": [
        "Oscar admits he is having an affair with the Senator and Kevin overhears."
    ],
    "storylines": [
        "Oscar admits to the cameras that he is indeed having an affair with the Senator. He asks that the cameras promise not to tell anyone and that he is trying to work things out. Suddenly Kevin steps out from behind the dumpster, having heard the whole thing. His shock causes him to drop his ice cream.",
        "Andy's family has gone bankrupt. Walter Bernard Sr. blew through all the family's money and ran away to Argentina with a younger woman. Walter Bernard Jr., Andy's younger brother, locked himself in the wine cellar and is now going to rehab in New Mexico. Jim and Pam express their amazement at how calm and competent Andy's handling of the situation is.",
        "Pam receives a call informing her that a local radio talk show is looking for any interested Dunder Mifflin Scranton employees that would like to be interviewed. Dwight immediately volunteers as he believes that it could lead to him being famous and being able to endorse paper products leading him to sell more.",
        "Andy recruits Darryl, Erin, and Oscar to help him figure out the family's budget. They determine the only way to regain most of their money is to sell the family boat. Andy is reluctant to do this as the boat has become a symbol in the family that represents their pride.",
        "Meanwhile, Oscar realizes that Kevin can barely keep the secret to himself and nearly reveals it to Angela several times. Oscar eventually gets angry with Kevin and turns in false information to Toby that indicates that Kevin is using company money to gamble.",
        "Pam reveals that the radio show called and canceled the interview, but Jim decides to use this for a prank.",
        "Andy is sad about the idea of the boat being sold. He explains to Erin that he has always wanted to steer the boat, but his father would always knock him aside. Erin tells him that now that he is the man of the family, the boat could be his to steer. Andy decides to go with Erin and take the boat on a sunset cruise before it is sold.",
        "Jim, Pam, Nellie, and Darryl all simulate the radio talk show in the conference room while Dwight is in the break room. Nellie plays the radio show host in an American accent while Darryl does theme music. Nellie successfully convinces Dwight to take his shirt and pants off and tricks him into blaming company CEO David Wallace for the \"stock failures\" that Jim brings up.",
        "Andy arrives at the boat and tries to sail it one more time, but men from the insurance company stop him. Andy convinces them that he will sail the boat down to the buyer himself. While showing Erin around the boat, he discovers a drunk Walter Jr. in the liquor cabinet and asks him if he would like to join his crew.",
        "Oscar feels bad about what he did to Kevin and decides to confess to Toby that the numbers he turned in were false. Toby then confides in Oscar that he was pressured to determine the Scranton Strangler guilty back when he was on trial.",
        "Jim plays a detective on the radio show and convinces Dwight that due to the stock failures facing Dunder Mifflin, David has gone insane and kidnapped a mailman and is holding him hostage inside his house. The plan backfires when Dwight decides to call David and convince him to let the mailman go.",
        "Jim, Pam, Nellie, and Darryl listen as Dwight calls David Wallace and talks to him as though he is insane and tells him to \"let the mailman go...\". David dismisses his call as nonsense and hangs up much to the relief of the staff. They congratulate Dwight when he comes out of the conference room. Dwight claims the call went exactly as expected.",
        "The Senator comes in and puts a hand on Oscar's shoulder, causing him to get nervous and worry that Kevin will reveal that Oscar and the Senator are having an affair. Instead, Kevin changes the subject to the Senator's upcoming election and Oscar admits he is impressed with Kevin. In a talking head shortly after Kevin reveals that he completely forgot about the affair when the Senator was present and starts laughing hysterically.",
        "Andy and Walter Jr. set sail and leave Erin on the dock. Erin appears disappointed as she really wanted to go along.",
        "With Andy gone, Pete asks if Erin would like to go to Poor Richard's and meet his friends. Erin, disappointed that Andy left her behind, agrees."
    ]
}