{
    "season": 9,
    "title": "The Whale",
    "episode": "7",
    "episodes": [
        7
    ],
    "coldOpens": [
        "Andy video-chats the office via his laptop. but then proceeds to drop it in the sea."
    ],
    "storylines": [
        "Andy and the rest of the office staff talk through Skype. The staff are horrified to see Andy badly sunburned and mostly naked. Andy shows them around the boat and accidentally knocks various items of importance overboard such as his drinking water, a hose used to convert salt water into fresh water, and eventually the laptop he is using. Darryl then tells the cameras Andy has only been sailing for two days.",
        "David Wallace calls to tell the branch that a massive client, Scranton White Pages, a phone book company, has recently dropped their paper supplier of 10 years and is now interested in Dunder Mifflin. Dwight brags that David has selected him to go after this \"white whale\" of a client instead of Jim, but David says he wants Jim on the call too. Dwight tries to take the phone off speaker, to keep Jim from being included, but Jim unplugs the handset and puts it in his desk drawer. When David tells Dwight that the new CEO is a woman, the women of the office begin to worry as Dwight is horrible when it comes to female clients. Pam asks Jim if he can go instead, but he can't due to a conference call for the company he and his friends are working on. They women all agree to coach Dwight on how to be respectful to women.",
        "Meanwhile, Pete, Clark, Toby, and Kevin are growing out their facial hair to support a charity for prostate cancer research. Toby likes the idea as he feels that he is bonding with the others in the office.",
        "Angela confides in Oscar that she thinks the Senator might be having an affair, which horrifies Oscar, knowing that she might be on to them. He tries to assure her that he isn't, but when Angela tells him about a yoga studio he is always at and how he is always with someone named Blake, Oscar begins to worry that the Senator is cheating on him as well. The two agree to stake him out.",
        "Pam tries to teach Dwight how to be respectful to women and teaches him ways to indicate that he is listening such as smiling and nodding, but Dwight appears creepy when doing so. Nellie and Phyllis try to help him, but they soon deem him \"hopeless\". Pam agrees to go on the sales pitch with Dwight and try to help him.",
        "Meanwhile, Jim calls his friends to discuss the investment and is embarrassed to learn that he is the only one calling and all the others are actually there. He tries to talk to them through his office phone, but various distractions around the office prevent Jim from focusing.",
        "Oscar and Angela spy on the Senator and while Oscar is relieved to know that Blake is a woman, Angela becomes jealous. However, it is revealed that Blake has a boyfriend letting Angela relax, but Oscar becomes jealous when he notices another man and the Senator getting along quite nicely.",
        "Dwight and Pam arrive at the White Pages office and they soon realize that the CEO is Jan Levinson. Pam tells Dwight to forget all they had taught him. Jan arrives and becomes furious when she realizes that Dwight and Pam are the sales representatives as she was expecting David Wallace. She had wanted to show David how powerful she had become and never planned to do business with Dunder Mifflin at all. Dwight, however, still intends to land this massive client and he tells Pam to stall before leaving the room.",
        "Toby enjoys spending time with the other men in the office as he feels he is really bonding with them. Meanwhile, Pete jokes around with Erin about his mustache and when it's obvious that Erin thinks it's ugly, Pete shaves it off.",
        "Angela begins to get suspicious as to why Oscar is so focused on the Senator. Before Oscar can leave, they watch the Senator make a phone call and when Oscar's phone starts to ring, he looks up to an angry and terrifying-looking Angela.",
        "Jim tries to talk to the other investors in the parking lot, but a loud saw across the street causes him to go to a quieter area and he accidentally sets off Meredith's car alarm. Hank then comes out believing that the local skateboard punks are back and yells for them to come out. Meredith also comes out, believing that someone is breaking into her car, causing even more chaos and noise for Jim.",
        "Pam is forced to watch a very awkward and weird slideshow of Astrid with Jan's singing. Dwight arrives with Clark and exploits Jan's fetish for younger men. Clark, however, appears to believe he was going to Quiznos. Jan agrees to take Clark in as her \"personal Dunder Mifflin liaison\" in exchange for giving Dwight her business.",
        "Jim apologizes to his friends for all the chaos of their phone call, but they admit they don't feel \"this is working\". Jim asks what that means.",
        "On the way out of the building, Dwight and Pam convince Jan's emotional and low self-esteemed secretary, Molly, that she should quit as Jan is likely to fire her anyway. She appears to like Dwight as he seems empathetic to her problems. Pam encourages Dwight to get her number, to which Dwight replies he already got \"it\", referring to her license plate number, and that this is all he needs to get her phone number. Dwight then promises Pam he will gossip about what they do on their date since \"...women love gossip. It's like air to you people.\""
    ]
}