{
    "season": 9,
    "title": "Dwight Christmas",
    "episode": "9",
    "episodes": [
        9
    ],
    "coldOpens": [
        "None "
    ],
    "storylines": [
        "The party planning committee drops the ball on the annual Christmas party, and at the behest of Jim, Dwight gets everyone to celebrate with a traditional Schrute Pennsylvania Dutch Christmas. He dresses up as the traditional winter Christmas gift-bringer figure Belsnickel, cooks Dutch food, and plays a game called \"Impish or Admirable\". Jim, however, has to leave the party early to arrive in Philadelphia for his sports marketing job; this causes Dwight to be visibly saddened. Dwight ends the festivities, and a \"normal\" Christmas party is started. Although Pam tries to cheer him up, only Jim's sudden return makes him feel better. During the party, Darryl fears that Jim has forgotten to include him in the new job in Philadelphia. As such, he gets extremely drunk. When he goes to confront Jim, Jim—unknowing that Darryl was upset—excitedly tells him that he has arranged an interview for him. Darryl, appeased, turns around but passes out and crashes down on the catering table.",
        "Meanwhile, Pete teaches Erin about his favorite movie, Die Hard. Pete displays serious devotion to the film by quoting a big majority of it, much to Erin's delight. Andy, who is still away in the Caribbean after sailing his family's boat, emails Erin and says that he thinks he is going to stay for a few weeks. Hurt, Erin decides to watch Die Hard with Pete rather than just hear him quote it. While watching the movie, Erin begins to cry and Pete tries to comfort her by placing his arm around her. Although Erin notes that she is still dating Andy, she tells Pete that he can continue putting his arm around her. In the meantime, Toby tells Nellie about the Scranton Strangler case he was on. After boring her for what is implied to be several hours, she hushes him, before gently kissing him. Toby then whips off his glasses and kisses her back."
    ],
    "quotes": [
        [
            {
                "speaker": "Stanley",
                "content": " No. I want Tropical Christmas. "
            }
        ],
        [
            {
                "speaker": "Meredith",
                "content": " Topless Christmas. "
            }
        ],
        [
            {
                "speaker": "Creed",
                "content": " Tapas swiss miss."
            }
        ],
        [
            {
                "speaker": "Creed",
                "content": " Spanish tapas, and swiss miss hot cocoa--What's so hard to understand?"
            }
        ],
        [
            {
                "speaker": "Dwight",
                "content": " Excuse me. I have to run to my car to take a dump. ]"
            }
        ]
    ]
}