{"sections":[{"title":"Andy's Ancestry","level":1,"content":[{"type":"paragraph","text":"\"Andy's Ancestry\" is the third episode of the ninth season of The Office and the show's 179th overall. It was written by Jonathan Green and Gabe Miller and was directed by David Rogers. It originally aired on NBC on October 4, 2012."},{"type":"paragraph","text":"In the episode, Darryl has a hard time in his new role as assistant regional manager when Andy flaunts his bloodlines. Dwight teaches Erin the Dothraki language to impress her boyfriend's educated family. Nellie tries to convince Pam that Jim is having an affair, and Jim reveals his secret in the warehouse."}],"images":[]},{"title":"Synopsis","level":2,"content":[{"type":"paragraph","text":"Fed up with Andy, Nellie decides to prank him, printing a fake genealogy that shows him as a relative of First Lady Michelle Obama, who is known to have white relatives. Excited about being a relative of one of the most popular women in America, Andy announces this discovery to the entire office. He assumes his employees are equally as excited as he is, but Oscar actually forms a theory that Andy's ancestors were slave owners, that being the only possible explanation as to how he had a black relative. When Andy hears of this, he holds a meeting pointing out embarrassing relatives of his other co-workers (these also being made up by Nellie), most notably asserting that Jim was related to former President Richard Nixon. This, coincidentally, is something that Pam says often because of their supposed similar appearance."},{"type":"paragraph","text":"Meanwhile, Pam teaches Nellie how to drive, and on their trip, Pam realizes how cool Nellie actually is. She's impressed that she pulled such a clever prank on Andy and even talks to her about the feeling she has that Jim is keeping something from her. Nellie immediately thinks that Jim is having an affair, striking suspicion in Pam."},{"type":"paragraph","text":"Later, Jim finally tells his wife that he took the job he was offered in Philadelphia."}],"images":[]},{"title":"Cultural references","level":2,"content":[{"type":"list","elements":[{"text":"Dwight attempts to teach Erin the Dothraki language from the popular book series A Song of Ice and Fire by George R. R. Martin. The books were later turned into the HBO fantasy series Game of Thrones.","elements":[]},{"text":"Nellie says Michelle Obama \"wants to wipe out fat children\", a reference to her Let's Move! initiative.","elements":[]},{"text":"Dwight later compares learning Dothraki to learning Klingon, a fictional language from franchise Star Trek.","elements":[]},{"text":"Andy refers to Ladysmith Black Mambazo as \"Ladysmith African-American Mambazo\" in an attempt to prove he is not racist. Kevin later changes Andy's ringtone to the song \"Dixie\".","elements":[]},{"text":"After Andy asks her to find information regarding the relatives of the office members, Nellie intentionally lies and tells Andy that Kevin is related to John Wayne Gacy and John Wayne Bobbitt. He is disappointed to learn that he is not related to either John Wayne or Dwayne \"The Rock\" Johnson, whom he erroneously calls \"Wayne\".","elements":[]},{"text":"Andy also informs the office that Jim is related to former president Richard Nixon and that Meredith is related to infamous ax-murder suspect Lizzie Borden.","elements":[]},{"text":"Before he realizes that all of the office members ancestors are fakes, Dwight admits that his were members of the German American Bund, a pro-Nazi group in the 1930s.","elements":[]},{"text":"Nellie jokes that she's related to American figure skating champion Tonya Harding.","elements":[]}]}],"images":[]},{"title":"Amusing details\/Trivia","level":2,"content":[{"type":"list","elements":[{"text":"After the release of the episode's plot synopsis, Geni.com, a genealogy, and social networking website, was able to prove that Ed Helms is, in fact, Michelle Obama's 18th cousin once removed.","elements":[]},{"text":"The Jim Halpert \"Get Glue\" sticker was released alongside the episode.","elements":[]}]}],"images":[]},{"title":"Cast","level":2,"content":[],"images":[]},{"title":"Main Cast","level":3,"content":[{"type":"list","elements":[{"text":"Rainn Wilson as Dwight Schrute","elements":[]},{"text":"John Krasinski as Jim Halpert","elements":[]},{"text":"Jenna Fischer as Pam Halpert","elements":[]},{"text":"Ed Helms as Andy Bernard","elements":[]}]}],"images":[]},{"title":"Supporting Cast","level":3,"content":[{"type":"list","elements":[{"text":"Catherine Tate as Nellie Bertram","elements":[]},{"text":"Leslie David Baker as Stanley Hudson","elements":[]},{"text":"Brian Baumgartner as Kevin Malone","elements":[]},{"text":"Creed Bratton as Creed Bratton","elements":[]},{"text":"Clark Duke as Clark Green","elements":[]},{"text":"Kate Flannery as Meredith Palmer","elements":[]},{"text":"Ellie Kemper as Erin Hannon","elements":[]},{"text":"Angela Kinsey as Angela Lipton","elements":[]},{"text":"Jake Lacy as Pete Miller","elements":[]},{"text":"Paul Lieberstein as Toby Flenderson","elements":[]},{"text":"Oscar Nunez as Oscar Martinez","elements":[]},{"text":"Craig Robinson as Darryl Philbin","elements":[]},{"text":"Phyllis Smith as Phyllis Vance","elements":[]}]}],"images":[]},{"title":"Guest Cast","level":3,"content":[{"type":"list","elements":[{"text":"Randall Park as Steve","elements":[]}]}],"images":[]}]}