{"sections":[{"title":"Ben Franklin","level":1,"content":[{"type":"paragraph","text":"\"Ben Franklin\" is the 14th episode of the third season of The Office and the 43rd overall. It was written by Mindy Kaling and directed by Randall Einhorn. It first aired on February 1, 2007 and was viewed by 10.1 million people."}],"images":[]},{"title":"Summary","level":2,"content":[{"type":"paragraph","text":"Michael films a video to be presented in the event of his death to his future unborn son. Dwight undermines Michael's efforts. Michael has planned two separate parties for Phyllis and Bob Vance. Michael announces Phyllis' wedding in six days, and declares that he is \"instituting Prima Nocta.\" Jim remembers the term from the movie Braveheart and confirms the real meaning of Michael's confusing statement using Wikipedia, revealing that it refers to the ancient custom of the king to deflower every bride in his kingdom on her wedding night. Michael apologizes for making the statement."},{"type":"paragraph","text":"Pam notices that Jim is tired, and Jim states in a talking-head interview that Karen and he have been talking over their relationship for the past five nights. In an odd conversation in the breakroom Pam tries to find out from Jim what's going on with Karen, and he confesses they've been staying up late talking. Having nothing else to say, she makes awkward, repeated suggestions that he catch up on his sleep. After Jim leaves, Pam chides herself for flirting so badly."},{"type":"paragraph","text":"Todd Packer arrives and, true to form, makes tasteless jokes about his belief that Jim is gay. Encountering Karen for the first time (and leering at her), he is shocked to learn that she is Jim's girlfriend. Packer is incensed that Michael has not hired a stripper for the bachelor party. Michael says he can't for fear of sexual harassment claims, but Packer convinces him that if he gets a male stripper for Phyllis's party, too, this will make everything all okay. (\"Separate but equal,\" says Packer confidently, and Michael thanks him for explaining the meaning of the term.)"},{"type":"paragraph","text":"Michael delegates the work of finding the two strippers to Dwight and Jim. While Dwight successfully locates a stripper for Bob Vance's party, Jim decides to undermine Michael's potentially disastrous plan and orders a costumed historical lecturer for the women instead."},{"type":"paragraph","text":"Michael and Ryan visit a sex shop. Michael is overwhelmed, and Ryan states, \"he hasn't even said a word yet... just giggling.\" Upon their return, the lecturer for the women's party arrives. He is costumed as Benjamin Franklin, and Michael, under the impression that he's a male stripper, asks if he's wearing a thong. \"Ben Franklin\" is introduced to the women (with Michael laboring under the misapprehension that Franklin was a U.S. president), and Pam and Karen have fun gently heckling the impersonator."},{"type":"paragraph","text":"Outside the warehouse, Michael grills steaks on the same George Foreman grill on which he once burned his foot (\"The Injury\") but tells Ryan not to worry since he has \"cleaned all the foot off of it.\" Inside, Kevin attempts to organize a game of professional poker, while Michael advertises his steaks as \"his man-meat\". Dwight enthusiastically asks for some."},{"type":"paragraph","text":"After joking about Ben Franklin in the breakroom, Karen tells Pam that she has heard about her past involvement with Jim. Pam is startled, and asks what she means. Karen says she knows that Pam and Jim have kissed, but it's not a big deal, as \"it's just a kiss\". Catching a look from Pam, Karen suddenly asks if she's still interested in Jim, to which Pam absently replies \"oh yeah.\" Karen is taken aback, but Pam then quickly says she misunderstood Karen's question, and awkwardly tells Karen \"You should go out with Jim—you are going out with Jim. You're a great couple.\""},{"type":"paragraph","text":"The female stripper arrives, dressed as an office secretary. Roy claims in a talking-head that's he's \"not really into strippers,\" and that he instead finds Pam's art sexy. When groom-to-be Bob Vance refuses a lap-dance, Michael volunteers. The dance proceeds for a few seconds before Michael suddenly remembers he has a girlfriend and abruptly calls a halt and breaks up the party."},{"type":"paragraph","text":"Dwight makes the now-fully-clothed stripper, Elizabeth, answer phone calls in the office, because he has already paid her for three hours of work. She compliments a clearly distressed Angela about the baby poster she received in \"Christmas Party\"."},{"type":"paragraph","text":"Michael goes to the stripper for advice as to whether he should tell Jan about his lap-dance. She replies, \"secret secrets are no fun, secret secrets hurt someone.\" Dwight claims that he is ninety-nine percent sure that the impersonator is not the real Ben Franklin, \"no matter what Jim says!\""},{"type":"paragraph","text":"The Ben Franklin impersonator reveals to Pam that his real name is Gordon in an unsuccessful attempt to hit on her. He also tells Michael to keep the lap dance a secret. Michael calls him a sleazebag. He then calls Jan out of a meeting to confess to her the aborted lap dance. A frustrated Jan tells him she's closer to firing him than dumping him. Michael seems to take this as good news."},{"type":"paragraph","text":"Pam and Jim have an understated confrontation in the break room which ends with Pam asking Ryan to set her up with some of his business-school buddies, in front of a visibly shocked Jim. Dwight grills Ben Franklin on his revolutionary-era knowledge, and Michael reflects that Ben Franklin turned out to be a creep while the stripper turned out to give great advice... advice that rhymed."}],"images":[]},{"title":"Deleted scenes","level":2,"content":[{"type":"paragraph","text":"The Season Three DVD contains a number of deleted scenes. Notable cut scenes include:"},{"type":"list","elements":[{"text":"Michael attempts to recover from his prima nocte remark.","elements":[]},{"text":"Michael offers to console Pam for having to attend somebody else's bridal shower. Pam declines the offer.","elements":[]},{"text":"Todd Packer obnoxiously hits on Pam, who avoids him by answering a pretend phone call.","elements":[]},{"text":"In a talking head interview, Michael explains that throwing a bachelor party is one of the things every man should know how to do.","elements":[]},{"text":"Phyllis asks Pam if it's okay if she were seated at the same table as Jim and Karen.","elements":[]},{"text":"Since Toby won't let Michael hire a stripper, Michael tells Toby to go home. Toby briefly objects but quickly complies. In a talking head interview, Toby says, \"I have to make it look like I tried.\"","elements":[]},{"text":"Angela refuses to use petty cash to change Creed's $20 bill into ones when she learns it's for the stripper. Creed leaves, having memorized the location of the petty cash box.","elements":[]},{"text":"Extension of the \"gray area\" scene with Ben Franklin. Pam and Karen give him a hard time about whether he is from the past or lives in the present day. Ben Franklin explains that he is a representation of the spirit of Ben Franklin's legacy. Angela nods in understanding. (As originally aired, Angela's nod was in response to the \"gray area\" remark.)","elements":[]},{"text":"In a talking head interview, Pam jokes that she thinks that Ben Franklin has a crush on her. \"Maybe he'll take me to Paris.\"","elements":[]},{"text":"Darryl asks whether Jan approved of having a stripper. Michael explains that he's in charge, not Jan. Dwight notes that it's up to Toby, but Michael sent him home. Michael presses Darryl to promise that he'll have the warehouse ready in time. Darryl explains, \"I only promise things to my three-year-old daughter.\"","elements":[]},{"text":"In a talking head interview, Kevin says that he bought Stacy a stripper pole for her birthday.","elements":[]},{"text":"In a talking head interview, Ryan is disgusted by how pale the stripper is.","elements":[]},{"text":"Dwight comes into Michael's office to talk about why he ended the stripper's performance. Michael is distraught because he nearly cheated on Jan.","elements":[]},{"text":"Extension of the scene where Dwight tries to determine whether Ben Franklin is real or not. In a talking head interview, Dwight says that he is 99% sure that it's not the real Ben Franklin. Maybe 98%.","elements":[]}]}],"images":[]},{"title":"Trivia","level":2,"content":[{"type":"list","elements":[{"text":"Paul Lieberstein (Toby Flenderson) is credited but does not appear in this episode.","elements":[]},{"text":"The blouse worn by the stripper was once worn by Pam. It appears to be the one that Pam wore in \"Basketball\". The blouse switches between a normal blouse and a strip-off blouse between the scenes.","elements":[]},{"text":"Andrew Daly (Ben Franklin) appeared in the 2008 movie Semi-Pro which also featured The Office cast member Ed Helms (Andy Bernard).","elements":[]},{"text":"Jenna Fischer was sick during the filming of this episode. She sneezes in the background when Todd Packer pretends to kick Michael.","elements":[]}]}],"images":[]},{"title":"Connections to previous episodes","level":2,"content":[{"type":"list","elements":[{"text":"When filming Michael, Dwight says \"Action\" too soon, as he did in a deleted scene from the episode \"Diversity Day\".","elements":[]},{"text":"While grilling the steaks, Ryan asks Michael if he is using the same grill he grilled his foot on, referring to the events of \"The Injury \".","elements":[]},{"text":"Roy claims not to enjoy strippers. In the episode \"Casino Night\", Pam claims that she is handling most of the wedding preparations because Roy is focusing on his bachelor party.","elements":[]},{"text":"Although he previously requested a strippergram in \"Michael's Birthday\", Michael is uncomfortable accepting a lap dance in this episode because he now has a girlfriend.","elements":[]},{"text":"Kevin plays \"deuce to seven lowball\" poker, the same variety of poker he claimed at \"Casino Night\" to have won at the World Series of Poker.","elements":[]},{"text":"The stripper tells Angela that she likes her poster of the two babies playing jazz instruments featured in the episode Conflict Resolution.","elements":[]}]}],"images":[]},{"title":"Amusing details","level":2,"content":[{"type":"list","elements":[{"text":"Michael calls Dwight by the name ‘Pam’ after the bra unhooking demonstration. He likely assumed that Dwight had zoomed in the camcorder further than he did, which would have better masked the identity of the bra wearer.","elements":[]},{"text":"BJ Novak seems amused by Packer and Michael messing around, which isn't exactly in his character, because nobody likes Todd Packer and now that Ryan is a salesman his character would be even less into this stuff.","elements":[]},{"text":"Dwight mentions that they hired the stripper for three hours, even though Michael said the bachelor party was forty-five minutes long.","elements":[]},{"text":"There are no indications of whose bra was used for the unhooking demonstration. The stripper in the episode wears a different style bra.","elements":[]},{"text":"Roy makes a conscious effort not to look at the stripper, in order to make it clear to the documentary crew that he's dedicated to Pam and, in particular, winning back her affections.","elements":[]},{"text":"Dwight tells Jim to pick between a brunette and a redhead stripper which are Karen and Pam's respective hair colors and Jim consciously says blonde to avoid picking between the two women.","elements":[]},{"text":"When Michael introduces Ben Franklin to the women of the office, Meredith is holding a stack of $1 bills. Strippers are traditionally tipped in $1 bills.","elements":[]},{"text":"During the guy’s poker game, Michael shuffles the cards in a style that children are taught to shuffle cards.","elements":[]},{"text":"The stripper, Elizabeth resembles Jan Levinson as she wears a similar suit and has the same hairstyle.","elements":[]},{"text":"When Michael and Ryan are at the sex shop, Michael gets a call from Jim and his ringtone is “My Humps” by The Black Eyed Peas. However, the closed captioning for this scene says, [cell phone playing Chamillionaire’s “Ridin’”].","elements":[]}]}],"images":[]},{"title":"Cultural references","level":2,"content":[{"type":"list","elements":[{"text":"Ben Franklin was one of the founders of the United States. The statements in the episode regarding Franklin's life are generally true, save for those made by Michael.","elements":[]},{"text":"While Dwight is interviewing Ben Franklin to determine if he is the real Ben Franklin, he offers Ben Franklin chocolate, to which Ben Franklin replies \"It is a delicacy in the Amazon, but has not yet made its way to the United States.\" This not actually true. While eating chocolate (like chocolate bars) was not yet created, drinking chocolate was extremely common. Ben Franklin himself famously sold it out of his Printing show as early as 1735.","elements":[]},{"text":"A shower is a gift-giving party, typically for an expectant mother (a \"baby shower\") or a bride (a \"bridal shower\"). A bachelor party is a party for the groom, typically to enjoy his last day of bachelorhood.","elements":[]},{"text":"Scared Straight! was a 1978 documentary about prison life directed at kids.","elements":[]},{"text":"101 is the number traditionally assigned to introductory college courses in the United States. \"Bachelor Party 101\" is therefore an imaginary college class that teaches the basics of throwing a bachelor party.","elements":[]},{"text":"Separate but equal was a principle of racial segregation; it was overturned in 1954 in the landmark case Brown v. Board of Education. Neither Todd Packer nor Michael Scott appears to be familiar with its true meaning.","elements":[]},{"text":"Co-ed (short for \"coeducation\") initially referred to schools which teach boys and girls together and by extension refers to any situation where men and women are both present.","elements":[]},{"text":"REM sleep is the dream stage. In popular culture, REM sleep is considered the most important.","elements":[]},{"text":"Dwight specifies no tats (short for \"no tattoos\"). The person on the phone misheard him as saying \"no tits\" (a rude term for breasts).","elements":[]},{"text":"Nancy is a girl's name. When applied to men, it is an insult, suggesting that the person is behaving in a cowardly or feminine manner. (Jim's response \"Sally\" does not carry the same connotation.)","elements":[]},{"text":"In the sex shop, Michael says \"Got you\" while he pokes Ryan with a dildo, a sex toy.","elements":[]},{"text":"SpongeBob SquarePants is a children's cartoon character.","elements":[]},{"text":"Michael sings bow chicka bow, mimicking the style of music associated with pornographic films.","elements":[]},{"text":"Jennifer Garner is an actress on the television program Alias where she plays a CIA agent who adopts different disguises.","elements":[]},{"text":"Man meat is slang for the penis.","elements":[]},{"text":"The stripper's advice Secrets secrets are no fun. Secrets secrets hurt someone are the opening words to the song \"No Secrets\" from the album \"No Secrets\" by the girl band \"No Secrets\".","elements":[]},{"text":"There is a Florida Gators magnet on the fridge.","elements":[]},{"text":"Michael calls Jan \"the best G.D. girlfriend in the world\". \"G.D.\" is an abbreviation for the profanity \"God damn\".","elements":[]}]}],"images":[]},{"title":"Cast","level":2,"content":[],"images":[]},{"title":"Main Cast","level":3,"content":[{"type":"list","elements":[{"text":"Steve Carell as Michael Scott","elements":[]},{"text":"Rainn Wilson as Dwight Schrute","elements":[]},{"text":"John Krasinski as Jim Halpert","elements":[]},{"text":"Jenna Fischer as Pam Beesly","elements":[]},{"text":"B.J. Novak as Ryan Howard","elements":[]}]}],"images":[]},{"title":"Supporting Cast","level":3,"content":[{"type":"list","elements":[{"text":"Melora Hardin as Jan Levinson","elements":[]},{"text":"David Denman as Roy Anderson","elements":[]},{"text":"Leslie David Baker as Stanley Hudson","elements":[]},{"text":"Brian Baumgartner as Kevin Malone","elements":[]},{"text":"Kate Flannery as Meredith Palmer","elements":[]},{"text":"Mindy Kaling as Kelly Kapoor","elements":[]},{"text":"Angela Kinsey as Angela Martin","elements":[]},{"text":"Phyllis Smith as Phyllis Lapin","elements":[]}]}],"images":[]},{"title":"Recurring Cast","level":3,"content":[{"type":"list","elements":[{"text":"Rashida Jones as Karen Filippelli","elements":[]},{"text":"Creed Bratton (actor) as Creed Bratton","elements":[]},{"text":"David Koechner as Todd Packer","elements":[]},{"text":"Craig Robinson as Darryl Philbin","elements":[]},{"text":"Bobby Ray Shafer as Bob Vance","elements":[]},{"text":"Phillip Pickard as Philip (Uncredited)","elements":[]}]}],"images":[]},{"title":"Guest Cast","level":3,"content":[{"type":"list","elements":[{"text":"Andrew Daly as Gordon (Ben Franklin)","elements":[]},{"text":"Jackie Debatin as Elizabeth (The Stripper)","elements":[]}]}],"images":[]},{"title":"References","level":2,"content":[{"type":"list","elements":[{"text":"↑ Ben Franklin and Blades of Glory Pics, Jenna Fischer's blog, February 5, 2007.","elements":[]}]}],"images":[]}]}