{"sections":[{"title":"Blood Drive","level":1,"content":[{"type":"paragraph","text":"\"Blood Drive\" is the 18th episode of the fifth season of the television series The Office, and the show's 90th episode overall. It was written by Brent Forrester and directed by Randall Einhorn. The episode aired in the United States on March 5, 2009, on NBC. It was viewed by 8.63 million people."}],"images":[]},{"title":"Synopsis","level":2,"content":[{"type":"paragraph","text":"In the cold open, a man shows up to sell a new phone system for the office. Every time he comes, Pam says that Michael is not in. Pam explains that this new system could connect callers directly to the various office workers, which she explains is \"basically 95 percent of my job.\" Jim comes over to greet the man, pretending to be Michael. The real Michael comes out and Jim calls him \"Jimbo\" and after some awkward confusion, the man leaves."},{"type":"paragraph","text":"It’s Valentine’s Day at the office. Michael and Kevin enter the building in bad spirits over the holiday because they are single. Michael even goes as far as to put Pam's flowers behind her desk. When Jim and Pam object, Michael tells them they are being insensitive by \"flaunting\" their romantic happiness in everyone's faces and announces that there will be a party for singles only where they will meet in defiance of love. As they can't attend the party for singles, Jim and Pam agree to join Phyllis and Bob Vance for a two-hour lunch - which Phyllis explains they will be able to take due to Michael’s fear of Bob."},{"type":"paragraph","text":"Michael meets a woman at a Valentine's Day blood drive where they have a good conversation. However, Michael passes out after his blood is drawn and the woman is gone when he comes to. He finds a glove, thinking it is hers. At the \"Lonely Hearts Party,\" Michael gets the office workers to share break up stories. When asked about her relationship with Ryan, Kelly initially claims that Ryan’s “heart was in the right place”, but seems very downtrodden when Michael points out Ryan is now in Thailand having \"random sex.\" Oscar shares a story about how he took a chance and confessed his romantic feelings to another man only for the man to tell him that he was not gay. Oscar then mentions how his friend called him later and told him about how he saw Oscar's crush at a gay bar, showing that the man was gay and lied to Oscar to avoid dating him (though Michael interprets this as a happy ending as the man did turn out to be gay). Angela relates how her worst breakup was with two men who dueled over her and then both left her. When Oscar names the two men as Dwight and Andy, Angela claims that this was when she was in Ohio, with the two men being John Mark and John David, leaving Oscar to bewilderingly point out that she has had two different pairs of men physically duel over her. Kevin tells the story of how Stacy left him, with them eating breakfast one day while Kevin read the sports section of the newspaper. When Kevin stated his belief that the Philadelphia Eagles might clinch the NFC East, Stacy replied: \"We're done.\" Kevin's story so shocks and saddens Michael that he states that rather than sitting around sharing sad stories of broken romances they should try to go out and meet people, declaring that they will turn their anti-romance party into a Single's Mixer. Michael puts out fliers advertising the mixer, with a special note at the bottom mentioning the glove he found, making clear his plans to try to meet the woman he donated blood with again by returning her glove. At the mixer, Michael makes attempts to introduce his employees to new party-comers, introducing a dye and repair worker to Meredith and introducing Kevin to Lynn. Dwight begins talking to Lynn's friend (who is a small blonde woman similar in appearance to Angela) but quickly switches from romance to business when he learns she works at a catalog company that uses a lot of paper. Dwight notices that Michael constantly is glancing at the door and asks if he is expecting someone, leading Michael to reveal how he is trying to return the glove of the woman he donated blood with. Kelly is charmed by Michael's story, comparing it to a modern-day fairy tale. "},{"type":"paragraph","text":"As the party goes on, Kevin offhandedly mentions to Lynn how his fiancé left him, causing him to believe he blew his chance with her. However, as Lynn gets ready to leave, Kevin approaches her and asks for her email address, which she gives, causing Kevin to tell the camera that it was a good Valentine's Day. The blonde Dwight is talking to leaves after refusing Dwight's business, causing him to shout at her angrily as he leaves. Michael continues waiting and the other employees decide to wait with Michael also. As it becomes clear however that the woman is not coming, Kelly gently urges Michael to accept it and leave. In the parking lot the employees, sensing Michael's heartbreak, each warmly bid him goodnight before leaving, leading Michael to say that despite the woman not coming he's happy enough to have friends like them. "},{"type":"paragraph","text":"Meanwhile, Jim and Pam are having an enjoyable conversation with Phyllis and Bob, until the latter couple does not return from the bathroom. The food has arrived and Jim and Pam, tired of waiting, start to pick food from Phyllis and Bob's plates. As Pam is reaching for another bite Jim scares her by exclaiming, \"here they come.\" Pam then asks if Phyllis and Bob dined and dashed to which Jim replies that they didn't dine so that is unlikely. Pam is worried that Phyllis and Bob weren't having a good time, so therefore they left. They then decide to check the bathroom and hear Phyllis and Bob having sex in the handicap bathroom. After Phyllis and Bob return to the table (clearly sweaty and out of breath from their intercourse) Jim and Pam awkwardly watch as Bob seductively feeds Phyllis a piece of his steak. "},{"type":"paragraph","text":"The episode ends with a scene that presumably happened earlier in the day. Stanley tries to get a cookie from the blood drive van saying he wants another one after giving blood. The nurse notices that he has a cotton ball and tape on his arm and tells him that they have been using band-aids. Stanley acts confused and leaves the van when he runs into Phyllis (also sporting a cotton ball and tape) and quietly says, \"band-aids\", to which Phyllis replies, \"damn it.\" The camera then focuses on Creed leaving the blood drive van while slyly slipping a blood bag into his pocket. "}],"images":[]},{"title":"Connections to previous episodes","level":2,"content":[{"type":"list","elements":[{"text":"Jim previously pretended to be Michael Scott in Halloween.","elements":[]},{"text":"While out to lunch, Phyllis teases Bob about his bowling score. At Phyllis' Wedding, one of Bob's friends made a toast to Phyllis and says that she is \"a hell of a bowler\".","elements":[]},{"text":"When Jim and Pam hesitate to take a long lunch with Phyllis she says Michael is terrified of her husband Bob. This was most likely established in Phyllis' Wedding after his toast during the reception. Had he been terrified of Bob before that he would not have interrupted at the ceremony or given such a long and offensive toast.","elements":[]}]}],"images":[]},{"title":"Cultural references","level":2,"content":[{"type":"list","elements":[{"text":"A blood drive is an event in which people are encouraged to donate blood.","elements":[]},{"text":"Valentine's Day is a holiday that celebrates romantic love. Symbols for the holiday include hearts and Cupid, the Roman god of erotic love (who causes people to fall in love by shooting them with a magic arrow).","elements":[]},{"text":"Jim quips, \"Those mines aren't gonna sweep themselves.\" He refers to the game Minesweeper which comes with Microsoft Windows, the operating system used on computers in the office.","elements":[]},{"text":"Jim distracts Michael by saying \"Aaay\" (with thumbs-up gesture) in the style of the character Fonzie from the 1970s-1980's comedy Happy Days.","elements":[]},{"text":"Kelly receives a Valentine, short for Valentine's Day card.","elements":[]},{"text":"Michael calls himself a \"human juice box\", referring to an aseptic container for holding liquids, usually juice. He also makes puns on \"Hawaiian blood punch\" and \"Type O-Ocean Spray\", referring to Hawaiian Punch and Ocean Spray, brands of fruit juice.","elements":[]},{"text":"Michael says, \"We don’t need no stinkin' relationships\" in a stereotypical Mexican accent (while pointing at Oscar) during the mixer, an allusion to the paraphrased line \"We don't need no stinking badges\" from the 1927 novel and the 1948 film The Treasure of the Sierra Madre.","elements":[]},{"text":"Michael says he was hit by \"Cupid's sparrow\", a mistaken reference to the Roman mythological god who would inspire love by shooting people with arrows.","elements":[]},{"text":"In the sport of bowling, a perfect score is 300.","elements":[]},{"text":"The Eagles are a professional American football team who compete in the East Division of the National Football Conference (called the NFC East).","elements":[]},{"text":"The Circle Drive-In is a real drive-in theater in Dickson City.","elements":[]},{"text":"Kelly exclaims, \"This is like a modern day Enchanted!\" Enchanted is a 2007 movie about a fairy tale princess who is forced to cope with the modern world.","elements":[]},{"text":"Jim wonders whether Bob and Phyllis dined and dashed, slang for leaving a restaurant without paying.","elements":[]},{"text":"Michael talks about Cinderella and her glass slipper, a classic folk tale in Western culture.","elements":[]}]}],"images":[]},{"title":"Trivia","level":2,"content":[{"type":"list","elements":[{"text":"B.J. Novak (Ryan Howard) is credited but does not appear in this episode.","elements":[]},{"text":"Stanley Hudson attends Michael's singles party despite the fact that he is married.","elements":[]}]}],"images":[]},{"title":"Cast","level":2,"content":[],"images":[]},{"title":"Main cast","level":3,"content":[{"type":"list","elements":[{"text":"Steve Carell as Michael Scott","elements":[]},{"text":"Rainn Wilson as Dwight Schrute","elements":[]},{"text":"John Krasinski as Jim Halpert","elements":[]},{"text":"Jenna Fischer as Pam Beesly","elements":[]}]}],"images":[]},{"title":"Supporting cast","level":3,"content":[{"type":"list","elements":[{"text":"Leslie David Baker as Stanley Hudson","elements":[]},{"text":"Brian Baumgartner as Kevin Malone","elements":[]},{"text":"Creed Bratton (actor) as Creed Bratton","elements":[]},{"text":"Kate Flannery as Meredith Palmer","elements":[]},{"text":"Mindy Kaling as Kelly Kapoor","elements":[]},{"text":"Angela Kinsey as Angela Martin","elements":[]},{"text":"Oscar Nunez as Oscar Martinez","elements":[]},{"text":"Phyllis Smith as Phyllis Vance","elements":[]}]}],"images":[]},{"title":"Recurring cast","level":3,"content":[{"type":"list","elements":[{"text":"Bobby Ray Shafer as Bob Vance","elements":[]},{"text":"Hugh Dane as Hank Tate","elements":[]}]}],"images":[]},{"title":"Guest cast","level":3,"content":[{"type":"list","elements":[{"text":"Kathryn Aselton as the Glove Girl","elements":[]},{"text":"Lisa K. Wyatt as Lynn","elements":[]},{"text":"Tate Hanyok as Rhee","elements":[]},{"text":"Julie Remala as Nurse","elements":[]},{"text":"Jason Rogel as Erik","elements":[]},{"text":"Rob Brownstein as Phone Salesman","elements":[]},{"text":"Dorian Frankel as Unnamed Woman","elements":[]}]}],"images":[]}]}