{"sections":[{"title":"Booze Cruise","level":1,"content":[{"type":"paragraph","text":"\"Booze Cruise\" is the eleventh episode of the second season of The Office and the 17th overall. It was written by Greg Daniels and directed by Ken Kwapis. It first aired on January 5, 2006. It was viewed by 8.6 million people."}],"images":[]},{"title":"Synopsis","level":2,"content":[{"type":"paragraph","text":"The episode opens with Dwight, who is incensed that Jim has put all of his possessions in the vending machine. Pam puts in some money and buys Dwight's pencil cup, to his great dismay.  Michael sends out a vague memo telling the staff to pack a number of random items, including a swimsuit, a toothbrush, rubber-soled shoes and a ski-mask, in preparation for the company's first quarter leadership training trip. The surprise trip turns out to be a \"booze cruise\" on Lake Wallenpaupack, and the staff is not happy--it's January, and much too cold for a cruise. Michael tells the staff: \"Leader... ship. The word \"ship\" is hidden inside the word \"leadership,\" as its derivation. So if this office is, in fact, a ship, as its leader, I am the captain!\" When they arrive on the boat, however, Michael immediately feels threatened by the ship's captain, Captain Jack, who declares that he will be the ship's \"party captain\" for the evening. A hilarious battle for top authority on the ship ensues, with Michael echoing everything Captain Jack says."},{"type":"paragraph","text":"Jim brings Katy, his new girlfriend, (played by Amy Adams) as his date, and Pam brings Roy along.  The four soon start talking, and it becomes clear that Katy and Roy enjoy each other more than they do their respective partners. Pam and Jim are left alone together, and the romantic tension is palpable. As the party inside begins, Michael tries unsuccessfully to motivate his staff and is disappointed when Captain Jack does a better job.  The awkwardness Michael creates is magnified by the fact Dunder Mifflin's group is not the only group on the boat. When Dwight volunteers to hold the limbo stick, Captain Jack sends him outside to \"steer the ship.\" Angela asks Dwight to come inside and talk to her, but he refuses, saying \"I can't. Do you want us to run aground, woman?!\" (The wheel Dwight is so seriously manning turns out to be fake). When Captain Jack leaves the festivities with Meredith, Michael claims wildly that the ship is sinking and will be at the bottom of the lake in mere minutes. At first no one believes him, but soon people start to panic and one passenger jumps overboard. Captain Jack returns and, after discovering what Michael has done, handcuffs him to the railing outside to prevent him from causing any more trouble. Roy, motivated by Captain Jack's stories about commitment (and slightly drunk), announces to Pam that it's time to set a date for their wedding. He suggests June 10th, and Pam happily accepts. After seeing this, Jim becomes depressed and soon breaks up with Katy, who is shocked and upset. Jim then admits to Michael that he has strong feelings for Pam. Michael more surprised than anything tells him he usually has a radar that kind of thing. Jim looks down and seems ready to let Pam go, Michael tells him that if he really likes her then he shouldn't give up. Michael also tells Jim: \"engaged ain't married,\" encouraging him never to give up on Pam."}],"images":[]},{"title":"Trivia","level":2,"content":[{"type":"list","elements":[{"text":"According to Greg Daniels' DVD commentary, the original script included a storyline depicting Oscar as a nasty drunk. It was cut for time.","elements":[]},{"text":"A real January booze cruise on Lake Wallenpaupack would be impossible. The lake is frozen over, and all boats must be removed from the lake by October.","elements":[]},{"text":"The official name of the ship is Lake Wallenpaupack Princess.","elements":[]},{"text":"Captain Jack claims to have been a captain of a US Navy PC-1 Cyclone class patrol ship during Operation Desert Storm.","elements":[]},{"text":"Actor Rob Riggle (plays Captain Jack) served as an Officer in the Marine Corps from 1990 until 2013.","elements":[]},{"text":"During the cruise, Michael gets seasick. Brenda notices that and he explains to her that he's on medication - \"Vomicillin\". Judging by the context of the situation, it's obviously supposed to be an anti-nauseant that he took to prevent seasickness while on the boat (not very effectively). Such a medicament doesn't exist in real life and it would be impossible to, because the name is an amalgamation of the words \"Vomiting\" (what it prevents) and \"Penicillin\" (the active substance). This is not entirely inaccurate - it's actually pretty common for pharmaceutical companies to name their products in such a manner. The problem is that penicillin is an antibiotic that has no antiemetic (anti-nausea) properties.","elements":[]}]}],"images":[]},{"title":"Quotes","level":2,"content":[{"type":"paragraph","text":"Michael: Now, on this ship that is the office, what is a sales department? Anyone?\nDarryl: How about the sales department is the sails?\nMichael: Yes, Darryl, the sales department makes sales. Good. Let me just explain. I see the sales department as the furnace.\nPhyllis: A furnace?\nJim: Yeesh, how old is this ship?\nPam: How about the anchor?\nPhyllis: What does the furnace do?\nMichael: All right, let's not get hung up on the furnace. This just... it's the sales... I see the sales department down there. They're in the engine room, and they are shoveling coal into the furnace, right? I mean, who saw the movie Titanic? They were very important in the movie Titanic. Who saw it? Show of hands!\nJim: I'm not really sure what movie you're talking about. Are you sure you got the title right?\nMichael: Titanic?\nPam: I think you're thinking of The Hunt for Red October.\nMichael: No, I'm Leo DiCaprio! Come on!"},{"type":"paragraph","text":"Phyllis: Michael, everyone in the engine room drowned.\nMichael: No! Thank you, spoiler alert. You saw the movie, those of you who did. They're happy down there in the furnace room. And they're dirty and grimy and sweaty, and they're singing their ethnic songs, and... actually, that might be warehouse.\nDarryl: What?\nMichael: The... no, no. No, I didn't... okay. Well, okay, in a nutshell, what I'm saying is... leadership. We'll talk more about that on the boat. Ship."},{"type":"paragraph","text":"Captain Jack: Not now, Mike, we're doing the limbo! That's right, partiers, it's time to limbo, limbo, limbo!\nMichael: So, okay.\nDwight: Limbo, whoo!\nCaptain Jack: All right! I need a volunteer to come up here and hold my stick. Who's it gonna be?\nMeredith: Me.\nCaptain Jack: Okay...\nDwight: Me! Me, me, me.\nCaptain Jack: Uh... usually it's a woman.\nDwight: I'm stronger."},{"type":"paragraph","text":"Michael: Sometimes you have to take a break from being the kind of boss that's always trying to teach people things. Sometimes you have to just be the boss of dancing."},{"type":"paragraph","text":"Kelly: Wait, Michael?\nMichael: Yeah?\nKelly: Why did you tell us to bring a bathing suit?\nMichael: To throw you off the scent.\nKelly: Yeah, but I bought a bathing suit.\nMichael: Well, just keep the tags on and you can return it.\nKelly: I took the tags off already.\nMichael: Well, that's not my fault, okay? Just.. we're not going to pay for a bathing suit."},{"type":"paragraph","text":"Jim: She's really funny and..she's warm and she's just...anyway.\nMichael: Well if you like her so much, don't give up.\nJim: She's engaged..\nMichael: Pfft BFD, engaged ain't married.\nJim: Huh...\nMichael: Never ever, ever give up."}],"images":[]},{"title":"Deleted scenes","level":2,"content":[{"type":"paragraph","text":"The Season Two DVD contains a number of deleted scenes from this episode. Notable cut scenes include:"},{"type":"list","elements":[{"text":"Jan and Brenda meet with Michael in his office. When Michael asks Brenda for a moment alone with Jan, she responds that Jan had specifically told her to say no if he asked that question - when he asks again soon after, Brenda is happy to comply before Jan tells her not to. After Jan leaves, Michael offers to make Brenda a fake ID.","elements":[]},{"text":"Toby intentionally arrives late to the booze cruise. Michael, of course, refuses to have the boat go back to get him - though as the boat pulls away from the dock, Toby smiles and jokingly says that stopping to have dinner might not've been a good idea.","elements":[]},{"text":"Michael tries to play guitar with the band, but fails. Creed offers to play and begins playing very well.","elements":[]},{"text":"Creed explains how he was a member of the band, The Grass Roots, which is the real band the real Creed Bratton played with.","elements":[]},{"text":"Dwight states he was conflicted between Michael and Captain Jack as he boarded the boat, but now \"he will follow Captain Jack to hell and back.\"","elements":[]},{"text":"Michael gives Ryan useless advice on how to study in the current situation.","elements":[]},{"text":"In separate shots Ryan and Meredith throw up.","elements":[]},{"text":"A drunken Darryl orders a drink. Angela says that maybe he had enough to which he responds, \"What you say, bitch?\". He immediately admits she might be right and walks away guiltily.","elements":[]},{"text":"In a scene after Roy has announced a date for his and Pam's wedding, Katy tells Jim he should make a toast. Despite him saying he doesn't want to, Katy tells everyone on the boat that he wants to make a speech. He stumbles through the beginning and then begins talking about how amazing Pam is. He is then cut off by a very drunk Dwight who \"steals\" one of Michael's jokes.","elements":[]},{"text":"In an extended version of the scene where Michael convinces Jim not to give up on Pam, Michael asks Jim for a hat. Jim gives him one then walks away, and Michael then realizes he can't get the hat on because his hands are tied to the railing. He still tries and eventually gets it on his head, but only barely.","elements":[]}]}],"images":[]},{"title":"Amusing details- Caution, here be spoilers","level":2,"content":[{"type":"list","elements":[{"text":"Kevin wears the requested ski mask to the booze cruise. It obscures his vision so much, he bumps into Michael as he walks up the ramp.","elements":[]},{"text":"When Katy sits and pouts after being dumped by Jim, Kelly is behind her with her head on the table, sleeping.","elements":[]},{"text":"After Roy finally sets a date for his and Pam's wedding, Captain Jack offers to marry them aboard the ship. Pam politely declines, saying she wants her parents to be there. Four years later, in \"Niagara\", she and Jim slip away from the wedding with their families and get married on a boat.","elements":[]}]}],"images":[]},{"title":"Cultural references","level":2,"content":[{"type":"list","elements":[{"text":"Michael's recitation which begins Stanley Bo-Banley is a verse from \"The Name Game\" adapted to Stanley's name.","elements":[]},{"text":"Tony Robbins is an author and motivational speaker who conducts seminars around the country.","elements":[]},{"text":"The -ship suffix in the word leadership is not part of its derivation as Michael claims. It is merely a noun-forming suffix meaning \"the qualities of\".","elements":[]},{"text":"The idiom all in the same boat means that everyone shares the same problem and needs to work together to solve it.","elements":[]},{"text":"The idiom to bowl over means to make someone happy by overwhelming with surprise. One can be bowled over by a gift, for example. Michael's use of the idiom in to bowl over the competition is somewhat misguided; one would more likely wish to bowl over one's customers. The phrase originates from the sport of cricket, although Michael is more likely to have taken his employees bowling.","elements":[]},{"text":"Michael fails to recognize that Darryl is making a pun on sales and sails.","elements":[]},{"text":"Titanic is an Oscar-winning blockbuster film about the ship RMS Titanic, which sank after hitting an iceberg on its maiden voyage. The film is well known for Leonardo DiCaprio's line \"I'm the king of the world!\", shouted while standing on the prow of the ship, a scene which Michael re-creates.","elements":[]},{"text":"The Hunt for Red October is a film (based on a book of the same title) about a Soviet submarine whose captain wishes to defect to the United States.","elements":[]},{"text":"Michael sings \"A three hour tour\" from the theme song to Gilligan's Island, a comedy about a group of castaways stranded on a tropical island. He also matches up office employees with characters from the program:","elements":[{"text":"Pam is Mary Ann, a sweet, innocent girl.","elements":[]},{"text":"Jim is The Professor, a genius who could make anything out of coconuts.","elements":[]},{"text":"Katy is Ginger Grant, a movie star.","elements":[]},{"text":"Angela is Mrs. Howell, a millionairess.","elements":[]},{"text":"Kelly is a native from a nearby island.","elements":[]},{"text":"Stanley is a Globetrotter, referring to the African-American exhibition basketball team who appeared in The Harlem Globetrotters on Gilligan's Island, one of one of many sequels to the television show.","elements":[]},{"text":"Michael is The Skipper, the captain of the ship that ran aground.","elements":[]},{"text":"Dwight is Gilligan, the bumbling first mate whose ineptitude ruins many attempts to escape the island.","elements":[]}]},{"text":"Nebulose is not a real word. Michael intended to say nebulous.","elements":[]},{"text":"Michael uses a variation of the slang saying If the van's a-rockin', don't come a-knockin'. In the saying, the van is rocking because the occupants are having sex.","elements":[]},{"text":"Bishop O'Hara is a high school in nearby Dunmore.","elements":[]},{"text":"Pan Am is a now-defunct airline. Before airline security became more stringent, pilots would occasionally allow young children to visit the cockpit and let them pretend to fly the plane. They likely discontinued this practice for safety reasons.","elements":[]},{"text":"Dwight sings What do you do with a drunken sailor?, a traditional sea shanty.","elements":[]},{"text":"A snorkel shot is a drinking game invented for this episode. It appears to consist of drinking a shot of liquor through a snorkel tube.","elements":[]},{"text":"Operation Desert Storm is another name for the Gulf War.","elements":[]},{"text":"Michael offers to give away the bride at Pam's wedding. This is a role traditionally played by the bride's father.","elements":[]},{"text":"BFD, short for Big F—ing Deal, is a derisive expression.","elements":[]},{"text":"I hope I die before I'm old are lyrics from the song \"My Generation\" by The Who.","elements":[]},{"text":"The Grass Roots was a real group, a successful folk rock act active from 1966 to 1975 who garnered 29 hit singles on the Billboard Top 100, and sold over 30 million records. Creed Bratton is portrayed by the actor of the same name, who was the group's guitarist. Creed appears to exhibit a level of bitterness over his 'fall from grace'.","elements":[]},{"text":"Songs played on the cruise were \"Get Busy\" by Sean Paul and \"Just the Two of Us\" by Bill Withers.","elements":[]}]}],"images":[]},{"title":"Cast","level":2,"content":[],"images":[]},{"title":"Main Cast","level":3,"content":[{"type":"list","elements":[{"text":"Steve Carell as Michael Scott","elements":[]},{"text":"Rainn Wilson as Dwight Schrute","elements":[]},{"text":"John Krasinski as Jim Halpert","elements":[]},{"text":"Jenna Fischer as Pam Beesly","elements":[]},{"text":"B.J. Novak as Ryan Howard","elements":[]}]}],"images":[]},{"title":"Recurring Cast","level":3,"content":[{"type":"list","elements":[{"text":"David Denman as Roy Anderson","elements":[]},{"text":"Amy Adams as Katy","elements":[]},{"text":"Leslie David Baker as Stanley Hudson","elements":[]},{"text":"Brian Baumgartner as Kevin Malone","elements":[]},{"text":"Creed Bratton (actor) as Creed Bratton","elements":[]},{"text":"Kate Flannery as Meredith Palmer","elements":[]},{"text":"Mindy Kaling as Kelly Kapoor","elements":[]},{"text":"Angela Kinsey as Angela Martin","elements":[]},{"text":"Paul Lieberstein as Toby Flenderson","elements":[]},{"text":"Oscar Nunez as Oscar Martinez","elements":[]},{"text":"Craig Robinson as Darryl Philbin","elements":[]},{"text":"Phyllis Smith as Phyllis Lapin","elements":[]},{"text":"Joanne Carlsen as Terri Hudson","elements":[]}]}],"images":[]},{"title":"Guest Cast","level":3,"content":[{"type":"list","elements":[{"text":"Rob Riggle as Captain Jack","elements":[]},{"text":"Brenda Withers as Brenda Matlowe","elements":[]},{"text":"Eliza Coleman as Passenger","elements":[]},{"text":"Roger Huse as Tequila Man","elements":[]},{"text":"R.C. Ormand as Panicked Man","elements":[]}]}],"images":[]}]}