{"sections":[{"title":"Boys and Girls","level":1,"content":[{"type":"paragraph","text":"\"Boys and Girls\" is the fifteenth episode of the second season of The Office and the 21st overall. It was written by B.J. Novak and directed by Dennie Gordon. It first aired on February 2, 2006, and viewed by 5.42 million people."}],"images":[]},{"title":"Synopsis","level":2,"content":[{"type":"paragraph","text":"Jan arrives at the Scranton branch to hold a Women in the Workplace seminar for the female employees. Although she has assured the women that Michael isn't allowed, he won't be dissuaded. As she begins to talk about the disparity in the perception of assertive men versus assertive women, Michael jumps into the conference room to give his own rambling cliché-ridden take on the subject. Jan forces him out, then has to snap at him for lingering around the door."},{"type":"paragraph","text":"Michael resents having his conference room taken away from him so the women can talk about clothes (or him). Dwight's more concerned that their menstrual cycles will align and wreck havoc on the plumbing. When Michael brings all the guys into a circle next to the conference room and makes a lot of noise, Jan tells them to go somewhere else. Dwight suggests the warehouse and Jan heartily approves."},{"type":"paragraph","text":"Jan continues by asking the women to state something they are good at. Meredith starts to say her name and that she's an alcoholic, but catches herself and says she's good at supplier relations. Phyllis believes she's good with computers until Angela criticizes her work. They move on to goals. Meredith wants to be five years sober in five years. Jan starts to praise Kelly who doesn't want to be lugging kids around in mini-van. Then Kelly says she wants an SUV. Pam admits she wants a house with a terrace on it and to be in a loving marriage with Roy. But she has always wanted to do something with art. After Phyllis compliments her work, Jan mentions a graphic design class offered by Corporate. She'd have to spend a few weeks in New York, but really only a few weekends after that. Pam starts to defer, but Jan reminds her that there are always a million reasons not to do something. Jan explains to the camera that her intent here is to find out if there are any women here who would make a good addition to Corporate."},{"type":"paragraph","text":"Downstairs, Michael starts to talk about how hard the warehouse staff works. This is awkward for two reasons. First of all, Darryl and his crew are not thrilled to have Michael there as he refuses to stay off the machinery. His recklessness behind the controls causes several supply shelves to come crashing down. Secondly, Jim isn't keen on being around Roy who has probably heard the rumor about him liking Pam. Kevin offers to back Jim up if it comes to blows. It turns out that Roy is fine with it. He believes it was a long time ago and that Jim and Pam are just friends. Besides, it gives Pam someone to talk to so she can get it all out before she comes home."},{"type":"paragraph","text":"Jan addresses how one should dress for the job one wants and not the job one has. Angela doesn't think she's getting anything out of this. Besides, Jan's clothes clearly indicate that she wants to be a whore."},{"type":"paragraph","text":"Michael sits down the guys for a gripe session about women. It quickly derails into a comparison between the office and warehouse workers. Darryl thinks that's the biggest issue. Michael may think they're all the same, but they're not. If they had a union, they could compete economically with the office. Michael is unable to tone down the union rhetoric."},{"type":"paragraph","text":"While Jan attempts to discuss how sports analogies often leave women out, Kelly uses the opportunity to ask about \"getting to second base\" in the context of Jan's relationship with Michael. Michael interrupts to explain about the union problem. Jan tells him he has to handle it himself. When he tries to patronize her with pros and cons, she tells him that the con is that the entire branch will be shut down, period. He attempts to insert their history into the conversation and she tells him in no uncertain terms they are not discussing it and makes him leave."},{"type":"paragraph","text":"The women continue to grill Jan about her relationship with Michael until she calls for a break."},{"type":"paragraph","text":"During the break, Pam tells Jim about the opportunity in New York. She seems excited about it; Jim believes she should go for it."},{"type":"paragraph","text":"The other men are trying to load up a delivery truck. Ryan comes up with an idea of speeding up the process to which Stanley immediately replies, \"This is a run out the clock situation.\" Michael blows packing peanuts all over the warehouse, pretending it's snow."},{"type":"paragraph","text":"At that point, Jan arrives, asks Michael if he's handled the problem, then immediately calls for everyone's attention. She explains clearly that any hint of unionizing will result in the closure of the branch, just like what happened in Pittsfield. They can direct any further questions to Michael...who is hiding."},{"type":"paragraph","text":"Pam and Roy have an argument about the design class. Jim confirms that she's not going to go after all. She says Roy doesn't believe there's any guarantee it will go anywhere. Jim tells her she has to take a chance on something, unless she wants to be a receptionist for the rest of her life. Pam snaps that she's fine with her choices."},{"type":"paragraph","text":"To the camera, she explains that she read about the house with a terrace when she was a kid and thought it was neat. It was just a story that stuck with her. It doesn't have any bearing on her life now. They don't even make houses like that in Scranton. She stops, finally vocalizing that she will never get to live her dream and bursts into tears."},{"type":"paragraph","text":"Michael treats the men to pizza as some form of compensation. As the day comes to a close, the warehouse is in complete disarray (furthered by Michael trying to create snow by spilling out the foam popcorn in front of a fan), and as Michael and the office employees depart, Darryl shouts: \"Hey Michael, this ain't over!\" as he stands in the middle of a complete mess. Michael shuts the door without responding."}],"images":[]},{"title":"Amusing Details","level":2,"content":[{"type":"list","elements":[{"text":"Toby avoids going to the warehouse, like how he avoided going on the Booze Cruise. This was for practical reasons: It allowed Paul Lieberstein to spend more time in the writers room.","elements":[]},{"text":"When Pam is saying how she doesn't fit it with the other ladies, she says she fits in more with... but then it cuts off to Roy saying Jim's name.","elements":[]},{"text":"Stanley talks about how they \"run the clock\" which is a sporting metaphor. The next scene shows Jan talking to them about sports metaphors and how women are left out of it.","elements":[]},{"text":"Michael suspected that the women are talking about \"clothes or me.\" It turns out he was correct on both topics.","elements":[]},{"text":"Kevin says he has Jim's back against Roy. When Roy starts talking to Jim in the next scene, you can see Kevin standing behind inventory in the background  ","elements":[]}]}],"images":[]},{"title":"Deleted scenes","level":2,"content":[{"type":"paragraph","text":"The Season Two DVD contained a number of deleted scenes from this episode. Notable cut scenes include:"},{"type":"list","elements":[{"text":"Michael asks Pam and Jim for help choosing a ringtone for his expensive new phone. He's looking for the one that sounds like a jackhammer. Jim asks, \"Do you mean vibrate?\"","elements":[]},{"text":"Roy and Dwight talk about guns. Roy prefers the Bushmaster; Dwight likes his spud gun.","elements":[]},{"text":"Dwight demonstrates his spud gun and destroys the window to Darryl's office. Though this scene isn't actually in the episode, it is acknowledged in Season 6 in the episode The Banker.","elements":[]},{"text":"In a talking head interview, Dwight talks about a film about a girl who went on an incredible adventure but eventually realized that \"there's no place like home\". But he can't remember the movie's title.","elements":[]}]}],"images":[]},{"title":"Trivia- Caution (spoilers)","level":2,"content":[{"type":"list","elements":[{"text":"As of this episode, David Denman (Roy Anderson) and Melora Hardin (Jan Levinson) have joined the main cast.","elements":[]},{"text":"Oscar Nunez (Oscar Martinez) is credited but does not appear in this episode.","elements":[]},{"text":"While Darryl says that the warehouse and office staff receive \"very different\" compensation, the difference was far less than he assumed - a year later, \"The Negotiation\" revealed that the reasonable raise Darryl asked for would give him a higher salary than Michael.","elements":[]},{"text":"A scene was shot in which Roy physically confronts Jim for pushing Pam to take the internship. The scene was very intense, but the producers opted not to include it in the episode because there was no comedy in it.","elements":[]},{"text":"There's a \"do not erase\" warning in the blackboard in the warehouse, but Michael erases it anyway.","elements":[]}]}],"images":[]},{"title":"References to previous episodes","level":2,"content":[{"type":"list","elements":[{"text":"The blow-up doll in the warehouse is the one Michael brought to work (and later threw away) in the episode \"Sexual Harassment\".","elements":[]}]}],"images":[]},{"title":"Cultural references","level":2,"content":[{"type":"list","elements":[{"text":"Ally McBeal (1998-2002) was a television dramedy about a young lawyer and her personal life. During its run, the title character became a focal point for the changing face of feminism.","elements":[]},{"text":"You've come a long way, baby was the motto of \"Virginia Slims\", a cigarette marketed for women. Its advertisements typically depicted a woman from the early 1900s being treated unfairly, combined with a carefree, stylish modern woman.","elements":[]},{"text":"Lost is a television drama that takes place on an island. The Others is a mysterious group of island inhabitants.","elements":[]},{"text":"Brangelina is the nickname created by the media to refer to the relationship between Brad Pitt and Angelina Jolie.","elements":[]},{"text":"Second base is part of a baseball-themed slang progression of intimacy: First base = making out, second base = fondling breasts, third base = genital touching, home run = intercourse.","elements":[]},{"text":"Good Will Hunting is a movie about a mathematical prodigy.","elements":[]},{"text":"Alcoholics Anonymous is a support group to assist people recovering from alcoholism. Members introduce themselves to the group by saying I'm (name) and I'm an alcoholic. Meredith almost says the same thing during the seminar.","elements":[]},{"text":"Lonny mockingly calls Michael Hasselhoff, referring to actor and singer David Hasselhoff.","elements":[]}]}],"images":[]},{"title":"Cast","level":2,"content":[],"images":[]},{"title":"Main cast","level":3,"content":[{"type":"list","elements":[{"text":"Steve Carell as Michael Scott","elements":[]},{"text":"Rainn Wilson as Dwight Schrute","elements":[]},{"text":"John Krasinski as Jim Halpert","elements":[]},{"text":"Jenna Fischer as Pam Beesly","elements":[]},{"text":"B.J. Novak as Ryan Howard","elements":[]}]}],"images":[]},{"title":"Supporting cast","level":3,"content":[{"type":"list","elements":[{"text":"Melora Hardin as Jan Levinson","elements":[]},{"text":"David Denman as Roy Anderson","elements":[]},{"text":"Leslie David Baker as Stanley Hudson","elements":[]},{"text":"Brian Baumgartner as Kevin Malone","elements":[]},{"text":"Kate Flannery as Meredith Palmer","elements":[]},{"text":"Angela Kinsey as Angela Martin","elements":[]},{"text":"Phyllis Smith as Phyllis Lapin","elements":[]}]}],"images":[]},{"title":"Recurring cast","level":3,"content":[{"type":"list","elements":[{"text":"Mindy Kaling as Kelly Kapoor","elements":[]},{"text":"Creed Bratton as Creed Bratton","elements":[]},{"text":"Paul Lieberstein as Toby Flenderson","elements":[]},{"text":"Craig Robinson as Darryl Philbin","elements":[]},{"text":"Patrice O'Neal as Lonnie Collins","elements":[]},{"text":"Karly Rothenberg as Madge","elements":[]},{"text":"Calvin Tenner as Calvin (Uncredited)","elements":[]},{"text":"Philip Pickard as Philip (Uncredited)","elements":[]}]}],"images":[]},{"title":"References","level":2,"content":[{"type":"list","elements":[{"text":"↑ GMMR Exclusive Interview with David Denman","elements":[]}]}],"images":[]}]}