{"sections":[{"title":"Branch Wars","level":1,"content":[{"type":"paragraph","text":"\"Branch Wars\" is the tenth episode of the fourth season of The Office and the 63rd overall. It was written by Mindy Kaling and directed by Joss Whedon. It first aired November 1, 2007. It was viewed by 8.39 million people."}],"images":[]},{"title":"Synopsis","level":2,"content":[{"type":"paragraph","text":"Karen, now Regional Manager at the Dunder-Mifflin branch in Utica, New York, offers a higher-paying job to Stanley, if he leaves Scranton. Stanley takes the offer and bluntly informs Michael. Michael believes that Karen is doing this to get back at Jim for \"dumping\" her."},{"type":"paragraph","text":"Meanwhile, Pam, Oscar, and Toby have created a \"Finer Things Club\", where they discuss literature, music, and the arts. Membership in the club is \"exclusive\", though they are still bothered by the activity of the other workers in the office. Jim wants to join but Toby and Oscar feel he dominates the conversation by trying to be funny, thus diverting the conversation away from the \"finer things\". Andy wants to join because it's the office's most exclusive club (the party planning committee, headed by Angela, is his backup and Kevin's band Scrantonicity II is his safety), but all three members shoot him down."},{"type":"paragraph","text":"Michael and Dwight invite Jim on a \"sales call\", which is a trick to get him to go to Utica to help get back at Karen. Jim is shocked by the deception but agrees to go along in order to prevent Michael and Dwight from doing anything foolish, including using Dwight's Molotov cocktails.  When Karen discovers the Scranton crew trying to steal her copier, she chastises them in her office. Before they leave, she pulls Jim aside and attempts to have a civil conversation with him. She is under the impression that this prank was constructed so Jim could have an opportunity to see her.  Jim awkwardly tells her that he didn't want to see her, trying not to hurt her feelings further, but does not succeed; he lets slip that he and Pam are finally dating and very happy. Karen reacts to the news with anger and he leaves."},{"type":"paragraph","text":"After Michael returns to Scranton, he tearfully says farewell to Stanley. Stanley then states his intentions to stay in Scranton, revealing to the camera that his threat of leaving was a bluff to get a raise."},{"type":"paragraph","text":"Pam attempts to cheer up Jim by giving him a place in the \"Finer Things Club\" as Andy still longs to be in it. The episode ends with Jim and the rest of the club wearing traditional Irish caps (Pam is wearing a scarf around her head). They are trying to discuss Angela's Ashes but Jim is being disruptive by speaking candidly with an Irish brogue. He gets it out of his system and then says he found the book to be a \"fun read\". Oscar and Toby are unamused, considering the book is a tragic memoir, and do not believe Jim actually read the book. Jim only proves them right by saying that the main character in the memoir is 'ashes'."}],"images":[{"src":"https:\/\/vignette.wikia.nocookie.net\/theoffice\/images\/a\/aa\/BW.jpg\/revision\/latest\/scale-to-width-down\/200?cb=20131127041737","caption":""}]},{"title":"Deleted scenes","level":2,"content":[{"type":"list","elements":[{"text":"An extended scene of Michael blaming Jim for Stanley transferring to Utica. He asks Jim if Pam was worth it to which he says it was. Pam blushes, but stops when Kelly points it out.","elements":[]},{"text":"In a talking head interview, Jim does his Stanley impression saying that he will transfer to Utica if they have more pretzel days there.","elements":[]},{"text":"Andy tries to buy his way into the Finer Things Club, slipping $150 in after claiming it was a letter of recommendation from former US Senator Rick Santorum - the club decides to take the donation, but still refuses admittance. (Given Oscar's presence in the group and Santorum's strident, vocal opposition to gay rights legislation, the name-drop almost certainly hurt Andy's case more than it helped.)","elements":[]},{"text":"Michael mentions facts about the other branches.","elements":[]},{"text":"Pam jokes about Jim still being interested in Karen.","elements":[]},{"text":"A scene showing Michael and Dwight wedged between a railing and the copier as Jim, Karen, Rolando, and a security guard watch them. The guard describes how Dwight sprayed him in the eye.","elements":[]},{"text":"Toby gives Andy a letter saying he is in a waiting list for entry into the Finer Things Club.","elements":[]}]}],"images":[]},{"title":"Trivia","level":2,"content":[{"type":"list","elements":[{"text":"B.J. Novak (Ryan Howard) and Mindy Kaling (Kelly Kapoor) are credited but do not appear in this episode.","elements":[]},{"text":"The first act premiered during The Office Convention on October 28th, during the \"Writer's Block\", in Scranton, PA.","elements":[]},{"text":"Pam's teapot from the episode \"Christmas Party\" makes an appearance at the Finer Things Club.","elements":[]},{"text":"When Michael is pinned by the industrial copier he asks Jim to promise him to host The Dundies.","elements":[]},{"text":"The song the \"Finer Things Club\" plays is Vivaldi's \"Spring\". (See List of Books, Magazines, Movies, Music, and Television Shows)","elements":[]},{"text":"When Michael announces to the whole office that Stanley is leaving for the Utica branch, Dwight acts surprised. However, Dwight should not be surprised because he was in the office when Stanley told Michael that he was leaving.","elements":[]},{"text":"The warehouse uniform Jim wears belongs to Madge but the uniforms Michael and Dwight wear don't seem to belong to any known employee.","elements":[]},{"text":"In the later episode \"Lecture Circuit\" there is a lock around the copier, and a sign that says not to touch it, which references this episode.","elements":[]},{"text":"Michael references an earlier episode when he seemingly makes a dying wish for Jim to host the Dundies.","elements":[]},{"text":"At the end, Jim uses an Irish accent to make a joke about the book Angela's Ashes. The book is an autobiography about Frank McCourt's life in Brooklyn, New York and Ireland.","elements":[]}]}],"images":[]},{"title":"Cultural References","level":2,"content":[{"type":"list","elements":[{"text":"In the car, Michael and Dwight chant, \"Utica! Utica!\" In the movie Dog Day Afternoon, Al Pacino's character famously incites the crowd in a chant of \"Attica! Attica!\"","elements":[]},{"text":"Andy's breakdown of his three options into a goal, a backup, and a safety are taken from United States college application rituals. A student traditionally applies to three schools: A first-choice school at which acceptance is unlikely but possible, a less prestigious backup school at which acceptance is likely, and a low-status safety school at which acceptance is almost assured.","elements":[]}]}],"images":[]},{"title":"Cast","level":2,"content":[],"images":[]},{"title":"Main Cast","level":3,"content":[{"type":"list","elements":[{"text":"Steve Carell as Michael Scott","elements":[]},{"text":"Rainn Wilson as Dwight Schrute","elements":[]},{"text":"John Krasinski as Jim Halpert","elements":[]},{"text":"Jenna Fischer as Pam Beesly","elements":[]}]}],"images":[]},{"title":"Supporting Cast","level":3,"content":[{"type":"list","elements":[{"text":"Ed Helms as Andy Bernard","elements":[]},{"text":"Leslie David Baker as Stanley Hudson","elements":[]},{"text":"Brian Baumgartner as Kevin Malone","elements":[]},{"text":"Creed Bratton (actor) as Creed Bratton","elements":[]},{"text":"Kate Flannery as Meredith Palmer","elements":[]},{"text":"Angela Kinsey as Angela Martin","elements":[]},{"text":"Paul Lieberstein as Toby Flenderson","elements":[]},{"text":"Oscar Nunez as Oscar Martinez","elements":[]},{"text":"Phyllis Smith as Phyllis Vance","elements":[]}]}],"images":[]},{"title":"Recurring Cast","level":3,"content":[{"type":"list","elements":[{"text":"Rashida Jones as Karen Filippelli","elements":[]}]}],"images":[]},{"title":"Guest Cast","level":3,"content":[{"type":"list","elements":[{"text":"Adam Jamal Craig as Rolando","elements":[]}]}],"images":[]}]}