{"sections":[{"title":"Broke","level":1,"content":[{"type":"paragraph","text":"\"Broke\" is the twenty-fifth episode of the fifth season of The Office, and the 97th episode overall. It was written by Charlie Grandy and directed by Steve Carell in his directorial debut. It first aired on April 23, 2009. It was viewed by 7.21 million people."}],"images":[]},{"title":"Synopsis","level":2,"content":[{"type":"paragraph","text":"The strain of early morning paper deliveries takes its toll on the Michael Scott Paper Company. Ryan, who says he gets sick by mornings now-a-days, is teased by Michael by moving the van when he reaches for the handle. Pam is told goodbye by a very sleepy Jim and Michael's honking disturbs their neighbor. Michael, Pam and Ryan visit an accountant to determine whether they can afford to hire a delivery person and discover that not only can they not afford one, but Michael's deep discounts and Ryan's flawed cash flow model mean that the company is on the brink of collapse."},{"type":"paragraph","text":"Meanwhile, CFO David Wallace visits the Scranton branch to determine what can be done to stop Michael from stealing Dunder Mifflin's clients. Dwight's bizarre suggestions on how to get rid of the Michael Scott Paper Company cast him in a new light in Charles Miner's eyes."},{"type":"paragraph","text":"Wallace realizes that he has to buy out the Michael Scott Paper Company. Jim \"investigates\" the situation (although he knows from Pam the Michael Scott Paper Company's desperate situation) and thwarts Dwight's efforts to warn David Wallace and Charles Miner that they are offering too much for the company."},{"type":"paragraph","text":"Michael shows an uncharacteristic flash of brilliance during the negotiations, first bidding up the offer for his company from $12,000 to $60,000, and then on top of that demanding (and getting) his old job back as Regional Manager of the Scranton branch, as well as jobs for both Pam and Ryan. Wallace is furious that Ryan will be back at Dunder Mifflin considering the enormous damage he caused the company, and Ryan doesn't seem too thrilled to be working there either."}],"images":[]},{"title":"Amusing details","level":2,"content":[{"type":"list","elements":[{"text":"When Michael honks the horn to pick up Pam, a light turns on in the neighbor's house.","elements":[]},{"text":"When Dwight runs into the kitchen to tell Charles that the Michael Scott Paper Company is broke, nobody is in the conference room, even though it happens while Michael, Pam, and Ryan are supposed to be in there.","elements":[]},{"text":"The buyout of the Michael Scott Paper Company came not a moment too soon: They just ran out of cheese puffs!","elements":[]},{"text":"Michael's fish is different yet again, implying he was unable to keep his previous fish alive.","elements":[]},{"text":"During the conference between Charles, David Wallace, Jim, and Dwight, the two sides dress similarly: David and Jim both wear light blue shirts with dark ties, Charles and Dwight wear white\/off-white shirts with striped ties.","elements":[]},{"text":"As Pam pointed out, 스크랜턴 할렐루야 교회 which is on the side of their van actually translates to Scranton Hallelujah Church from Korean. This causes random Korean churchgoers to board the van throughout the episode.","elements":[]},{"text":"The shareholder meeting that Michael points out is coming up for David Wallace is the one Michael is invited to speak at during Shareholder Meeting.","elements":[]},{"text":"When Jim leans into Pam to give her a kiss on the cheek, Pam puckers her lips in preparation for a kiss on the lips.","elements":[]}]}],"images":[]},{"title":"Cultural references","level":2,"content":[{"type":"list","elements":[{"text":"Michael asks, \"It's 4:30 in the morning. Do you know where your kids are?\" This is a slight misquote of the public service announcement popular in the United States in the 1960s to the 1980s. At 10pm or 11pm, a brief announcement came on the television set: \"It's (time). Do you know where your children are?\".","elements":[]},{"text":"A paper route is a job typically held by teenage children delivering newspapers to houses early in the morning.","elements":[]},{"text":"Michael says, \"Time to make the donuts!\", the catch phrase from a series of television commercials for donut chain Dunkin' Donuts featuring Fred the Baker waking up before dawn muttering the phrase to himself.","elements":[]},{"text":"Ryan says \"Ever since I've gotten clean...\" To get clean is slang for to stop taking drugs.","elements":[]},{"text":"Michael shouts, \"Boner patrol!\" Boner is slang for a male erection.","elements":[]},{"text":"Michael, Pam, and Ryan sitting on the floor of their \"office\" sharing confessions echoes a similar scene from The Breakfast Club.","elements":[]},{"text":"Jim addresses Michael, Pam, and Ryan as \"Titans of Industry\" when asking if they would be receptive to a buyout. This is a common phrase applied to industrial giants such as Andrew Carnegie and J. P. Morgan. It was also the less common name given to Andrew Johnson's Reconstruction-era Knights of the Guild. Michael misunderstands Jim and informs him that \"not only are [they] tight ends, [they're] also quarterbacks,\" referencing two positions in American football.","elements":[]}]}],"images":[]},{"title":"Cast","level":2,"content":[],"images":[]},{"title":"Main cast","level":3,"content":[{"type":"list","elements":[{"text":"Steve Carell as Michael Scott","elements":[]},{"text":"Rainn Wilson as Dwight Schrute","elements":[]},{"text":"John Krasinski as Jim Halpert","elements":[]},{"text":"Jenna Fischer as Pam Beesly","elements":[]},{"text":"B.J. Novak as Ryan Howard","elements":[]}]}],"images":[]},{"title":"Supporting cast","level":3,"content":[{"type":"list","elements":[{"text":"Leslie David Baker as Stanley Hudson","elements":[]},{"text":"Brian Baumgartner as Kevin Malone","elements":[]},{"text":"Creed Bratton (actor) as Creed Bratton","elements":[]},{"text":"Kate Flannery as Meredith Palmer","elements":[]},{"text":"Mindy Kaling as Kelly Kapoor","elements":[]},{"text":"Angela Kinsey as Angela Martin","elements":[]},{"text":"Oscar Nunez as Oscar Martinez","elements":[]},{"text":"Phyllis Smith as Phyllis Vance","elements":[]}]}],"images":[]},{"title":"Special guest star","level":3,"content":[{"type":"list","elements":[{"text":"Idris Elba as Charles Miner","elements":[]}]}],"images":[]},{"title":"Recurring cast","level":3,"content":[{"type":"list","elements":[{"text":"Ellie Kemper as Erin Hannon","elements":[]},{"text":"Andy Buckley as David Wallace","elements":[]}]}],"images":[]},{"title":"Guest cast","level":3,"content":[{"type":"list","elements":[{"text":"Kurt Scholler as Ty Platt","elements":[]}]}],"images":[]}]}