{"sections":[{"title":"Chair Model","level":1,"content":[{"type":"paragraph","text":"\"Chair Model\" (originally titled \"Parking\" and \"The Chair Model\") is the 14th episode of the 4th season of The Office and the 67th episode overall. It was written by B.J. Novak and directed by Jeffrey Blitz. It first aired on April 17, 2008. It was viewed by 9.81 million people."}],"images":[]},{"title":"Synopsis","level":2,"content":[{"type":"paragraph","text":"Michael's fascination with a woman modeling a chair in an office supply catalog makes him feel things he hasn't felt in a while. With Michael distracted, Kevin and Andy team up to win back Dunder Mifflin's stolen parking spaces, forcing them into a showdown with the bosses of the five businesses of the office park."}],"images":[]},{"title":"Deleted scenes","level":2,"content":[{"type":"list","elements":[{"text":"Michael has been staying at Dwight's beet farm house for the past six weeks, letting Jan stay in his condo. Now that Jan is staying with her sister in Scottsdale, Michael can return home. Dwight tallies up Michael's bill for staying in the Americana Room for six weeks. Michael is hurt by the gesture but hands Dwight his credit card, explaining that everything that happened between them for the past six weeks (such as slumber parties) was strictly business and not personal. Moved by Michael's words, Dwight tears up the bill. He tells the documentary camera, \"We don't take debit cards anyway.\"","elements":[]},{"text":"Michael asks Angela if she has any single friends, maybe a religious type in uniform. Angela asks, \"A Catholic school girl?\" Michael clarifies: \"Older.\" Angela asks, \"A nun?\"","elements":[]},{"text":"In a talking head interview, Michael muses on the schoolyard taunt, \"Love, marriage, baby carriage.\" He explains that he had love with Jan, no marriage, but he did buy her a baby carriage to carry groceries after her DUI.","elements":[]},{"text":"Michael sits at Kelly's desk. Kelly arrives and Michael asks if she can set him up with one of her friends. Kelly says, \"Oh all my friends are crazy, like Brianna.\" Michael asks for Brianna's number, but she's only 23. Kelly then volunteers that she knows \"a ton of people.\" She begins talking about her friends' divorced parents, but Michael walks out on her.","elements":[]},{"text":"In a talking head interview, Toby explains that there is no explicit company rule against Michael forcing employees to set him up on a date. Then again, there is no explicit company rule against forcing employees to take part in a shot-by-shot remake of Indiana Jones. \"How do you make a rule book like that?\"","elements":[]},{"text":"Michael comes to the break room and asks everyone for their index cards. When Pam comes up empty, Michael explains that he's not looking for \"a perfect ten\", but all his suggestions involve models or former models. Jim offers to set up Michael with a sex model. \"She's blind. Is that a problem?\" And she's not actually a model; she's a toll booth attendant. In a talking head interview, Michael holds two index cards. \"A blind toll booth operator and a 1200-pound catcher\".","elements":[]}]}],"images":[]},{"title":"Trivia","level":2,"content":[{"type":"list","elements":[{"text":"B.J. Novak (Ryan Howard) is credited but does not appear in this episode","elements":[]},{"text":"The working title for this episode was \"Michael Dating\", but a more vague title was selected for public release in order to avoid giving away the ending of the episode Dinner Party.","elements":[]},{"text":"This is the second episode in which a character named Deborah is introduced, and in both cases, she meets an unfortunate fate. In the episode Product Recall, Creed framed Debbie Brown and forced her dismissal.","elements":[]},{"text":"The establishing shot for the coffee shop is from The Coffee Gallery.","elements":[]},{"text":"The \"Five Families\" meeting is Bob Vance's only appearance independent of his relationship with Phyllis.","elements":[]},{"text":"In the original script, Michael and Dwight sang \"Candle in the Wind\" in the cemetery, but the producers were unable to secure permission to use the song. The NBC comedy 30 Rock had previously requested permission to use the song, but Elton John was so deeply offended by their parody that he flat-out refused even to consider the request from The Office. Coincidentally, this song was eventually referenced in Parks and Recreation when Leslie Knope requests that Andy Dwyer write a song to commemorate the passing of Li'l Sebastian. Parks and Recreation was also created by Greg Daniels and Michael Schur. Another song considered (but for which rights could not be obtained) was \"Ruby Tuesday\", sung as \"Good-bye Deborah Shoshlefski\".","elements":[]},{"text":"Deborah Shoshlefski is played by April Eden, who also appears on Parks and Recreation as the Miss Pawnee pageant winner Trish Ianetta.","elements":[]},{"text":"In the original script, Michael and Dwight sang \"Legs\" late into the night. The producers invited the actors to sing \"American Pie\" instead, and the performance was so compelling, it went into the final cut.","elements":[]},{"text":"The original script had a subplot where Jim sends Dwight to fake management training, but it was abandoned when \"the network pointed out ... that it felt like something we had already done.\" The writers considered other options, such as Jim and Pam moving in together, and then they realized, \"Why wouldn't they just get engaged?\"","elements":[]}]}],"images":[]},{"title":"Analysis","level":2,"content":[{"type":"list","elements":[{"text":"Both Kevin and Michael are dealing with the consequences of a nasty break-up, but they handle them in very different ways.","elements":[]},{"text":"This episode provides another example of Michael unwittingly providing emotional assistance to another character. His refusal to help Kevin resolve the parking problem (selfishly motivated) forces Kevin to address the problem himself, allowing Kevin to enjoy the much-needed satisfaction of having taken control of his life back from those who had made it miserable.","elements":[]}]}],"images":[]},{"title":"Amusing details","level":2,"content":[{"type":"list","elements":[{"text":"At the end of the episode, when Andy makes a comment about \"Joe Sixpack,\" he says several things that don't make sense, including paying a mortgage on a rented apartment and paying orphanage bills. This further perpetuates the image that Andy doesn't understand how the real world works.","elements":[]},{"text":"We briefly see Michael's computer- it is the same wallpaper image that he changed it to in Survivor Man.","elements":[]},{"text":"Andy has a Cornell sticker on his windshield.","elements":[]},{"text":"While sitting on the couch talking with Michael about Stacy, Kevin soaks his feet, presumably using the footbath he bought himself in the episode Christmas Party.","elements":[]},{"text":"At the coffee shop, Michael ordered a large hot chocolate with caramel and peppermint. His sweet tooth continues unabated.","elements":[]},{"text":"When Michael pays for his coffee we see that his his wallet is decorated with rhinestones.","elements":[]},{"text":"After Michael asks the office to provide the names of possible girlfriends Jim jokingly offers up Pam's mother, foreshadowing a real relationship between the two in Season 6.","elements":[]},{"text":"The headstone on the grave of the chair model, Deborah Shoshlefski, indicates that she died in 2003. The catalog has used that photo for years and will probably use it again next year.","elements":[]},{"text":"The phone number to call for a free consultation from W.B. Jones Heating & Air (1-800-984-3672) is the same number used in the episode Women's Appreciation for Dwight's Anti-Flashing Task Force. After the episode aired, the message changed to tips from W.B. Jones on using heating and cooling equipment.","elements":[]},{"text":"Keeping with the mockumentary nature of the show, credits and citations are given when the bosses of Scranton Business Park are introduced.","elements":[]},{"text":"At the end of the episode, Michael and Dwight literally dance on the grave of the chair model.","elements":[]},{"text":"Watch closely when Kevin is rubbing his feet in the beginning of the episode. A huge drop of spit falls out of his mouth.","elements":[]},{"text":"When brushing his teeth before going on his blind date with Pam's landlord, Michael simply swallows the toothpaste instead of spitting it out.","elements":[]},{"text":"At the meeting with the \"Five Families\", Andy says that Michael couldn't make it to the meeting due to an \"unforeseen prior engagement\".","elements":[]},{"text":"When Kevin is introducing the heads of the Scranton Business Park 5 families, Bob Vance appears holding a cigar that is neither lit nor circumcised, despite the tip being moist.","elements":[]}]}],"images":[]},{"title":"Cultural references","level":2,"content":[{"type":"list","elements":[{"text":"A penny loafer is a style of shoe. It has no laces or buckles. Some people consider it good luck to put a penny in one's penny loafers.","elements":[]},{"text":"The type of chair Pam mimics in her talking head interview is one with a pneumatic height adjustment. Older chairs employed more complicated means for adjusting the seat height.","elements":[]},{"text":"Michael tells Kevin, \"You don't deserve her,\" inadvertently reversing the traditional consolatory words, \"He\/she doesn't deserve you.\"","elements":[]},{"text":"Oscar Meyer is a company best known for its hot dogs, known as \"Oscar Meyer Wieners\". The term \"wiener\" is slang for penis, and Michael blends the two when he calls Oscar an Oscar Meyer Wiener lover.","elements":[]},{"text":"Michael asks whether Phyllis's friend is a jolly, sassy, opera singer. The terms \"jolly\" and \"sassy\" are sometimes used euphemistically for people who are overweight. Opera singers are stereotypically overweight.","elements":[]},{"text":"Michael asks whether Phyllis's friend plays catcher or infield. Catchers in softball are usually short and stout, while infielders are more graceful and thus skinnier.","elements":[]},{"text":"Michael says that his employees are \"hanging me out to dry\". To \"hang someone out to dry\" is to abandon someone after taking advantage of him.","elements":[]},{"text":"Michael says that he needs to get laid, a rather lewd term for having sex.","elements":[]},{"text":"Michael says, \"I am a catch and I am not going to be the one who got away.\" These idioms are commonly used in discussing dating, relying on an analogy with fishing. A \"catch\" is a desirable mate, and one who \"gets away\" is a \"catch\" that one fails to get. The term is not used in the first person, as Michael does.","elements":[]},{"text":"The term eligible is a common euphemism to indicate that the person is neither married nor has a boyfriend or girlfriend.","elements":[]},{"text":"Michael and Dwight sing American Pie at the chair model's grave, with altered lyrics. The meaning of the song's original lyrics is in dispute, but the singer Don McLean claims (and few dispute) that it was inspired by his memories of the death of singer Buddy Holly. The song is notable for its unusually long length: 8 and a half minutes.","elements":[]},{"text":"The phrase Five Families could have been taken from the movie The Godfather.","elements":[]}]}],"images":[]},{"title":"Cast","level":2,"content":[],"images":[]},{"title":"Main cast","level":3,"content":[{"type":"list","elements":[{"text":"Steve Carell as Michael Scott","elements":[]},{"text":"Rainn Wilson as Dwight Schrute","elements":[]},{"text":"John Krasinski as Jim Halpert","elements":[]},{"text":"Jenna Fischer as Pam Beesly","elements":[]},{"text":"B.J. Novak as Ryan Howard","elements":[]}]}],"images":[]},{"title":"Supporting cast","level":3,"content":[{"type":"list","elements":[{"text":"Ed Helms as Andy Bernard","elements":[]},{"text":"Leslie David Baker as Stanley Hudson","elements":[]},{"text":"Brian Baumgartner as Kevin Malone","elements":[]},{"text":"Creed Bratton (actor) as Creed Bratton","elements":[]},{"text":"Kate Flannery as Meredith Palmer","elements":[]},{"text":"Melora Hardin as Jan Levinson (voice, uncredited)","elements":[]},{"text":"Mindy Kaling as Kelly Kapoor","elements":[]},{"text":"Angela Kinsey as Angela Martin","elements":[]},{"text":"Paul Lieberstein as Toby Flenderson","elements":[]},{"text":"Oscar Nunez as Oscar Martinez","elements":[]},{"text":"Phyllis Smith as Phyllis Vance","elements":[]}]}],"images":[]},{"title":"Recurring cast","level":3,"content":[{"type":"list","elements":[{"text":"Bobby Ray Shafer as Bob Vance","elements":[]}]}],"images":[]},{"title":"Guest cast","level":3,"content":[{"type":"list","elements":[{"text":"Brooke Dillman as Margaret, the Landlady","elements":[]},{"text":"Terrence Beasor as Bill Cress (Cress Tool and Dye)","elements":[]},{"text":"Paul Faust (actor) as Paul Faust (Disaster Kits Limited)","elements":[]},{"text":"Barry Sigismondi as W.B. Jones (W.B. Jones Heating and Air)","elements":[]},{"text":"Sean Bury as Coffee Shop Employee","elements":[]},{"text":"April Eden as Deborah Shoshlefski, the Chair Model","elements":[]}]}],"images":[]},{"title":"References","level":2,"content":[{"type":"list","elements":[{"text":"↑ Talking with 'Office' Star B.J. Novak, NPR, The Bryant Park Project, May 12, 2008.","elements":[]},{"text":"↑ Cite error: Invalid  tag; no text was provided for refs named","elements":[]},{"text":"↑ The Office's BJ Novak Uncut, NPR, The Bryant Park Project.","elements":[]}]}],"images":[]}]}