{"sections":[{"title":"China","level":1,"content":[{"type":"paragraph","text":"\"China\" is the tenth episode of the seventh season of The Office and the 136th episode overall. The episode was directed by Charles McDougall and was written by Halsted Sullivan & Warren Lieberstein. It first aired on December 2, 2010. It was viewed by 7.31 million people."}],"images":[]},{"title":"Synopsis","level":2,"content":[{"type":"paragraph","text":"After reading a magazine article about the rise of China's economy, Michael gets frightened that the United States will fall victim to an evil ploy by the Chinese government due to its immense size. In an announcement, Michael asks the staff for ideas on how to boost the American economy and states a figure about how many cities China has that have over a million people. Oscar tries to correct him, but Ryan and Stanley research it which proves Michael correct."},{"type":"paragraph","text":"The entire staff jokes with Oscar for the rest of the day about being less intelligent than Michael, so Oscar invites Michael to coffee to one-up him in another conversation about China. Jim and Andy try to coach him, but Michael fumbles the conversation and Oscar nearly walks away victorious and smug from the debate. Michael, at the last minute, rebuts with an argument about friendship and conversation which has no relevance to the conversation but is delivered so passionately that the audience of Erin, Kelly, Ryan, Jim and Andy all applaud and congratulate him."},{"type":"paragraph","text":"As the new building owner, Dwight has made financial cutbacks, including installing motion-activated light sensors and half-ply toilet paper. Pam starts to argue against these changes, and as the new office administrator decides to find a new building to move into. Pam finds a new space for the office in a plush building. Dwight begins to get worried, but finds out she made up the office as leverage. He starts to put pressure on her, and she confides in Jim that she doesn't want to be a failure as office administrator."},{"type":"paragraph","text":"Dwight overhears and sets up a ploy for Pam to find out about tenant rights, which she uses against Dwight. He makes the changes and confides in the camera that it was because he is not a compassionate person, although a candid smile may reveal otherwise."},{"type":"paragraph","text":"Darryl confronts Andy about sending him stupid text messages, but Andy continues to text him. Darryl draws the line and gives Andy one more do-or-be-blocked message. Andy texts him about pigeons in the parking lot, and Darryl reluctantly goes but ends up enjoying the birds eating ice cream."}],"images":[]},{"title":"Cultural references","level":2,"content":[{"type":"list","elements":[{"text":"Michael is initially worked up about China after reading an article in Newsweek, an American weekly news magazine.","elements":[]},{"text":"Michael notes that he was forced to read Newsweek in the waiting room at his dentist's office because some \"kid had the magazine I wanted to read\", hinting that the magazine Michael wanted to read was the children's magazine Highlights for Children.","elements":[]},{"text":"Dognapping is the kidnapping or stealing of a dog owned by someone else, with the intention of demanding a ransom. According to Nate, Dwight is being questioned by the police in connection with a string of dognappings.","elements":[]},{"text":"Jim played a game called Zombie Soccer for two hours.","elements":[]},{"text":"Andy sends Darryl a text that only reads \"Megan Fox?\", a reference to the American actress and model.","elements":[]},{"text":"Michael does an impression of the then-governor of California, Arnold Schwarzenegger.","elements":[]},{"text":"Creed notes that he understands, but cannot speak Pirate slang.","elements":[]},{"text":"Tibet is a plateau region in Asia, north-east of the Himalayas.","elements":[]},{"text":"Mao Zedong was a Chinese communist revolutionary, dictator, political theorist and politician.","elements":[]},{"text":"Andy attempts to motivate Michael with a pep talk taken from the 1979 movie Rocky II.","elements":[]}]}],"images":[]},{"title":"Connections to previous episodes","level":2,"content":[{"type":"list","elements":[{"text":"During Michael and Oscar's discussion in the lobby of the office building, a copy of Call of Duty can be seen behind the counter (The Coup and Email Surveillance).","elements":[]},{"text":"Michael returns from dentist appointments many times during the series, due to his soft teeth.","elements":[]}]}],"images":[]},{"title":"Amusing details","level":2,"content":[{"type":"list","elements":[{"text":"When Dwight and Nate are locating the building, Nate reads out \"10706\", but the sign reads \"10735\".","elements":[]},{"text":"When Kevin is coming up with the antacid pill ideas, Stanley says, \"Why not just go one for the year?\" and Kevin says, \"It's too big a pill to swallow.\" It appears Kevin was just making the pills bigger instead of using a stronger antacid.","elements":[]},{"text":"Michael says, \"Yes, Pam this is exactly why I hired you as Office Administrator, handle it.\" Michael did not hire her as Office Administrator, and he didn't pay attention to what Pam was saying when he signed off on it.","elements":[]},{"text":"Michael says that hitting Ctrl-P will open a new tab as long as the printer isn't hooked up. This is false.","elements":[]}]}],"images":[]},{"title":"Cast","level":2,"content":[],"images":[]},{"title":"Main cast","level":3,"content":[{"type":"list","elements":[{"text":"Steve Carell as Michael Scott","elements":[]},{"text":"Rainn Wilson as Dwight Schrute","elements":[]},{"text":"John Krasinski as Jim Halpert","elements":[]},{"text":"Jenna Fischer as Pam Halpert","elements":[]},{"text":"B.J. Novak as Ryan Howard","elements":[]},{"text":"Ed Helms as Andy Bernard","elements":[]}]}],"images":[]},{"title":"Supported cast","level":3,"content":[{"type":"list","elements":[{"text":"Leslie David Baker as Stanley Hudson","elements":[]},{"text":"Brian Baumgartner as Kevin Malone","elements":[]},{"text":"Creed Bratton (actor) as Creed Bratton","elements":[]},{"text":"Kate Flannery as Meredith Palmer","elements":[]},{"text":"Mindy Kaling as Kelly Kapoor","elements":[]},{"text":"Ellie Kemper as Erin Hannon","elements":[]},{"text":"Angela Kinsey as Angela Martin","elements":[]},{"text":"Oscar Nunez as Oscar Martinez","elements":[]},{"text":"Craig Robinson as Darryl Philbin","elements":[]},{"text":"Phyllis Smith as Phyllis Vance","elements":[]},{"text":"Zach Woods as Gabe Lewis","elements":[]}]}],"images":[]},{"title":"Recurring cast","level":3,"content":[{"type":"list","elements":[{"text":"Hugh Dane as Hank Tate","elements":[]},{"text":"Mark Proksch as Nate","elements":[]}]}],"images":[]},{"title":"Guest cast","level":3,"content":[{"type":"list","elements":[{"text":"Sarah Zimmerman as \"Other Pam\"","elements":[]}]}],"images":[]}]}