{"sections":[{"title":"Company Picnic","level":1,"content":[{"type":"paragraph","text":"\"Company Picnic\" is the twenty-eighth episode of the fifth season of The Office, and the 100th episode overall. It was written by Jennifer Celotta and Paul Lieberstein and directed by Ken Kwapis. It first aired on May 14, 2009. It was viewed by 6.72 million people."}],"images":[]},{"title":"Synopsis","level":2,"content":[{"type":"paragraph","text":"Michael ate a whole family size chicken pot pie, and then fell asleep. The office tries to get all the clocks reset so that he thinks it is five o' clock, so that they can leave for the day. After resetting his computer clock, his watch and the clock in his car, they pretend to laugh at a joke, and Michael realizes the time. Michael says that they can all go, and they yell in the parking lot, with Jim and Dwight pretending to shoot a gun."},{"type":"paragraph","text":"The next day, the Scranton branch joins several other branches at the Dunder Mifflin Company Picnic. Pam explains that last year someone grabbed her breasts for \"balance.\" Dwight and his friend Rolf argue about Sunscreen and Bug repellent, which Dwight made homemade, because of regulations. Michael sees Holly after Kevin points her out with her boyfriend, A.J.. They hug, and talk to each other. Michael pretends to not remember A.J., however, A.J. remembers him, and says hi."},{"type":"paragraph","text":"Michael gets Holly and A.J. drinks, but makes it awkward. Michael explains that he lied to Kevin about how Holly was only his friend, he wants more out of their relationship. Michael continues, and says that he and Holly are soul mates."},{"type":"paragraph","text":"Charles Miner continues to belittle Jim, by saying that Jim must be happy to get a rest from all of his rest."},{"type":"paragraph","text":"Dwight plans the volleyball game carefully to not repeat what happened last year, when Jim found a supposedly poisonous spider in his glove. When Andy requests being next to Erin to Dwight, Dwight refuses, and puts him next to Phyllis. Meanwhile, Michael asks Holly and A.J. what is happening. He is shocked and sad when Holly tells Michael that they are building a house. Michael says that he is building a pants-chair, and A.J. says that he'll take a pair. When he reveals his size, Michael calls him a fatty, and Holly and Michael begin to prepare their skit, saying that the old comedy team is back together again."},{"type":"paragraph","text":"Andy is angry at Erin for missing the volleyball. However, he pretends he was yelling at a guy wearing Ray-Bans, asking him if he is blind. When Kevin misses, Dwight and Andy belittle him to no end. Phyllis, tired, sits down on the ground, and an angry Dwight asks why. The Scranton Branch continues to play, and Ryan misses, however, Dwight finds someone holding the net, so he deducts a point from their team. Dwight tells Pam to serve, who serves well. In a talking head, she reveals that she went to volleyball camp most summers. She wins the game against Albany for the Scranton branch."},{"type":"paragraph","text":"Holly and Michael have snacks and plan their skit, which they will wing. They bond once again. Pam continues to do great, but Phyllis quits. Rolf puts Meredith in the game and Angela asks why not her. Rolf explains why and in doing so calls Angela a cheater and tramp, which slightly alarms Dwight. Holly and Michael continue to plan their skit, but can't come up with an idea. As they complete their task, Pam wins another game, and Charles and David watch, saying that corporate will beat them. However, Rolf crudely tells them, \"That they'll piss all over your faces,\" alarming everyone. Kendall and Toby reflect on a previous company picnic."},{"type":"paragraph","text":"Holly and Michael finish planning their skit and David introduces them to the whole Dunder Mifflin company. Their skit, which is called, SlumDunder Mifflinaire, starts well. Holly asks Michael questions, and Michael replies in an Indian voice. Holly then pretends to stab Michael with a microphone. They continue their horrible play, and talk about Robert Mifflin's suicide, and how he killed himself. Many people look at Holly and Michael with disgust. Stanley, surprisingly loves it. Holly and Michael accidentally reveal that the Buffalo branch will be closed down. Holly continues to torture Michael. Michael says that David told him that Buffalo will be closed down. David Wallace reveals it to be true, and he berates Michael and Holly for their performances. Meredith, Oscar, Dwight and Pam confer about their volleyball game and decide to, \"Kick corporate's ass.\" Charles continues to make fun of Jim."},{"type":"paragraph","text":"Kevin loses another point for Scranton. Rolf calls Angela a whore, and Dwight angrily tells Rolf to stop. Erin, finally makes a point, yelling, \"Booyah!\" Pam slips and is supposedly injured. Charles and David, wanting to get the best player off Scranton's team, tells them to go to the hospital. Dwight tells them that there is a hospital around, and Pam tells him that they'll be back. Dwight, stalling, kicks the ball into the woods, and slowly gets it."},{"type":"paragraph","text":"Holly and Michael talk about their skit, and they are unsure whether it was good or not. Michael has a hard time telling Holly that he loves her and eventually doesn't. At the hospital, a nurse tells Pam that she needs an x-ray and asks if she is pregnant. A.J. tells Holly and Michael that he liked the skit. In a talking head, Michael tells the documentary crew that the relationship between Michael and Holly will take a long time, but then it will be perfect. He says he is in no rush."},{"type":"paragraph","text":"Dwight stalls again to wait for Pam to come back. Jim, at the hospital, tells Dwight that they are hurrying and to buy them a few more minutes."},{"type":"paragraph","text":"In the end scene, Jim walks into the x-ray room, and a doctor inaudibly reveals something to Jim and Pam. They are thrilled. Jim, holding back tears, calls Dwight and tells him to send in the subs."}],"images":[]},{"title":"Deleted scenes","level":2,"content":[{"type":"paragraph","text":"These are deleted scenes from the Season 5 DVD:"},{"type":"list","elements":[{"text":"Meredith asks how Stanley, and his wife Terri are doing. Jake, Meredith's son calls Meredith, Meredith, not mom, and tells Meredith, up yours. Meredith leaves him in the car all day.","elements":[]},{"text":"Michael explains that he works all year to go to the company picnic, and that instead of bringing his family, he brings a guy from his condo complex. However, he says, this year he will hang out with people like Dan Gore and Holly.","elements":[]},{"text":"Dwight teaches everyone how to play volleyball. When Dwight tells Jim to put his hands in a triangle position, he tells them that his hands work on their own, and then slaps Dwight.","elements":[]},{"text":"Dwight and Andy tell Utica that they suck, and sing a song, \"Ususktika, Usukskita,\" and then Jim pulls their ears.","elements":[]},{"text":"Ryan keeps serving to himself. Andy yells at him that you can only serve three times on one side. An angry guy from Buffalo named Mark, misses the serve, and tells his other employees that one of them moved, and then goes on to idiots. Andy then laughs at him, saying what's up with that guy.","elements":[]},{"text":"Charles goes on to berate Jim, telling him that he controls everything like work. Pam teaches Jim how to serve.","elements":[]},{"text":"David Wallace congratulates Jennie Tan for the website. Michael says he might throw up, but Holly tells him not to worry.","elements":[]},{"text":"Oscar says that the head accountant at Buffalo is a real homophobe.","elements":[]},{"text":"Pam, yells, come on Ellie (really Erin who is played by Ellie Kemper), and Erin misses. Andy yells at her loudly, but Erin calmly smiles.","elements":[]},{"text":"Angela is thrilled that Dwight nodded at her. Angela says that on the inside that she is a soft and warm as porcelain. She gushes on about Dwight.","elements":[]},{"text":"Stanley asks Creed to stay in the shade.","elements":[]},{"text":"Oscar and everyone else wants to forfeit. Dwight calls Meredith an idiot. Meredith serves and purposely throws it at Dwight's head. They lose, and this leaves the branch thrilled, but Dwight angry.","elements":[]}]}],"images":[]},{"title":"Goofs","level":2,"content":[{"type":"list","elements":[{"text":"When Jim turns the clock back the initial time reads 12:50, whereas when Dwight switches it back in Michael's car, it reads 12:10 even though this was supposed to have occurred at the same time or later. ","elements":[]},{"text":"Michael and Holly claim that Dunder and Mifflin met during a tour of Dartmouth college. In \"Dunder Mifflin Infinity\", however, Robert Dunder himself says he knew Mifflin through the Rotary Club.","elements":[]}]}],"images":[]},{"title":"Trivia","level":2,"content":[{"type":"list","elements":[{"text":"Dwight doesn't put his shoes on when he runs to the parking lot to reset the clock in Michael's car.","elements":[]},{"text":"Mark from Buffalo is played by Brian Stack, a writer on Conan O'Brien. We see more of his short temper in a deleted scene.","elements":[]},{"text":"The man with Ray-Bans is played by Emmy-award-winning editor of The Office, David Rogers. Like Jennifer Celotta, Rogers wanted to play a Schrute, but he decided that his hope was unrealistic and settled for this cameo.","elements":[]},{"text":"According to the set decorations, the company picnic was held at \"The Meadows\" in upstate New York.","elements":[]},{"text":"In the episode, Holly mentions that Camden and Yonkers had recently been closed.","elements":[]},{"text":"One of the Buffalo staff members is played by Jennie Tan, Webmaster of the site Office Tally. In a deleted scene, she is thanked by David Wallace by name for her work on \"the web site.\"","elements":[]},{"text":"The hospital in this episode is the same hospital used for the show Scrubs.","elements":[]},{"text":"Pam's serves were inserted via computer graphics. Actors had to dive for an imaginary ball.","elements":[]},{"text":"When it is revealed that Pam is pregnant and Jim and Pam embrace one another, it is silent. That is a homage to the original BBC series, \"The Office\" when Tim asks Dawn in silence if she will go on a date with him.","elements":[]},{"text":"Connection to previous episode (Weight Loss)- Michael gives Jim a condom so that he doesn't have a \"surprise pregnancy\".","elements":[]},{"text":"Dunder Mifflin branch t-shirt colors at the picnic:","elements":[{"text":"Corporate - Black","elements":[]},{"text":"Akron - Yellow","elements":[]},{"text":"Albany - Light blue","elements":[]},{"text":"Buffalo - Orange","elements":[]},{"text":"Nashua - Green","elements":[]},{"text":"Rochester - Dark purple","elements":[]},{"text":"Scranton - Red","elements":[]},{"text":"Utica - Dark blue","elements":[]}]}]}],"images":[]},{"title":"Continuity error ","level":2,"content":[{"type":"list","elements":[{"text":"Pam admits to playing volleyball in junior high school as well as senior high school and college and going to volleyball camp almost every summer, although in \"The Job Fair\" in a talking head interview she says, \"So many memories in this old gym, pretending I had PMS so I didn't have to play volleyball, pretending I had PMS so I didn't have to play basketball...those were the days.\"","elements":[]}]}],"images":[]},{"title":"Cast","level":2,"content":[],"images":[]},{"title":"Main Cast","level":3,"content":[{"type":"list","elements":[{"text":"Steve Carell as Michael Scott","elements":[]},{"text":"Rainn Wilson as Dwight Schrute","elements":[]},{"text":"John Krasinski as Jim Halpert","elements":[]},{"text":"Jenna Fischer as Pam Beesly","elements":[]},{"text":"B.J. Novak as Ryan Howard","elements":[]}]}],"images":[]},{"title":"Supporting Cast","level":3,"content":[{"type":"list","elements":[{"text":"Ed Helms as Andy Bernard","elements":[]},{"text":"Leslie David Baker as Stanley Hudson","elements":[]},{"text":"Brian Baumgartner as Kevin Malone","elements":[]},{"text":"Creed Bratton (actor) as Creed Bratton","elements":[]},{"text":"Kate Flannery as Meredith Palmer","elements":[]},{"text":"Mindy Kaling as Kelly Kapoor","elements":[]},{"text":"Angela Kinsey as Angela Martin","elements":[]},{"text":"Paul Lieberstein as Toby Flenderson","elements":[]},{"text":"Oscar Nunez as Oscar Martinez","elements":[]},{"text":"Phyllis Smith as Phyllis Vance","elements":[]}]}],"images":[]},{"title":"Special Guest Stars","level":3,"content":[{"type":"list","elements":[{"text":"Amy Ryan as Holly Flax","elements":[]},{"text":"Idris Elba as Charles Miner","elements":[]}]}],"images":[]},{"title":"Recurring Cast","level":3,"content":[{"type":"list","elements":[{"text":"Ellie Kemper as Erin Hannon","elements":[]},{"text":"Andy Buckley as David Wallace","elements":[]},{"text":"Bobby Ray Shafer as Bob Vance","elements":[]}]}],"images":[]},{"title":"Guest Cast","level":3,"content":[{"type":"list","elements":[{"text":"Rob Huebel as A.J.","elements":[]},{"text":"James Urbaniak as Rolf","elements":[]},{"text":"John Hartmann as Kendall","elements":[]},{"text":"Joanne Carlsen as Teri Hudson","elements":[]},{"text":"Brian Stack as Mark (Buffalo branch)","elements":[]},{"text":"Ken Bernfield as The Doctor","elements":[]},{"text":"Molly Bryant as Albany Branch Employee","elements":[]},{"text":"David Rogers as Man wearing Ray-Bans","elements":[]},{"text":"Marla Garlin as Picnic Attendant","elements":[]}]}],"images":[]}]}