{"sections":[{"title":"Customer Survey","level":1,"content":[{"type":"paragraph","text":"\"Customer Survey\" is the seventh episode of the fifth season of The Office and the 79th episode overall. It was written by Lester Lewis and directed by Stephen Merchant. It first aired November 6, 2008. It was viewed by 8.35 million people."}],"images":[]},{"title":"Synopsis","level":2,"content":[{"type":"paragraph","text":"Michael has apparently announced to everyone in the office that he is engaged to Holly.  This is far from the truth, as Darryl points out. The staff prods Michael to call his mother to tell her about the engagement, which he does. His mother does not believe him, as he has apparently done this before, and he is forced to reveal the truth, disappointing everybody. Kelly is particularly disappointed, having just bought a bridesmaid dress (white) which she is now forced to return for a partial refund."},{"type":"paragraph","text":"Kelly gives the customer survey reports to Michael, and Dwight and Jim are shocked to find out that their feedback is abysmal. Jim is somewhat disappointed as he was intending on using his anticipated satisfaction-based bonus to buy his parents' home (he has not told Pam of this), but he otherwise takes it in stride. Dwight, on the other hand, is vehement that something influenced the numbers and suspects Kelly of tampering with the reports, perhaps with co-conspirators. Dwight talks about it to Jim, who doesn't believe him until he notices Kelly being uncharacteristically succinct with him when they talk. When asking Ryan about Kelly's recent behavior, Jim notices that Ryan has a coffee mug with his face on it, something he had noticed Andy also had earlier. Ryan explains that the mugs were party favors at an America's Got Talent party Kelly hosted over the summer. Jim discovers that everyone in the office has one, except for him and Dwight, as they didn't attend the party, and he deduces that Kelly tampered with their reports out of spite. Jim and Dwight have Michael confront her about this, and she ultimately comes clean regarding the reports. After dismissing Dwight and Jim, Michael pretends to confront Kelly about her deceit but actually commiserates with her because no one goes to his parties either. They relish in Jim and Dwight's discomfort."},{"type":"paragraph","text":"Pam buys a miniature Bluetooth device for her and Jim so they can stay in touch throughout the day without being caught. Jim tells Dwight that he is only talking to himself when he is really talking to Pam, and Dwight thinks that Jim needs a friend. Pam helps Jim realize Kelly's unusual behavior with him and figure out the truth about the satisfaction reports. Near the end of the day, one of Pam's friends from art school, Alex, comes to visit her at the corporate office. He pulls her into the conference room and tells her he thinks that she shouldn't move back to Scranton. Jim, still listening on the Bluetooth, remarks that it's pretty clear Alex has a crush on her. Alex goes on to tell her that if she really wants to pursue a career in art, then only three months in New York isn't going to do any good for her. He leaves, and Jim and Pam are left to silently ponder this."},{"type":"paragraph","text":"Andy shows Angela a wedding tent he would like for their wedding. Angela agrees on the condition that the location is on a hand-plowed farm with an old barn, within special requirements, and within a 5-8 mile radius. Andy looks up possible locations and chooses Schrute Farms as the location since he is acquainted with Dwight and believes he can get a good deal. At the end of the episode, Dwight accepts the offer to hold their wedding on his farm. Dwight further offers to meet Angela's every need, day or night. She is clearly pleased by this and has to suppress a smile."}],"images":[]},{"title":"Trivia","level":2,"content":[{"type":"list","elements":[{"text":"After the episode aired, Kelly's America's Got Talent mugs were available for purchase on the NBC online store.","elements":[]},{"text":"Michael is not the central character in this episode.","elements":[]},{"text":"The man in the first wedding photo in the binder that Dwight shows to Angela and Andy at the end of the episode, is the same man that was running the booth for the funeral home in Job Fair.","elements":[]}]}],"images":[]},{"title":"Connections to Other Episodes","level":2,"content":[{"type":"list","elements":[{"text":"Kelly also wore a white dress to Phyllis' Wedding. On that occasion, she tells everyone that there was an \"emergency\", but confesses to the camera that she just looks really good in white.","elements":[]},{"text":"This is not the first time Kelly has asked for reimbursement for clothing items from Michael. In Booze Cruise she tells Michael that she bought a new swimsuit for the cruise, and is upset when he tells them they won't need one, because she \"already took the tags off.\"","elements":[]}]}],"images":[]},{"title":"Cast","level":2,"content":[],"images":[]},{"title":"Main Cast","level":3,"content":[{"type":"list","elements":[{"text":"Steve Carell as Michael Scott","elements":[]},{"text":"Rainn Wilson as Dwight Schrute","elements":[]},{"text":"John Krasinski as Jim Halpert","elements":[]},{"text":"Jenna Fischer as Pam Beesly","elements":[]},{"text":"B.J. Novak as Ryan Howard","elements":[]}]}],"images":[]},{"title":"Supporting Cast","level":3,"content":[{"type":"list","elements":[{"text":"Ed Helms as Andy Bernard","elements":[]},{"text":"Leslie David Baker as Stanley Hudson","elements":[]},{"text":"Brian Baumgartner as Kevin Malone","elements":[]},{"text":"Creed Bratton (actor) as Creed Bratton","elements":[]},{"text":"Kate Flannery as Meredith Palmer","elements":[]},{"text":"Mindy Kaling as Kelly Kapoor","elements":[]},{"text":"Angela Kinsey as Angela Martin","elements":[]},{"text":"Oscar Nunez as Oscar Martinez","elements":[]},{"text":"Craig Robinson as Darryl Philbin","elements":[]},{"text":"Phyllis Smith as Phyllis Vance","elements":[]}]}],"images":[]},{"title":"Recurring Cast","level":3,"content":[{"type":"list","elements":[{"text":"Rich Sommer as Alex","elements":[]}]}],"images":[]},{"title":"Guest Cast","level":3,"content":[{"type":"list","elements":[{"text":"June Squibb as Michael's Mother (voice)","elements":[]}]}],"images":[]}]}