{"sections":[{"title":"Did I Stutter?","level":1,"content":[{"type":"paragraph","text":"\"Did I Stutter?\" is the sixteenth episode of the fourth season of The Office and the 69th episode overall.  It was written by Brent Forrester and Justin Spitzer and directed by Randall Einhorn. It first aired May 1, 2008. It was viewed by 7.67 million people."}],"images":[]},{"title":"Plot","level":2,"content":[{"type":"paragraph","text":"When in a meeting Michael tries to persuade Stanley to participate. Stanley doesn't really want to; he just wants to work on his crossword puzzles. After much nagging, Stanley finally interrupts Michael with the phrase, 'Did I stutter?' much to Michael's shock. Michael then leaves the conference room in disbelief and embarrassment. Toby heads into Michael's office trying to convince him to have a talk with Stanley. Toby's efforts fail as Michael claims that he and Stanley were simply joking."},{"type":"paragraph","text":"Dwight discovers that Andy is selling his car and decides to buy it from him, after convincing him to lower the price. Pam is shown at reception wearing a pair of glasses instead of her usual contacts. Pam then explains that after spending the night at the house of “a friend”, implied to be Jim, she forgot her contact solution and must use glasses."},{"type":"paragraph","text":"Michael walks over to Stanley and tries to make up with him. Stanley explains to the camera that he doesn't apologize unless he thinks that he's wrong."},{"type":"paragraph","text":"Ryan shows up to the office in order to give Jim a formal warning regarding his job performance, stating that he spends far too much time pranking Dwight and hanging out at reception rather than selling paper. Jim asks if the warning has to do with his discussion with David Wallace about Ryan’s website, but Ryan immediately becomes defensive. In a talking head, Toby gloats that all of Jim’s time spent talking with Pam has “finally caught up to him”."},{"type":"paragraph","text":"Andy discovers that Dwight has put the car that he bought from him for sale on eBay. Dwight feels that he can sell the car for more money and reveals that the car is currently in a three-way bidding war. Kevin tells Pam that he loves her glasses because all the girls he's ever dated have had glasses. After he reveals that glasses and librarians are a turn-on for him, however, Pam decides to sacrifice her good vision by taking her glasses off."},{"type":"paragraph","text":"Michael then decides that he can slap some sense into Stanley by fake-firing him, when he does so Stanley threatens to file a lawsuit against him.  Michael tells Stanley that the firing was fake, but that only makes Stanley outraged, telling Michael that he is a professional idiot. Michael is hurt by this and loudly tells Stanley to stop it, he then makes everyone leave the room and has a conversation with Stanley, bluntly telling him that he is his boss and won't be talked to that way. Stanley then agrees that even though he has no respect for Michael, he will not talk to him the way he did anymore. Michael asks Stanley's opinion on a new idea of his, to which Stanley replies \"It has potential to be your best idea yet\"."}],"images":[]},{"title":"Deleted Scenes","level":2,"content":[{"type":"list","elements":[{"text":"Phyllis compliments Pam on her glasses, but when Pam returns the favor, Phyllis reminds her that she's married, and that \"boys don't make passes at girls who wear glasses\". Kelly disagrees, saying she liked the Tina Fey\/Lisa Loeb vibe they gave off, but in a talking head declares herself the new Cutest Girl in the Office.","elements":[]},{"text":"In a talking head, Michael calls Stanley one of his oldest friends, who he could not see for 50 years and still be as close with - all as the camera shows him walking down the stairs, outside the building, and into the annex to go to the bathroom so that he can avoid Stanley.","elements":[]},{"text":"Talking heads where Stanley says that Michael crossed a line he had been warned not to cross, \"so f—k him!\", Jim sarcastically blames gangsta rap for the outburst, and Michael claims Stanley was like a child clamoring for his father's attention, as he had as a child.","elements":[]},{"text":"In the breakroom, Michael tells Jim, Pam and Kelly about all the nasty things Stanley has said to him about his co-workers. After claiming he had criticized her glasses, Pam calls bullshit on Michael and suggests that he simply tell Stanley he had been rude - but when asked by Jim to tell Andy to figure out whether or not he has a rash in private, and Kelly to remind Creed that \"looking is as bad as touching\", Michael walks away in disgust.","elements":[]},{"text":"A meeting in Michael's office where he makes a scene of putting a reprimand in Stanley's file, giving him every opportunity possible to apologize and the letter will go in the trash - and Stanley refuses.","elements":[]},{"text":"A talking head where Pam gets the cameraman to leave his lens severely unfocused, showing what the rest of the day will be like for her, unable to see anything \"disgusting (Dwight trimming nose hair at his desk) or...ugly (Creed at his desk, partially disrobed) or...Michael... It's great!\"","elements":[]},{"text":"Ryan shows Pam how to eat bagels, by scooping out the middle and only eating the shell - in a talking head, Pam says it's yet another reason she's okay with being essentially blind.","elements":[]},{"text":"Jim confronts Toby about his warning. Toby brings up Dwight's complaints, which Jim reminds him are treated almost as a joke; Toby states it's a productivity issue, though Jim counters that his numbers are good - and when Toby agrees, but mentions that Ryan thinks they can be even better, Jim knows once and for all the real explanation.","elements":[]},{"text":"Ryan admits that, since he's a favorite of Wallace, going after Jim is risky, but sometimes, in business, the best move is to \"get out on the open highway...with the top down\", punctuating the statement by putting the top down on his car - which doesn't work.","elements":[]},{"text":"Observing Dwight's auction of his old car, Andy wonders aloud who would buy a car on eBay. Meredith replies that she has had success on the site, actually using it to buy everything she is currently wearing, which leaves Andy sulking as a smirking Dwight looks on.","elements":[]},{"text":"Oscar says that his grandmother would describe Michael vs. Stanley as a \"Peruvian standoff\" - thanks to their ignorance or \"backward\" culture, neither will give in. Realizing how that sounds, he admits that she was a racist, \"like most Bolivians\".","elements":[]},{"text":"Walking out to the car, after Pam says that she doesn't need to see to know something is bothering him, Jim straight up tells her that Ryan is attempting to run him out of the company. Pam is furious, offering to drive up to New York right then and there, since, if she wasn't wearing her glasses when she ran over him, it wouldn't be a crime.","elements":[]},{"text":"As Michael leaves for the day, Toby compliments him on his handling of the situation - which of course is the last thing in the world he wants to hear.","elements":[]}]}],"images":[]},{"title":"Dwight's organizational chart","level":2,"content":[{"type":"list","elements":[{"text":"Dwight's organizational chart is quite detailed. NBC made the chart available online after the episode aired. Download the PDF here.","elements":[{"text":"Ryan Howard's title is Vice President, North East Region and Director of New Media.","elements":[]},{"text":"Jim Halpert is Assistant Regional Manager.","elements":[]},{"text":"Dwight K. Schrute is Original Assistant Regional Manager, positioned slightly above Jim.","elements":[]},{"text":"Angela Martin is Senior Accountant, and her box has a pink \"female\" symbol (♀).","elements":[]},{"text":"Accountant Tom Peets has been crossed off. (He killed himself, as noted in the episode Performance Review.)","elements":[]},{"text":"Accountant Kevin Malone has a four-leaf clover.","elements":[]},{"text":"Accountant Oscar Martinez has two \"male\" symbols (♂♂), alluding to his homosexuality.","elements":[]},{"text":"Toby Flenderson has a blue Star of David with a question mark. Dwight may believe that Toby is Jewish, although it is stated that Toby attended the Catholic Bishop O'Hara High School and was at one time a seminarian.","elements":[]},{"text":"The Quality Control department consists of Quality Assurance Rep \"Creed Bratton\", in quotation marks.","elements":[]},{"text":"The Customer Service department consists of Customer Service Rep Kelly Kapoor, and her box has a pink \"female\" symbol.","elements":[]},{"text":"The Supplier Relations department consists of Supplier Relations Meredith Palmer, with a pink \"female\" symbol. Additionally, the symbol indicating her menstrual cycle has been crossed off, referring to her hysterectomy, first mentioned in Health Care.","elements":[]},{"text":"Reporting to Meredith is Devon White, whose box has been crossed off. (Devon was fired in Halloween).","elements":[]},{"text":"The Reception department consists of Receptionist Pam Beesly, with a pink \"female\" symbol.","elements":[]},{"text":"The Sales department is headed by Regional Director in Charge of Sales Andy Bernard. His box contains a silhouette of a person wearing a mortarboard, referring to Andy's habit of reminding everyone that he went to Cornell.","elements":[]},{"text":"Reporting to Andy are Sales Rep Phyllis Vance and Sales Rep Stanley Hudson. Phyllis's box contains a pink \"female\" symbol, as well as a symbol which, according to the legend, indicates that she is post-menopausal. Stanley's box contains a \"Black Power\" fist.","elements":[]},{"text":"Heading the Warehouse is Warehouse Foreman Darryl Philbin, whose box contains a \"Black Power\" fist.","elements":[]},{"text":"Reporting to Darryl are Jerry DiCanio, Madge Madsen, and Lonnie Collins. Madge's box is adorned with a pink \"female\" symbol, and Lonnie's contains a \"Black Power\" fist. There is an unexplained dotted line from Lonnie to Michael.","elements":[]},{"text":"The Party Planning Committee consists of Angela, Pam, Phyllis, Meredith, and Kelly, although the line to Kelly is not as strong as the other lines.","elements":[]},{"text":"The chart is labelled \"Dunder Mifflin Scranton Branch ORG. CHART By Dwight K. Schrute*\" with the footnote \"*Do Not Duplicate or Transmit. Intellectual Property of Dwight K. Schrute for 1,000 years.\"","elements":[]},{"text":"Karen and the other former Stamford employees do not appear on the chart. Neither does Roy.","elements":[]}]}]},{"type":"list","elements":[{"text":"Dwight's \"Emergency Powers\" chart [1] makes the following changes:","elements":[{"text":"Next to his name is the symbol for radioactive materials. It also says \"warnung vor radioaktiven und ionisierenden Strahlen\" (\"warning of radioactive and ionizing radiation\").","elements":[]},{"text":"Andy's name is crossed out.","elements":[]},{"text":"The Warehouse staff is under a \"lockdown\".","elements":[]},{"text":"Dwight's family members are listed as members of the hierarchy as follows:","elements":[{"text":"Mose reports directly to Dwight.","elements":[]},{"text":"Vater (German for \"father\") reports to Mose, and Mutter (\"mother\") reports to Vater.","elements":[]},{"text":"Two people noted as Shirley and Heindl also report to Mose. Shirley is most likely Dwight's Aunt Shirley who died in Season 9.","elements":[]}]}]}]}],"images":[]},{"title":"Trivia","level":2,"content":[{"type":"list","elements":[{"text":"After the episode aired, Andy's Nissan Xterra was placed for sale on eBay. According to the auction listing, the car actually belongs to Kim M. Ferry, the key hair stylist for the show. Included with the car are autographed memorabilia donated by the actors. The car went to a couple in Oklahoma.","elements":[]},{"text":"Nobody in the office is showing any care for Toby putting his hand on Pam's leg which was seen in the previous episode, Night Out.","elements":[]}]}],"images":[]},{"title":"Amusing details","level":2,"content":[{"type":"list","elements":[{"text":"During the game of Mad Libs, Angela first suggests \"tall\" then changes it to \"nice\". When Andy reads the completed Mad Lib, we learn that Angela had chosen \"tall\", \"nice\", and \"nice\" again. Not only does she choose bland words, she can't even choose unique bland words!","elements":[]},{"text":"Andy's flyer reads: \"For Sale \/ 2001 Nissan Xterra \/ (photo) \/ Air Bags, Anti-Lock Brakes, Air Conditioning, AM\/FM Radio \/ Mirrors, Windows, Character \/ $8,700 \/ Contact \/ Andy Bernard \/ @ Ext 1022\". Wow, the car comes with windows.","elements":[]},{"text":"Dwight's flyer reads almost the same: \"For Sale \/ 2001 Nissan Xterra \/ (photo) \/ Low Mileage - Pristine Transmission \/ Air Bags, Anti-Lock Brakes, Air Conditioning, AM\/FM Radio \/ Mirrors, Windows, Character \/ $9,995.00 \/ Contact \/ Dwight Schrute \/ @ Ext 1015\".","elements":[]}]},{"type":"list","elements":[{"text":"When Pam stands up during the conference room scene in a deleted scene, Toby is also wearing glasses.","elements":[]},{"text":"Toby reported Jim to Ryan because he is jealous that Jim gets to be with Pam. Ryan, also jealous that Jim gets to be with Pam (likely because Pam rejects Ryan in Dunder Mifflin Infinity), he decides to warn Jim for no apparent reason.","elements":[]},{"text":"On Dwight's Org. Chart that has him taking over all of the office, many of Dwight's family members appear on the chart. One of those is a woman named Shirley, who is supposed to report to Mose. This likely refers to Dwight's Aunt Shirley, who owns a 1600 acre farm directly adjacent to Schrute Farms. She appears in season nine and will eventually die due to old age.","elements":[]},{"text":"Dwight's Org. Chart in which he is in full control also has Andrew Bernard crossed out, indicating that Dwight would likely fire him if he was in control.","elements":[]}]}],"images":[]},{"title":"Connections to previous episodes","level":2,"content":[{"type":"list","elements":[{"text":"Michael fake-fired Pam in the Pilot. It didn't go well then either.","elements":[]},{"text":"When Jim questions Ryan’s reasoning for giving him a formal warning, the salesman asks about his talk with Wallace about the website Ryan created. Ryan brings this up in the previous episode, Night Out.","elements":[]},{"text":"In one of the deleted scenes, Kelly advises Pam to continue wearing her glasses, but then tells the cameras, \"Guess who just became the cutest girl in the office\", echoing Andy's \"Guess who just became the best looking single guy in the office?\" from the episode Dunder Mifflin Infinity.","elements":[]}]}],"images":[]},{"title":"Cultural references","level":2,"content":[{"type":"list","elements":[{"text":"Dwight says \"Michael, I promise to give authority back to you when this crisis is over,\" in his pitch to gain full emergency authority. This is a reference to Chancellor Adolf Hitler gaining emergency powers to rule by decree in Germany 1933.","elements":[]},{"text":"Kelly talks about watching actor Will Smith on E!, an American cable television channel focusing on popular entertainment. Pam explains that Kelly is talking about Grauman's Chinese Theatre, a Hollywood landmark known for signatures and handprints of notable entertainment figures in the cement sidewalk outside.","elements":[]},{"text":"Andy and Angela play Mad Libs, a children's game consisting of an incomplete story. Players fill in the words without knowing the story; the result is intended to be humorous. Dwight mocks the game in a talking head interview later in the episode.","elements":[]},{"text":"Jim goads Michael by saying an urban thing. The word urban is a euphemism for \"black\".","elements":[]},{"text":"Andy talks about the blue book value of his car. The Kelley Blue Book is a guide to used car values.","elements":[]},{"text":"Michael asks Darryl about the Crips and the Bloods, two well-known Los Angeles rival street gangs. Darryl adds the Latin Kings from Chicago, the fictitious Warriors from the 1979 movie The Warriors, and invents a gang called the Newsies, presumably named after the 1992 Disney movie.","elements":[]},{"text":"Ryan asks Jim how he can support the Eagles, a local professional American football team. The 2007 season was particularly disappointing. Jim's response \"on a wing and a prayer\" is an idiom meaning that you're in a desperate situation and hoping that everything turns out all right.","elements":[]},{"text":"Dwight's nonsense-syllable singing when he washes the Xterra is an example of scat singing.","elements":[]},{"text":"Andy accuses Dwight of flipping his car, an informal term meaning to purchase something and immediately resell it at a profit.","elements":[]},{"text":"Kevin describes the confrontation between Michael and Stanley as a Clash of the Titans, a 1981 stop-motion animated film depicting the myth of Perseus. The term has since been used to describe any conflict between formidable opponents.","elements":[]},{"text":"Kevin describes Michael as in one corner and Stanley as in the other corner, terms used to describe the opponents in a boxing match.","elements":[]},{"text":"In Michael's final talking head, he mimics the styles of a series of stand-up comedians, usually taking a well-known joke and messing it up.","elements":[{"text":"Rodney Dangerfield: \"I don't get no respect\" coupled with collar tug.","elements":[]},{"text":"Jerry Seinfeld: \"If the black box is the only thing that survives the crash, why don't they make the whole plane out of the black box?\"","elements":[]},{"text":"Henny Youngman: \"Take my wife, please\" (itself another pun)","elements":[]},{"text":"Jeff Foxworthy: \"You might be a redneck if...\"","elements":[]},{"text":"Borat","elements":[]},{"text":"Jerry Seinfeld again: \"What's the deal with Grape Nuts? No grapes, no nuts!\"","elements":[]}]},{"text":"Michael initially proposes a summer sale-a-bration, a commonly-used pun on \"celebration\". He changes this to sales-a-lot, which is not a pun on anything. He may have confused it with Camelot or Sir Mix-a-Lot.","elements":[]},{"text":"The adage Boys don't make passes at girls who wear glasses was coined by Dorothy Parker.","elements":[]},{"text":"Lisa Loeb is a popular singer; Tina Fey is a writer and comic actor. Both are noted for wearing bold glasses.","elements":[]},{"text":"Ryan brags about the bagels in New York City. New York City is indeed known for its bagels.","elements":[]},{"text":"Ryan's remark \"Fewer carbs\" refers to the low-carbohydrate diet which was popular at the time the episode aired.","elements":[]}]}],"images":[]},{"title":"Cast","level":2,"content":[],"images":[]},{"title":"Main Cast","level":3,"content":[{"type":"list","elements":[{"text":"Steve Carell as Michael Scott","elements":[]},{"text":"Rainn Wilson as Dwight Schrute","elements":[]},{"text":"John Krasinski as Jim Halpert","elements":[]},{"text":"Jenna Fischer as Pam Beesly","elements":[]},{"text":"B.J. Novak as Ryan Howard","elements":[]}]}],"images":[]},{"title":"Supporting Cast","level":3,"content":[{"type":"list","elements":[{"text":"Ed Helms as Andy Bernard","elements":[]},{"text":"Leslie David Baker as Stanley Hudson","elements":[]},{"text":"Brian Baumgartner as Kevin Malone","elements":[]},{"text":"Creed Bratton (actor) as Creed Bratton","elements":[]},{"text":"Kate Flannery as Meredith Palmer","elements":[]},{"text":"Mindy Kaling as Kelly Kapoor","elements":[]},{"text":"Angela Kinsey as Angela Martin","elements":[]},{"text":"Paul Lieberstein as Toby Flenderson","elements":[]},{"text":"Oscar Nunez as Oscar Martinez","elements":[]},{"text":"Craig Robinson as Darryl Philbin","elements":[]},{"text":"Phyllis Smith as Phyllis Vance","elements":[]}]}],"images":[]},{"title":"References","level":2,"content":[{"type":"list","elements":[{"text":"↑ Publicity still for episode Did I Stutter?","elements":[]},{"text":"↑ Buy Andy's car!, Office Tally","elements":[]},{"text":"↑ Buy Andy's Xterra: Epilogue, Office Tally","elements":[]}]}],"images":[]}]}