{"sections":[{"title":"Dinner Party","level":1,"content":[{"type":"paragraph","text":"\"Dinner Party\" is the thirteenth episode of the fourth season of The Office and the 66th overall. It was written by Lee Eisenberg and Gene Stupnitsky. It was directed by Paul Feig. It first aired April 10, 2008. It was viewed by 9.22 million people."}],"images":[]},{"title":"Synopsis","level":2,"content":[{"type":"paragraph","text":"Michael pretends that Corporate has ordered the staff to work late on a Friday night, then pretends to call Corporate to reverse their decision. Their Friday evening now free, Jim and Pam have no excuse for declining Michael's latest invitation to socialize - in this case, a dinner party at his condo. Although Dwight wants to attend, Michael explains that the party is only for couples, that he also invited Andy and Angela, and that he only has six wine glasses."},{"type":"paragraph","text":"Jim and Pam are welcomed by Michael and Jan, who give them a tour of the condo. One bedroom has been converted into Jan's office (which appears unused); another is her workspace where she makes candles for her home business: \"Serenity by Jan.\" The aroma from the candles is overpowering. Jan then leads the guests into the master bedroom and playfully scolds Michael for not putting away the video camera tripod."},{"type":"paragraph","text":"Michael demonstrates how he sleeps on a small bench at the foot of the bed because Jan has \"some space issues.\" Jan has gotten her way with the home decor, although Michael takes comfort in his small plasma television mounted on the wall. Michael is also proud of a crude wooden table he built. To be polite, Jim confesses that he has no talent for crafts, and Pam joins in by mentioning that Jim couldn't set up her TiVo."},{"type":"paragraph","text":"Michael tells Pam that if she needs help, \"I'm just a phone call away.\" Jan angrily remarks to Michael, \"I bet you are.\""},{"type":"paragraph","text":"When Andy and Angela arrive, Jan offers to take them on a short tour before starting dinner. All that's left to do is cook the ossobuco, which will take three hours, she says. Pam looks horrified."},{"type":"paragraph","text":"When she returns, Jan plays a CD (\"The Hunted\") recorded by her former assistant, Hunter. The lyrics of the song and Jan's provocative dancing suggest that he lost his virginity to her."},{"type":"paragraph","text":"During a disastrous game of Celebrity, Jim excuses himself and pretends to have received a telephone call informing him that his apartment has flooded. His attempt to escape the party with Pam is thwarted when Michael notes that only one person needs to check on the damage. Jim concedes the point and tries to escape alone, but Pam forces a smiling Jim to stay."},{"type":"paragraph","text":"Jim returns to the game of Celebrity and undermines Michael's turn by intentionally guessing the wrong names to obvious clues."},{"type":"paragraph","text":"After the game, Michael tries to make a sales pitch to Jim and Andy to buy shares in Jan's candle company for $10,000, which Andy immediately accepts. Pam and Angela join Jan in the kitchen, where Jan says that Michael told her that he used to date Pam. Pam is disgusted and tells Jan she never has and never wants to date Michael, but Angela quickly comments that she sees Pam staring at Michael in the office."},{"type":"paragraph","text":"As dinner begins, Dwight arrives, uninvited, with his own food, two wine glasses and (apparently) his former babysitter, with whom he claims to be having a \"carnal\" relationship. Michael and Jan argue openly about very personal matters: while Jan debated whether or not to have children, she forced Michael to undergo a vasectomy, have it reversed, then undergo another vasectomy."},{"type":"paragraph","text":"The tension between Michael and Jan only grows during dinner. Michael confides in Pam that he thinks Jan has poisoned his food; Jan is upset with Michael for dipping his food in wine. Michael then plugs in a garish neon St. Pauli Girl beer sign, and the tension erupts in a shouting match. The conflict escalates until Jan throws one of Michael's Dundie awards and breaks his $200 \"plasma\" television."},{"type":"paragraph","text":"When the police arrive to investigate a disturbance call, Michael says that he will not press charges against Jan and will \"take the fall\" for what happened. On the advice of the responding officers, Michael agrees to go home with a friend. Jim and Pam are unavailable because Jim's apartment is \"on fire\"--Pam corrects him: \"flooded.\" Dwight happily takes Michael in his car."},{"type":"paragraph","text":"In Michael's condo, Jan tries to repair his Dundie. Jim and Pam stop at a coney island for dinner, eating in Jim's car while listening to Hunter's CD (which Jim stole). Angela and Andy make their own stopover for ice cream cones; Andy playfully takes a lick of Angela's cone, who gives him a look of unbridled disgust and smears the rest of her ice cream on the side of his car."}],"images":[{"src":"https:\/\/vignette.wikia.nocookie.net\/theoffice\/images\/c\/cb\/Dwight_dinner_party_arrival.jpg\/revision\/latest\/scale-to-width-down\/180?cb=20101209081549","caption":""}]},{"title":"Deleted scenes","level":2,"content":[{"type":"paragraph","text":"NBC released a number of deleted scenes on its Web site."},{"type":"list","elements":[{"text":"In a talking head interview, Michael lists his dream dinner guest list: \"Jim, Pam, Ryan, the mayor, Barack Obama, Shiloh Jolie-Pitt (because at the end of the night, Brad and\/or Angelina would have to pick him up, and I would get to meet them), Shia LaBeouf (because of Disturbia), all the children of the world, Val Kilmer (but he probably wouldn't come, too famous), obviously George Clooney, and Jan, definitely (if there was room).\"","elements":[]},{"text":"In a talking head interview, Dwight lists his dream dinner guest list: \"John Wilkes Booth, Lee Harvey Oswald, Osama bin Laden, John Wayne Gacey, and Jeffrey Lionel Dahmer. Oh, hey guys, welcome to my home. Oh, here comes the waiter with the soup. Hope you guys are hungry! Meanwhile, the waiter subtly nods at me. But I don't acknowledge him. But I know he's an assassin because I trained him. Boom, two minutes later, five dead psychopaths on my dining room table. All that's left to do is dispose of the bodies and collect the reward. It's almost too easy.\"","elements":[]},{"text":"Toby complains about having to work late, since he had Tom Petty tickets that night (implying that Michael deliberately chose this night to fake the after-hours assignment), and becomes quite frustrated when no one listens.","elements":[]},{"text":"Jan serves appetizers. Angela teases Andy when he brags about having studied in France while at Cornell. Michael emerges from the rest room. Michael confirms to Jan that he washed his hands, but he whispers to Jim, \"I didn't really wash my hands.\" He then rearranges all the appetizers and offers them to the guests. Only Andy takes one.","elements":[]},{"text":"In the hallway, a starving Pam shares her snack bar with Jim. Jan suddenly appears and angrily asks, \"Are you eating?\" Jim denies having eaten anything. Jan scolds Pam. After Jan leaves, Jim confesses to Pam, \"She scares me.\" Pam resumes eating.","elements":[]},{"text":"Dwight explains to the documentary camera that he recently entered into a serious, monogamous relationship. \"If that idiot ever gets here.\"","elements":[]},{"text":"In the kitchen, Jan tells a rambling story, beginning with a childhood friend becoming Miss West Virginia and leading to her bragging about how beautiful she is. Jan pauses and asks Pam, \"What was your question?\" Pam repeats the question: \"Where did you grow up?\"","elements":[]},{"text":"A subplot involving the neighbor's dog:","elements":[{"text":"Michael tells a story of how Jan fell asleep during her Neighborhood Watch shift, and while she was passed out on wine, some local kids spray-painted a swear word on the neighbor's dog, and Jan was blamed.","elements":[]},{"text":"During dinner, Jan gleefully confesses that it was she who spray-painted the dog because it was so smug. \"I held it down with my knee and I just spray-painted it until I was good and done! It bit me on the arm, and I didn't even feel it.\" The other guests are horrified.","elements":[]},{"text":"When the police arrive, Jan rushes outside. The neighbors watch the situation from their front door, with their dog on a leash. The word spray-painted on the dog is blurred out.","elements":[]}]}]}],"images":[]},{"title":"Trivia","level":2,"content":[{"type":"list","elements":[{"text":"B.J. Novak (Ryan Howard) is credited but does not appear in this episode.","elements":[]},{"text":"This episode is widely considered to be one of the series' best, mostly due to the cringe-inducing but hilarious Michael-Jan moments.","elements":[]},{"text":"This episode had been foreshadowed for several episodes. The writers inserted a reference into nearly every episode, but most of them ended up cut.","elements":[{"text":"In Launch Party, Michael invites Jim and Pam to dinner, but Jim says that they \"can't\" and both of them feign disappointment.","elements":[]},{"text":"In Money, Jim and Pam accept Michael's earlier offer to have them over for dinner, knowing that he won't be able to make it.","elements":[]},{"text":"In Women's Appreciation, Michael tells the women how Jan videotapes them having sex and plays it immediately afterwards to \"correct his form\".","elements":[]},{"text":"In Fun Run, Jan gets mad at Pam for walking in on Michael changing. In this episode she continues to be jealous of the relationship between Pam and Michael.","elements":[]}]},{"text":"This was the last episode written before the strike, but due to the cast refusal to cross picket lines, it was not filmed until after the end of the strike.","elements":[]},{"text":"At the Writer's Block segment of the 2007 Office Convention, the writers talked at length about how they would often go grab a Coney Island Hot Dog. The scene was filmed at the Home Plate Burgers restaurant in nearby Reseda. Here's a review and pictures for comparison.","elements":[]},{"text":"The words to the song \"That One Night\" were written by episode writers Lee Eisenberg and Gene Stupnitsky. The music was written and performed by Todd Fancey of the group The New Pornographers.","elements":[{"text":"The song was made available for download by NBC the day after the episode aired. Download it here.","elements":[]}]},{"text":"Every \"babe\" in the episode was scripted.","elements":[]},{"text":"B.J. Novak had an opportunity to talk with Presidential candidate John McCain who had professed his appreciation for The Office during an appearance on The Daily Show (in which he jokingly announced that Dwight Schrute would be his running mate). To determine whether McCain's appreciation for the show was authentic or merely a media image, he asked the candidate what his favorite scene was. McCain said that his favorite joke was the video camera in Michael and Jan's bedroom. Novak was impressed because this was a very quick joke.","elements":[]},{"text":"The script for this episode was included in the Season 4 DVD in limited quantities. It differed from the episode in a few places -","elements":[{"text":"The episode begins with the \"peanut butter in hair\" gag which would be used two episodes later in Night Out - the fake corporate assignment occurs after the opening credits.","elements":[]},{"text":"Instead of bursting into tears because he wasn't invited, Dwight compares it to getting his testicles pulverized by a horse.","elements":[]},{"text":"Michael calls Toby, insults him, and hangs up, followed to Toby implying that this is a very regular occurrence.","elements":[]},{"text":"Rather than painting the dog, Jan had run over and killed it - traumatizing a child who saw the accident - and later confesses that she intentionally ran it down.","elements":[]},{"text":"Michael says \"That's what she said!\" when Jan, responding to \"I'll be your first customer!\", threatens to shove a candle up his ass, rather than bringing up her much more prolific sexual history.","elements":[]},{"text":"During the drive home, Dwight speaks of how \"Men are from Mars, Women are from Venus\", as if he seriously believes this.","elements":[]}]}]}],"images":[]},{"title":"Amusing details","level":2,"content":[{"type":"list","elements":[{"text":"Since most of the action occurs in Michael's condo, this episode can be considered a bottle episode.","elements":[]},{"text":"While Michael is explaining to Dwight why he can't come to the party, people are beginning to leave for the day. After that, Dwight has a talking head interview talking about if not being invited bothered him, and, in the background, Stanley and Creed are hard at work even though Creed left and Stanley was packing up earlier in the scene.","elements":[]},{"text":"When Jim and Pam enter the house, both Jan and Michael hug Jim at the same time. Only Michael hugs Pam though.","elements":[]},{"text":"When Jan explains that the ossobuco will take three hours, Angela stares at her chest disapprovingly.","elements":[]},{"text":"Details in Michael's condo:","elements":[{"text":"There is an Andy Warhol style painting of Jan on the wall along the stairwell. The painting reappears as office art in The Whale; realizing that Jan is the anonymous female executive she and Dwight are trying to sell to, Pam recoils in horror at the sight of it.","elements":[]},{"text":"The arms on the chair in Jan's unused office still have the plastic covers.","elements":[]},{"text":"In Michael and Jan's bedroom is a George Foreman grill, first mentioned in The Injury.","elements":[]},{"text":"In Michael and Jan's bedroom there is a video camera tripod and Jan playfully scolds Michael for not putting it away when they are showing Jim and Pam around the house. This was first mentioned in Women's Appreciation where he tells the office ladies that Jan likes to film them during sex, and then play it back afterwards to help him improve. It is also briefly mentioned that Jan watches the tapes with her therapist.","elements":[{"text":"Pam recoils at the sight of the camera, as Michael told her a long time ago about what Jan does with the camera.","elements":[]}]},{"text":"Michael's garage contains Bowflex and Soloflex machines back-to-back. \"Many of the writers love the idea that Michael is completely taken by late-night infomercials.\"","elements":[]},{"text":"Behind the Bowflex machine in Michael's garage is a painting of dogs playing poker. But not the famous one; a knock-off.","elements":[]},{"text":"Nearly all of the boxes in the garage are of Michael's things; Jan completely took over when she moved in (a deleted scene from The Job had shown Michael watching in horror as she did so). The one exception is boxes of Le Creuset cookware, a high-end brand of kitchenware. Jan prepares the dinner with Le Creuset cookware.","elements":[]},{"text":"Michael has a set of bongo drums in his garage.","elements":[]},{"text":"The bed is completely covered in pillows. No wonder there's no room for Michael.","elements":[]},{"text":"Michael's \"plasma\" television is actually a flat-screen LCD.","elements":[{"text":"The monitor that appears in Jan's office is larger than Michael's TV.","elements":[]},{"text":"When Jan throws the Dundie at Michael's TV, it appears to be smashed. However, when she later is shown gluing the Dundie back together, the TV is shown on and operating fine, albeit with fracture lines on the screen. This is impossible; when an LCD TV is broken, at least some part of the image will become black and various colored lines will generally appear all over the screen.","elements":[]}]},{"text":"Every photo in the condo was of Jan with other men. There were no pictures of Michael.","elements":[]},{"text":"Michael tells Dwight he only has six wine glasses, but there are eleven at the dinner table.","elements":[]}]},{"text":"Andy wore a sweater, with another sweater tied around his neck, with a coat and scarf on top.","elements":[]},{"text":"When Jan turns on Hunter's song, the camera pans to show Angela, Pam, and Jim sitting on the couch. Angela has stood a pillow upright between herself and Pam to keep them from touching.","elements":[]},{"text":"When Michael talks about Jan suing people, we can see her take a wiff of her candle like she said she does earlier in the episode when she is upset.","elements":[]},{"text":"Dwight and his date poured themselves full glasses of wine.","elements":[]},{"text":"Angela covered her plate of food with her napkin, eating none of it. She is a vegetarian.","elements":[]},{"text":"Dwight drove Michael around in his car until he fell asleep, a common trick used to get babies to fall asleep.","elements":[]},{"text":"When Jan and Angela shade Pam for being a \"bad receptionist\/secretary\" the camera pans to Pam's face next to her you can see John Krasinski (Jim) laughing.","elements":[]},{"text":"One of the officers that shows up to respond to the yelling complaints addresses Dwight by name. It is likely that he knows him from when Dwight was a volunteer deputy.","elements":[]},{"text":"In Goodbye, Toby, Michael discovers that Jan is pregnant and it is established that she got pregnant while they were still together. This would mean she was pregnant in this episode although she is seen drinking wine and tells Michael, \"I'm sorry that I don't want to bring kids into this screwed up world!\" when they are arguing about Jan making Michael get a vasectomy.","elements":[]},{"text":"Michael confuses \"aftertaste\" with \"afterbirth\", much to Jim's confusion.","elements":[]},{"text":"The lyrics to \"That One Night\" heavily imply that Jan took Hunter's virginity. It is already suggested that they had an affair while Jan worked at Dunder Mifflin.","elements":[]},{"text":"Dwight and his date even brought their own chairs. They are sitting in fold up lawn chairs.","elements":[]}]}],"images":[]},{"title":"Cultural references","level":2,"content":[{"type":"list","elements":[{"text":"Jim and Pam eat burgers outside a Detroit Coney Island Chili Dogs restaurant. The Coney Island style restaurant originated in Detroit. Its signature dish is the Coney Island hot dog. (Filming location is now a \"Fatburger\" in Reseda, CA)","elements":[]},{"text":"Angela and Andy eat ice cream outside a Cold Stone Creamery ice cream store (the sign is reflected in Andy's windshield).","elements":[]}]}],"images":[]},{"title":"Cast","level":2,"content":[],"images":[]},{"title":"Main Cast","level":3,"content":[{"type":"list","elements":[{"text":"Steve Carell as Michael Scott","elements":[]},{"text":"Rainn Wilson as Dwight Schrute","elements":[]},{"text":"John Krasinski as Jim Halpert","elements":[]},{"text":"Jenna Fischer as Pam Beesly","elements":[]}]}],"images":[]},{"title":"Supporting Cast","level":3,"content":[{"type":"list","elements":[{"text":"Ed Helms as Andy Bernard","elements":[]},{"text":"Leslie David Baker as Stanley Hudson","elements":[]},{"text":"Brian Baumgartner as Kevin Malone","elements":[]},{"text":"Creed Bratton (actor) as Creed Bratton","elements":[]},{"text":"Kate Flannery as Meredith Palmer","elements":[]},{"text":"Melora Hardin as Jan Levinson","elements":[]},{"text":"Mindy Kaling as Kelly Kapoor","elements":[]},{"text":"Angela Kinsey as Angela Martin","elements":[]},{"text":"Paul Lieberstein as Toby Flenderson","elements":[]},{"text":"Oscar Nunez as Oscar Martinez","elements":[]},{"text":"Phyllis Smith as Phyllis Vance","elements":[]}]}],"images":[]},{"title":"Guest Cast","level":3,"content":[{"type":"list","elements":[{"text":"Beth Grant as Dwight's Babysitter","elements":[]},{"text":"Frederik Pohliv as Neighbor","elements":[]},{"text":"Gary Weeks as Cop #1","elements":[]},{"text":"Steve Seagren as Cop #2","elements":[]}]}],"images":[]},{"title":"References","level":2,"content":[{"type":"list","elements":[{"text":"↑ Lee and Gene answer 'Dinner Party' questions","elements":[]},{"text":"↑ Talking with 'Office' Star B.J. Novak, NPR, The Bryant Park Project, May 12, 2008.","elements":[]}]}],"images":[]}]}