{"sections":[{"title":"Double Date","level":1,"content":[{"type":"paragraph","text":"\"Double Date\" is the ninth episode of the sixth season of The Office, and the show's 109th episode overall. It was written by Charlie Grandy and directed by Seth Gordon. It originally aired on November 5, 2009 and was viewed by 7.94 million people."}],"images":[]},{"title":"Synopsis","level":2,"content":[{"type":"paragraph","text":"In a plan to take down Jim Halpert, Dwight brings the whole office bagels so that they will all owe him a favor. Dwight reveals his plan to the documentary crew. He even tries to get Michael and Pam to turn on Jim."},{"type":"paragraph","text":"Meanwhile, Pam and Jim are going on an early lunch with Helene and Michael because it is Helene's birthday, although Pam wishes the relationship would have died out."},{"type":"paragraph","text":"Ryan gets into photography. He takes pictures of \"places with unlikely beauty,\" including a sewer, homeless people, and graffiti. He asks Erin if she has ever been photographed before, and then shows her a topless picture of Kelly, for a series titled Exposure in the Workplace. Erin is seemingly shocked."},{"type":"paragraph","text":"Michael is thrilled that he can prove to Pam on the birthday lunch that he really likes her mom. Angela snidely asks Pam if she's going to introduce the office to \"Michael's girlfriend\". Helene reveals that Michael got her two presents. When Kevin suggests that Helene and Michael had sex, Pam is outraged. As Helene, Jim, Pam, and Michael leave, Pam gets a \"phone call\" and tries to stay at the office by saying to the couple that her client is having a shipping emergency. However, Jim, who is having none of it, takes the phone and acts as if he's resolved the issue; he hangs up and the foursome leave for the double date."},{"type":"paragraph","text":"On the car ride, Pam tells her mother that she likes sales. Helene suggests that Pam's sales are mediocre, and Pam reflects that she shouldn't have gotten in the car."},{"type":"paragraph","text":"While Pam endures the date, Andy repays Dwight by giving him his suitcase back, which he polished. Not to be outdone, they awkwardly keep giving each other little favors on the way back to their desks from the break room. Dwight says that Andy is complicating everything, but that he is not afraid."},{"type":"paragraph","text":"Meanwhile, Pam is shocked when the waitress calls Helene, Michael, Jim and Pam the \"Scott Family.\" She shows open disdain towards Michael in a talking head. It is revealed that Michael decorated the area where the double date takes place, which causes Pam to warm up a bit."},{"type":"paragraph","text":"Michael, however, begins to realize how old Helene is when he says he'd like to go to Italy someday, but instead of echoing his desire she says he can have her guidebooks and that she's \"done with those really long plane rides\". Helene then jokingly says that she is 49 for the 9th year. Michael uses a pen and paper to add 49 and 9; \"you're 54 years old!\" he says when done. Helene corrects him and says she's 58. Michael says in interview that he's not robbing the cradle, he's robbing the grave. Back at the table, he is mortified when Pam and Jim suggest that Helene be called \"grandma\" and he knocks back the rest of his wine. To probe Helene's attitude towards her age, Michael tries to get her to participate in a triathlon. She says no, but she might have done it when she was younger, confirming Michael's fears."},{"type":"paragraph","text":"At Dunder Mifflin, Andy takes \"a page out of the old Schrute book of niceness\" and buys lunch for the whole office. They all eat the tacos, except Angela. Dwight tries to maintain his edge by offering to make everyone's tacos for them."},{"type":"paragraph","text":"Michael begins to signal that he doesn't want to be with Helene. Michael downplays the gift he got Helene - a scrapbook with mementos of their relationship and a cutesy poem -- which Pam, unaware of Michael's change in attitude, calls a \"home run\". Pam and Jim are pleased at Michael, finally."},{"type":"paragraph","text":"After a stop at the bar, Michael says in interview that he thought he was going to grow old with Holly Flax. Then he met Helene and although she already knows and has done everything Michael wants to do, he wants to do those things himself. At the table, Michael tells Helene that he wants her to enjoy her cake before he tells her a \"terrible terrible thing\". Michael then announces he can't continue to date Helene \"in good conscience\" because of Pam's disapproval. Pam tells him that it is okay and that she's come around. Michael abandons that line of argument, and instead breaks up with Helene by telling her, in essence, that she is too old for him. Pam is angry, and Helene is seemingly ruined by the news."},{"type":"paragraph","text":"While Helene tries to get over the breakup, Dwight continues to help Andy, assisting him get something off a high shelf only to realize that it is in fact a gift for him (a $15 Starbucks gift card from the whole office)."},{"type":"paragraph","text":"Michael, bribing Pam, offers to give her a raise on the condition that she stops being mad. When she's not happy with that, Michael invites Pam to hit him, and Pam says she will. She tells him that she will hit him that day after work, in the parking lot, as hard as she can, in front of everyone."},{"type":"paragraph","text":"Kelly and Ryan come to see Michael and to tell him that he is going to get punched hard. Nervously, Michael goes to Jim to ask him to stop Pam, but Jim toys with Michael, saying he needs some time to make a decision about it; \"no more than a week... maybe two weeks\"."},{"type":"paragraph","text":"Toby talks to Pam and tells her that the punch needs to be off company property. He then advises her on how to punch with more force."},{"type":"paragraph","text":"The whole office waits outside to see Pam punch Michael, who is late. Once he shows up and says he's ready, as he's about to be hit he keeps wincing and blocking the anticipated punch with his hands. Michael then tells Pam that he is sorry, and after extracting some clarification on what he's sorry for, Pam lets him off the hook, warning him never to date a family member of hers again. He says okay, but as Pam turns away, he tries to get the last word by saying that \"for the record\" Helene came onto him. Pam abruptly turns around and slaps him hard, drawing a shocked reaction from the gathered crowd. Pam asks Michael if he is okay, but when he says \"no!\" like a crybaby, she brushes him off and walks away. Jim asks Pam if she feels better, but she says \"no, you were right\"."},{"type":"paragraph","text":"Afterward, Dwight aids Michael by holding a frozen chicken part against his swollen cheek. Michael tells Dwight he owes him one. Dwight, not missing a beat, tells Michael he's cashing in the favor and that he wants Michael to fire Jim and promote him to \"tri-managers\". Michael refuses, and Dwight storms off, chicken in hand."}],"images":[]},{"title":"Cultural references","level":2,"content":[{"type":"list","elements":[{"text":"When Dwight and Andy yell, Caka, Caka, KY, it is from a Taco Bell commercial.","elements":[]},{"text":"Michael's poem was based on a poem by Shel Silverstein.","elements":[]},{"text":"\"Kafkaesque\" is an eponym used to describe concepts, situations, and ideas which are reminiscent of the literary work of Prague writer Franz Kafka, particularly his novels The Trial and The Castle, and the novella The Metamorphosis.","elements":[]},{"text":"A hover car is a futuristic car that is supposed to be made in the future. It is a large part of science fiction.","elements":[]}]}],"images":[]},{"title":"Amusing details","level":2,"content":[{"type":"list","elements":[{"text":"Dwight mentions that fish sticks are not an aphrodisiac. An aphrodisiac is a substance that is used in the belief that it increases sexual desire. Foods such as artichokes, ginseng, and truffles are supposed to be aphrodisiacs.","elements":[]},{"text":"The trees in the background are orange and yellow, similar to what Scranton would look like in the fall.","elements":[]},{"text":"The restaurant the double date takes place in is Paparazzo's, an Italian restaurant. The restaurant is not known to be in Scranton.","elements":[]},{"text":"Angela, a strict vegetarian, doesn't eat the tacos.","elements":[]},{"text":"Since the episode Launch Party, Michael has wanted to be friends with Jim and Pam, and continues to try to invite them on a double date, or in Dinner Party, a triple date (Jim and Pam, Michael and Jan, and Andy and Angela) with Dwight and his babysitter barging in.","elements":[]},{"text":"In a deleted scene when Michael is driving the group home, out the window several palm trees can be seen growing along with other trees, very un-Scranton like and further evidence that this is filmed in California rather than Pennsylvania.","elements":[]},{"text":"When Ryan and Kelly question Michael about \"The Punch\", Ryan has a camera around his neck. Earlier in the episode Ryan revealed to Erin that he is photographing a series on \"Exposure in the Workplace\". The implication is that Ryan was recently taking more nude photos of Kelly that day.","elements":[]},{"text":"When Pam tries to get out of lunch with Michael and Helene by getting a fake call about a shipping problem, Jim undoes her trick. In Dinner Party, Jim tries to leave Michael and Jan’s dinner party early by faking a phone call that said that his apartment was flooded. Pam reverses his scheme then. This is likely payback for her.","elements":[]},{"text":"Pam says Michael locked himself in his office all morning to work on Helene's present. However, in the cold open, Dwight comes in to give him a bagel, the door wasn't locked, and he doesn't appear to be doing much.","elements":[]},{"text":"In a talking head interview, Michael says his life flashed before his eyes, saying he saw his future. Normally, you would see what has already happened so far when your life flashes before your eyes.","elements":[]}]}],"images":[]},{"title":"Connections to previous episodes","level":2,"content":[{"type":"list","elements":[{"text":"In a deleted scene in the \"Pilot,\" Angela tells the documentary crew that Phyllis likes cats too. In this episode, a picture of a black cat is seen sitting on her desk.","elements":[]},{"text":"In \"Office Olympics\", Michael angrily tells Dwight, \"I'm not going to date a 55-year-old woman.\" In this episode, he breaks up with Helene because of her age.","elements":[]},{"text":"In \"Casual Friday\" Michael makes a scrapbooked poster of The Michael Scott Paper Company. In this episode, he makes a scrapbook for Helene. In Women's Appreciation, Michael says that he's happy with Jan \"sometimes, like when we're scrapbooking...\"","elements":[]},{"text":"This is not the first time Michael has been slapped by a coworker. The first time was by Kelly in \"Diversity Day\".","elements":[]},{"text":"In this episode, the parking lot is considered to be off of company property, but in \"Fun Run\", when Michael hits Meredith with his car in the parking lot, it is considered company property.","elements":[]}]}],"images":[]},{"title":"Andy and Dwight's favors","level":2,"content":[{"type":"list","elements":[{"text":"Dwight buys the whole office genuine New York bagels.","elements":[]},{"text":"Andy refurbishes Dwight's briefcase in return.","elements":[]},{"text":"Dwight gets the door for Andy, and in return, Andy does the same.","elements":[]},{"text":"Dwight tells Andy that \"if you clench your buttocks together then you will take pressure off of your knees\", and welcomes Andy to use the tip whenever.","elements":[]},{"text":"Andy fixes Dwight's jacket then Dwight fixes Andy's bow tie. In return, Andy fixes Dwight's glasses.","elements":[]},{"text":"Dwight gets a chair for Andy, and Andy gets a chair for Dwight afterward.","elements":[]},{"text":"Dwight changes the batteries in Andy's wireless mouse.","elements":[]},{"text":"Andy buys the whole office tacos and Dwight serves them to the employees.","elements":[]},{"text":"Dwight cleans up lunch.","elements":[]},{"text":"Dwight gets Andy's \"thing\" on top of the shelf, only to realize that it is a gift card from Andy and the whole office.","elements":[]}]}],"images":[]},{"title":"Cast","level":2,"content":[],"images":[]},{"title":"Main cast","level":3,"content":[{"type":"list","elements":[{"text":"Steve Carell as Michael Scott","elements":[]},{"text":"Rainn Wilson as Dwight Schrute","elements":[]},{"text":"John Krasinski as Jim Halpert","elements":[]},{"text":"Jenna Fischer as Pam Halpert","elements":[]},{"text":"B.J. Novak as Ryan Howard","elements":[]}]}],"images":[]},{"title":"Supporting cast","level":3,"content":[{"type":"list","elements":[{"text":"Ed Helms as Andy Bernard","elements":[]},{"text":"Leslie David Baker as Stanley Hudson","elements":[]},{"text":"Brian Baumgartner as Kevin Malone","elements":[]},{"text":"Creed Bratton (actor) as Creed Bratton","elements":[]},{"text":"Kate Flannery as Meredith Palmer","elements":[]},{"text":"Mindy Kaling as Kelly Kapoor","elements":[]},{"text":"Ellie Kemper as Erin Hannon","elements":[]},{"text":"Angela Kinsey as Angela Martin","elements":[]},{"text":"Paul Lieberstein as Toby Flenderson","elements":[]},{"text":"Oscar Nunez as Oscar Martinez","elements":[]},{"text":"Phyllis Smith as Phyllis Vance","elements":[]}]}],"images":[]},{"title":"Recurring cast","level":3,"content":[{"type":"list","elements":[{"text":"Linda Purl as Helene Beesly","elements":[]}]}],"images":[]},{"title":"Guest cast","level":3,"content":[{"type":"list","elements":[{"text":"Katharine Leonard as Chloe","elements":[]},{"text":"Melinda Haugh as Waitstaff #1 (uncredited)","elements":[]},{"text":"Kristin Millian as Waitstaff #2 (uncredited)","elements":[]},{"text":"Aaron Pushkar as Bartender (uncredited)","elements":[]}]}],"images":[]}]}