{"sections":[{"title":"Dunder Mifflin Infinity","level":1,"content":[{"type":"paragraph","text":"For other uses, see Dunder Mifflin Infinity (disambiguation)."},{"type":"paragraph","text":"\"Dunder Mifflin Infinity\" is the third and fourth episode of the fourth season of The Office and is the 56th and 57th episode overall. It was written by Michael Schur and directed by Craig Zisk. It first aired on October 4, 2007. It was viewed by 8.49 million people."}],"images":[]},{"title":"Synopsis","level":2,"content":[{"type":"paragraph","text":"Toby sees Jim and Pam kiss secretly in the break room, and fires off an unsolicited memo warning about public displays of affection within the office. The entire office immediately speculates on the reason for the notice. Toby (whose crush on Pam has been previously established) tells everyone it's because of Jim and Pam, apparently in an attempt to shame them. This effectively forces them to confirm their relationship, and to Toby's surprise, all of the other workers are ecstatic. Jim and Pam later ask Toby whether they need to file the same paperwork Michael and Jan once had, but Toby tries to put it off, hoping the relationship won't last."},{"type":"paragraph","text":"Ryan Howard returns to the Scranton branch of Dunder Mifflin for the first time since his promotion, sporting a much more urbane look and attitude (which does not prevent him from receiving a noogie from Kevin). He convenes a meeting to inform the staff about \"Dunder Mifflin Infinity,\" his initiative to revitalize the company with new technology. Michael is initially excited about the prospect of getting a BlackBerry, but is warned by Creed that the purpose of the program is really to get rid of older workers."},{"type":"paragraph","text":"Kelly tries to restart her relationship with Ryan, an effort he ignores until she (untruly) tells him she's pregnant. He agrees to discuss the situation over dinner that night. Jim informs Pam that Dwight and Angela are secretly dating, only to discover that she has known this for quite some time. Meanwhile, Dwight attempts to make amends for the death of Angela's cat Sprinkles by giving her a stray cat he found in his barn. Dwight's cousin Mose named the cat Garbage because that's what it eats. Angela rejects the gift, and Dwight attempts to dump the cat into the office of Vance Refrigeration."},{"type":"paragraph","text":"Creed dyes his hair jet-black (using ink cartridges) in an attempt to convince everyone that he's much younger. After a conversation with Jan, Michael decides to formally challenge Dunder Mifflin Infinity by claiming that Ryan is being ageist. Michael brings the octogenarian co-founder of Dunder Mifflin into a meeting to make his point about old things still being useful, but shoves Dunder out after tiring of his rambling stories. Angela asks Dwight out to dinner, where she breaks up with him, saying that she can't look into Dwight's eyes without seeing Sprinkles' corpse."},{"type":"paragraph","text":"To show that personal interaction is more effective than new technology, Michael decides to go out and win back the clients they lost in the past year with gift baskets. Dwight insists on going with him. Each manager they encounter refuses to consider returning to Dunder Mifflin unless the company improves its technology."},{"type":"paragraph","text":"Michael misinterprets his rental car's GPS map system's directions and ends up driving into Lake Scranton. He takes this as further proof that new technology is useless because it \"tried to kill him\". After the lake incident, he and Dwight walk back to one of the former clients to awkwardly get back their gift basket, causing a scene."},{"type":"paragraph","text":"Ryan learned during the previous night's dinner that Kelly's pregnancy claim was a lie. Back at the office, Ryan asks Pam to create a logo for Dunder Mifflin Infinity. Pam is excited about the opportunity to use her art background, but Ryan uses the logo as an excuse to ask her out, which he does in front of Jim. Pam responds that she's dating Jim, which leaves the new boss thoroughly embarrassed."}],"images":[]},{"title":"Trivia","level":2,"content":[{"type":"list","elements":[{"text":"After the episode aired, NBC launched the Dunder Mifflin Infinity online game, where fans can join virtual Dunder Mifflin branches and participate in various tasks to earn Schrute Bucks.","elements":[]},{"text":"The character of Amy, Toby's new girlfriend, is played by actor Paul Lieberstein's real-life then-girlfriend (now wife), Janine Poreba.","elements":[]},{"text":"This is the final episode of the series in which Kate Flannery does not appear as Meredith Palmer.","elements":[]}]}],"images":[]},{"title":"Interesting notes","level":2,"content":[{"type":"list","elements":[{"text":"The two founders of Dunder Mifflin have the same first name, Robert.","elements":[]},{"text":"Dwight says that his grandfather's name is Manheim; in a deleted scene from the Pilot, he said his grandfather's name was Dweide Schrude. Dweide Schrude is his father's father and Manheim his mother's father.","elements":[]},{"text":"This is the first of two episodes where Michael ends up soaking wet. The other is \"Koi Pond\".","elements":[]},{"text":"When Michael tells Dwight to hang up the phone Dwight does so immediately and without question. This shows Dwight's loyalty and trust in Michael.","elements":[]},{"text":"After Michael drives his car into the lake, he is briefly seen opening the back door so that the cameraman could get out.","elements":[]},{"text":"The cameraman's shadow can be seen in the lake when they're all on shore safely.","elements":[]}]}],"images":[]},{"title":"Amusing Details","level":2,"content":[{"type":"list","elements":[{"text":"As Dwight talks to Angela at her desk, the white board calendar behind her shows some interesting entries: On the \"10th\" Ryan covers reception and Karen is included in flex time. Neither Ryan nor Karen are employees of the Scranton branch at this time.","elements":[]},{"text":"On the same calendar, the writing on the \"4th\" reads: \"In case you haven't noticed, there's a lot of colorful hooey on the board!\" Each word is written in a different color.","elements":[]},{"text":"One of the dates on the calendar says \"Anger Management Appreciation Day.\"","elements":[]},{"text":"The calendar also says there is a sales staff meeting with Michael at 8 AM, however it is stated multiple times in the series that work at Dunder Mifflin is from 9 AM to 5 PM.","elements":[]},{"text":"Jim points out that Michael uses the same photo from Big that he used in The Injury.","elements":[]},{"text":"When Michael notes all the ink in the printer is gone, Creed smiles, implying that he used the ink to dye his hair black.","elements":[]},{"text":"As they are exiting the sinking rental car after Michael drives it into a lake, Dwight warns to \"look out for leeches!\" This is amusing on several levels: it is a non sequitur, as their most urgent priority is simply escaping the car; leeches are not life-threatening, and regardless are not commonly found in suburban lakes in the US; and both Michael and Dwight are fully clothed, making a successful leech \"attack\" improbable to begin with. It also calls into question the value and relevance of Dwight's \"training\" for emergencies of this sort, which he asserted moments before.","elements":[]},{"text":"Michael uses 'vis-a-vis' when talking to Ryan, a reflection of his British counterpart David Brent (Ricky Gervais).","elements":[]},{"text":"When Ryan and Kelly are arguing he claims that Karen sent him an email asking him out, and he turned her down because he's committed to their relationship. This is a lie. Ryan dumped Kelly immediately after receiving news of his promotion. It was revealed in the episode Women's Appreciation that he was the one to ask Karen out via email and be rejected.","elements":[]},{"text":"When Phyllis talks to Pam and Jim in the break room, a yellow employee information poster with the Warner Brothers logo can be seen in the background","elements":[]},{"text":"When Robert Dunder is discussing Mifflin going out to dinner with Beverly, and attempts to recall Beverly’s husband’s name, and he states such as “Jerry Troupiano” from South Jersey. This could be a possible reference to Joey Tribbiani from Friends.","elements":[]},{"text":"Ryan looks at the pictures of old people on the wall, slowly realizing from his time at the Scranton branch that he was about to do an appreciation seminar similar to the one from \"The Injury.\"","elements":[]}]}],"images":[]},{"title":"Cultural references","level":2,"content":[{"type":"list","elements":[{"text":"When Michael holds his ceremony to honor Jim and Pam, he says, \"This is a day which will live in Infamy\". Michael makes a reference to FDR's 'A Day In Infamy' speech, which was made after the events of Pearl Harbor.","elements":[]},{"text":"Michael says they had a foreign exchange student when he was younger that returned to what was known as Yugoslavia. Yugoslavia disbanded into many countries in Europe, including Bosnia and Herzegovina, Croatia, Serbia, and Montenegro.","elements":[]},{"text":"Dwight's grandfather lives in Argentina but Dwight's attempt to visit him was protested by the Shoah Foundation. Shoah foundations are organizations furthering the remembrance of the Holocaust. This follows the theme that Dwight's family has ex-Nazis in it. Josef Mengele, Adolf Eichmann and other high-ranking Nazis fled to Argentina following World War II; a popular myth is that Hitler also escaped to Argentina.","elements":[]},{"text":"Pierce Brosnan is an Irish actor most famous for playing the part of James Bond.","elements":[]}]}],"images":[]},{"title":"Cast","level":2,"content":[],"images":[]},{"title":"Main cast","level":3,"content":[{"type":"list","elements":[{"text":"Steve Carell as Michael Scott","elements":[]},{"text":"Rainn Wilson as Dwight Schrute","elements":[]},{"text":"John Krasinski as Jim Halpert","elements":[]},{"text":"Jenna Fischer as Pam Beesly","elements":[]},{"text":"B.J. Novak as Ryan Howard","elements":[]}]}],"images":[]},{"title":"Supporting cast","level":3,"content":[{"type":"list","elements":[{"text":"Ed Helms as Andy Bernard","elements":[]},{"text":"Melora Hardin as Jan Levinson","elements":[]},{"text":"Leslie David Baker as Stanley Hudson","elements":[]},{"text":"Brian Baumgartner as Kevin Malone","elements":[]},{"text":"Creed Bratton as Creed Bratton","elements":[]},{"text":"Mindy Kaling as Kelly Kapoor","elements":[]},{"text":"Angela Kinsey as Angela Martin","elements":[]},{"text":"Paul Lieberstein as Toby Flenderson","elements":[]},{"text":"Oscar Nunez as Oscar Martinez","elements":[]},{"text":"Phyllis Smith as Phyllis Vance","elements":[]}]}],"images":[]},{"title":"Guest cast","level":3,"content":[{"type":"list","elements":[{"text":"John Ingle as Robert Dunder","elements":[]},{"text":"Kevin Dorff as Aaron Grandy","elements":[]},{"text":"Edward James Gage as Larry Meyers","elements":[]}]}],"images":[]}]}