{"sections":[{"title":"Employee Transfer","level":1,"content":[{"type":"paragraph","text":"\"Employee Transfer\" is the sixth episode of the fifth season of The Office and the 78th episode overall. It was written by Anthony Farrell and directed by David Rogers. It first aired October 30, 2008. It was viewed by 9.32 million people."}],"images":[]},{"title":"Summary","level":2,"content":[{"type":"paragraph","text":"Pam is embarrassed when she is the only person at corporate wearing a costume on Halloween. Pam's intended costume is Charlie Chaplin, since her mustache was applied with grease paint. She shows annoyance that she cannot remove her hat, since she then resembles Adolf Hitler. In Scranton, Stanley wears a Creature from the Black Lagoon mask in order to sleep at work and not get caught while Creed, Kevin and Dwight dress up as Heath Ledger's version of the Joker from The Dark Knight."},{"type":"paragraph","text":"Kelly dresses up as Carrie Bradshaw from Sex and the City, and Ryan tries to woo her. Ryan dresses as Gordon Gekko from the film Wall Street, which Kelly associates with the GEICO gecko. Oscar dresses up like Uncle Sam, Meredith is a cheerleader, Phyllis is Raggedy Ann, and Andy is Rum Tum Tugger from the Broadway show Cats. Angela is in the same kitten outfit as she was in Halloween. Jim's outfit is minimalist as usual, dressing up as a guy named \"Dave\" (a costume consisting of his normal attire, with a name tag)."},{"type":"paragraph","text":"Holly has been transferred back to her old branch in Nashua, New Hampshire after CFO David Wallace discovered her relationship with Michael. Michael and Darryl help her move using Darryl's truck. Michael and Holly want to continue their relationship, but as they get closer to Nashua, Holly starts to come to the realization that their relationship is not going to work with the long distance, citing the seven hour drive. Michael continuously begs her to keep their relationship alive as he fears he will go back to Jan."},{"type":"paragraph","text":"Michael had originally intended to spend the weekend with Holly before heading back to Scranton, but after they move her stuff into her new house, he changes his mind and decides to head back with Darryl. Michael and Holly share one last embrace before he leaves. In the truck, Darryl tries to console Michael by teaching him to sing the blues, which Michael does not understand but ultimately joins in."},{"type":"paragraph","text":"Jim meets Pam in New York for lunch with his brothers, Tom and Pete. Pam, Tom, and Pete arrive early to discuss a prank Pam wants to play on Jim that involves her engagement ring. Tom and Pete, however, think of playing a prank involving her interest in art, which she agrees to, though she appears to be mildly offended. When Jim arrives, Tom and Pete begin mocking Pam's interest in art, and Jim continuously comes to her defense."},{"type":"paragraph","text":"When the argument becomes heated, Tom and Pete reveal it was a prank, and Jim and Pam stare awkwardly at each other. Later, when Jim and Pam are walking outside of the restaurant, Pam explains her original idea for the prank, which Jim appreciates much more than his brothers' idea. Moments later, Jim receives a text message from his brother stating his approval of Pam and welcoming her to the family."},{"type":"paragraph","text":"Meanwhile, back in Scranton, Dwight comes in wearing a Cornell sweatshirt, which irritates Andy, who thinks Dwight is mocking him. Dwight tries to talk about Cornell with Andy and tells him that he is going to apply there. He further installs a Cornell pennant and a Cornell mascot bobblehead in his area. Unable to take any more of Dwight's mocking, Andy calls the university and is given permission to give Dwight his interview for admission."},{"type":"paragraph","text":"Andy has no intention of allowing Dwight to pass, but during the interview, Dwight notices inconsistencies with Andy's questions such as asking who was Cornell's eighth president, which Dwight answers correctly as Dale R. Corson, but Andy replies that Cornell's seventh president was James A. Perkins. Then Dwight starts writing down his critique of Andy's interviewing skills, which he tells him he is going to send to the university. Dwight additionally gets to Andy by proclaiming his newfound desire to change his application to the \"vastly superior Dartmouth,\" which becomes the last straw for Andy."},{"type":"paragraph","text":"After a heated physical struggle with the conference room table, Andy gives up. At the end of the episode, Andy comes into the office in overalls, a farmer's hat, and a basket of beets, saying he is starting his own beet farm, hence trying to be like Dwight. Dwight, however, is quick to point out Andy's knowledge of beets, or lack thereof. Through the day Angela is seen to be annoyed by both Andy and Dwight's antics, but does not speak up against either one."}],"images":[]},{"title":"Trivia","level":2,"content":[{"type":"list","elements":[{"text":"The scene in New York City with Jim's brothers was filmed at the East 3rd Steakhouse and Lounge in Los Angeles.","elements":[]},{"text":"Andy and Dwight mimicking each other at the beginning and end of the episode is similar to Dwight and Jim doing the same in Product Recall. In both episodes, the first imitator leaves the victim so frustrated that the latter humiliates himself with an attempt at payback.","elements":[]},{"text":"On the drive back from Nashua, Michael and Darryl are headed south but it appears as if the sun is setting in the east.","elements":[]},{"text":"Michael and Holly say that the trip from Scranton, PA to Nashua, NH will take 7 hours. According to Google Maps, the fastest route between the two cities is about 4 hours and 45 minutes, although there is a second route which takes about 5 hours. This could be accounted for by the fact that Michael, Holly, and Darryl travel in Darryl's work truck, which is loaded with all of Holly's possessions, and thus would need to drive at slower speeds, thus lengthening the trip.","elements":[]},{"text":"Ryan's Gordon Gekko costume is humorous considering Ryan was also arrested for fraud.","elements":[]}]}],"images":[]},{"title":"Cultural References","level":2,"content":[{"type":"list","elements":[{"text":"Creed, Dwight and Kevin dress up as Heath Ledger's version of The Joker from The Dark Knight, the sequel to Batman Begins, while Creed has the most impressive costume.","elements":[]},{"text":"Kelly dresses as Carrie Bradshaw from Sex and the City.","elements":[]},{"text":"Pam dresses up as Charlie Chaplin and points out that without her hat she looks like Adolf Hitler.","elements":[]},{"text":"Ryan dresses up as Gordon Gekko from Wall Street, though Kelly confuses that with the GEICO Gecko.","elements":[]},{"text":"Andy dresses up as a Rum Tum Tugger from the musical Cats.","elements":[]},{"text":"Phyllis is dressed as Raggedy Ann, and Meredith is wearing a cheerleader costume.","elements":[]},{"text":"Oscar dresses up as Uncle Sam.","elements":[]}]}],"images":[]},{"title":"Connections to Previous Episodes","level":2,"content":[{"type":"list","elements":[{"text":"While in Darryl's truck, Michael and Holly play with the radio until Darryl yells at them to stop. In The Negotiation, while Michael is in Darryl's truck, he jokes about playing with the radio and then promises not to touch it. ","elements":[]}]}],"images":[]},{"title":"Amusing Details","level":2,"content":[{"type":"list","elements":[{"text":"Jim's brothers both look at the camera with comedic facial expressions and mannerisms similar to Jim's.","elements":[]},{"text":"Darryl's front license plate has a sticker that says Rock 107, which is a real Scranton radio station.","elements":[]}]}],"images":[]},{"title":"Cast","level":2,"content":[],"images":[]},{"title":"Main Cast","level":3,"content":[{"type":"list","elements":[{"text":"Steve Carell as Michael Scott","elements":[]},{"text":"Rainn Wilson as Dwight Schrute","elements":[]},{"text":"John Krasinski as Jim Halpert","elements":[]},{"text":"Jenna Fischer as Pam Beesly","elements":[]},{"text":"B.J. Novak as Ryan Howard","elements":[]}]}],"images":[]},{"title":"Supporting Cast","level":3,"content":[{"type":"list","elements":[{"text":"Ed Helms as Andy Bernard","elements":[]},{"text":"Leslie David Baker as Stanley Hudson","elements":[]},{"text":"Brian Baumgartner as Kevin Malone","elements":[]},{"text":"Creed Bratton (actor) as Creed Bratton","elements":[]},{"text":"Kate Flannery as Meredith Palmer","elements":[]},{"text":"Mindy Kaling as Kelly Kapoor","elements":[]},{"text":"Angela Kinsey as Angela Martin","elements":[]},{"text":"Oscar Nunez as Oscar Martinez","elements":[]},{"text":"Craig Robinson as Darryl Philbin","elements":[]},{"text":"Phyllis Smith as Phyllis Vance","elements":[]}]}],"images":[]},{"title":"Special Guest Star","level":3,"content":[{"type":"list","elements":[{"text":"Amy Ryan as Holly Flax","elements":[]}]}],"images":[]},{"title":"Recurring Cast","level":3,"content":[{"type":"list","elements":[{"text":"Calvin Tenner as Calvin (Uncredited)","elements":[]}]}],"images":[]},{"title":"Guest Cast","level":3,"content":[{"type":"list","elements":[{"text":"Tug Coker as Pete Halpert","elements":[]},{"text":"Blake Robbins as Tom Halpert","elements":[]}]}],"images":[]}]}