{"sections":[{"title":"Free Family Portrait Studio","level":1,"content":[{"type":"paragraph","text":"\"Free Family Portrait Studio\" is the 24th and final episode of the 8th season, and the 176th episode overall. It was written and directed by B.J. Novak. In the episode, Andy stages a coup to win his job back with the help of David Wallace. It is the final episode to feature Gabe Lewis as a regular character, and Robert California as a whole."}],"images":[]},{"title":"Plot","level":2,"content":[{"type":"paragraph","text":"Dwight announces that he has set up a studio in the office that takes family portraits for free. Jim is convinced that this is a way for Dwight to enact his revenge on Jim for his pranks, and tells Pam to not bring their children in. Several employees use this opportunity to take family portraits including Creed, Stanley, Meredith, Kelly, and Toby. Senator Lipton, Angela's husband, also brings in Phillip for a family photo. Dwight attempts to take DNA samples of Phillip to prove that he is the father of Phillip. Dwight fails initially, but later steals Phillip's soiled diaper. Angela then pursues Dwight in a car chase. However, Dwight has already positioned Mose in an identical car to his at an intersection. Dwight drives into the intersection and hides, while Mose drives off in the identical car, causing Angela to chase Mose instead. She catches up to Mose and forces him to give her the location of Dwight, which he eventually does. Angela finds Dwight in a hospital with the diaper already given to the doctors. She accepts this, and strokes Dwight's hand. They then kiss passionately."},{"type":"paragraph","text":"Meanwhile, an unshaved and seemingly drunk Andy returns to the office and begs Nellie for a job. Nellie lets Andy clean the carpet which he proceeds to do using a mop. Through an interview, it is revealed that Andy is actually staging his appearance in order create a \"delicious\" moment for himself when David Wallace comes and gives Andy his old manager position back. Andy continues to pretend as if he is a broken man, spilling soup all over his jumpsuit and talking in a slurred voice. Soon however, Andy receives a call from David and learns that he is stuck in traffic and may not be able to make it to the office. Nevertheless, Andy pressures David to come. Andy then reveals his true intentions to the office, but they regard him as crazy. David arrives later and announces that he has bought Dunder Mifflin, and that Andy is once again the manager of the Scranton Branch. But before Andy can have his \"delicious\" moment, he is cut off repeatedly and ignored. David then discusses some official business with Robert, and Robert announces that he is leaving the office in pursuit of a new business opportunity that seeks to provide African, Asian, and Eastern European women gymnasts with education all the way through college. Andy takes his office back from Nellie, and Nellie asks for mercy from Andy. Andy hires Nellie back into the office."},{"type":"paragraph","text":"Glenn and Hide, two warehouse workers that left Dunder Mifflin after winning the lottery, return to Darryl asking for their jobs back after their investment in an energy drink for Asian homosexuals failed. Darryl gives them their jobs back and introduces them to Val, complimenting her repeatedly. Val's boyfriend notices this and confronts Darryl, who responds by admitting his attraction to Val. Later, while Darryl is taking a photo with his daughter in the family portrait studio, Val comes and holds Darryl's hand."},{"type":"paragraph","text":"At the end of the episode, Oscar is at the cafe in the building's lobby when Senator Lipton appears from the elevator. Lipton confronts Oscar about Oscar having not called him since the fundraiser. Oscar attempts to make up an excuse, but Lipton interrupts him, saying, \"You know what this is about.\" He then gives Oscar a suggestive look and whispers \"call\" before walking out. Oscar is visibly shocked, but pleased."}],"images":[{"src":"https:\/\/vignette.wikia.nocookie.net\/theoffice\/images\/2\/2e\/Creed_fam_port.jpg\/revision\/latest\/scale-to-width-down\/180?cb=20140725071318","caption":"Creed getting his family portrait"}]},{"title":"Cultural references","level":2,"content":[{"type":"list","elements":[{"text":"In the cold open, Oscar tries to record a video for the It Gets Better Project.","elements":[]},{"text":"Brandon calls Darryl \"Biggie\", a reference to the rapper The Notorious B.I.G..","elements":[]},{"text":"MVP is short for Most Valuable Player.","elements":[]}]}],"images":[]},{"title":"Connections to previous episodes","level":2,"content":[{"type":"list","elements":[{"text":"Several characters that have not been seen since Take Your Daughter To Work Day in season 2, make a reappearance. These include Meredith's son Jake and Toby's daughter Sasha.","elements":[]},{"text":"The toy duck in the photo shoot is the same duck that Toby won for Pam in Cocktails. It also appears in a very quick shot from Stress Relief.","elements":[]},{"text":"Darryl's daughter Jada also makes a reappearance. She was last seen in Search Committee.","elements":[]},{"text":"The energy drink for Asian homosexuals was first referenced in Lotto.","elements":[]}]}],"images":[]},{"title":"Amusing details\/Trivia","level":2,"content":[{"type":"list","elements":[{"text":"We get to see Creed's very old parents, when he sits and smiles with them like a little boy for a family photo.","elements":[]},{"text":"This is the first time Stanley's other daughter makes an appearance, but her name is still not revealed.","elements":[]},{"text":"Robert kissing Andy on the lips reflects his views about sexuality being a spectrum among other similar views.","elements":[]},{"text":"The rumor that Robert's name is actually Bob Kazamakis is entirely feasible. \"Bob\" is a common shortening of \"Robert\", and he likely goes by the surname \"California\" as it possesses more of a star quality than an obscure surname such as \"Kazamakis\".","elements":[]},{"text":"Nate removes the Sabre sign which was mounted under the Dunder Mifflin sign in Sabre.","elements":[]}]}],"images":[]},{"title":"Cast","level":2,"content":[],"images":[]},{"title":"Main Cast","level":3,"content":[{"type":"list","elements":[{"text":"Rainn Wilson as Dwight Schrute","elements":[]},{"text":"John Krasinski as Jim Halpert","elements":[]},{"text":"Jenna Fischer as Pam Halpert","elements":[]},{"text":"B.J. Novak as Ryan Howard","elements":[]},{"text":"Ed Helms as Andy Bernard","elements":[]},{"text":"James Spader as Robert California","elements":[]}]}],"images":[]},{"title":"Supporting Cast","level":3,"content":[{"type":"list","elements":[{"text":"Catherine Tate as Nellie Bertram","elements":[]},{"text":"Leslie David Baker as Stanley Hudson","elements":[]},{"text":"Brian Baumgartner as Kevin Malone","elements":[]},{"text":"Creed Bratton (actor) as Creed Bratton","elements":[]},{"text":"Kate Flannery as Meredith Palmer","elements":[]},{"text":"Mindy Kaling as Kelly Kapoor","elements":[]},{"text":"Ellie Kemper as Erin Hannon","elements":[]},{"text":"Angela Kinsey as Angela Martin","elements":[]},{"text":"Paul Lieberstein as Toby Flenderson","elements":[]},{"text":"Oscar Nunez as Oscar Martinez","elements":[]},{"text":"Craig Robinson as Darryl Philbin","elements":[]},{"text":"Phyllis Smith as Phyllis Vance","elements":[]},{"text":"Zach Woods as Gabe Lewis","elements":[]}]}],"images":[]},{"title":"Recurring Cast","level":3,"content":[{"type":"list","elements":[{"text":"Jack Coleman as Robert Lipton","elements":[]},{"text":"Sendhil Ramamurthy as Ravi","elements":[]},{"text":"Andy Buckley as David Wallace","elements":[]},{"text":"Ameenah Kaplan as Val","elements":[]},{"text":"Mark Proksch as Nate","elements":[]},{"text":"Joanne Carlsen as Teri Hudson","elements":[]},{"text":"Spencer Daniels as Jake Palmer","elements":[]},{"text":"Delaney Ruth Farrell as Sasha Flenderson","elements":[]},{"text":"Taylar Hollomon as Jada","elements":[]},{"text":"Hideotoshi Imura as Hidetoshi Hasagawa","elements":[]},{"text":"Jerry C. Minor as Brandon","elements":[]},{"text":"Michael Schur as Mose Schrute","elements":[]},{"text":"Calvin Tenner as Glenn","elements":[]}]}],"images":[]},{"title":"Guest Cast","level":3,"content":[{"type":"list","elements":[{"text":"Julie Dove as Photographer Toni","elements":[]}]}],"images":[]}]}