{"sections":[{"title":"Get the Girl","level":1,"content":[{"type":"paragraph","text":"\"Get the Girl\" is the nineteenth episode of the eighth season of the American television comedy series The Office and is the show's 171st overall. It was written by Charlie Grandy and directed by Rainn Wilson. It originally aired on NBC March 15, 2012. It was viewed by 4.87 million people."}],"images":[]},{"title":"Synopsis","level":2,"content":[{"type":"paragraph","text":"Andy drives all the way to Florida to try and woo back Erin, where she has been living with the elderly Irene and her middle-aged grandson, Glenn (Brad Morris), as a live-in maid. He surprises Erin by popping out of a delivery box and singing \"Signed, Sealed, Delivered I'm Yours\", but she is not particularly excited to see him and states she does not want to go back to Scranton with him. The situation is further complicated when Andy reveals to Erin that he has not yet broken up with current girlfriend, Jessica. Andy tells Erin he loves her, but she rejects him; Andy subsequently leaves, his feelings crushed. Irene, who had been treating Andy with disdain over the way Erin spoke of him, sees that he is a nice person and encourages Erin to go back with him. She runs up to him in his car and they share a kiss before heading back to Scranton."},{"type":"paragraph","text":"Meanwhile, Nellie shows up in Scranton after Robert California allows her to have a job there. She is invited to take an open desk, and she takes Andy's manager desk, as he is currently in Florida. Jim says she cannot take Andy's job, but Robert is interested in her spontaneous behavior. As acting manager, Nellie decides to give everyone performance reviews. Both Jim and Dwight refuse to let her proceed, as she is unfamiliar with the other employees. To counter this, Nellie offers Dwight a raise on the spot, and eventually, he and the other employees relent, save for Jim. When it is Jim's turn, Jim still refuses. Everyone in the office, save for Jim and Pam, applaud her. Nellie promptly begins rearranging the office."}],"images":[]},{"title":"Cultural References","level":2,"content":[{"type":"list","elements":[{"text":"Nellie is not impressed with stunt performer Harry Houdini or his museum.","elements":[]},{"text":"While shaving along the sea shore, Andy picks up a horseshoe crab and sarcastically thanks BP, a reference to the 2010 Deepwater Horizon oil spill.","elements":[]},{"text":"Andy pops out of the box, singing \"Signed, Sealed, Delivered I'm Yours\" by Stevie Wonder.","elements":[]},{"text":"Irene asks Andy, \"Where's the ring, Lancelot?\"","elements":[]},{"text":"\"Chumbo\" is a cross between Dumbo and Jumbo, with a hint of chubby.","elements":[]},{"text":"Robert calls it \"Disneytown\" instead of Disneyland.","elements":[]},{"text":"Irene mentions that her son is going to sue Home Depot, a popular retailer of home improvement and construction products and services.","elements":[]},{"text":"Nellie compares herself to Tinker Bell, telling the office that, in order for her to work for them, they need \"to believe in her.\"","elements":[]},{"text":"Nellie dreamed she could breathe underwater like Jacques Cousteau.","elements":[]}]}],"images":[]},{"title":"Connections to previous episodes","level":2,"content":[{"type":"list","elements":[{"text":"Robert's \"everything is sex\" theory is practically the same as the one he presented at his job interview in Search Committee.","elements":[]}]}],"images":[]},{"title":"Trivia","level":2,"content":[{"type":"list","elements":[{"text":"Nellie's nameplate is obviously Andy's old one - the \"Ber\" in Bertram is the one in Bernard.","elements":[]},{"text":"In this episode, Nellie mocks Harry Houdini. In the next episode, it is revealed that she harbors an intense hatred for stage magicians as a result of a painful event in her past.","elements":[]}]}],"images":[]},{"title":"Cast","level":2,"content":[],"images":[]},{"title":"Main Cast","level":3,"content":[{"type":"list","elements":[{"text":"Rainn Wilson as Dwight Schrute","elements":[]},{"text":"John Krasinski as Jim Halpert","elements":[]},{"text":"Jenna Fischer as Pam Halpert","elements":[]},{"text":"B.J. Novak as Ryan Howard","elements":[]},{"text":"Ed Helms as Andy Bernard","elements":[]},{"text":"James Spader as Robert California","elements":[]}]}],"images":[]},{"title":"Supporting Cast","level":3,"content":[{"type":"list","elements":[{"text":"Catherine Tate as Nellie Bertram","elements":[]},{"text":"Leslie David Baker as Stanley Hudson","elements":[]},{"text":"Brian Baumgartner as Kevin Malone","elements":[]},{"text":"Creed Bratton (actor) as Creed Bratton","elements":[]},{"text":"Kate Flannery as Meredith Palmer","elements":[]},{"text":"Mindy Kaling as Kelly Kapoor","elements":[]},{"text":"Ellie Kemper as Erin Hannon","elements":[]},{"text":"Angela Kinsey as Angela Martin","elements":[]},{"text":"Paul Lieberstein as Toby Flenderson","elements":[]},{"text":"Oscar Nunez as Oscar Martinez","elements":[]},{"text":"Craig Robinson as Darryl Philbin","elements":[]},{"text":"Phyllis Smith as Phyllis Vance","elements":[]}]}],"images":[]},{"title":"Recurring Cast","level":3,"content":[{"type":"list","elements":[{"text":"Georgia Engel as Irene","elements":[]}]}],"images":[]},{"title":"Guest Cast","level":3,"content":[{"type":"list","elements":[{"text":"Brad Morris as Glenn","elements":[]},{"text":"Alexander Sibaja as Alonzo","elements":[]}]}],"images":[]}]}