{"sections":[{"title":"Happy Hour","level":1,"content":[{"type":"paragraph","text":"\"Happy Hour\" is the twenty first episode of the sixth season and the 121st episode of The Office overall. It was written by B.J. Novak and directed by Matt Sohn. It aired on March 25, 2010. It was viewed by 7.17 million people."}],"images":[]},{"title":"Synopsis","level":2,"content":[{"type":"paragraph","text":"Michael completes his 25th push-up and one girl push-up and challenges the office employees to do 26 push-ups of their own. Those who do can go home. While Angela, Jim, and the rest of the office try and fail, the office cheers on Stanley, who remains dedicated to the task. Oscar states that it is remarkable, however, Michael says that it is unfair because his weight is pushing him down to the floor. Stanley completes the goal, and the office yells in excitement for him. Stanley leaves."},{"type":"paragraph","text":"Oscar comes in early to encounter Matt, and says that he is always early, but Calvin tells Matt he never comes in early. When Oscar tries the door he realizes that the office won't open for two hours. Oscar suggests to Darryl that everyone go to happy hour. Darryl says that he'll invite Matt and then makes a pun: he tells Oscar that he knows about his liking Matt and says that he can be gay with Matt but be straight with him. Oscar then asks the office if they would like to go to happy hour and Phyllis agrees. She says she likes to wear something low-cut, because when someone flirts with her, Bob Vance beats them up. The documentary crew is shocked, but Phyllis only remarks, \"What?\" Jim says that he can not go because the baby is with Pam and she wouldn't want to leave the baby. When Jim calls Pam, to ask her if she wants to go to happy hour, she is ecstatic and begs to go, yelling that she could be around adults and desperately misses everyone."},{"type":"paragraph","text":"Meanwhile, Erin and Andy try to keep their relationship under wraps, quiet and free of drama. Erin pretends to hate Andy, but they both agree to go to happy hour together. Kevin suspects their relationship quickly and starts to make crude gestures while the couple are in a talking head, which Andy and Erin find pretty funny."},{"type":"paragraph","text":"Michael also decides to go to happy hour. Everyone from the office arrives at happy hour, and Pam invites her friends, Isabel and Julie; she plans to set up Michael with Julie. Pam sees Kevin, who is trying to get Pam's breasts to leak by crying like a baby. Michael meets Julie, and they hit it off. Isabel comes and flirts with Dwight, who is talking to Angela at the time. Angela notices Dwight's interest in Isabel and starts to become jealous. Julie says that she likes Michael, however things take a turn for the worse when Jim alerts Michael that he is on a date. Michael then becomes \"Date Mike.\"  While Hide talks to Oscar, Michael starts to act boorish and outlandish. Kevin continues his quest to make Pam's breasts leak. Kelly and Ryan play Dance Dance Revolution. Erin and Andy want to play it, but decide that playing together would make people aware of their relationship. While Isabel and Dwight talk and flirt with each other, Angela follows them, leading him to get closer to Isabel while they play whac-a-mole. Michael continues to be obnoxious and the date gets worse. Later, Andy gets signals that people know about his relationship with Erin, and he says that he doesn't want the drama."},{"type":"paragraph","text":"Dwight tells Angela that they had a good run, but that it's over; he offers to release her from their contract. Michael continues to act irrational and starts to dance on the pool table. When the bar manager, Donna, sees Michael, she calls security and asks him to stop, which he does. Michael goes up to Donna and they fight, however, they soon begin to flirt. Erin and Andy flirt with different people, but when Erin gropes someone, trying to be like people from the movies, Andy tells her to stop and yells at her in the picture booth. Julie decides to leave, and Pam tells her that Michael is not always like this, but can't tell her what he is really like. Donna asks Michael when he is coming back to the bar."},{"type":"paragraph","text":"Darryl tells Oscar that Matt is dumb, and Oscar momentarily agrees, but as soon as Matt shows up he eagerly goes with him to play hoops. Looking at the pictures of his yelling at Erin, Andy realizes that his and Erin's relationship is becoming dysfunctional. Not wanting a relationship like that, he goes to the microphone and announces to everyone that they are dating. Then he admits he likes the drama anyway. Angela confronts Dwight and Isabel. Isabel 'whacks' Angela lightly, when Angela says that she is taking Dwight to court. Isabel and Dwight then make out. Michael says that he and a woman hit it off. Jim and Pam, thinking he meant Julie, obviously disagree. Michael says that his success with women is due to Date Mike. A drunk Kelly starts to cry when Erin spills her drink, and she and Ryan decide to go home. Kelly's crying starts Pam's breasts leaking, to Kevin's delight."},{"type":"paragraph","text":"At the end of the episode the Asian dockworker, Hide, says that he was a heart surgeon in Japan and that he killed a Yakuza boss on purpose during an operation; when he came to America, he got a new car, a new woman, children, and says that Darryl is a life saver. He explains he was the best surgeon."}],"images":[{"src":"https:\/\/vignette.wikia.nocookie.net\/theoffice\/images\/1\/1f\/Pamhappyhour.jpg\/revision\/latest\/scale-to-width-down\/200?cb=20100326174207","caption":"Pam is ecstatic to see Kevin."},{"src":"https:\/\/vignette.wikia.nocookie.net\/theoffice\/images\/e\/ea\/Erinhappyhour.jpg\/revision\/latest\/scale-to-width-down\/192?cb=20100326173916","caption":"Erin gropes a stranger."},{"src":"https:\/\/vignette.wikia.nocookie.net\/theoffice\/images\/e\/e7\/Angelahappyhour.jpg\/revision\/latest\/scale-to-width-down\/180?cb=20100326174033","caption":"Angela confronts Dwight and Isabel."}]},{"title":"Deleted Scenes","level":2,"content":[{"type":"list","elements":[{"text":"Angela says that she is all business at the office, however, that she can relax at happy hour. When she arrives at happy hour, the guy says that she doesn't need an ID, but tries to find it anyway, citing the rules. She can't find it, while Isabel waits behind her.","elements":[]},{"text":"Michael says that anything could happen at Happy hour, and Michael asks who thought of the idea. Kevin says that surprisingly, Oscar thought of it because he is usually a snob. However, Oscar disagrees, but realizes he kind of is a snob.","elements":[]},{"text":"Andy tells Erin to go into the bar before him so that they won't look like a couple. Andy awkwardly stands in the doorway waiting.","elements":[]},{"text":"Julie asks where Michael lives, and they start laughing.","elements":[]},{"text":"Creed goes up to Oscar and an unknown lady and asks them to buy him a drink. They both decline.","elements":[]},{"text":"Pam says that everything was going well, but now isn't. Michael says he could do Michael Klump again, or he could do the Scranton Strangler. However, Jim and Pam tell him not to. Michael says that he knows what he is doing as he has been dating for over 30 years.","elements":[]},{"text":"Meredith wins pool and tells the suckers to pay up.","elements":[]},{"text":"Oscar and Hide talk to each other, while Oscar remains unamused.","elements":[]},{"text":"Kevin does well in an arcade game.","elements":[]}]}],"images":[]},{"title":"Trivia","level":2,"content":[{"type":"list","elements":[{"text":"Writer B.J. Novak fought hard for the tag at the end of the episode. He was enamored of the idea that one of the overlooked background warehouse workers has a life far more dramatic than anyone else, and the documentary crew completely missed it all this time.","elements":[]},{"text":"The scene where Michael and Oscar were commenting on Stanley doing pushups was shot using a green screen.","elements":[]},{"text":"Writer B.J. Novak's father co-authored the autobiography of Lee Iacocca mentioned in this episode.","elements":[]}]}],"images":[]},{"title":"Amusing Details","level":2,"content":[{"type":"list","elements":[{"text":"Michael does in fact, have a Chrysler, a Chrysler Sebring. It has been seen since, \"Company Picnic.\"","elements":[]},{"text":"In \"Basketball,\" Oscar offers to play on the team \"if you need me.\" In this episode, we discover that he is terrible at basketball. It was a good decision on Michael's part to turn down the offer.","elements":[]},{"text":"Angela references a salacious rumor surrounding Anderson Cooper, whom she respects. Anderson Cooper is openly gay, but kept that part of his life private until 2012 -- two years after the episode.","elements":[]},{"text":"The writers of the episode may have had \"Date Mike\" appear as Steve Carell is in the movie Date Night, as the two names sound similar.","elements":[]},{"text":"Andy does a spit take upon seeing Erin flirt with another man.","elements":[]},{"text":"In a talking head interview, Julie says, \"If I had a boss like that we'd never get anything done,\" which is true.","elements":[]},{"text":"Hide's story of his life as a surgeon is somewhat akin to a possible scenario in the video game Hitman (2016), when you can trick a Japanese surgeon into purposely botching an operation on a traitor with connections to the Yakuza. Interestingly enough, the patient also needs a new heart because his is on the wrong side. Whether the level takes inspiration from Hide's story is unknown but the similarities are somewhat uncanny. ","elements":[]}]}],"images":[]},{"title":"Connections to Previous Episodes","level":2,"content":[{"type":"list","elements":[{"text":"Toby mentioned that one of the things he was going to miss was going out for beers with everyone every Tuesday night. * Perhaps they stopped doing it after Toby left.","elements":[]},{"text":"Oscar and Matt last talked in \"Secret Santa,\" as he refers to Christmas, although at the end of \"St. Patrick's Day\" at the bar Oscar and Matt can be seen together in the same shot.","elements":[]},{"text":"Kevin also suspected Jim and Pam's relationship in \"Fun Run,\" and also sees Erin and Andy's relationship in this episode.","elements":[]},{"text":"Erin is not the first person to threaten cutting someone's face. In a deleted scene in, \"Goodbye Toby,\" Meredith says that she is going to cut Holly Flax's face.","elements":[]},{"text":"The Scranton Strangler was last mentioned in \"The Delivery,\" where a newspaper's title reads, Scranton Strangler Strikes Again.","elements":[]},{"text":"The Yakuza was last mentioned in \"Murder,\" when Dwight sets up a scenario where the people in the office are part of the Yakuza, and must get away from a group of triads.","elements":[]},{"text":"David Wallace has met Lee Iaccoca, a fact told by him to Michael, Jan, and others in \"Cocktails.\"","elements":[]},{"text":"Kevin's amazing skill at Skee-Ball in a deleted scene echoes his ability at other games of physical skill. We have seen that he is good at basketball  and golf .","elements":[]},{"text":"Michael's request for a drink made only of grenadine mimics his morning drink of milk and sugar, as seen in Broke, and further expands on Michael's sweet tooth and dislike of things that can be bitter or hard to drink, such as coffee or alcohol.","elements":[]}]}],"images":[]},{"title":"Goofs, Caution here be spoilers","level":2,"content":[{"type":"list","elements":[{"text":"Many viewers misheard Pam's request to see Ryan, believing that Jenna Fischer said \"Brian\" (Baumgartner), the actor who plays Kevin Malone. However it is possible she was referring to one of the crew that films the office, Brian. Although Brian doesn't appear properly until the Season 9 episode \"Customer Loyalty\".","elements":[]},{"text":"In the episode \"Basketball\" we see that Oscar wants a chance to play for Michael's team, and there's a shot of him easily sinking trash in the trash can. When we see Oscar shoot \"hoops\" with Matt during \"Happy Hour\" it seems as if he's never played basketball before. In the episode \"Job Fair\" he can also be seen playing the exact type of \"hoops\" game competently.","elements":[]}]}],"images":[]},{"title":"Cultural References","level":2,"content":[{"type":"list","elements":[{"text":"Happy Hour is a promotion common at bars or restaurants which offers reduced prices or other enticements during periods when business would otherwise be slow. Its meaning has been extended to cover a gathering of work colleagues at a bar or restaurant outside of normal work hours.","elements":[]},{"text":"The location for Happy Hour (\"Sid & Dexter\" in the show) is based on Dave & Buster's. (Further solidified by the presence of the game Pump It Up, described below.)","elements":[]},{"text":"Creed, Ryan, Kelly, and Andy play Pump It Up, a musical video game where players try to match dance steps on the screen. (A brief shot of the footpad shows sensors at the diagonals, which is a characteristic of Pump It Up. The more well-known video game in this genre Dance Dance Revolution has sensors at the cardinal directions.)","elements":[]},{"text":"After playing the game, Kelly complains that she got only three tickets. At some amusement arcades, games dispense tickets based on how well a player performed. These tickets can be collected and redeemed for prizes. (In reality, the game Pump It Up does not dispense tickets.)","elements":[]},{"text":"Repartee is a form of intelligent humor, or when someone is skilled in making witty remarks, which is why it is commonly also known as wit.","elements":[]},{"text":"Yakuza is an organized group of people who commit crimes from Japan. Rituals include cutting their fingers, having full body tattoos, and learning how to grip a sword.","elements":[]},{"text":"ESL is short for English as a Second Language, describing the study of English by those who did not grow up speaking it. Michael confuses it with ESP, short for Extrasensory Perception, which involves reception of information by means other than the five physical senses. It is often associated with psychic powers.","elements":[]},{"text":"\"Date Mike\" wears a Kangol beret backwards. Kangol hats have become associated in recent years with hip-hop culture. Date Mike unbuttons his shirt and pulls the collar out of the jacket, a style which was fashionable in the 1970s.","elements":[]},{"text":"Andy asks Erin if she got her flirting ideas from Black Snake Moan, a movie featuring Christina Ricci as a nymphomaniac.","elements":[]},{"text":"Dwight, Isabel and Angela play Whac a Mole, an arcade game in which people use a mallet to strike moles which pop out of holes.","elements":[]},{"text":"Grenadine is a red syrup (originally made from pomegranate), usually used as an ingredient in alcoholic drinks, but it does not itself contain alcohol.","elements":[]},{"text":"Lee Iacocca is an American businessman, especially known for his revival of the Chrysler car company during the 1980s. He is also an author of several books.","elements":[]}]}],"images":[]},{"title":"Quotes","level":2,"content":[{"type":"paragraph","text":"For quotes, see: Happy Hour Quotes."}],"images":[]},{"title":"Cast","level":2,"content":[],"images":[]},{"title":"Main Cast","level":3,"content":[{"type":"list","elements":[{"text":"Steve Carell as Michael Scott","elements":[]},{"text":"Rainn Wilson as Dwight Schrute","elements":[]},{"text":"John Krasinski as Jim Halpert","elements":[]},{"text":"Jenna Fischer as Pam Halpert","elements":[]},{"text":"B.J. Novak as Ryan Howard","elements":[]},{"text":"Ed Helms as Andy Bernard","elements":[]}]}],"images":[]},{"title":"Supporting Cast","level":3,"content":[{"type":"list","elements":[{"text":"Leslie David Baker as Stanley Hudson","elements":[]},{"text":"Brian Baumgartner as Kevin Malone","elements":[]},{"text":"Creed Bratton (actor) as Creed Bratton","elements":[]},{"text":"Kate Flannery as Meredith Palmer","elements":[]},{"text":"Mindy Kaling as Kelly Kapoor","elements":[]},{"text":"Ellie Kemper as Erin Hannon","elements":[]},{"text":"Angela Kinsey as Angela Martin","elements":[]},{"text":"Oscar Nunez as Oscar Martinez","elements":[]},{"text":"Craig Robinson as Darryl Philbin","elements":[]},{"text":"Phyllis Smith as Phyllis Vance","elements":[]}]}],"images":[]},{"title":"Recurring Cast","level":3,"content":[{"type":"list","elements":[{"text":"Amy Pietz as Donna","elements":[]},{"text":"Bobby Ray Shafer as Bob Vance","elements":[]},{"text":"Kelen Coleman as Isabel","elements":[]},{"text":"Hideotoshi Imura as Hidetoshi Hasagawa","elements":[]},{"text":"Calvin Tenner as Calvin","elements":[]},{"text":"Sam Daly as Matt","elements":[]}]}],"images":[]},{"title":"Guest Cast","level":3,"content":[{"type":"list","elements":[{"text":"Laurie Naughton Okin as Julie","elements":[]},{"text":"Seth Coltan as Randy","elements":[]},{"text":"Kie Spring as Stanley's date","elements":[]}]}],"images":[]},{"title":"References","level":2,"content":[{"type":"list","elements":[{"text":"↑ B.J. Novak talks about the Happy Hour tag, Office Tally","elements":[]}]}],"images":[]}]}