{"sections":[{"title":"Health Care","level":1,"content":[{"type":"paragraph","text":"\"Health Care\" is the third episode of the first season of The Office and the 3rd overall. It was written by Paul Lieberstein and directed by Ken Whittingham. It first aired on April 5, 2005, and was viewed by 5.8 million people."}],"images":[]},{"title":"Summary","level":2,"content":[{"type":"paragraph","text":"Because he is in charge of choosing a health plan for his employees, Michael decides that makes him the equivalent of their doctor."},{"type":"paragraph","text":"He wants to choose the Gold Plan which Jan explains that even she doesn't have. With downsizing possible, it's important that Michael chose an inexpensive plan for his employees. Michael, wanting to be liked, isn't enthusiastic about cutting their benefits. Jan tells him that part of being a manager involves giving unpleasant news. This is something he has to do."},{"type":"paragraph","text":"Michael tries to give the job to Jim who prefers he focus on his own job. He isn't planning to stay at Dunder Mifflin forever so doesn't really believe he should be acting the part of a manager. He suggests Dwight who accepts wholeheartedly, setting up a temporary workspace in the conference room."},{"type":"paragraph","text":"Dwight, who doesn't have any health problems and believes in cutting costs, picks a dirt cheap plan with virtually no benefits. To avoid his employees' complaints, Michael hides out in his office, pretending to have calls that Pam can tell he doesn't. After Jim and Pam try to get Dwight to have more compassion toward his co-workers, the employees gather outside the men's room and confront Michael about the plan."},{"type":"paragraph","text":"Michael orders Dwight to make changes and promises the crew a surprise at the end of the day. In the conference room, Dwight orders everyone to write down what diseases they need covered. Jim explains that such information is confidential. Michael leaves the office to figure out what the surprise should be, considering Atlantic City or a trip to a coal mine."},{"type":"paragraph","text":"In the meantime, Jim and Pam have fun making up fake diseases to put on the forms. When Dwight recognizes the prank, he accuses Jim who refuses to confess. Jim locks Dwight in the meeting room."},{"type":"paragraph","text":"Dwight calls Jan, identifies himself as Assistant Manager and demands the ability to fire Jim. Jan tells him he's not a manager at all. Dwight explains that Michael put him in charge of the health plan and isn't in the office right now. She lectures Dwight, tells him to never call her on her cell phone again and to have Michael call her when he gets back."},{"type":"paragraph","text":"When Michael returns, he throws ice cream sandwiches at the staff. They point out that this isn't a very good surprise, considering the day they've been having. Michael assures them it isn't the surprise. He goes into his office and doesn't come out."},{"type":"paragraph","text":"Meanwhile, Dwight goes through the questionnaires people submitted and verifies that Meredith Palmer needs coverage for an inverted vagina, Kevin for anal fissures and Angela for dermatitis. Finally he picks a plan so cheap that Oscar likens it to a pay decrease."},{"type":"paragraph","text":"At the end of the day, Michael is confronted again by the employees, wanting to know why he put Dwight in charge. Michael pretends not to know that Dwight picked a bad plan and that he did so against his orders. Since it's the end of the day, there's nothing to be done about it now."},{"type":"paragraph","text":"They ask about their surprise. While Michael still insists he has one, they walk out as he continues to kill time trying to think of one. Then Dwight tells him Jan wants to him to call her back."}],"images":[]},{"title":"Cultural references","level":2,"content":[{"type":"list","elements":[{"text":"Michael's nickname for Pam, \"Pama-lama-ding-dong\", is a pun on the song title Rama-lama-ding-dong, the 1958 hit song by The Edsels.","elements":[]},{"text":"Michael's exclamation \"Makin' copies!\" is the catch phrase from a recurring character portrayed by Rob Schneider on the sketch comedy program Saturday Night Live.","elements":[]},{"text":"Michael mutters Information Superhighway, a term popular in the early 1990s (but now obsolete) to describe the future of the nascent internet.","elements":[]},{"text":"Trading Spouses was a reality television program in which two families of different socio-economic class trade wives or husbands for one week.","elements":[]},{"text":"Michael describes Dwight's potential failure as a strike two, a reference to the sport of baseball.","elements":[]},{"text":"The deductible in an insurance plan is the monetary amount the insurance does not cover. For example, given a $200 expense with a $50 deductible, the insurance pays $150 and the insured person pays $50.","elements":[]},{"text":"How's tricks? is a casual greeting. Click here to see the origin of the phrase.","elements":[]},{"text":"Atlantic City is a city in nearby New Jersey known for its casinos and beach, about three and a half hours' drive from Scranton.","elements":[]},{"text":"Whose Line Is It Anyway? is an improvisational comedy program.","elements":[]},{"text":"Count Chocula is a chocolate-flavored children's cereal.","elements":[]},{"text":"Mork from Ork is the name of Robin Williams' character in the 1970s television comedy Mork and Mindy. Na-nu na-nu was the character's catch phrase.","elements":[]},{"text":"Outbreak is a 1995 movie that deal with the outbreak of a fictitious Ebola-like virus.","elements":[]},{"text":"Unbreakable is a 2000 movie in which one of the lead characters appears to have unusual powers, among them being immune to disease.","elements":[]},{"text":"The Sixth Sense is a 1999 movie in which one of the lead characters is revealed at the end of the movie (spoiler) as having been a ghost the entire time. Both Unbreakable and The Sixth Sense are written and produced by M. Night Shyamalan, and in both cases, the character in question was played by Bruce Willis.","elements":[]}]}],"images":[]},{"title":"Trivia","level":2,"content":[{"type":"list","elements":[{"text":"Diseases submitted to Dwight:","elements":[{"text":"Mad Cow Disease","elements":[]},{"text":"Ebola","elements":[]},{"text":"Spontaneous Dental Hydroplosion","elements":[]},{"text":"Leprosy","elements":[]},{"text":"Flesh-Eating Bacteria","elements":[]},{"text":"Hot Dog Fingers","elements":[]},{"text":"Anal Fissures","elements":[]},{"text":"Government Created Killer Nanorobot Infection (a reference to the X-Files episode \"S.R. 819\" in which Walter Skinner is infected with such a disease as a means to blackmail him)","elements":[]},{"text":"Inverted Penis","elements":[]},{"text":"Count Choculitis","elements":[]},{"text":"Dermatitis","elements":[]}]},{"text":"Both Stanley and Jim put a circle over every disease on the form.","elements":[]},{"text":"Dwight claims in this episode he has \"never been sick\" due to his \"perfect immune system.\" However, in later episodes, it is revealed that he once had walking pneumonia (\"Performance Review\"), that he has a history of kidney stones (\"Michael's Birthday\"), and also has had sinus infections (\"Christmas Party\").","elements":[]}]}],"images":[]},{"title":"Behind the Scenes","level":2,"content":[{"type":"list","elements":[{"text":"Three elements of this episode borrow from the original British series:","elements":[{"text":"Dwight and Michael argue over whether the workspace is an office. David and Gareth have a similar argument in in Episode Two, Series One.","elements":[]},{"text":"Jim locks Dwight in his workspace. Tim does the same to Gareth in The Office Christmas Specials.","elements":[]},{"text":"In a deleted scene, Jim and Pam look through Dwight's old signs for his \"workspace\". A similar scene involved Tim and Dawn looking through Gareth's old signs for his workspace in the episode Work Experience.","elements":[]}]},{"text":"Some of the diseases (like the nanorobots) were scripted. Others were invented by the writers on the set and handed to Rainn Wilson to read cold. \"Hot dog fingers\" were invented by Rainn's friend Kevin Isola who happened to be on set that day.[1]","elements":[]},{"text":"Angela Kinsey (portraying Angela Martin) and Brian Baumgartner (portraying Kevin Malone) break when Dwight reads off \"hot dog fingers\". The producers thought it was funny, so they kept it. [2]","elements":[]},{"text":"Meredith's hysterectomy was scripted, but the follow-up \"I thought you didn't have a vagina\" was improvised.[3]","elements":[]},{"text":"The interaction among the accountants (\"You let him walk all over you\") was a bit that Angela Kinsey and Oscar Nunez improvised, and camera operator Matt Sohn advised that if they could tighten it up, it would be more likely to make the final cut. It was fortuitous that Brian Baumgartner was right behind them, giving Angela the opportunity to snap, \"Nothing, Kevin.\"[4]","elements":[]},{"text":"According to Paul Lieberstein at Paley Fest, the final scene was scripted as \"The longest pause in television history.\" It ultimately went two and a half minutes, so long Steve Carell broke into a sweat from the awkwardness of the situation.","elements":[]},{"text":"Creed Bratton is the voice of the mine shaft employee whom Michael calls. This is his first official speaking role. (His speaking role as Creed in Diversity Day was unplanned.)","elements":[]}]}],"images":[]},{"title":"Deleted scenes","level":2,"content":[{"type":"paragraph","text":"The Season One DVD contains a number of deleted scenes from this episode. Notable cut scenes include:"},{"type":"list","elements":[{"text":"An interview between Dwight and Oscar.","elements":[]},{"text":"Dwight talking about jealousy when a worker is elevated above his peers.","elements":[]},{"text":"Oscar trying to confront Michael about the plan.","elements":[]},{"text":"Jim and Pam reveal early attempts at the sign for the conference room. These include \"Schrute Space\" (which is the name of Dwight's blog), \"Quiet! Dwight Schrute Working\", and \"Dwight Schrute Privates\".","elements":[{"text":"This would have been a third reference to the original British series, also from Episode Two, Series One.","elements":[]}]},{"text":"An alternate take where Jim says Dwight should pick a good health plan in order to help himself as well, leading to them making movie references in order to argue over his mortality.","elements":[]},{"text":"Dwight memorizing who he takes health care forms from, only for Oscar to give him a bunch of forms at once.","elements":[]},{"text":"Dwight interviewing Pam which leads to him interviewing Jim, demanding he confess.","elements":[]},{"text":"An extended talking head of Michael talking on how he learned improv from the masters.","elements":[]},{"text":"Michael's final response at the end after everyone has left was that they would all go bowling. This suggests he may have mentally shut down out of panic while trying to improvise something.","elements":[]}]}],"images":[]},{"title":"Cast","level":2,"content":[],"images":[]},{"title":"Main Cast","level":3,"content":[{"type":"list","elements":[{"text":"Steve Carell as Michael Scott","elements":[]},{"text":"Rainn Wilson as Dwight Schrute","elements":[]},{"text":"John Krasinski as Jim Halpert","elements":[]},{"text":"Jenna Fischer as Pam Beesly","elements":[]},{"text":"B.J. Novak as Ryan Howard","elements":[]}]}],"images":[]},{"title":"Recurring Cast","level":3,"content":[{"type":"list","elements":[{"text":"Melora Hardin as Jan Levinson","elements":[]},{"text":"Leslie David Baker as Stanley Hudson","elements":[]},{"text":"Brian Baumgartner as Kevin Malone","elements":[]},{"text":"Kate Flannery as Meredith Palmer","elements":[]},{"text":"Mindy Kaling as Kelly Kapoor","elements":[]},{"text":"Angela Kinsey as Angela Martin","elements":[]},{"text":"Paul Lieberstein as Toby Flenderson","elements":[]},{"text":"Oscar Nunez as Oscar Martinez","elements":[]},{"text":"Phyllis Smith as Phyllis Lapin","elements":[]},{"text":"Creed Bratton (actor) as Creed Bratton (Uncredited) and Coal mine employee (Uncredited)","elements":[]},{"text":"Devon Abner as Devon White (Uncredited)","elements":[]}]}],"images":[]},{"title":"Guest Cast","level":3,"content":[{"type":"list","elements":[{"text":"Charlie Hartsock as Travel Agent","elements":[]}]}],"images":[]}]}