{"sections":[{"title":"Heavy Competition","level":1,"content":[{"type":"paragraph","text":"\"Heavy Competition\" is the twenty-fourth episode of the fifth season of The Office and the 96th episode overall. It was written by Ryan Koh and directed by Ken Whittingham. It first aired on April 16, 2009. It was viewed by 8.24 million people."}],"images":[]},{"title":"Synopsis","level":2,"content":[{"type":"paragraph","text":"Michael and Dwight have been having secret meetings in the parking lot, where Dwight provides information about Dunder Mifflin so Michael can undercut the company. However, Dwight's loyalty is put to the test as Charles Miner seems to show more respect for Dwight than Michael did. Dwight brings Charles to the parking lot during one of the secret meetings, where Charles orders Michael to stop pestering Dwight. This begins a rivalry between Michael and Dwight, and Michael begins to steal Dwight's clients. Dwight asks for a truce and offers to take Michael and his employees out to lunch; Dwight does not go to the restaurant and instead sneaks into the empty Michael Scott Paper Company office and steals everything on Michael's desk, including his Rolodex contact list, and places a dead fish in the air conditioning vent."},{"type":"paragraph","text":"Meanwhile, Jim and Pam are attempting to get bargain deals on wedding plans from Andy. When Pam turns down his ideas, Andy suspects that Pam might be acting controlling and cruelly to Jim, in the same way Angela treated Andy. Andy warns Jim, who tries to convince Andy that he and Pam are really happy. Andy remains convinced that Pam will betray him, so Jim asks Andy to provide for his emotional needs as a prank. After Jim feigns crying on Andy's shoulder, Andy blames the office for Jim's emotional troubles and asks them to apologize. Phyllis tells Andy that Jim is just messing with him. Andy does not believe her until he sees Jim grinning through the kitchen window. When Andy confronts Jim, Jim assures him that he and Pam are really happy and that Andy will find someone else one day."},{"type":"paragraph","text":"Michael, Pam, and Ryan return to their office and believe they have been robbed. Dwight calls and reveals his treachery. Michael calls Dwight on the phone and tells him that he is going to steal his biggest client while he listens. Dwight races to the Harper Collins office, where Michael and Dwight start fighting over the client. The client asks for both of their offers via email, and they agree to do so. Before leaving, Dwight then looks at the client's personal information from Michael's Rolodex card and asks him about his \"gay son\", which seemingly perturbs the client. Michael reveals his unusual system where he color codes personal information about his contacts so he knows what not to talk about. Michael is seen laughing with the client in the parking lot as Dwight returns to his car alone."}],"images":[]},{"title":"Connections to previous episodes","level":2,"content":[{"type":"list","elements":[{"text":"Michael stole the jar of cheeseballs from Dunder-Mifflin in a deleted scene from Two Weeks.","elements":[]},{"text":"Dwight complains about Charles' new dress code. However, Dwight was the one concerned with the dress code when he sent Jim a memo about it in the episode New Boss.","elements":[]},{"text":"This is the second time that the Michael Scott Paper Company is compared to a computer giant. Michael tells Mr. Schofield that buying paper from him is like buying software from Bill Gates. In “Dream Team” Pam states they have an advantage over Apple because they are starting in a condo instead of a garage.","elements":[]}]}],"images":[]},{"title":"Goofs","level":2,"content":[{"type":"list","elements":[{"text":"After hanging up the phone Michael whispers shit and they don't censor it.","elements":[]}]}],"images":[]},{"title":"Amusing details","level":2,"content":[{"type":"list","elements":[{"text":"Dwight changes back into his signature short-sleeved shirt prior to storming the meeting between Michael and Dwight’s biggest client.","elements":[]}]}],"images":[]},{"title":"Cultural references","level":2,"content":[{"type":"list","elements":[{"text":"Michael, Pam and Ryan have lunch at Alfredo's Pizza Café, a reference to the restaurant first referenced in the fourth season episode \"Launch Party\".","elements":[]},{"text":"Andy presents a recording of his a cappella group singing Pachelbel's Canon segueing into the Paul Simon song \"You Can Call Me Al\".","elements":[]},{"text":"Dwight said under Michael's leadership, the office was like the Roman Empire, the Wild West, war-torn Poland, and Poland all at once.","elements":[]},{"text":"Dwight describes Charles as \"Will Smith-esque\", a reference to the American film actor.","elements":[]},{"text":"Andy vows to be Jim's \"traveling pants\", a reference to the young adult novel series The Sisterhood of the Traveling Pants.","elements":[]},{"text":"Michael and Dwight both court HarperCollins, an American publishing company, as a prospective paper client.","elements":[]}]}],"images":[]},{"title":"Quotes","level":2,"content":[{"type":"paragraph","text":"For quotes see: Heavy Competition Quotes"}],"images":[]},{"title":"Cast","level":2,"content":[],"images":[]},{"title":"Main Cast","level":3,"content":[{"type":"list","elements":[{"text":"Steve Carell as Michael Scott","elements":[]},{"text":"Rainn Wilson as Dwight Schrute","elements":[]},{"text":"John Krasinski sa Jim Halpert","elements":[]},{"text":"Jenna Fischer as Pam Beesly","elements":[]},{"text":"B.J. Novak as Ryan Howard","elements":[]}]}],"images":[]},{"title":"Supporting Cast","level":3,"content":[{"type":"list","elements":[{"text":"Ed Helms as Andy Bernard","elements":[]},{"text":"Leslie David Baker as Stanley Hudson","elements":[]},{"text":"Brian Baumgartner as Kevin Malone","elements":[]},{"text":"Creed Bratton (actor) as Creed Bratton","elements":[]},{"text":"Kate Flannery as Meredith Palmer","elements":[]},{"text":"Mindy Kaling as Kelly Kapoor","elements":[]},{"text":"Angela Kinsey as Angela Martin","elements":[]},{"text":"Oscar Nunez as Oscar Martinez","elements":[]},{"text":"Phyllis Smith as Phyllis Vance","elements":[]}]}],"images":[]},{"title":"Special Guest Star","level":3,"content":[{"type":"list","elements":[{"text":"Idris Elba as Charles Miner","elements":[]}]}],"images":[]},{"title":"Recurring Cast","level":3,"content":[{"type":"list","elements":[{"text":"Ellie Kemper as Erin Hannon","elements":[]},{"text":"Karly Rothenberg as Madge Madsen","elements":[]}]}],"images":[]},{"title":"Guest Cast","level":3,"content":[{"type":"list","elements":[{"text":"Bob Gebert as Mr. Schofield","elements":[]},{"text":"Angela Campolla-Sanders as the Receptionist","elements":[]}]}],"images":[]}]}