{"sections":[{"title":"Hot Girl","level":1,"content":[{"type":"paragraph","text":"\"Hot Girl\" is the sixth episode of the first season of The Office and the 6th overall. It was written by Mindy Kaling and directed by Amy Heckerling. It first aired on April 26, 2005 and was viewed by 4.8 million people."}],"images":[]},{"title":"Summary","level":2,"content":[{"type":"paragraph","text":"A purse vendor, Katy, comes in to the office to sell purses for the day. While solicitors are generally not welcome in the office, Michael allows her to use the conference room to sell purses because he, as well as some of the other male staff, is attracted to her. Michael continually tries to get Katy interested in him but fails. Michael offers to give Katy a ride after work and is disturbed when he discovers her heading out with Jim, which is the beginning of the Jim-Katy Relationship. The episode also furthers Pam's character development. In the episode, we see her dissatisfaction with Roy as he says he would get with Katy if he wasn't \"dating\" Pam. Pam angrily reminds him that they are, in fact, engaged and proceeds to storm out of the kitchen. Additionaly, Pam is subtly upset by Jim's revelation that he is going to take Katy out that weekend. "}],"images":[]},{"title":"Amusing details","level":2,"content":[{"type":"list","elements":[{"text":"Michael tells Stanley that the coffee machine is easy to clean. But two scenes later, Michael talks to Pam in his office, and the coffee machine is covered in dirty napkins, as if Michael had made a horrible mess.","elements":[]},{"text":"On the whiteboard in the conference room there is listed a \"D.M. Calendar Blitz\". Jim's goal is $3,500, and his actual sales are listed as $3,143.28. Dwight's goal is $3,000, and his sales are only $1,076.21, which is the lowest of the four visible in the shot. Stanley is third on the board with a goal of $3,000 and sales of $2,580.09. -- Dwight's status has the branch's most productive salesperson apparently had not yet been established by the writers. One other line is visible but the salesperson's name is not.","elements":[]}]}],"images":[]},{"title":"Trivia","level":2,"content":[{"type":"list","elements":[{"text":"At the time the episode was being filmed, Amy Adams had already finished filming Junebug, but the movie hadn't been released yet. She later received an Academy Award nomination for her role in that movie.","elements":[]},{"text":"The Dunder Mifflin parking lot isn't the same as the other episodes because the first season was filmed in the same office building as the Pilot episode, before the show moved to an office set. Jenna Fischer recalls that she and David Denman waited in the pickup truck for everybody come out so they could drive away on cue, and after one very long wait, they saw everybody come out and leave for home. The director had forgotten to tell them that they were finished for the day.","elements":[]},{"text":"John Krasinski and Jenna Fischer improvised Jim and Pam's narration of Dwight's purse purchase. Rainn Wilson made Dwight do strange things in order to provide things for them to narrate.","elements":[]},{"text":"The discussion between Katy and Angela was unscripted. When Angela said that her favorite colors were various shades of gray, the costume designer used that to inform Angela's wardrobe.","elements":[]},{"text":"The surprising number of filet o' fish sandwich wrappers that Ryan cleans out of Michael's car was a nod to Mindy Kaling's love of the sandwiches.","elements":[]}]}],"images":[]},{"title":"Deleted scenes","level":2,"content":[{"type":"paragraph","text":"The Season One DVD contains a number of deleted scenes from this episode."},{"type":"list","elements":[{"text":"Dwight describes his perfect girl.","elements":[]},{"text":"Dwight shops for a purse as Michael brings coffee.","elements":[]},{"text":"Michael clarifies his intentions with Katy.","elements":[]},{"text":"Michael makes Toby look bad in front of Katy.","elements":[]},{"text":"Jim assesses Michael's chances with Katy.","elements":[]},{"text":"Jim encourages Dwight to use his purse, tricking him into mentioning it in front of the other employees.","elements":[]},{"text":"Dwight describes his perfect date.","elements":[]},{"text":"Michael asks Ryan for music advice.","elements":[]},{"text":"Dwight gives his purse to Kelly.","elements":[]}]}],"images":[]},{"title":"Cultural references","level":2,"content":[{"type":"list","elements":[{"text":"The Mets (New York) and Pirates (Pittsburgh) are professional baseball teams.","elements":[]},{"text":"Michael's nickname Pamburger is a pun on hamburger.","elements":[]},{"text":"American Way is the in-flight magazine of American Airlines.","elements":[]},{"text":"Doris Roberts is an Emmy Award-winning actress.","elements":[]},{"text":"Starbucks is an international chain of coffee shops.","elements":[]},{"text":"Michael's question \"High test or unleaded?\" is invented slang asking whether Katy prefers regular or decaffeinated coffee. Her response, \"Bring it on,\" indicates that she wants the more challenging alternative.","elements":[]},{"text":"Joe is slang for coffee.","elements":[]},{"text":"Oscar the Grouch is a character from the children's television program Sesame Street who until 2018 was voiced by Caroll Spinney.","elements":[]},{"text":"Bishop O'Hara is a Catholic high school in Dunmore, a suburb of Scranton.","elements":[]},{"text":"Soccer mom refers to a stay-at-home upper-middle-class woman with school-age children.","elements":[]},{"text":"NASCAR mom is a term that was briefly popular in the 2004 election, referring to the mother of a working-class white family.","elements":[]},{"text":"GQ is a men's magazine focusing on fashion and style.","elements":[]},{"text":"Divine Secrets of the Ya-Ya Sisterhood is a book and subsequent movie about a group of women who are close friends.","elements":[]},{"text":"Mack daddy is slang for a man who is successful with women. Michael applies it to a coffee machine.","elements":[]},{"text":"A futon is a foam mattress used as a cheap substitute for a bed. In the United States, its use is typically restricted to young adults with little money.","elements":[]},{"text":"Drakkar Noir is a men's cologne. Rite Aid is a U.S. chain of drugstores. (Night Swept is a made-up brand name.)","elements":[]},{"text":"Filet-O-Fish is the name of a fried fish sandwich from McDonalds.","elements":[]}]}],"images":[]},{"title":"Cast","level":2,"content":[],"images":[]},{"title":"Main Cast","level":3,"content":[{"type":"list","elements":[{"text":"Steve Carell as Michael Scott","elements":[]},{"text":"Rainn Wilson as Dwight Schrute","elements":[]},{"text":"John Krasinski as Jim Halpert","elements":[]},{"text":"Jenna Fischer as Pam Beesly","elements":[]},{"text":"B.J. Novak as Ryan Howard","elements":[]}]}],"images":[]},{"title":"Recurring Cast","level":3,"content":[{"type":"list","elements":[{"text":"Amy Adams as Katy","elements":[]},{"text":"David Denman as Roy Anderson","elements":[]},{"text":"Leslie David Baker as Stanley Hudson","elements":[]},{"text":"Brian Baumgartner as Kevin Malone","elements":[]},{"text":"Kate Flannery as Meredith Palmer","elements":[]},{"text":"Angela Kinsey as Angela Martin","elements":[]},{"text":"Paul Lieberstein as Toby Flenderson","elements":[]},{"text":"Oscar Nunez as Oscar Martinez","elements":[]},{"text":"Phyllis Smith as Phyllis Lapin","elements":[]},{"text":"Melora Hardin as Jan Levinson","elements":[]},{"text":"Mindy Kaling as Kelly Kapoor (Uncredited)","elements":[]},{"text":"Creed Bratton (actor) as Creed Bratton (Uncredited)","elements":[]},{"text":"Devon Abner as Devon White (Uncredited)","elements":[]}]},{"type":"paragraph","text":"Cite error:  tags exist, but no  tag was found"}],"images":[]}]}