{"sections":[{"title":"Job Fair","level":1,"content":[{"type":"paragraph","text":"\"Job Fair\" is the seventeenth episode of the fourth season of The Office and the 70th episode overall. It was written by Lee Eisenberg and Gene Stupnitsky. It was directed by Tucker Gates. It first aired May 8, 2008. It was viewed by 7.22 million people."}],"images":[]},{"title":"Synopsis","level":2,"content":[{"type":"paragraph","text":"Michael, Pam, Oscar and Darryl set up a booth at a local job fair at Valley View High School, which happens to be Pam's alma mater, to find the \"Best and the Brightest\" for Dunder Mifflin's summer internship. Meanwhile, Jim hits the links with Andy and Kevin to try and land his biggest sale after receiving a formal warning from Ryan regarding his job performance."},{"type":"paragraph","text":"Michael sets up the company's booth at the job fair by placing one sheet of white paper on the table and nothing else. The client Jim is trying to impress, Phil Maguire, suggests they bet on the golf game, which excites Kevin, as he both loves to gamble and proves to be an excellent golfer. Andy, on the other hand, is quite a poor golfer. The employees realize there is no reason for them to be in the office with so many people gone and want to go home. Stanley quietly packs his things and walks out as Dwight becomes outraged that everyone wants to leave."},{"type":"paragraph","text":"At the job fair, Michael turns away the only student interested in their booth because he is not the type of person Michael was interested in recruiting. He then gets mad that the student signed his name on the sheet of paper and tells Pam to put out another. Pam only brought one, and when Michael gets mad at her, she points out that he told her to only bring one sheet. Michael pushes the blame back on her and makes her go find another piece of paper."},{"type":"paragraph","text":"Jim tries to convince the client to switch paper companies, but Phil is content with the supplier he is using and is not interested in hearing a sales pitch. Michael tries to pull other students in to the booth but no one is interested. Back at the office, Angela and Dwight find themselves alone as the rest of the employees decide to go home."},{"type":"paragraph","text":"Pam finds a piece of paper from her old art room and returns to the booth with it, but Michael is mad that it is not Dunder Mifflin paper and makes Pam go back to the office to retrieve another sheet. Meanwhile, Dwight calls Michael with the news that the employees left but Michael agrees that no one should have to be there as both he and Jim are gone and hangs up."},{"type":"paragraph","text":"The sales pitch does not seem to be going well for Jim, but he is determined to give it his best shot. After getting shot down again, Andy, in an attempt to be funny, suggests racing to the next hole and crashes the golf cart into a sand trap. Michael becomes disgusted with how well the rest of the booths are doing. Michael tries to re-recruit Justin, the only student who showed an interest in the company, but Justin tells Michael he was a jerk and walks away."},{"type":"paragraph","text":"After the golf game, Jim delivers one last desperate sales pitch and Phil finally breaks down and gives Dunder Mifflin his business. As the job fair starts to wrap up, Michael grabs the microphone and, like Jim, delivers one last desperate sales pitch to get anyone to intern at the company, but he gets no takers."},{"type":"paragraph","text":"In his final talking head, Michael justifies his failure at the job fair by accepting credit for Jim's success, as Jim chooses to work at Dunder Mifflin."},{"type":"paragraph","text":"The final scene shows Pam walking over to a graphic design booth during the job fair and asking for an application. Although Pam is intimidated when the graphic design interviewer lists several programs that she is unfamiliar with, the interviewer states that it should be easy to find adult education programs to help Pam learn them."}],"images":[]},{"title":"Deleted scenes","level":2,"content":[{"type":"list","elements":[{"text":"In a talking head interview, Michael explains that kids today have a short attention span, preoccupied with texting, video games and sex. And today, they are being distracted by other booths.","elements":[]},{"text":"Michael calls a student to the booth and tries to convince him that Dunder Mifflin is a lot of fun. Pam arrives with the paper, and Michael points out that the student could look at Pam all day. He gives the student the paper and says he can keep it. Pam is stunned.","elements":[]},{"text":"Michael tries to convince that student (who is clearly not interested) that Dunder Mifflin is a fun, sexy place. The student manages to escape, but Michael follows him. The student goes to the bathroom and is disturbed to find Michael waiting for him. The student finally tells Michael directly that he doesn't want to waste his life \"selling paper for your stupid company\".","elements":[]},{"text":"Kevin anticipates that the winnings from the golf game will help cover his gambling debts.","elements":[]},{"text":"Jim confides that inviting Andy was a calculated move: The client hates Cornell.","elements":[]},{"text":"Pam sees a picture of Roy (in the school's trophy case, along with many accolades from his time on the football team), and says, \"9 years of my life.\"","elements":[]},{"text":"A female student chooses to be the intern at Dunder Mifflin, but is stopped by Oscar. He lies by saying the position was filled and that she should do something that she really wants to do. He later states he \"couldn't do that to a little girl\", meaning wasting her life selling paper like him.","elements":[]}]}],"images":[]},{"title":"Trivia","level":2,"content":[{"type":"list","elements":[{"text":"The booths at the job fair are real organizations except for Dunder-Mifflin itself: Office Depot (office supplies), Simplex Homes, WICK Sports Radio \"The Game\", Electric City magazine, Dunder Mifflin Scranton, H&R Block (tax preparation), [RLG], the Air Force, Pennstar Bank, the Hilton Scranton & Conference Center, Allegheny Rent-A-Car, Starlight Models, Care Givers America (Clarks Summit), Frank M. Regan Funeral Home, Solid Cactus, L. R. Constanzo Construction, the Greater Scranton Chamber of Commerce, and Lamar Advertising.","elements":[]},{"text":"Actor Trevor Einhorn (Justin) is better-known to American television audiences as Frederick Crane, son of Frasier Crane from the television situation comedy Frasier. (No relation to The Office Director of Photography Randall Einhorn.)","elements":[]},{"text":"The writers considered sending Dwight to the job fair (where he would interact with the students) or adding him to Jim's golf foursome (where he was eventually kicked out and played golf with a bunch of old ladies instead) before settling on what happens in this episode.","elements":[]},{"text":"Andy, Kevin, and Phil Maguire (the client) all use the Odyssey White Hot XG 2 Ball Center Shaft Putter.","elements":[]},{"text":"The make up department carefully researched the correct placement of Andy's golfing blisters.","elements":[]},{"text":"Brian Baumgartner is an accomplished golfer. This episode once again demonstrates the actor's talent for sports.","elements":[]},{"text":"The graphic design company representative that Pam meets with was played by Nelson Franklin, the same actor who portrays Nick the I.T. Guy when Sabre takes over in Season 6.[1]","elements":[]}]}],"images":[]},{"title":"Connections to other episodes","level":2,"content":[{"type":"list","elements":[{"text":"Pam tells the intern candidate, Justin, \"We uh eat a lot of cake.\" In the episode Survivor Man, we learn that every employee in the office gets an individual birthday cake.","elements":[]},{"text":"Michael previously used the \"And don't call me Shirley\" joke with Jan in Valentine's Day. But in that episode, he used it correctly.","elements":[]},{"text":"Jim and Pam share a polite handshake even though they would rather kiss - and after already sharing a kiss. In The Return, Dwight and Angela share a polite handshake even though they would rather kiss.","elements":[]},{"text":"Pam does not seem to recognize the graphic design interviewer, Nick, in the episode Sabre, who has been hired as an IT specialist.","elements":[]},{"text":"Pam tells the camera that she has fond memories from her high school years in the gym, including “pretending to have PMS to get out of volleyball.” However, in Company Picnic, Pam is the most skilled volleyball player on the team and tells the camera that she played a little in junior high, high school, college, “and went to volleyball camp most summers.”","elements":[]}]}],"images":[]},{"title":"Amusing details","level":2,"content":[{"type":"list","elements":[{"text":"B.J. Novak (Ryan Howard) and Paul Lieberstein (Toby Flenderson) are credited but do not appear in this episode.","elements":[]},{"text":"Kevin once again gambles the petty cash. He did so previously in the Webisode Things Are Getting Tense.","elements":[]},{"text":"While in the gym, Pam recounts how she used to pretend to have PMS to get out of playing volleyball. However, in Company Picnic, not only is Pam shown to be an excellent volleyball player, she proudly states that she used to play in jr. high, high school, and college; in addition to spending most of her summers at volleyball camp.","elements":[]}]}],"images":[]},{"title":"Goofs","level":2,"content":[{"type":"list","elements":[{"text":"Pam returns to the office for a sheet of card stock, but she takes it from the copy machine. It is very unusual to use card stock in a copy machine. However, it did appear to be heavy duty paper when she held it up. Also, it was from a lower drawer of the copier where paper other than standard 20 pound may be kept.","elements":[]},{"text":"Andy's hands are fully healed when he is playing air guitar when Jim and Pam kiss despite being covered in blisters and sores at the golf course earlier that day.","elements":[]}]}],"images":[]},{"title":"Cultural references","level":2,"content":[{"type":"list","elements":[{"text":"Michael says that he wants to youthanize the office, a made-up word combining \"youth\" and the verb suffix \"-ize\". He inadvertently says the word \"euthanize\", meaning \"to kill in a humane way.\"","elements":[]},{"text":"Valley View High School is located in Archbald, Pennsylvania, about nine miles north of Scranton.","elements":[]},{"text":"Kelly tells Darryl, \"You look like Barack Obama.\" Obama was a leading presidential candidate at the time the episode aired.","elements":[]},{"text":"Andy mentions his grandfather spinning in his urn. The idiom \"spinning in one's grave\" is used to describe a situation which would have made a dead person furious if they were still alive. Andy adapts this idiom to accommodate the fact that his grandfather was cremated.","elements":[]},{"text":"Andy refers to the client as a Dartmouth boy. Dartmouth College is a university in New Hampshire, a member of the Ivy League of prestigious universities (which includes Cornell) in the Northeast United States. (Incidentally, writer\/actor Mindy Kaling went to Dartmouth).","elements":[]},{"text":"Kevin lists several golf betting games: Skins, Acey Deucey, Bingo-Bango-Bongo, Sandies, Barkies, Arnies, and Wolf.","elements":[]},{"text":"PMS (known as PMT in British English) is short for \"Premenstrual syndrome\", a collection of adverse symptoms tied to a woman's menstrual cycle.","elements":[]},{"text":"Dwight says the American workday ends at 5pm. The traditional American workday runs from 9am to 5pm.","elements":[]},{"text":"Junk mail is an informal term for unwanted advertisements received in the mail.","elements":[]},{"text":"Michael blames Dateline for his lack of success at the job fair. Dateline NBC is a television news magazine known for its \"To Catch a Predator\" segment which identifies child sexual predators.","elements":[]},{"text":"Michael suggests that Justin could be a migraine worker. He means \"migrant worker.\"","elements":[]},{"text":"Michael says \"And don't call me Shirley,\" repeating a joke from the movie Airplane!. His use of the joke is incorrect, however, since Pam merely said \"Are you serious?\" instead of \"Surely you can't be serious.\"","elements":[]},{"text":"Michael describes Justin as the ugly girl in the movie, who takes off her glasses and she's hot! And you realize she was always hot, she was just wearing glasses. This is a movie cliche [2] a special case of the Beautiful All Along cliche.","elements":[]},{"text":"Michael derides the job fair as bush league, originally a derogatory term for the minor leagues of professional baseball, but which has entered general use as slang for \"substandard.\"","elements":[]},{"text":"When Pam and Jim kiss, Kevin and Andy add musical accompaniment in a style characteristic of pornographic movies.","elements":[]},{"text":"The graphic designer lists a variety of computer graphic software: Photoshop, Dreamweaver, Corel Painter, Illustrator, and After Effects.","elements":[]},{"text":"Adult education classes are non-credit evening classes typically offered by small colleges to adults in the community.","elements":[]},{"text":"Michael kicks a ball like Nick Nolte in the 1994 movie Blue Chips.","elements":[]}]}],"images":[]},{"title":"Cast","level":2,"content":[],"images":[]},{"title":"Main Cast","level":3,"content":[{"type":"list","elements":[{"text":"Steve Carell as Michael Scott","elements":[]},{"text":"Rainn Wilson as Dwight Schrute","elements":[]},{"text":"John Krasinski as Jim Halpert","elements":[]},{"text":"Jenna Fischer as Pam Beesly","elements":[]},{"text":"B.J. Novak as Ryan Howard","elements":[]}]}],"images":[]},{"title":"Supporting Cast","level":3,"content":[{"type":"list","elements":[{"text":"Ed Helms as Andy Bernard","elements":[]},{"text":"Leslie David Baker as Stanley Hudson","elements":[]},{"text":"Brian Baumgartner as Kevin Malone","elements":[]},{"text":"Creed Bratton (actor) as Creed Bratton","elements":[]},{"text":"Kate Flannery as Meredith Palmer","elements":[]},{"text":"Mindy Kaling as Kelly Kapoor","elements":[]},{"text":"Angela Kinsey as Angela Martin","elements":[]},{"text":"Oscar Nunez as Oscar Martinez","elements":[]},{"text":"Craig Robinson as Darryl Philbin","elements":[]},{"text":"Phyllis Smith as Phyllis Vance","elements":[]}]}],"images":[]},{"title":"Guest Cast","level":3,"content":[{"type":"list","elements":[{"text":"Phil Reeves as Phil Maguire","elements":[]},{"text":"Emerson Brooks as Air Force Recruiter","elements":[]},{"text":"Trevor Einhorn as Justin Polznik","elements":[]},{"text":"Charlie McDermott as Student","elements":[]},{"text":"Lori Murphy Saux as Announcer","elements":[]}]}],"images":[]},{"title":"Recurring Cast","level":3,"content":[{"type":"list","elements":[{"text":"Nelson Franklin as Graphic Design Guy","elements":[]},{"text":"Elvy Yost as Megan (deleted scene)","elements":[]}]}],"images":[]},{"title":"References","level":2,"content":[{"type":"list","elements":[{"text":"↑ Lee Eisenberg answers 'Job Fair' questions, Office Tally","elements":[]}]},{"type":"paragraph","text":"No"}],"images":[]}]}