{"sections":[{"title":"Koi Pond","level":1,"content":[{"type":"paragraph","text":"\"Koi Pond\" is the eighth episode in the sixth season of The Office and the 108th episode overall. It was written by Warren Lieberstein and Halsted Sullivan and directed by Reggie Hudlin. It aired on October 29, 2009 and was viewed by 8.20 million people."}],"images":[]},{"title":"Synopsis","level":2,"content":[{"type":"paragraph","text":"Michael accompanies Jim to a client meeting. While there, Michael accidentally trips and falls into their koi pond. Word spreads around the office, causing all types of puns and jokes at Michael's expense. Michael, unable to handle humor directed at him, gets angry. Jim tries to calm Michael down and get him to see the humor in the situation. If he shows that he can take a few jokes, it will probably cause them to end more quickly. He starts off well, lobbing a few hardballs at himself, but inevitably goes too far in mocking his friendship challenges and storms off. Then Meredith is sent a video of the incident. Jim attempts to convince the group to leave things alone, but Michael decides to let it be shown. The video captures Jim deliberately bending backward to avoid grabbing Michael as he falls."},{"type":"paragraph","text":"In Michael's office, Jim admits he resented that Michael didn't trust him to handle the meeting himself. Michael can't believe that Jim is jealous of him."},{"type":"paragraph","text":"Meanwhile, Andy and Pam, the two poorest-performing salesmen, are sent on cold calls. The potential clients assume that the two are a married couple which causes some awkward moments and quick denials. Eventually, they decide to pose as a married couple in hopes of landing a sale. Andy takes the ruse too far which makes Pam and the client uncomfortable. They land no sales. On the car ride back to the office, Andy admits to liking Erin, and Pam tries to help the two get together."}],"images":[]},{"title":"Connections to previous episodes","level":2,"content":[{"type":"list","elements":[{"text":"Creed offering to sell blood to children is a callback from when Creed stole blood from the blood drive in the Season 5 episode, \"Blood Drive.\"","elements":[]},{"text":"This is the second time Michael ends up soaking wet. The first is in \"Dunder Mifflin Infinity\".","elements":[]},{"text":"Meredith is using her coffee mug from Kelly that is first seen in \"Customer Survey\".","elements":[]}]}],"images":[]},{"title":"Halloween costumes","level":2,"content":[{"type":"paragraph","text":"In the deleted scene that was removed after the premiere of the episode, the staff put up a haunted warehouse for the local children. Each staff member is wearing a Halloween costume."},{"type":"list","elements":[{"text":"Michael- Character from SNL's \"D**k in a Box\", \"Mother Lover\" and \"3-Way\" Sketch","elements":[]},{"text":"Dwight- Jigsaw","elements":[]},{"text":"Jim- Facebook","elements":[]},{"text":"Pam- Rosemary Woodhouse","elements":[]},{"text":"Darryl- Wearing a jack-o-lantern shirt, Michael refers to him as a \"gangster pumpkin\"","elements":[]},{"text":"Angela- Black Widow","elements":[]},{"text":"Kevin- Paul Blart","elements":[]},{"text":"Erin- Princess Fiona","elements":[]},{"text":"Kelly- Leeloo from \"The Fifth Element\"","elements":[]},{"text":"Ryan- Edward Cullen","elements":[]},{"text":"Creed- Dracula","elements":[]},{"text":"Meredith- Hobo","elements":[]},{"text":"Mose- Himself","elements":[]},{"text":"Oscar- Sarah Palin","elements":[]},{"text":"Andy- Michael Jackson","elements":[]}]}],"images":[]},{"title":"Trivia","level":2,"content":[{"type":"list","elements":[{"text":"The original opening for the episode involved the office putting together a haunted house in the warehouse for some children. The opening was removed however after people were offended by a scene of Michael hanging himself.","elements":[]},{"text":"Do Not Mock List:","elements":[{"text":"Michael- Koi Pond, Fountain (he says he also fell into the fountain at the Steamtown Mall)","elements":[]},{"text":"Dwight- Nose too small","elements":[]},{"text":"Erin- Orphan","elements":[]},{"text":"Kevin- Huge Gut","elements":[]},{"text":"Angela- Shrimpy (Then she says that some people think she eats like a squirrel. Phyllis says, \"So you're comparing yourself to a cute tiny animal?\".)","elements":[]},{"text":"Meredith- Sex with a terrorist","elements":[]},{"text":"Phyllis- Acid Reflux","elements":[]},{"text":"Stanley- Crosswords","elements":[]},{"text":"Ryan- Kelly","elements":[]}]},{"text":"Strangely, Dwight doesn't react when Jim yells at Angela as he usually does when someone wrongs her. This is especially odd considering Dwight's vendetta against Jim at the time.","elements":[]},{"text":"Most of the office workers change their computer's screensavers to fish tanks after this episode.","elements":[]},{"text":"Michael says \"Loser\" in a similar way Jim Carey famously does in the movie \"Ace Ventura\".","elements":[]},{"text":"Michael incorrectly answers that \"Wilma\" is the wife of Popeye. In his naivety, he's actually getting her confused with the wife of cartoon character Fred Flintstone, from the classic 1960s cartoon The Flintstones. Olive Oyl, is in fact Popeye's wife.","elements":[]}]}],"images":[]},{"title":"Quotes","level":2,"content":[{"type":"paragraph","text":"Dwight: \"Jim is my enemy. But it turns out that Jim is also his own worst enemy. And the enemy of my enemy is my friend. So, Jim is actually my friend. But... because he is his own worst enemy, the enemy of my friend is my enemy. So, actually Jim is my enemy. But-\""}],"images":[]},{"title":"Goofs","level":2,"content":[{"type":"list","elements":[{"text":"Michael says he doesn't even have Jan's cell phone number, but in the season 4 episode: Chair Model he accidentally calls Jan while talking to Pam's landlady. Although, it’s possible that she has changed her phone number since then.","elements":[]}]}],"images":[]},{"title":"Cast","level":2,"content":[],"images":[]},{"title":"Main cast","level":3,"content":[{"type":"list","elements":[{"text":"Steve Carell as Michael Scott","elements":[]},{"text":"Rainn Wilson as Dwight Schrute","elements":[]},{"text":"John Krasinski as Jim Halpert","elements":[]},{"text":"Jenna Fischer as Pam Halpert","elements":[]},{"text":"B.J. Novak as Ryan Howard","elements":[]}]}],"images":[]},{"title":"Supporting cast","level":3,"content":[{"type":"list","elements":[{"text":"Ed Helms as Andy Bernard","elements":[]},{"text":"Leslie David Baker as Stanley Hudson","elements":[]},{"text":"Brian Baumgartner as Kevin Malone","elements":[]},{"text":"Kate Flannery as Meredith Palmer","elements":[]},{"text":"Creed Bratton (actor) as Creed Bratton","elements":[]},{"text":"Mindy Kaling as Kelly Kapoor","elements":[]},{"text":"Ellie Kemper as Erin Hannon","elements":[]},{"text":"Angela Kinsey as Angela Martin","elements":[]},{"text":"Paul Lieberstein as Toby Flenderson","elements":[]},{"text":"Oscar Nunez as Oscar Martinez","elements":[]},{"text":"Phyllis Smith as Phyllis Vance","elements":[]}]}],"images":[]},{"title":"Guest cast","level":3,"content":[{"type":"list","elements":[{"text":"Tom Yi as Tim Dockery","elements":[]},{"text":"Amy Weaver as Keena Gifford","elements":[]},{"text":"Jennifer Hasty as the Receptionist","elements":[]}]}],"images":[]}]}