{"sections":[{"title":"Last Day in Florida","level":1,"content":[{"type":"paragraph","text":"\"Last Day in Florida\" is the eighteenth episode of the eighth season of the American television comedy series The Office and is the show's 170th overall. It was written by Robert Padnick and directed by Matt Sohn. It originally aired on NBC March 8, 2012. It was viewed by 4.89 million people."}],"images":[]},{"title":"Synopsis","level":2,"content":[{"type":"paragraph","text":"Dwight celebrates his winning of the Vice President position on a golf outing with Jim, Robert California, and Nellie Bertram. After playing, Robert tells Jim that he dislikes the business plan for the Sabre store; he only approved it because Jo Bennett wanted it, but he plans to sandbag it at a high-level meeting, and Jim is stunned when Robert strongly hints he's going to fire Dwight over it. Jim makes several attempts to stop Dwight from attending the meeting with Robert, but Dwight is heedless and continually insults Jim, who finally decides to leave Dwight to his fate. However, a guilt-inducing phone call to Pam makes Jim decide he has to keep parsing Dwight's insults until he directly tells him that he's going to lose his job. Dwight ignores the news, thinking Jim is jealous of him, so Jim resorts to wrestling with Dwight outside the conference room. In the meantime, Nellie has Todd Packer stand in as VP in Dwight's absence. When Dwight makes it into the conference room, he hears Robert planning to fire the VP, so he sneaks out of the conference room and lets Packer take the fall in front of those present. Dwight then silently extends a hand to Jim, and they head back to Scranton with Stanley, who has reverted to his old grumpy self over the thought of leaving Florida."},{"type":"paragraph","text":"Back in Scranton, Darryl and Toby are both trying to sell girl scout cookies for their daughters. When Toby's requests clash with Darryl's, Darryl tells him they need their own sections of the office to sell to in order to not interfere with each other. Darryl takes accounting while Toby gets every other section. Darryl asks for accounting because Kevin buys more cookies than everyone else put together. Toby eventually realizes Darryl's plan and the two end up fighting over who will sell Kevin cookies, with Kevin coming up with absurd competition ideas. After doing a song and dance for Kevin, Kevin still can't make up his mind, so Darryl and Toby contemplate giving up until Kevin mentions he plans to buy hundreds of boxes of cookies, at which point they continue the competition. They finally give up for good when Kevin wants to ride them like a pony, citing they still want to maintain their dignity and will not go beyond the limit to what they'd do for their daughters. When they walk away, Kevin says he'll do any absurd thing for them to continue, kissing Meredith to prove it, but they still refuse."},{"type":"paragraph","text":"Meanwhile, Andy learns that Erin isn't coming back to Scranton after she takes a job helping an elderly lady she met at the Sabre store opening, leaving Andy very distraught. When Dwight, Jim, and Stanley return to Scranton and Andy sees Jim happily reunite with Pam, Andy decides to travel to Florida to try and bring Erin back."}],"images":[]},{"title":"Connections to previous episodes","level":2,"content":[{"type":"list","elements":[{"text":"The way Andy tells the office that Dwight is staying in Florida, mirrors the same way Michael told the office that he hit Meredith with his car in Fun Run.","elements":[]}]}],"images":[]},{"title":"Cultural References","level":2,"content":[{"type":"list","elements":[{"text":"Included on Andy's whiteboard of possible items inside Dwight's treasure chest is the phrase \"Rosebud-type scenario\" and \"Star Wars stuff.\"","elements":[]},{"text":"Erin walks through Irene's front door and, imitating Ricky Ricardo, says, \"Hey, Lucy! I'm home!\"","elements":[]},{"text":"Kevin says he wants to be \"wined and dined and 69'ed\" (metaphorically).","elements":[]},{"text":"In the episode, Ryan mentions that he told everybody through his Tumblr account that Erin was not coming back from Florida.","elements":[]},{"text":"Kevin forces Toby and Darryl to sing \"Hello! Ma Baby\" in the style of Michigan J. Frog.","elements":[]},{"text":"Oscar uses reverse psychology on himself and then realizes, \"I'm Wallace Shawn in The Princess Bride!\"","elements":[]},{"text":"Instead of making tea, Erin boils Gatorade, the sports drink.","elements":[]}]}],"images":[]},{"title":"Cast","level":2,"content":[],"images":[]},{"title":"Main Cast","level":3,"content":[{"type":"list","elements":[{"text":"Rainn Wilson as Dwight Schrute","elements":[]},{"text":"John Krasinski as Jim Halpert","elements":[]},{"text":"Jenna Fischer as Pam Halpert","elements":[]},{"text":"B.J. Novak as Ryan Howard","elements":[]},{"text":"Ed Helms as Andy Bernard","elements":[]}]}],"images":[]},{"title":"Supporting Cast","level":3,"content":[{"type":"list","elements":[{"text":"Catherine Tate as Nellie Bertram","elements":[]},{"text":"Leslie David Baker as Stanley Hudson","elements":[]},{"text":"Brian Baumgartner as Kevin Malone","elements":[]},{"text":"Creed Bratton (actor) as Creed Bratton","elements":[]},{"text":"Kate Flannery as Meredith Palmer","elements":[]},{"text":"Mindy Kaling as Kelly Kapoor","elements":[]},{"text":"Ellie Kemper as Erin Hannon","elements":[]},{"text":"Angela Kinsey as Angela Martin","elements":[]},{"text":"Paul Lieberstein as Toby Flenderson","elements":[]},{"text":"Oscar Nunez as Oscar Martinez","elements":[]},{"text":"Craig Robinson as Darryl Philbin","elements":[]},{"text":"Phyllis Smith as Phyllis Vance","elements":[]},{"text":"Zach Woods as Gabe Lewis","elements":[]}]}],"images":[]},{"title":"Reccuring Cast","level":3,"content":[{"type":"list","elements":[{"text":"David Koechner as Todd Packer","elements":[]},{"text":"Lindsey Broad as Cathy Simms","elements":[]},{"text":"Georgia Engel as Irene","elements":[]}]}],"images":[]}]}