{"sections":[{"title":"Lecture Circuit Part 1","level":1,"content":[{"type":"paragraph","text":"\"Lecture Circuit Part 1\" is the sixteenth episode of the fifth season of the television series The Office, and the show's 88th episode overall. It was written by Mindy Kaling and directed by Ken Kwapis. The episode aired on February 5, 2009 and was viewed by 8.39 million people."}],"images":[]},{"title":"Synopsis","level":2,"content":[{"type":"paragraph","text":"Michael is asked to go around to the different branches to lecture about Scranton's success, except Nashua, where Holly was transferred, as Michael says it's still a \"little bit raw\" there. He brings Pam along as his assistant, mostly just to carry around his belongings. Pam states that she agreed to come on the trip because she gets time and a half pay. Their first stop is the Utica branch, where Karen is the regional manager. Pam is nervous to see Karen as she believes Karen is still mad at her over Jim. When Karen comes to greet them, the two are shocked to see that she is pregnant. Michael immediately asks if it is Jim's, which Karen denies. Michael's lecture to the Utica branch is a failure and Karen brings Michael and Pam into her office. While Michael fools around, Karen reveals to Pam she is due in one month and is married to a dermatologist named Dan. Pam mentions that she and Jim are engaged, about which Karen hesitantly but happily congratulates her. On the way to the car, Pam mentions to Michael that she is happy she came on the trip because she found closure with Karen. Later, in the car, Michael tells Pam about Holly and how he never really found closure with her. Pam suggests that they drive to Nashua so that he can find closure, and Michael agrees, blowing off the lecture in Rochester."},{"type":"paragraph","text":"Back in Scranton, Jim and Dwight become the reluctant heads of the Party Planning Committee after Phyllis blackmailed Angela. Michael determined that Angela and Phyllis became too power hungry when they were the sole heads at their respective times, and it would be best for both of them to step down and appoint two new heads. They openly show their disdain for it, which is reflected in their performance of their duties when Kelly chastises them for forgetting her birthday. They try to make it up to her by having a party but do a poor job setting it up as Dwight puts little effort into blowing up the balloons and neither of them know how old Kelly is. Dwight reads through Kelly's file report and finds out that she has been to juvenile hall. He is, however, disappointed when he reads that it has not affected her job performance."},{"type":"paragraph","text":"Meanwhile, Andy finds himself attracted to Julia, a potential female client, who is talking with Stanley. Andy awkwardly interrupts their business meeting and Stanley pulls him aside. Andy admits his attraction to her to Stanley, who then gives the potential client over to Andy in exchange for two of his clients. Andy awkwardly gets Julia to reveal that she is single and tries to muster up the courage to ask her out. Creed suggests that he goes in for the kiss, before mistakenly calling him Jim. Andy walks the client to her car and attempts to kiss her, but she immediately rebukes his advances. Andy apologizes and mentions that he just got out of a relationship. The client mentions that she got out of a relationship as well and Andy starts feeling a connection, but she still rejects him and he loses the account."}],"images":[]},{"title":"Cultural References","level":2,"content":[{"type":"list","elements":[{"text":"Michael has a Canadian flag sticker on his luggage which could likely be from his trip to Winnipeg in Business Trip.","elements":[]},{"text":"Pam tosses chocolate bars into the audience during Michael's speech to the Utica office just as Michael did to Ryan's classmates in Business School.","elements":[]},{"text":"Jim and Dwight forget to throw a birthday party for Kelly. This is the second time they have forgotten to do something for Kelly, the first being attending her America's Got Talent party, mentioned in Customer Survey.","elements":[]},{"text":"In the photo of Karen and her husband dressed as a hamburger and hot dog, Karen's husband resembles the \"Hiya buddy\" hot dog doodle from The Deposition.","elements":[]},{"text":"During Michael's presentation at the Utica branch, a copier can be seen through the window to the room behind Michael and Pam. The copier appears to be chained to the wall, as well as having a blue sign stating \"Report any suspicious persons near the copier!\", likely referencing Branch Wars in which Michael and Dwight push Utica's industrial copier down a stairwell.","elements":[]},{"text":"When Michael and Pam are discussing Karen’s pregnancy with Karen Michael asks was she impregnated by a “sperm machine”, eluding to the way Jan decided to have a child as revealed to Michael in Goodbye, Toby.","elements":[]}]}],"images":[]},{"title":"Trivia","level":2,"content":[{"type":"list","elements":[{"text":"B.J. Novak (Ryan Howard) is credited but does not appear in this episode.","elements":[]},{"text":"Pam does not seem to know Rolando, but in the episode, Branch Wars, she and Rolando seem to know each other and he was the one who informed her of Michael, Jim and Dwight's antics. They had never met in person but probably knew each other through phone calls.","elements":[]},{"text":"Michael has Pam as his assistant carrying his luggage similar to how David Brent makes Dawn in motivation.","elements":[]},{"text":"For the record, this episode occurs approximately 20 months after the last time it would have been plausible for Jim and Karen to have had sex.","elements":[]},{"text":"It bears notice that when Michael questions AJ about Holly during the presentation AJ has no idea Michael dated Holly, even though AJ stated that his relationship with Holly was serious. This is further evidence of Holly’s unresolved feelings toward Michael.","elements":[]},{"text":"The character of Julia is played by the actress Erica Tazel, who went on to play Deputy US Marshal Rachel Brooks in the TV show Justified.","elements":[]}]}],"images":[]},{"title":"Amusing Details","level":2,"content":[{"type":"list","elements":[{"text":"Production while filming this episode had to be shut down for 20 minutes at one point because Rainn Wilson and John Krasinski had a laughing fit.","elements":[]},{"text":"In the cold open, nobody does anything when Michael says things on the PA system, but when Michael begins abusing Toby, Jim realises Michael has gone too far and decides to cut the wire and put an end to the system. This most likely further expands Jim's friendship with Toby. ","elements":[]}]}],"images":[]},{"title":"Cultural references","level":2,"content":[{"type":"list","elements":[{"text":"Andy sings the song \"1234\" by Feist, with altered lyrics.","elements":[]},{"text":"In the cold open, when Jim walks into Michael's office to cut his telephone wire, Michael recites the classic introduction the Chicago Bulls announcers had for Michael Jordan. Michael Jordan is also 6'6\" and from North Carolina.","elements":[]},{"text":"While Creed is talking to Andy about Julia, Creed references how he ended up with \"Squeaky Fromme,\" a former member of the Manson family.","elements":[]}]}],"images":[]},{"title":"Cast","level":2,"content":[],"images":[]},{"title":"Main Cast","level":3,"content":[{"type":"list","elements":[{"text":"Steve Carell as Michael Scott","elements":[]},{"text":"Rainn Wilson as Dwight Schrute","elements":[]},{"text":"John Krasinski as Jim Halpert","elements":[]},{"text":"Jenna Fischer as Pam Beesly","elements":[]},{"text":"B.J. Novak as Ryan Howard","elements":[]}]}],"images":[]},{"title":"Supporting Cast","level":3,"content":[{"type":"list","elements":[{"text":"Ed Helms as Andy Bernard","elements":[]},{"text":"Leslie David Baker as Stanley Hudson","elements":[]},{"text":"Brian Baumgartner as Kevin Malone","elements":[]},{"text":"Creed Bratton (actor) as Creed Bratton","elements":[]},{"text":"Kate Flannery as Meredith Palmer","elements":[]},{"text":"Mindy Kaling as Kelly Kapoor","elements":[]},{"text":"Angela Kinsey as Angela Martin","elements":[]},{"text":"Paul Lieberstein as Toby Flenderson","elements":[]},{"text":"Oscar Nunez as Oscar Martinez","elements":[]},{"text":"Phyllis Smith as Phyllis Vance","elements":[]}]}],"images":[]},{"title":"Special Guest Cast","level":3,"content":[{"type":"list","elements":[{"text":"Rashida Jones as Karen Filippelli","elements":[]}]}],"images":[]},{"title":"Guest Cast","level":3,"content":[{"type":"list","elements":[{"text":"Erica Tazel as Julia","elements":[]},{"text":"Adam Jamal Craig as Rolando","elements":[]},{"text":"Brian Patrick Mulligan as Mark \"Baldy\"","elements":[]}]}],"images":[]}]}