{"sections":[{"title":"Lecture Circuit Part 2","level":1,"content":[{"type":"paragraph","text":"\"Lecture Circuit Part 2\" is the seventeenth episode of the fifth season of The Office and the 89th episode overall. It was written by Mindy Kaling and directed by Ken Kwapis. It originally aired February 12, 2009. It was viewed by 11.5 million people."}],"images":[]},{"title":"Synopsis","level":2,"content":[{"type":"paragraph","text":"Michael and Pam head to the Nashua branch to give a presentation, as well as having Michael find closure with Holly. When they arrive at the branch, they find that Holly is away on an HR retreat. They also learn that she is dating one of the salesmen there named A.J., which deeply upsets Michael."},{"type":"paragraph","text":"Michael finds himself unable to give the presentation after hearing that news. Pam empathizes with Michael saying she felt the same way when Jim was dating Karen, but she kept her composure. She encourages Michael to do the best presentation possible so that people will tell Holly about it."},{"type":"paragraph","text":"They then go do their presentation, which starts off well, until Michael calls out A.J. about his relationship with Holly. Michael then leaves the room deeply upset, leaving Pam to do the rest of the presentation using Michael's techniques, which fails. Michael goes to Holly's desk and cuts off a sleeve of her sweater and puts it in his pocket. He looks at her computer and finds a file entitled \"Dear Michael\", which he copies to his flash drive. Later, at a diner, Michael tells Pam what he did and Pam says it was not a good idea to copy the file and that he should not read it, given that he would be violating her trust. Pam, however, volunteers to read it, and deletes it afterward. She says that the letter said that Holly still has feelings for Michael and that it's not over. Michael becomes happy and feels like he has found closure."},{"type":"paragraph","text":"Back in Scranton, Jim picks up a blank cake for Kelly, and later decorates it with her name spelled incorrectly. Dwight tries to find out why Kelly was in juvenile hall. Kelly explains that it was because her boyfriend at the time dumped her and she responded by stealing his father's boat. Kelly gets mad at Jim and Dwight for not having a theme."},{"type":"paragraph","text":"Jim and Dwight then wonder what Kelly's favorite things are so they can make a theme out of it. When the party starts, Jim and Dwight give Kelly the option of either watching TV for an hour or taking a nap for an hour. Kelly says she loves the theme and decides to take a nap in the conference room for an hour. Jim and Dwight enjoy the ice cream cake at the reception couch, on which Dwight compliments him for getting."},{"type":"paragraph","text":"Angela comes in happier than usual because she bought a new cat for $7,000 with the money she received from selling her engagement ring from Andy. Kevin and Oscar are annoyed with the fact that Angela set a nanny cam up at her home so she can monitor them from work. Angela becomes rather distressed when one of her cats (Mister Ash) tries to have sex with her new cat (Princess Lady), while Kevin, Oscar, Meredith, and Creed find it funny. She goes home to check on them but leaves the nanny cam on and Kevin and Oscar become disgusted at the image of Angela licking her cat on the monitor. Angela comes back to work and coughs up a cat hair, which is an image that Oscar claims will disturb him for the rest of his life."}],"images":[]},{"title":"Deleted Scenes","level":2,"content":[{"type":"list","elements":[{"text":"In a talking head interview, Angela tells the camera crew that as she is no longer in any relationships, she decided to treat herself to a new cat that cost $7,000.","elements":[]},{"text":"Jim and Dwight approach Toby who is in a Finer Things Club meeting with Oscar and asks for suggestions on what Kelly may want in her birthday party.","elements":[]},{"text":"Dwight picks up the book Toby and Oscar are discussing, \"The Rape of Nanking\" by Iris Chang and expresses his love for it.","elements":[]},{"text":"Michael asks A.J. if Holly talks about him and gets upset when he learns that she doesn't.","elements":[]}]},{"type":"list","elements":[{"text":"In a talking head scene, Kevin shows the camera his phone on which he recorded Angela's absurd interaction with her cats including her babytalk and meowing and says that he is saving it for a rainy day.","elements":[]}]}],"images":[]},{"title":"Episode references","level":2,"content":[{"type":"list","elements":[{"text":"Michael has a Canadian flag sticker on his luggage which could likely be from his trip to Winnipeg in Business Trip.","elements":[]},{"text":"Pam tosses chocolate bars into the audience during Michael's speech to the Nashua office just as Michael did to Ryan's classmates in Business School.","elements":[]},{"text":"Jim and Dwight forget to throw a birthday party for Kelly. This is the second time they have forgotten to do something for Kelly, the first being attending her America's Got Talent party, mentioned in Customer Survey.","elements":[]},{"text":"When Michael walks in to do his presentation, he screams out \"GOOD MORNING, VIETNASHUA!\" This is a reference to Michael's being a fan of Robin Williams; it references Williams' movie \"Good Morning, Vietnam\". Michael also used the \"good morning, Vietnam\" line in Dwight's Speech.","elements":[]},{"text":"At the end of the episode when Michael talks about how relieved he was to have closure with Holly, he suggests on a whim that he should apologize to Tony Gardner. Tony was a former employee from the Stamford branch who transferred to Scranton in The Merger that Michael fired when Tony tried to quit.","elements":[]},{"text":"After Michael finds out about Holly and A.J., Pam empathizes with him the same way Jim empathized with Dwight in Money.","elements":[]}]}],"images":[]},{"title":"Trivia","level":2,"content":[{"type":"list","elements":[{"text":"Despite numerous claims to have superior strength and health, Dwight's lung capacity seems to be severely below average as he appears unable to inflate a balloon. However, this may be due to his inexperience with birthday parties and birthday decorations.","elements":[]},{"text":"The employees at the Nashua branch initially laugh at Michael's presentation, probably because they don't get many visitors, as Pam states earlier in the episode.","elements":[]}]}],"images":[]},{"title":"Cast","level":2,"content":[],"images":[]},{"title":"Main cast","level":3,"content":[{"type":"list","elements":[{"text":"Steve Carell as Michael Scott","elements":[]},{"text":"Rainn Wilson as Dwight Schrute","elements":[]},{"text":"John Krasinski as Jim Halpert","elements":[]},{"text":"Jenna Fischer as Pam Beesly","elements":[]}]}],"images":[]},{"title":"Supporting cast","level":3,"content":[{"type":"list","elements":[{"text":"Leslie David Baker as Stanley Hudson","elements":[]},{"text":"Brian Baumgartner as Kevin Malone","elements":[]},{"text":"Creed Bratton (actor) as Creed Bratton","elements":[]},{"text":"Kate Flannery as Meredith Palmer","elements":[]},{"text":"Mindy Kaling as Kelly Kapoor","elements":[]},{"text":"Angela Kinsey as Angela Martin","elements":[]},{"text":"Paul Lieberstein as Toby Flenderson","elements":[]},{"text":"Oscar Nunez as Oscar Martinez","elements":[]},{"text":"Phyllis Smith as Phyllis Vance","elements":[]}]}],"images":[]},{"title":"Recurring cast","level":3,"content":[{"type":"list","elements":[{"text":"Rashida Jones as Karen Filippelli (only in the \"Previously on The Office\" intro)","elements":[]}]}],"images":[]},{"title":"Guest cast","level":3,"content":[{"type":"list","elements":[{"text":"Rob Huebel as A.J.","elements":[]},{"text":"Katherine Flynn as Receptionist","elements":[]},{"text":"Michael McCartney as Nashua Employee","elements":[]},{"text":"Mary Wall as Nashua Employee","elements":[]}]}],"images":[]}]}