{"sections":[{"title":"Lice","level":1,"content":[{"type":"paragraph","text":"\"Lice\" is the tenth episode of the ninth season of the American television comedy series The Office and is the show's 186th overall. It was written by Niki Schwartz-Wright and directed by Rodman Flender. It aired on January 10, 2013. It was viewed by 4.54 million people."}],"images":[]},{"title":"Synopsis","level":2,"content":[{"type":"paragraph","text":"In the intro, Jim is talking about sports with Kevin and Darryl when he accidentally bites his lip. Jim tries not to let it affect him but after biting his lip twice more he storms out of the break room. On camera, he's trying to blow it off as not a big deal, until he bites his lip again, at which point he gives up and decides to take the rest of the day off."},{"type":"paragraph","text":"Pam comes into the office looking so tired and disheveled that Erin mistakes her for Meredith. Pam explains that Jim has been spending a few days a week in Philadelphia working on his new company and that she has been taking care of the kids. She also explains that Cece recently got lice and she was awake all night disinfecting everything in the house."},{"type":"paragraph","text":"Meanwhile, Jim is in Philadelphia and is very excited as he is about to meet Julius Erving, also known as Dr. J, a famous former NBA player. He doesn't tell any of this to Pam on the phone as he feels it would just stress her out to know he is having fun while she is working."},{"type":"paragraph","text":"Meanwhile, Darryl and Val have just broken up. While he is with Val, Darryl appears to be quite saddened by the breakup, but during his interview he reveals that he manipulated Val into breaking up with him because their relationship wasn't going anywhere and he wanted his freedom if he was going to be working at Jim's company in Philadelphia."},{"type":"paragraph","text":"When Pam asks Meredith to fill out a form she notices Meredith furiously scratching her head and worries that she might have brought lice into the office. Erin notices Meredith scratching and, after searching her scalp, she confirms that Meredith has lice, having become familiar with lice while in a foster home. Erin then proceeds to check everyone in the office and finds everyone infected except Dwight, Phyllis, Nellie, Kevin, and Darryl. Pam looks furtively at the camera but continues with the deception, not revealing that she is really to blame for the lice."},{"type":"paragraph","text":"Meanwhile, Jim has been picked up by a limo and is confused when he is dropped off at a basketball court but the driver reveals that Dr. J asked that Jim be dropped off at his private basketball court, exciting Jim."},{"type":"paragraph","text":"Dwight comes in wearing a hazmat suit and orders that the people without lice continue their work in the warehouse instead of the office and deals with the rest of the lice-infested people."},{"type":"paragraph","text":"Pam decides that she is going to tell Meredith that she was the one who infested her with lice, but when she goes into the kitchen she is shocked to find Meredith shaving her head. Too embarrassed and nervous to say anything Pam allows Meredith to continue shaving off her hair."},{"type":"paragraph","text":"In the warehouse, Darryl warns no one to say anything to Val while they are down there since they just broke up. He feigns sadness whenever he sees her, leading Nellie, Kevin, and Phyllis to believe that Darryl is heartbroken by their breakup and they resolve that they should get the two back together."},{"type":"paragraph","text":"Jim meets Dr. J and plays basketball with him, still not believing how amazing his day is turning out to be."},{"type":"paragraph","text":"Dwight and Erin discuss lice and how to get rid of them. Dwight believes everyone should shave their head and Erin says that they can use mayonnaise to kill the lice easily. They go with the mayonnaise plan, and Pam makes a trip to the store for it. When she gets back to the office and starts unloading her car, she calls Jim. He asks Dr. J if he can take the call from his wife and Dr. J encourages him to take it. They have a short conversation during which Pam drops two jars of mayonnaise on the ground and they spill everywhere."},{"type":"paragraph","text":"Everyone except Dwight partners up to apply mayonnaise to each other's heads. The partners are: Pete and Erin, Oscar and Angela, Meredith and Stanley, leaving Pam to partner with Creed. Creed ironically complains that he's left with the weird one in the office."},{"type":"paragraph","text":"While putting mayo in Oscar's hair, Angela becomes subtly aggressive: slapping him in the face while putting on the mayo, letting excess mayonnaise run down his face and neck, and hitting him in the head with a coffee pot while rinsing out the water. In the annex Pete and Erin have fun together as they put on their mayonnaise, laughing and imitating different characters, and after Creed abandons Pam she is forced to put it on by herself."},{"type":"paragraph","text":"Phyllis, Kevin, and Nellie convince Val to give Darryl another chance. Val finally agrees that maybe they should continue their relationship, much to Darryl's chagrin and he sadly tells the cameras that he and Val are back together."},{"type":"paragraph","text":"Back in the office Dwight announces that he has bought a \"insecticidal grenade\" which he plans to detonate in the office, but as he is talking to the group he drops it and the bomb goes off around him. Dwight then tells the office that the exploded bomb seems to have hallucinogenic effects and after speaking nonsensically he faints."},{"type":"paragraph","text":"As Erin readies herself to rinse the mayo off of Pete's head he removes his shirt, revealing a toned body beneath his undershirt, and draws Erin's attention, although she looks quickly away. She begins washing the mayonnaise out of his hair affectionately and asks if it's too cold. He says no and they both give a small smile."},{"type":"paragraph","text":"When Pam is spreading mayonnaise into her hair by herself she receives a phone call and, as her hands are covered in mayo, she is unable to answer it and puts the phone on speaker instead. On the other end it is Helene who tells her that she has just picked up Cece after she was sent home from school because she still has lice. As the phone is on speaker everyone in the office hears the call and they furiously shout at Pam for bringing in the lice and letting Meredith take the blame. Meredith angrily demands Pam shave her head."},{"type":"paragraph","text":"When Pete stops by Erin's desk he finds it empty and Oscar tells him that she has already gone home for the day. Pete looks visibly saddened by the news, but Erin is actually standing by the supply shelves and sees his reaction. In the parking lot Dwight tells the camera he is ready to deal with lice and accidentally drops another lice bomb, which detonates in his car."},{"type":"paragraph","text":"Pam calls Jim again and leaves him a message as he does not see that she is calling him because he is busy playing basketball with Dr. J. Overhearing Pam's sad voicemail message for Jim, Meredith invites her out for a drink and Pam smiles and agrees, relieved. At the bar Pam admits she is impressed by Meredith's ability to have been a single mom all these years and the two look happy, the episode ending with Pam and Meredith singing karaoke at the bar and appearing to have a good time."}],"images":[]},{"title":"Connections to Previous Episodes","level":2,"content":[{"type":"list","elements":[{"text":"Nellie refers to her breakup from Welcome Party.","elements":[]},{"text":"Darryl's grandmother passed away in PDA.","elements":[]}]}],"images":[]},{"title":"Trivia","level":2,"content":[{"type":"list","elements":[{"text":"Despite no longer being on the show, the Gabe Lewis \"Get Glue\" sticker, was released with the episode.","elements":[]}]}],"images":[]},{"title":"Goofs","level":2,"content":[{"type":"list","elements":[{"text":"Before Jim plays basketball with Dr. J (the game where Pam tries to call Jim), his shirt is untucked. In the next shots, his shirt is tucked in.","elements":[]}]}],"images":[]},{"title":"Cast","level":2,"content":[],"images":[]},{"title":"Main Cast","level":3,"content":[{"type":"list","elements":[{"text":"Rainn Wilson as Dwight Schrute","elements":[]},{"text":"John Krasinski as Jim Halpert","elements":[]},{"text":"Jenna Fischer as Pam Halpert","elements":[]},{"text":"Ed Helms as Andy Bernard","elements":[]}]}],"images":[]},{"title":"Supporting Cast","level":3,"content":[{"type":"list","elements":[{"text":"Catherine Tate as Nellie Bertram","elements":[]},{"text":"Leslie David Baker as Stanley Hudson","elements":[]},{"text":"Brian Baumgartner as Kevin Malone","elements":[]},{"text":"Creed Bratton as Creed Bratton","elements":[]},{"text":"Kate Flannery as Meredith Palmer","elements":[]},{"text":"Ellie Kemper as Erin Hannon","elements":[]},{"text":"Angela Kinsey as Angela Lipton","elements":[]},{"text":"Jake Lacy as Pete Miller","elements":[]},{"text":"Oscar Nunez as Oscar Martinez","elements":[]},{"text":"Craig Robinson as Darryl Philbin","elements":[]},{"text":"Phyllis Smith as Phyllis Vance","elements":[]}]}],"images":[]},{"title":"Guest Cast","level":3,"content":[{"type":"list","elements":[{"text":"Julius Erving as Himself","elements":[]},{"text":"Ameenah Kaplan as Val","elements":[]},{"text":"Jeff Hatch as Limo Driver","elements":[]},{"text":"Sam Richardson as Colin, Athlead Employee","elements":[]},{"text":"Linda Purl as Helene Beesly (voice only) (uncredited)","elements":[]}]}],"images":[]}]}