{
  "sections": [
    {
      "title": "Livin' the Dream",
      "level": 1,
      "content": [
        {
          "type": "paragraph",
          "text": "\"Livin' the Dream\" is the twenty-first episode of the ninth season of The Office and is the show's 197th episode overall. It aired on May 2, 2013."
        }
      ],
      "images": []
    },
    {
      "title": "Synopsis",
      "level": 2,
      "content": [
        {
          "type": "paragraph",
          "text": "Andy attempts to get enough strength to quit his job and pursue his dream as an actor. Dwight receives his black belt in karate from his new sensei (Michael Imperioli). Jim returns to Scranton and spends time with Pam."
        },
        {
          "type": "paragraph",
          "text": "Chief Executive Officer David Wallace talks to the camera crew about him informing Andy that he was on very thin ice after Andy lied to him about being at Dunder Mifflin, but was really on his boat for three months. After Andy buys a top-of-the-line printer \"that is good for head shots\" and asks David to pay for him to have cheek implants, David informs the camera crew that, \"At a certain point, the ice gets too thin, and you fall through. And that is when you get fired.\" Andy attempts to get enough strength to quit his job and pursue his dream as an actor and talks to David about it in his office before he even has the chance to fire Andy. He changes his mind twice, but eventually he makes up his mind and leaves the office. As a goodbye, Andy serenades the rest of the office employees, who initially dismissed Andy's dream as a giant mistake, with a beautiful and moving rendition of Sarah McLachlan's song \"I Will Remember You\". He also defecates on the hood of David Wallace's new car."
        },
        {
          "type": "paragraph",
          "text": "Meanwhile, Dwight receives his black belt in karate from his new sensei. Seeing Dwight's tenacity and devotion, David is inspired to promote Dwight to the regional manager. Jim returns to Scranton and spends time with Pam. Dwight then appoints Jim the new assistant to the regional manager. Darryl informs Jim that Athlead has found a buyer and they are set to travel around the country for three months. Jim tells Darryl he cannot leave Pam for an extended period of time. Pam is seen overhearing their conversation in the bathroom."
        },
        {
          "type": "paragraph",
          "text": "Angela is evicted from her studio apartment after her cats have been taken away by Animal Control. She considers living in a tent in the woods, prompting Oscar to offer for her to stay with him. At the end of the episode, Angela breaks down into tears informing Oscar that she still loves Dwight."
        }
      ],
      "images": []
    },
    {
      "title": "Cultural references",
      "level": 2,
      "content": [
        {
          "type": "list",
          "elements": [
            { "text": "Stanley compares Andy to Lil' Romeo.", "elements": [] }
          ]
        }
      ],
      "images": []
    },
    {
      "title": "Connections to previous episodes",
      "level": 2,
      "content": [
        {
          "type": "list",
          "elements": [
            {
              "text": "During their joint talking head, Pam reveals unnecessary information about their sex life. Jim does the same thing in PDA.",
              "elements": []
            },
            {
              "text": "The ant farm seen in Dwight's new office is the ant farm seen in Todd Packer (episode).",
              "elements": []
            },
            {
              "text": "When David Wallace takes a phone call right as he's about to instate Dwight as manager, David can be heard exclaiming, \"Then we'll get him a new set of drums!\" while presumably on the phone with his wife. In Sabre, David's son plays the drums loudly in the background while Michael is at the Wallace's house.",
              "elements": []
            }
          ]
        }
      ],
      "images": []
    },
    {
      "title": "Amusing details/Trivia",
      "level": 2,
      "content": [
        {
          "type": "list",
          "elements": [
            {
              "text": "The official Office Darryl Philbin \"GetGlue\" sticker was released alongside this episode.",
              "elements": []
            },
            {
              "text": "As of this episode, all five of the new employees transferred from the Stamford branch have left the Scranton branch for good:",
              "elements": [
                {
                  "text": "Tony Gardner announced he was quitting, prompting Michael to fire him instead in The Merger.",
                  "elements": []
                },
                {
                  "text": "Martin Nash quit in the episode The Convinct after his colleagues learned of his past and Michael made a big deal out of it.",
                  "elements": []
                },
                {
                  "text": "Hannah Smoterich-Barr filed a complaint against the company and left (off screen) between the episodes A Benihana Christmas and Back From Vacation.",
                  "elements": []
                },
                {
                  "text": "Karen Filippelli transferred to the Utica branch between the episodes The Job and Fun Run (as seen in a flashback in the Fun Run episode) after breaking up with Jim.",
                  "elements": []
                },
                {
                  "text": "And finally, after having been sent to anger management between The Return and The Negotiation, having been fired in Angry Andy and hired back in Free Family Portrait Studio, and being AWOL between The Boat and Couples Discount, Andy Bernard quits in this episode to pursue an acting career.",
                  "elements": []
                }
              ]
            },
            {
              "text": "When Jim is trying to get his old desk back and Clark replies, \"Well, I'm here to sell paper,\" Dwight can be heard offscreen quietly saying, \"Burn.\"",
              "elements": []
            }
          ]
        }
      ],
      "images": []
    },
    { "title": "Cast", "level": 2, "content": [], "images": [] },
    {
      "title": "Main Cast",
      "level": 3,
      "content": [
        {
          "type": "list",
          "elements": [
            { "text": "Rainn Wilson as Dwight Schrute", "elements": [] },
            { "text": "John Krasinski as Jim Halpert", "elements": [] },
            { "text": "Jenna Fischer as Pam Halpert", "elements": [] },
            { "text": "Ed Helms as Andy Bernard", "elements": [] }
          ]
        }
      ],
      "images": []
    },
    {
      "title": "Supporting Cast",
      "level": 3,
      "content": [
        {
          "type": "list",
          "elements": [
            { "text": "Catherine Tate as Nellie Bertram", "elements": [] },
            { "text": "Leslie David Baker as Stanley Hudson", "elements": [] },
            { "text": "Brian Baumgartner as Kevin Malone", "elements": [] },
            { "text": "Creed Bratton as Creed Bratton", "elements": [] },
            { "text": "Clark Duke as Clark Green", "elements": [] },
            { "text": "Kate Flannery as Meredith Palmer", "elements": [] },
            { "text": "Ellie Kemper as Erin Hannon", "elements": [] },
            { "text": "Angela Kinsey as Angela Martin", "elements": [] },
            { "text": "Jake Lacy as Pete Miller", "elements": [] },
            { "text": "Paul Lieberstein as Toby Flenderson", "elements": [] },
            { "text": "Oscar Nunez as Oscar Martinez", "elements": [] },
            { "text": "Craig Robinson as Darryl Philbin", "elements": [] },
            { "text": "Phyllis Smith as Phyllis Vance", "elements": [] }
          ]
        }
      ],
      "images": []
    },
    {
      "title": "Guest Cast",
      "level": 3,
      "content": [
        {
          "type": "list",
          "elements": [
            { "text": "Andy Buckley as David Wallace", "elements": [] },
            { "text": "Michael Imperioli as Sensei Billy", "elements": [] },
            { "text": "Nora Kirkpatrick as Esther", "elements": [] }
          ]
        }
      ],
      "images": []
    }
  ]
}
