{"sections":[{"title":"Local Ad","level":1,"content":[{"type":"paragraph","text":"\"Local Ad\" is the fifth episode of the fourth season of The Office and the 62nd overall. It was written by B.J. Novak and directed by Jason Reitman. It first aired on October 25, 2007. It was viewed by 8.98 million people."}],"images":[]},{"title":"Synopsis","level":2,"content":[{"type":"paragraph","text":"Dunder Mifflin's corporate office has hired advertising consultants to create a television commercial. Michael is excited by the opportunity to exhibit creativity, but then dismisses the consultants when it’s revealed that his input will be limited to the final five seconds of the commercial, when the branch staff are shown waving at the camera. Corporate accepts Michael’s offer to fund and film his own, alternative commercial by the next day, with the proviso that, if they don't like it better, they'll use the consultants' version."},{"type":"paragraph","text":"Pam, who is taking a computer animation class, makes an animated logo for the commercial. Phyllis tries to enlist author Sue Grafton, who is appearing at a book signing at the local mall to appear in the ad. Phyllis later cries after Grafton refuses their offer."},{"type":"paragraph","text":"Andy struggles throughout the episode to recall the product name from the famous \"Break Me Off a Piece of that Kit Kat Bar\" ad campaign, substituting the final three syllables with the guesses \"applesauce\", \"Chrysler car\", and \"football cream.\""},{"type":"paragraph","text":"Headed by Darryl, a group of employees writes a jingle for the commercial, which is rejected by Michael. The singers include Kelly, Andy, Creed and Kevin. Darryl plays keyboards for the demo they do for Michael, and Michael's rejection hurts Darryl, as we see when he sadly trudges out of the office with the instrument."},{"type":"paragraph","text":"Dwight has largely removed himself to the virtual world of Second Life, but has become Andy’s confidante regarding his relationship with Angela. This is initially painful for him, until Andy confides that, during a makeout session, Angela said, \"Oh, D!\"; it was the first response he has gotten from their physical contact. While Andy interprets this as the second syllable of his name, Dwight is delighted, because Angela used to call him \"D.\""},{"type":"paragraph","text":"The office gathers at a local bar, Poor Richard's, to watch the commercial. Although corporate has rejected Michael’s version of the commercial and aired the original, Jim slips the bartender a DVD of Michael's version, calling it a \"Director's Cut.\" The positive response from the employees and others at the bar cheers Michael up, who later buys all of them another round of drinks."}],"images":[]},{"title":"Trivia","level":2,"content":[{"type":"list","elements":[{"text":"The advertising consultants Forrester and Koh were named for writers Brent Forrester and Ryan Koh. Even though they did not end up playing the roles, they kept the character names.","elements":[]},{"text":"The actor in the corporate advertisement, Jeff Witzke, appears in every one of director Jason Reitman's projects.","elements":[]},{"text":"The tune to the first version of the Dunder Mifflin song was written by writer B.J. Novak's brother. The second version was composed by actor Craig Robinson. The lyrics of the song can be seen below:\n ","elements":[]}]},{"type":"paragraph","text":"Out of paper\nOut of stock\nThere’s friendly faces around the block\nBreak loose from the chains\nThat are causing your pain\nCall Michael and Stanley\nJim, Dwight, Creed\nCall Andy and Kelly\nFor your business paper needs\nDunder Mifflin\nThe people person's paper people\nDunder Mifflin\nThe people person's paper people..."},{"type":"list","elements":[{"text":"Describing a moment in his commercial, Michael uses the expression, Triumph of the Will, seemingly oblivious that this is the title of a Nazi-propaganda film.","elements":[]},{"text":"When Andy discusses \"D\" with Dwight in the break room, he is drinking a Wegman's brand \"W-Pop\".","elements":[]},{"text":"This is the first mention of the Nashua, New Hampshire branch.","elements":[]},{"text":"During the scene with Dwight and Andy in the break room, the logo of the Scranton\/Wilkes-Barre Yankees, the AAA affiliate of the New York Yankees, can be seen on the snack machine.","elements":[]},{"text":"When Michael calls David, the first scene showing the phone has the clock in the upper left hand corner read 9:38. As the call finishes, the time reads 9:22 on the same date of 10\/03\/07.","elements":[]},{"text":"The only other references to Jim playing guitar is when a guitar is visible in his bedroom in the episode Email Surveillance, and a brief moment of him playing his guitar in Vandalism.","elements":[]},{"text":"Michael prank calls Ryan pretending to be Eddie Murphy. This started when Michael got Ryan's cell phone number in \"The Fight,\" He pretended, in order, to be Michael Jackson, Tito Jackson, Mike Tyson, Saddam Hussein, and \"your [Ryan's] girlfriend.\"","elements":[]},{"text":"The full jingle lyric that Andy cannot remember is, \"Break me off a piece of that Kit Kat bar.\" Andy, however, at the end of the episode is sure that the song goes \"Break me off a piece of that Fancy Feast,\" mistakenly referring to the cat food under the belief that the jingle should rhyme.","elements":[]},{"text":"Michael edits the ad with Adobe Premiere Pro.  This is odd given his previously established resistance to technology (the Dunder Mifflin Infinity website, PowerPoint)","elements":[]},{"text":"Michael mispronounces the word \"coup.\"","elements":[]},{"text":"Pam was Jim's ride home even though he has a car, loosely implying that they slept together or at least carpool.","elements":[]},{"text":"The background music used in the Michael Scott's Dunder Mifflin Director's Cut Ad is from the soundtrack of the movie Chariots of Fire and the music composer is Vangelis.","elements":[]},{"text":"The birth of Angela Kinsey's daughter was announced on Second Life by Dwight's alter ego Dwight K. Shelford.","elements":[]},{"text":"At Poor Richard's, the waiter compliments Pam's creative work (on Michael's ad) as a ploy to ask her out on a date. Ryan also uses the same tactic on Pam in Dunder Mifflin Infinity.","elements":[]},{"text":"In Second Life, Dwight's position is \"Assistant to Regional Manager.\" This is odd since he has always wanted to be considered \"Assistant Regional Manager.\" This could be explained out of Dwight's loyalty to Michael. When he first made the Second Life account, he was still Assistant to the RM. Dwight says that everything is exactly the same, except for his ability to fly. So it would make sense that he would put his title as what Michael calls him and what his official title is.","elements":[]},{"text":"While Jim is showing Pam Dwight's profile on Second Life, she notices that Jim's avatar is a sports writer in Philadelphia, which is strangely close to the career he pursues in season 9, that of a sports marketeer in Philadelphia.","elements":[]},{"text":"In the ad, Dwight's character tells Phyllis' character that he is her son. This could be seen as foreshadowing for Phyllis, who in season 7 admits that she had given up a child.","elements":[]}]}],"images":[]},{"title":"Deleted Scenes","level":2,"content":[{"type":"list","elements":[{"text":"Toby shares an idea for the commercial that Michael claims is a bad one. ","elements":[]}]}],"images":[]},{"title":"Cast","level":2,"content":[],"images":[]},{"title":"Main Cast","level":3,"content":[{"type":"list","elements":[{"text":"Steve Carell as Michael Scott","elements":[]},{"text":"Rainn Wilson as Dwight Schrute","elements":[]},{"text":"John Krasinski as Jim Halpert","elements":[]},{"text":"Jenna Fischer as Pam Beesly","elements":[]},{"text":"B.J. Novak as Ryan Howard","elements":[]}]}],"images":[]},{"title":"Supporting Cast","level":3,"content":[{"type":"list","elements":[{"text":"Ed Helms as Andy Bernard","elements":[]},{"text":"Leslie David Baker as Stanley Hudson","elements":[]},{"text":"Brian Baumgartner as Kevin Malone","elements":[]},{"text":"Creed Bratton (actor) as Creed Bratton","elements":[]},{"text":"Kate Flannery as Meredith Palmer","elements":[]},{"text":"Mindy Kaling as Kelly Kapoor","elements":[]},{"text":"Angela Kinsey as Angela Martin","elements":[]},{"text":"Paul Lieberstein as Toby Flenderson","elements":[]},{"text":"Oscar Nunez as Oscar Martinez","elements":[]},{"text":"Craig Robinson as Darryl Philbin","elements":[]},{"text":"Phyllis Smith as Phyllis Vance","elements":[]}]}],"images":[]},{"title":"Recurring Cast","level":3,"content":[{"type":"list","elements":[{"text":"Andy Buckley as David Wallace","elements":[]}]}],"images":[]},{"title":"Guest Cast","level":3,"content":[{"type":"list","elements":[{"text":"Kyle Bornheimer as Adman","elements":[]},{"text":"Tim Kang as Koh","elements":[]},{"text":"Virginia Newcomb as Assistant","elements":[]},{"text":"Drew Powell as The Bartender","elements":[]},{"text":"Jeff Witzke as Commercial Actor","elements":[]}]}],"images":[]},{"title":"References","level":2,"content":[{"type":"list","elements":[{"text":"↑ Season 4 DVD commentary, Local Ad.","elements":[]},{"text":"↑ Mindy and Craig at OSU","elements":[]},{"text":"↑ Dwight Schrute: Total permeation, Northern Attack.","elements":[]}]}],"images":[]}]}