{"sections":[{"title":"Manager and Salesman","level":1,"content":[{"type":"paragraph","text":"\"Manager and Salesman\" (alternately titled, \"The Manager and the Salesman\") is the sixteenth episode of the sixth season and the 116th episode overall. It was written by Mindy Kaling, who also wrote \"Secret Santa,\" \"Niagara,\" and \"Golden Ticket\" and was directed by Marc Webb. It aired on February 11, 2010. Kathy Bates guest stars. It was viewed by 7.40 million people."}],"images":[]},{"title":"Synopsis","level":2,"content":[{"type":"paragraph","text":"Michael calls the hotel where he had reserved a room for the first week of the Vancouver Olympics. The staff member cannot find his reservation in the system and implies he is trying to make a reservation at the last minute. Dwight searches through Michael's e-mail to find the confirmation number and finds that Michael lied about not receiving his e-Vite to Dwight's barbecue. Dwight also finds the confirmation number and the hotel employee apologizes to Michael, stating that she couldn't find the reservation due to the hotel having changed their computer system. His reservation definitely confirmed, Michael then cancels the reservation and is billed a cancellation fee."},{"type":"paragraph","text":"The office is eager to welcome Sabre CEO Jo Bennett to Scranton, and are dazzled by her southern ways. Jo, along with her huge dogs and Gabe Lewis, comes to the office and takes a look around. She compliments everyone; however, when she realizes that there are two managers, she decides that one will go to sales and one will remain a manager."},{"type":"paragraph","text":"Andy gives everyone Valentine's Day cards so he can give one to his love, Erin. When he throws an envelope at Meredith, she receives a paper cut on her throat, something she apparently is used to and dislikes."},{"type":"paragraph","text":"Michael insults Jo Bennett's intelligence and the state of Florida. Jo tells Jim and Michael that they are just trying to save their positions and uses folksy sayings to explain her point. Jim and Michael both want the position as regional manager and are reluctant to give it up. Jo Bennett tells them she will pick who is to remain manager and tells them to go away. Later, she tells the documentary crew straightforwardly about herself and ends remarking that she is pleased to meet them."},{"type":"paragraph","text":"Andy awkwardly gives Erin her Valentine's Day card, and Pam smirks. Andy implies that he loves Erin, however, Erin continues to be oblivious of his feelings. Andy's plans backfire when he accidentally gives Kelly a romantic card and Kelly concludes that he must love her. Kelly is flattered although she thought he was \"annoying and homosexual.\""},{"type":"paragraph","text":"Jo Bennett has a meeting with the whole office and tells Angela to sit down. Jo gives everyone a Sabre handbook and her autobiography. Jo humorously tells them about Sabre and their printers and tells them that they are going to take their \"arm\" and bring the Northeast printers. Michael repeatedly incorporates the word \"manage\" into his speech so Jo will see him as the true manager."},{"type":"paragraph","text":"Pam tells Jim that he could make more money as a salesman than as manager and Jim goes to tell Michael that he will be the salesman. Michael accepts this idea eagerly and begins to brag about getting the job. Oscar tells Michael he wants to be a salesman too because Sabre has no caps on commission. Michael tells the crew he has been hustled and tells Jo and Jim that he wants to be the salesman. Jo accepts Michael's decision and welcomes Jim as the new regional manager of Dunder Mifflin Scranton. Michael sarcastically congratulates Jim and mentions his future commission checks."},{"type":"paragraph","text":"As Erin helps Michael set up his desk in the sales section, Dwight calls a meeting with Ryan to think of ways to take Jim down. A tardy Ryan angers Dwight with his terrible ideas. They ultimately try getting Nick, the new IT guy, to align with them, to no avail. Meanwhile, Michael has a difficult time adjusting to sales, particularly since the procedures he used are obsolete and he does not enjoy sitting with the employees. He tells Jim that he wants the manager job back and they both tell Jo, who allows them to do so. When Dwight taunts Jim about his demotion, Jim puts Dwight's tie in his coffee mug as Pam grins. At the end of the episode, Dwight and Ryan decide to go out for drinks to celebrate Jim's demotion, but they end up arguing about where to go."},{"type":"paragraph","text":"Kelly kisses Andy, to his disgust. When he tells Kelly he likes someone else, she asks who. He struggles to say anything and doesn't; however, Erin is relieved that Andy doesn't like Kelly."}],"images":[]},{"title":"Cultural references","level":2,"content":[{"type":"list","elements":[{"text":"The 2010 Winter Olympics in Vancouver began the day after the episode first aired.","elements":[]},{"text":"Judge Judy is a television judge who resolves family disputes. It is customary to stand when a judge enters the courtroom.","elements":[]},{"text":"Michael, trying to sound folksy, uses the phrase knee-high to a grasshopper, which is a folksy way of saying \"very young\". Michael misuses the phrase.","elements":[]},{"text":"Nancy Pelosi is the Speaker of the House, the first woman to hold the position.","elements":[]},{"text":"Truman Capote was an American writer who was openly gay.","elements":[]},{"text":"Roger Federer, considered as the greatest tennis player of all time, was the top-ranked male tennis player for 2009. He does not have an eponymous cologne.","elements":[]},{"text":"Joe Camel was the cartoon mascot for Camel cigarettes. The character was controversial for a variety of reasons, including the similarity of the character's head to a penis.","elements":[]},{"text":"A Gentlemen's club is a euphemism for a strip club. Curves is not a gentlemen's club; it is an exercise club for women.","elements":[]},{"text":"Saw is a 2004 horror film in which two kidnapped characters awaken chained in a room and left with instructions that in order to escape, they must saw off their own feet.","elements":[]},{"text":"The Atlantic is a literary and cultural magazine. Michael confuses it with the Atlantic Ocean.","elements":[]},{"text":"An e-vite is an online invitation used to give people virtual cards about upcoming parties, events, and perhaps, barbecues. They have been used by both Dwight and Jim.","elements":[]},{"text":"Lifesavers are a flavored hard-candy, used by Erin to fill her candy bowl. They come in many flavors including tropical and mint.","elements":[]},{"text":"Lethal Weapon is a movie about a veteran cop being partnered with a young cop, and both have a common issue, they hate being in partnerships.","elements":[]},{"text":"Bossa Nova is a type of Brazilian music, that attracted a large following, mainly among the young. It was used by Michael and Erin when he reentered his office.","elements":[]},{"text":"Vodka is a popular distilled liquor using a fermented grain, including wheat or rye.","elements":[]}]}],"images":[]},{"title":"Trivia","level":2,"content":[{"type":"list","elements":[{"text":"The cold open with Michael canceling his Vancouver Olympics reservation was a plug for the 2010 Winter Olympics airing the next day.","elements":[]},{"text":"Jo Bennett's biography is titled \"Take a Good Look.\"","elements":[]},{"text":"Jo Bennett has two Great Danes, a large dog breed.","elements":[]},{"text":"The dates in which Michael has made marks on his height are November 2005 (\"The Fight,\" \"The Client,\" \"Performance Review,\" and \"E-mail Surveillance,\" November 2004 (before the series began), December 2006 (\"A Benihana Christmas\") and December 2007 (no episodes due to Writer's Strike).","elements":[]},{"text":"Jim has a Dundie behind him, which is his. To this date, we have no idea what awards Jim wins at the Dundies.","elements":[]},{"text":"Jim kept Michael's desktop picture.","elements":[]},{"text":"Ryan and Kelly have an on-again, off-again relationship. They were seen together in \"Niagara,\" and in a deleted scene in \"Secret Santa,\" Kelly says she wants Ryan for Christmas, however, they seem to have broken up.","elements":[]},{"text":"Dwight taunts Jim for having the shortest term as Regional Manager, and then goes on to tell him the next shortest tenure, which is more than 9 years. He conveniently forgets his own stint as Regional Manager which lasted only one day.  ","elements":[]},{"text":"Earlier on in the series, Pam says that everyone gives each other little gifts and cards for Valentine's Day. However, this is the first episode where somebody's actually given out a Valentine's card.","elements":[]}]}],"images":[]},{"title":"Connections to previous episodes","level":2,"content":[{"type":"list","elements":[{"text":"Michael continues his bad relationship with money by paying the cancellation fee for his Vancouver trip. Michael has been bad with money by spending too much in \"Money,\" and getting into a pyramid scheme in \"Michael's Birthday.\"","elements":[]},{"text":"Jim puts his Sabre thermos on his desk, given to the employees of Dunder Mifflin Scranton in \"Sabre.\"","elements":[]},{"text":"Dwight's Diabolical Plan was started in the episode, \"Scott's Tots.\"","elements":[]},{"text":"Joe Camel was last talked about by Michael and Jan in \"Dinner Party.\"","elements":[]},{"text":"When Kelly talks about thinking that Andy was homosexual, it refers to when Michael told Kelly Andy was gay in \"Gossip.\"","elements":[]},{"text":"Incorporating a phrase into one's speech in the hopes that the person listening will accept it was a technique first used by Kelly in \"Michael Scott Paper Company\".","elements":[]},{"text":"Dwight continues to use code names (\"Monkey,\" \"Bobcat,\" \"Dragon\").","elements":[]},{"text":"Michael last used his Train Conductor whistle in the episode \"Take Your Daughter to Work Day\", another Mindy Kaling written episode.","elements":[]},{"text":"The I.T. specialist, Nick also worked at the graphic design table in the episode Job Fair but Pam doesn't seem to recognize him.","elements":[]},{"text":"When Ryan asks Dwight, \"Did you see Saw?\", Dwight responds, \"Of course, Mose and I seesaw all the time.\" This refers to in Money when Jim looks up Schrute Farms on Google Maps when Dwight tries to get everyone to not look it up on the Internet and finds a picture of Dwight and Mose on a seesaw, having a great time.","elements":[]}]}],"images":[]},{"title":"Quotes","level":2,"content":[{"type":"paragraph","text":"For Manager and Salesman Quotes see: Manager and Salesman Quotes."}],"images":[]},{"title":"Goofs","level":2,"content":[{"type":"list","elements":[{"text":"When Michael messes up Jim's hair, the next shot of Jim shows him having perfect hair.","elements":[]},{"text":"When they show Michael at his new desk the door to Jim's office changes from open to closed in between shots.","elements":[]},{"text":"Jo carries a different bag as she enters the office and when she leaves the office.","elements":[]},{"text":"When Michael is freaking out about the sulfur-like smell coming from Phyllis, Andy has stuck tissues up his nostrils. When talking with Michael, there is one tissue connected to both nostrils for a few scenes, but the last scene shows a tissue on each side.","elements":[]},{"text":"Dwight claims that the Regional Manager that worked the least amount of time (before Jim) was Henry Rostin, but in The Job Dwight worked as Regional Manager for 1 day, which is less than Henry's 9 years.","elements":[]}]}],"images":[]},{"title":"Deleted scenes","level":2,"content":[{"type":"list","elements":[{"text":"Michael tells Jim that \"It works! If you visualize something, it can actually come true.\" He tries again by imagining that Sheryl Crow is hosting Saturday Night Live, and he is in the audience as her boyfriend. He opens his eyes and checks the TV listing, disappointed that \"Gnarles Barkley\" is hosting the show (incorrectly pronouncing it Ga-Narles), who he mistakes as \"Charles Barkley\". Jim tells Michael he is going to talk to Jo, and Michael calls him a sweet person. Jim awkwardly leaves, smiling.","elements":[]},{"text":"Michael says that the Atlantic Ocean is the best ocean, because \"according to Oprah,\" the Pacific is full of garbage, the Indian full of pirates, the Arctic too cold, and the Southern Ocean is just the bottom of the others.","elements":[]},{"text":"Michael discovers that everybody has been eating his homemade frozen orange juice popsicles from the freezer. When Michael confronts Meredith, she taunts him, \"What are you going to do about it? You can't fire us anymore. Ha-ha!\" Creed offers Michael his half-eaten popsicle, and Michael leaves disgusted.","elements":[]},{"text":"The documentary crew films Jim as he puts Dwight's phone in Jello. Jim goes to HR to tell Toby that as manager, he couldn't do that and smiles. Toby tells him not to make it a habit. Jim says he is going to, to which Toby gets angry.","elements":[]}]}],"images":[]},{"title":"Cast","level":2,"content":[],"images":[]},{"title":"Main cast","level":3,"content":[{"type":"list","elements":[{"text":"Steve Carell as Michael Scott","elements":[]},{"text":"Rainn Wilson as Dwight Schrute","elements":[]},{"text":"John Krasinski as Jim Halpert","elements":[]},{"text":"Jenna Fischer as Pam Halpert","elements":[]},{"text":"B.J. Novak as Ryan Howard","elements":[]},{"text":"Ed Helms as Andy Bernard","elements":[]}]}],"images":[]},{"title":"Supporting cast","level":3,"content":[{"type":"list","elements":[{"text":"Leslie David Baker as Stanley Hudson","elements":[]},{"text":"Brian Baumgartner as Kevin Malone","elements":[]},{"text":"Creed Bratton (actor) as Creed Bratton","elements":[]},{"text":"Kate Flannery as Meredith Palmer","elements":[]},{"text":"Mindy Kaling as Kelly Kapoor","elements":[]},{"text":"Ellie Kemper as Erin Hannon","elements":[]},{"text":"Angela Kinsey as Angela Martin","elements":[]},{"text":"Paul Lieberstein as Toby Flenderson","elements":[]},{"text":"Oscar Nunez as Oscar Martinez","elements":[]},{"text":"Phyllis Smith as Phyllis Vance","elements":[]}]}],"images":[]},{"title":"Special guest star","level":3,"content":[{"type":"list","elements":[{"text":"Kathy Bates as Jo Bennett","elements":[]}]}],"images":[]},{"title":"Recurring cast","level":3,"content":[{"type":"list","elements":[{"text":"Zach Woods as Gabe Lewis","elements":[]},{"text":"Nelson Franklin as Nick","elements":[]}]}],"images":[]}]}