{"sections":[{"title":"Michael's Last Dundies","level":1,"content":[{"type":"paragraph","text":"\"Michael's Last Dundies\" is the twenty-first episode of the seventh season of the American television comedy series The Office and is the show's 147th episode overall. It was written and directed by Mindy Kaling. It originally aired on April 21, 2011. It was viewed by 6.85 million people."}],"images":[]},{"title":"Synopsis","level":2,"content":[{"type":"paragraph","text":"The episode opens with Michael and Deangelo personally delivering Dundies nomination plaques to the employees of Dunder Mifflin. At the office, Michael announces to the employees that Deangelo will be his co-host at the Dundies. The idea of performance is worrisome to Deangelo though, but Michael makes him take the job. Michael brings some of the staff together in the conference room to try and help Deangelo get prepared for the show, but Deangelo has problems riffing (even Ryan's pointers don't help him)."},{"type":"paragraph","text":"Andy tries to help him, saying he should just think of performing like conducting a meeting, but Michael objects to that, saying Deangelo should perceive it as the performance of his life. Michael tries a number of different things to help Deangelo, such as sitting on his stomach, ordering him to tell him something traumatic that happened in his childhood, and making him listen to a Walkman with the music turned up all the way so he can't hear himself talk, but none are effective."},{"type":"paragraph","text":"Meanwhile, Jim and Pam, coming from elsewhere, see Erin sitting in her car eating a sandwich. Afraid of being spotted, she brings them into the car to explain she's taken to eating lunch in her car to get some time away from Gabe, who she's starting to despise. Pam coaches Erin, saying if she doesn't love Gabe she should break things off with him, as to not lead him on any further. This amuses Jim, given Pam's history with Roy, and he leaves to avoid the temptation to comment on the irony of her advice. In a talking head interview, Jim claims the situation simply didn't interest him."},{"type":"paragraph","text":"A few hours after work, the employees arrive at Louie Volpe's (the restaurant the Dundies are being hosted at) and are treated to an opening video where Deangelo is searching for Michael to be his co-host, in which Michael plays various employees around the office. First, he's Jo Bennett. Then, he's Angela, which gets laughs, particularly from Oscar. Next, he's Jim, who he plays as sort of a stoner type character. He then finishes up as Phyllis, who he plays as being an old, enfeebled woman. Only when Deangelo \"looks into his heart\", does Michael appear before him in a bathroom mirror."},{"type":"paragraph","text":"After the movie, Dwight introduces Michael and Deangelo. However, moments after being introduced, Deangelo disappears into the bathroom to vomit. Eventually, Michael is able to psych him up, and the show begins. Even though he hosts it poorly, Deangelo manages to pull the ceremony off. Jim wins the \"Best Dad\" award, and in a humorous twist, not only does Pam not win \"Best Mom\", but Meredith does. Dwight wins the \"Promising Assistant Manager\" Dundie, but as he is still mad at Michael, he tosses his award in the trash."},{"type":"paragraph","text":"The evening takes an even more awkward turn when Erin wins the \"Cutest Redhead\" award, and she gives a speech in which she breaks up with Gabe, who takes the stage to defend himself and express his emotional pain. Michael then awards Deangelo with the \"Best Dundies Host\" award. The staff urges him to make a speech, and Deangelo, still nervous, puts on his Walkman and turns it on full blast and talks extremely loud, resulting in all of the office workers getting kicked out of the restaurant."},{"type":"paragraph","text":"Michael is upset that his last Dundies ended like this, but the staff manages to convince Michael to keep the Dundies going, and to host the rest of it at the office, which Michael gives in to. Dwight rides with Michael and Deangelo, and he insults the Dundies. Michael pulls over the car, and he and Dwight get into a fight, which leads to Dwight exiting the car and leaving down the highway. Back at the office, Michael and Deangelo continue to host the Dundies in the conference room. After Michael awards Andy with the \"Doobie Doobie Pothead Stoner of the Year\" Award (since Andy tried marijuana in college), he is taken by surprise when Andy leads the employees (except Dwight and Gabe, who are not present) in serenading the soon-to-depart Michael with a version (backed up on the keyboard by Darryl) of \"Seasons of Love\" with altered lyrics. Michael is touched, and in a talking-head interview held in his office, says leaving the office is going to hurt like a \"mother f**ker\"."},{"type":"paragraph","text":"A flashback occurs where Toby gets the \"Extreme Repulsiveness\" Award. Toby mentions that he was part of the verdict in the Scranton Strangler case and is having doubts about the outcome."}],"images":[]},{"title":"Deleted scenes","level":2,"content":[{"type":"list","elements":[{"text":"When Michael announced the \"Hottest in the Office\" goes to Danny Cordray, Michael said \"Danny could not be here tonight to accept his award, so he is live via satellite. Oh, Danny! Are you there?\"","elements":[]}]}],"images":[]},{"title":"Amusing details","level":2,"content":[{"type":"list","elements":[{"text":"This is the second Dundies related episode.","elements":[]},{"text":"In season 2, Jim doesn't care much for the Dundies, but in this episode, he seems sincerely proud to win his \"Best Dad\" award.","elements":[]},{"text":"DeAngelo is terrible at performing, the one thing Michael thrives at.","elements":[]},{"text":"Right when Michael says that he always gives the \"Hottest in the Office\" award to a man, the camera focuses in on The Senator. This could be foreshadowing for when The Senator is revealed to be gay.","elements":[]},{"text":"Ryan is visibly upset that Michael did not present the “Hottest in the Office” award to him this year, despite his complete disgust and discomfort at receiving the same award for the first time in season 2.","elements":[]},{"text":"Steve Carell did not know that the cast would sing \"9,986,000 Minutes\", as it was kept a secret from him. Therefore, his reaction to the song is real and not scripted.","elements":[]},{"text":"At the Dundies Award Ceremony, Dwight Schrute's name is spelled incorrectly on one of DeAngelo's cue cards.","elements":[]}]}],"images":[]},{"title":"Cultural references","level":2,"content":[{"type":"list","elements":[{"text":"Meredith's house reminds Deangelo of the aftermath of Hurricane Katrina.","elements":[]},{"text":"Meredith takes a walk of shame, most likely returning home after a one night stand.","elements":[]},{"text":"Larry King Live was replaced by Piers Morgan Tonight, a talk show hosted by the British television personality and journalist Piers Morgan. Michael thinks that Larry King is dead and Morgan took over his show.","elements":[]},{"text":"Black tie optional is a form of dress code.","elements":[]},{"text":"Michael randomly shouts \"Nice! Regis and Kelly!\" after a successful joke with Ryan.","elements":[]},{"text":"Deangelo's uncomfortable question about Jim's whereabouts on September 11 is a reference to 9\/11.","elements":[]},{"text":"There are several references to the film The King's Speech, notably during the scene in which Deangelo gives his speech at the Dundies while listening to his Walkman played at a high volume.","elements":[]},{"text":"The DMV stands for Department of Motor Vehicles, famous for long lines.","elements":[]},{"text":"Kevin brings his crayons to make the place feel more like a kid-friendly restaurant for himself, i.e. IHOP. The usage of crayons may be a reference to Macaroni Grill, which allows patrons to draw on their tablecloths.","elements":[]},{"text":"Pippi Longstocking is an adventurous red-headed girl from Swedish children's books.","elements":[]},{"text":"Ron Weasley is the red-headed best friend of Harry Potter.","elements":[]},{"text":"Ron Howard is also known for his movies, TV shows, and ginger beard.","elements":[]},{"text":"Michael also mentions \"Ronald McDonald's wife\" as an example of a red-head.","elements":[]},{"text":"Die Hard is a movie featuring Bruce Willis as a New York City detective caught in the middle of a hostage situation while visiting his estranged wife in Los Angeles on Christmas Eve.","elements":[]},{"text":"Dwight's line \"Always the Padawan, never the Jedi,\" is a reference to both Star Wars, and another saying: \"Always the bridesmaid, never the bride\". The Jedi are characters in the Star Wars saga who are famed for their ability to tap into the energy field that connects all things known as the Force, and as such, they were charged with maintaining the balance between the light and dark sides of the Force and keeping the peace in the Galactic Republic. A Padawan is a Jedi in training, usually an adolescent.","elements":[]},{"text":"Billy Crystal and Neil Patrick Harris have hosted several award shows but were unavailable for the Dundies.","elements":[]},{"text":"Michael thought that the awards would end up like The Godfather Part III, but it turned out \"confusing\" like The Godfather. It's notable that Michael's favorite film of the trilogy is the least critically acclaimed one.","elements":[]},{"text":"The final song that the office sings to Michael is a parody of \"Seasons of Love\" from the Broadway musical Rent.","elements":[]},{"text":"Michael describes the Dundies as \"like the Golden Globes but less mean\" referring to Ricky Gervais' hosting of the 2011 Golden Globe Awards; which left critics questioning if he had gone \"too far\". Gervais stated on his blog that the line was inserted as a metajoke was intended as \"a little in-joke\".","elements":[]}]}],"images":[]},{"title":"Connections to previous episodes","level":2,"content":[{"type":"list","elements":[{"text":"Michael throws eggs at Toby's house, in Initiation, Ryan and Dwight threw eggs at the building where Ryan had the failed sales call.","elements":[]},{"text":"\"They're like breadsticks on steroids\" resembles Michael's vague quote from Valentine's Day: \"Scranton is great, but New York is like Scranton on acid. No, on speed. Nah. On steroids.\"","elements":[]},{"text":"Dwight plays his recorder, seen in episodes like Michael's Birthday, Take Your Daughter To Work Day, Grief Counseling, and Money.","elements":[]},{"text":"Several of the lines in the song sung by the office employees in the conference room reference previous events, such as Oscar's line \"I forgive you for kissing me!\" (from Gay Witch Hunt), and Meredith's line \"You hit me with your car!\" (from Fun Run). It also references Ryan's struggle with drugs and Michael's involvement in his recovery (Night Out).","elements":[]},{"text":"Deangelo mentions having to testify against both his parents when they got divorced as a child. Toby told Michael a similar story in The Deposition. Michael's reaction seems to imply that he noticed the connection.","elements":[]},{"text":"Dwight questions why Deangelo is even wearing a seatbelt because he’s in the backseat. In Traveling Salesmen, Dwight sits in the back of Jim’s car because it’s the safest place, as the driver always protects his side first.","elements":[]}]}],"images":[]},{"title":"Dundie winners","level":2,"content":[{"type":"list","elements":[{"text":"Best Dad - Jim","elements":[]},{"text":"Best Mom - Meredith","elements":[]},{"text":"Hottest in the Office - Danny Cordray","elements":[]},{"text":"The Diabetes Award- Stanley","elements":[]},{"text":"Promising Assistant Manager - Dwight, who promptly throws it into the trash","elements":[]},{"text":"Cutest Redhead in the Office Award - Erin, which prompts Meredith to throw her Dundie away","elements":[]},{"text":"Best Dundies Host - Deangelo Vickers","elements":[]},{"text":"Doobie Doobie Pothead Stoner of the Year Award - Andy","elements":[]},{"text":"Extreme Repulsiveness Award - Toby","elements":[]},{"text":"The Kind of a Bitch Award - Dwight (Not an actual Dundie but Michael stated Dwight should have gotten it)","elements":[]},{"text":"World's Best Boss - Michael, it was given to Michael by the employees, although it was only revealed in the later episode (Goodbye, Michael)","elements":[]}]}],"images":[]},{"title":"Parody lyrics","level":2,"content":[{"type":"paragraph","text":"The lyrics to the parody the employees sing to Michael in the conference room are as follows:"}],"images":[]},{"title":"Cast","level":2,"content":[],"images":[]},{"title":"Main Cast","level":3,"content":[{"type":"list","elements":[{"text":"Steve Carell as Michael Scott","elements":[]},{"text":"Rainn Wilson as Dwight Schrute","elements":[]},{"text":"John Krasinski as Jim Halpert","elements":[]},{"text":"Jenna Fischer as Pam Halpert","elements":[]},{"text":"B.J. Novak as Ryan Howard","elements":[]},{"text":"Ed Helms as Andy Bernard","elements":[]}]}],"images":[]},{"title":"Supporting Cast","level":3,"content":[{"type":"list","elements":[{"text":"Leslie David Baker as Stanley Hudson","elements":[]},{"text":"Brian Baumgartner as Kevin Malone","elements":[]},{"text":"Creed Bratton (actor) as Creed Bratton","elements":[]},{"text":"Kate Flannery as Meredith Palmer","elements":[]},{"text":"Mindy Kaling as Kelly Kapoor","elements":[]},{"text":"Ellie Kemper as Erin Hannon","elements":[]},{"text":"Angela Kinsey as Angela Martin","elements":[]},{"text":"Paul Lieberstein as Toby Flenderson","elements":[]},{"text":"Oscar Nunez as Oscar Martinez","elements":[]},{"text":"Craig Robinson as Darryl Philbin","elements":[]},{"text":"Phyllis Smith as Phyllis Vance","elements":[]},{"text":"Zach Woods as Gabe Lewis","elements":[]}]}],"images":[]},{"title":"Special Guest Star","level":3,"content":[{"type":"list","elements":[{"text":"Will Ferrell as Deangelo Vickers","elements":[]}]}],"images":[]},{"title":"Guest Cast","level":3,"content":[{"type":"list","elements":[{"text":"Jack Coleman as State Senator Robert Lipton","elements":[]},{"text":"Timothy Olyphant as Danny Cordray (Deleted Scene)","elements":[]}]}],"images":[]}]}