{"sections":[{"title":"Michael's Birthday","level":1,"content":[{"type":"paragraph","text":"\"Michael's Birthday\" is the nineteenth episode of the second season of The Office and the 25th overall. It was written by Lee Eisenberg and Gene Stupnitsky and directed by Ken Whittingham. It first aired on March 30, 2006. It was viewed by 7.8 million people."}],"images":[]},{"title":"Synopsis","level":2,"content":[{"type":"paragraph","text":"Michael is excited to be celebrating his birthday and tries to get the employees excited with him. Unfortunately for Michael, Dwight seems to be the only one joining in, as the rest of the employees are more concerned with Kevin, who is awaiting his results from his skin cancer screening. Pam and Jim meanwhile decide to sneak out and go to the store to shop for gifts for Kevin."},{"type":"paragraph","text":"When Michael finds out about Kevin's predicament, he gives Kevin his condolences, but subtly remains bitter that Kevin is ruining his birthday fun. Dwight and Angela are less subtle than they think they are being when discussing their secret relationship within earshot of Ryan. After goofing around at the store, Jim and Pam return to the office. To \"make Kevin feel better\", Michael takes the employees out ice skating. At the rink, he also runs into his real estate agent Carol with her children and he entertains them, which puts a smile on Carol's face. Kevin gets the call about his results, which turn up negative, to everyone's relief except for Michael's who believes that negative meant he did have cancer. He later explains that \"Apparently, in the medicine community, negative means good, which makes absolutely no sense. In the real world community, ye-that would be... chaos.\" The gifts are passed out to Kevin and Michael and Pam expresses her feelings on the \"great day\"."}],"images":[]},{"title":"Deleted scenes","level":2,"content":[{"type":"paragraph","text":"The Season Two DVD contains a number of deleted scenes from this episode. Notable cut scenes include:"},{"type":"list","elements":[{"text":"In a talking head interview, Dwight explains his duties on Michael's birthday.","elements":[]},{"text":"In a talking head interview, Michael explains how good bosses share their birthdays with their employees.","elements":[]},{"text":"Michael tells Ryan that he does not need to get him a present but is clearly upset when he does not.","elements":[]},{"text":"In a talking head interview, Michael tells a story of his worst birthday.","elements":[]},{"text":"In a talking head interview, Dwight admires the concept of someone's skin turning on them.","elements":[]},{"text":"Michael makes Ryan read to the camera information about melanoma and belittles every fact.","elements":[]},{"text":"In a talking head interview, Angela says that Kevin should be concerned about his fate in the afterlife. \"Gluttony?\"","elements":[]}]}],"images":[]},{"title":"Trivia","level":2,"content":[{"type":"list","elements":[{"text":"Jim and Pam shop at a Rite Aid pharmacy. Based on store size and the Thrifty Ice Cream sign seen in the background, it is a West Coast location. East Coast stores are smaller and do not sell Thrifty Ice Cream (west coast locations sell the ice cream because it was inherited from a chain Rite Aid acquired in 1996).","elements":[]},{"text":"Kevin can be seen with a small bandage on the right side of his neck throughout the episode. This is likely there to show that he has recently had a biopsy of a mole, a common test for skin cancer.","elements":[]},{"text":"According to Jenna Fischer, the writers had been looking for a reason to use Carell's ice-skating skills in an episode. Carell used to play hockey; Fischer learned to skate in preparation for the movie Blades of Glory but decided that her character cannot.","elements":[]},{"text":"Since Michael has indirectly said before that his birthday is March 15, this episode takes place on March 15, 2006. Additionally, Michael notes in this episode he shares his birthday with Eva Longoria, who was also born on March 15th.","elements":[]},{"text":"Ice skating scenes were filmed at Pickwick Gardens in Burbank, California.","elements":[]},{"text":"Michael says that on his sixteenth birthday, he was supposed to go on a date with a girl named Julie, but she got it mixed up with another Michael in the class, and he heard all about it in school the next day. March 15, 1980, Michael's sixteenth birthday, was a Saturday, so the next day would be Sunday, Michael not having school.","elements":[]}]}],"images":[]},{"title":"References to previous episodes","level":2,"content":[{"type":"list","elements":[{"text":"Michael creates a fake Livestrong bracelet. He wore a real one in the episode \"Basketball\".","elements":[]},{"text":"This episode reintroduces the character of Carol Stills, first seen in the episode \"Office Olympics\".","elements":[]},{"text":"Nightswept is Michael's cologne, as established in the episode \"Hot Girl\".","elements":[]},{"text":"Oscar executes a spin at the ice rink. In the episode \"The Secret\", Oscar pretended to be sick and spent the day with his boyfriend Gil. Among the things they did was go ice skating.","elements":[]},{"text":"Toby said that the health plan here is terrible. This could be a reference to Dwight’s healthcare plan in Health Care.","elements":[]}]}],"images":[]},{"title":"Cultural references","level":2,"content":[{"type":"list","elements":[{"text":"Calling cards are a form of pre-paid long distance telephone service. They became wildly popular in the 1990s, but the growth of mobile telephones with free long distance led to a decline in both popularity and social cachet. (Ryan remarks, \"Who uses calling cards any more?\") By the mid-2000s, calling cards were used primarily by lower-income people with poor credit.","elements":[]},{"text":"Michael lost money in an attempt to help the son of the deposed king of Nigeria. Michael was a victim of the Nigerian Letter scam, one of the most common forms of advance fee fraud. Incidentally, the last King of Nigeria was the British King, George VI who died in 1952 whilst Nigeria was under British colonial rule. Nigeria, following independence from the United Kingdom in 1960, declared itself a republic in 1963.","elements":[]},{"text":"Eva Longoria is an actress best known for her role on the show Desperate Housewives. Teri Hatcher is another actress from that program.","elements":[]},{"text":"eBay is a large Internet auction site which allows anyone to put an item up for sale.","elements":[]},{"text":"24\/7 is shorthand for 24 hours a day, 7 days a week. Michael somewhat erroneously applies it to the efforts of the Party Planning Committee, who started working on his party only the previous day (and presumably did not stay up all night).","elements":[]},{"text":"Grey's Anatomy is a television medical drama.","elements":[]},{"text":"Princess Diana (formally, Diana, Princess of Wales) was the first wife of Charles, Prince of Wales, heir apparent to the British throne. She died in an automobile accident, and her funeral was watched by an estimated 2.5 billion people.","elements":[]},{"text":"The Longest Time is a song performed by Billy Joel. Dwight mis-identifies the song as For the Longest Time and the singer as William Joel.","elements":[]},{"text":"Michael mis-identifies actor James Dean in Rebel Without a Cause as actor Luke Perry.","elements":[]},{"text":"M&Ms is a type of candy, American Pie 2 is a 2001 teen sex comedy, Cup Noodles (misstated as Cup of Noodles) is an instant ramen snack, and 69 is the nickname for a sexual position.","elements":[]},{"text":"Pam's announcement Luke, this is your father is a play on the line No, I am your father from the movie The Empire Strikes Back.","elements":[]},{"text":"Michael creates a yellow wristband from Post-it notes, essentially a counterfeit Livestrong wristband, a fundraising item for the Lance Armstrong Foundation. (Later in the episode, he shows off the wristband and says, \"Live strong.\")","elements":[]},{"text":"Michael's get our skate on is a snowclone of get one's X on, originally get one's groove on or get one's freak on, meaning to dance in a sexually provocative manner. The original sense has been largely forgotten. The phrase get one's X on typically means simply start doing X.","elements":[]},{"text":"The NHL is the National Hockey League, a North American professional hockey league.","elements":[]},{"text":"Michael refers to Pam's breasts as ticking time-bags, a combination of the phrase ticking time-bomb (a disaster poised to occur without warning) and fun bags (somewhat crude slang for female breasts).","elements":[]},{"text":"Dwight's birthday gift for Michael is a jersey for the Wilkes-Barre\/Scranton Penguins, a professional hockey team in the AHL, a subsidiary league of the NHL.","elements":[]},{"text":"Nightswept is a fake brand of cologne.","elements":[]},{"text":"Michael's ringtone is My Humps by the group Black Eyed Peas.","elements":[]}]}],"images":[]},{"title":"Cast","level":2,"content":[],"images":[]},{"title":"Main cast","level":3,"content":[{"type":"list","elements":[{"text":"Steve Carell as Michael Scott","elements":[]},{"text":"Rainn Wilson as Dwight Schrute","elements":[]},{"text":"John Krasinski as Jim Halpert","elements":[]},{"text":"Jenna Fischer as Pam Beesly","elements":[]},{"text":"B.J. Novak as Ryan Howard","elements":[]}]}],"images":[]},{"title":"Supporting cast","level":3,"content":[{"type":"list","elements":[{"text":"Melora Hardin as Jan Levinson","elements":[]},{"text":"Leslie David Baker as Stanley Hudson","elements":[]},{"text":"Brian Baumgartner as Kevin Malone","elements":[]},{"text":"Kate Flannery as Meredith Palmer","elements":[]},{"text":"Angela Kinsey as Angela Martin","elements":[]},{"text":"Oscar Nunez as Oscar Martinez","elements":[]},{"text":"Phyllis Smith as Phyllis Lapin","elements":[]}]}],"images":[]},{"title":"Recurring cast","level":3,"content":[{"type":"list","elements":[{"text":"Paul Lieberstein as Toby Flenderson","elements":[]},{"text":"Mindy Kaling as Kelly Kapoor","elements":[]},{"text":"Creed Bratton as Creed Bratton","elements":[]},{"text":"Nancy Walls as Carol Stills","elements":[]}]}],"images":[]},{"title":"Guest cast","level":3,"content":[{"type":"list","elements":[{"text":"Susan Foley as Delivery Woman","elements":[]},{"text":"Justin Meloni as Delivery Man","elements":[]},{"text":"Susan Van Horn as Clerk","elements":[]},{"text":"Eric La Barr as Cashier (uncredited)","elements":[]}]}],"images":[]}]}