{"sections":[{"title":"Money","level":1,"content":[{"type":"paragraph","text":"\"Money\" is the seventh\/eighth episode of the fourth season of The Office and the 60th\/61th episode overall. It was written and directed by Paul Lieberstein. It first aired on October 18, 2007 and was an hour-long episode. It was viewed by 8.50 million people."}],"images":[]},{"title":"Synopsis","level":2,"content":[{"type":"paragraph","text":"The episode begins with a conversation between Pam and Michael, explaining that Michael receives his films from Netflix and while watching The Devil Wears Prada, he decides to act out that whole movie in the office as Meryl Streep which includes throwing his coat at Pam and yelling for his steak when he is at his desk. When he finishes the movie, he apologizes for his behavior, and references his newest rental, Million Dollar Baby."},{"type":"paragraph","text":"Michael and Jan sit in Michael's office talking about renovating their condo, not able to decide which type of flooring they want. When Jan leaves, it is revealed that she still has not gotten a job and that Michael had to trade in his car to buy her a Porsche."},{"type":"paragraph","text":"Jim discovers that Dwight and Mose are now running Schrute Farms as a Bed and Breakfast. Jim and Pam decide to spend the night there, finding the operation even stranger than they had imagined. They take part in Dwight and Mose's table-making demonstration, watch Mose produce wine from beets, and even have Dwight read Harry Potter as a bedtime story. Jim also begins to recognize the extent of Dwight's depression over the loss of Angela."},{"type":"paragraph","text":"Michael begins leaving the office early, refusing to explain his reasons to Pam (and telling Jan that he's taking a nighttime improv class). It is revealed that Michael has loads of debt and had to get a second job as a telemarketer, taking the bus there immediately after leaving Dunder Mifflin. There, he works until 1 A.M. In one instance, he calls a \"Mr. Hudson.\" It turns out to be Stanley from Dunder Mifflin, who recognizes his voice (but assumes it's a joke)."},{"type":"paragraph","text":"Ryan arrives at the office to supervise Michael's first PowerPoint presentation. However, Michael is unprepared. In the process of defending himself, he inadvertently acknowledges that he has taken a second job. As Michael's lack of being prepared for the presentation is seemingly a result of his second job, Ryan orders Michael to quit the other job or face termination. Michael reluctantly agrees."},{"type":"paragraph","text":"During the meeting, it is revealed that Kelly is dating Darryl. The relationship turns out to be quite dysfunctional, as Kelly is mainly concerned with making Ryan jealous. Darryl realizes this, but finds that Kelly's scheming actually turns him on. Kelly, on the other hand, is perplexed by the fact that Darryl never seems to have any hidden agenda, but always means exactly what he says."},{"type":"paragraph","text":"After Michael devises some desperate schemes to come up with more money, Creed encourages him to just declare bankruptcy. Unaware of what that entails, Michael takes the advice literally and announces \"I declare bankruptcy!\" to the office, thinking that is all that is required. Seeing Michael's desperation, Oscar agrees to look over his financial situation and finds that he spends a lot of money on stuff \"no one ever, ever needs\" such as a core blaster extreme exercise machine, professional bass fishing equpiment, and multiple magic sets."},{"type":"paragraph","text":"Oscar convinces Michael to discuss the situation with Jan over the phone, but she immediately harangues Michael about being irresponsible. In the middle of her diatribe, Michael runs out of the office in a failed attempt to hop a train. Jan arrives and attempts to console Michael, saying she appreciates the fact that he was there for her when she was fired. Michael fails to confront Jan about her role in his financial problems, and insists that his lack of money is no reason to have her breast augmentation reversed."},{"type":"paragraph","text":"Andy gives Angela a cat he discovered in the Vance Refrigeration office as part of his continuing effort to court her. It is the same cat, named Garbage, Dwight unsuccessfully tried to give her (in Dunder Mifflin Infinity) to make amends for his mercy killing of her cat Sprinkles. This time it works, and she gives Andy permission to ask her to dinner, with several provisos about what they will be eating. After seeing this exchange, Dwight sits alone in the stairway of Dunder Mifflin, crushed. Jim attempts to console Dwight, relaying that the pain of his own rebuffed affection for Pam is what caused him to leave for Stamford, and was so awful that \"it is something that I wouldn't wish on my worst enemy -- and that includes you\". On his way back into the office, Jim spends a last moment remembering how much he'd suffered when he couldn't be with Pam. He shakes it off and walks over to passionately kiss her in full view of everyone. Though surprised, Pam responds without a moment's hesitation, and then they discuss eating Italian food for dinner. In an interview Pam says coyly that Jim is passionate about Italian food. Jim responds in his own interview that he is in love with Italian food, implying that he's actually in love with Pam. Soon after, seemingly aided by Jim's outreach, Dwight returns to his desk and resumes his more typical, obnoxious behavior. He silently pushes away Jim's work materials that have started to encroach on his desk and makes a sales call. Jim and Pam share a poignant smile, knowing that they have helped Dwight get over Angela."}],"images":[]},{"title":"TripAdvisor review of Schrute Farms","level":2,"content":[{"type":"paragraph","text":"With the permission of TripAdvisor, the producers created a fake entry for Schrute Farms and included two reviews."},{"type":"list","elements":[{"text":"The first review (since deleted) was posted by sprinklesmom from Scranton, PA:","elements":[]}]},{"type":"paragraph","text":"“Stay away - proprietor is crazy!” I have to warn people about the proprietor of Schrute Farms - he may portray himself as a gentleman farmer, but he is not what he seems! He killed my cat, sprinkles!!! Who knows what he might do to you or your loved ones.... This TripAdvisor Member disliked - The owner!!!"},{"type":"list","elements":[{"text":"The second review was posted by JandP2 from Scranton:","elements":[]}]},{"type":"paragraph","text":"“Schrute Farms delivers!” The architecture reminds one of a quaint Tuscan beet farm, and the natural aroma of the beets drifts into the bedrooms and makes you dream of simpler times. You will never want to leave your room. The informative lecture will satisfy all your beet curiosity, and the dawn goose walk will tug at your heart strings. Table making never seemed so possible. Great story to tell your friends. Plenty of parking! The staff’s attention to detail and devotion to cleanliness was limitless. From their enthusiastic welcome to the last wave good-bye, Schrute Farms delivers. Date of Stay: October, 2007\nTraveled with: Spouse \/ significant other\nVisit was for: Romantic getaway\nAge group: 25-34"},{"type":"list","elements":[{"text":"Fans of the show added their own \"reviews\", and posting a review of Schrute Farms was a task in the Dunder Mifflin Infinity online game.","elements":[]},{"text":"The fake review has been a valuable source of publicity for TripAdvisor, which does no television advertising. Schrute Farms continues to be a source of traffic to the site, thanks to syndication and DVDs.[1]","elements":[]}]}],"images":[]},{"title":"Goofs","level":2,"content":[{"type":"list","elements":[{"text":"While the scene displays Andy chasing Garbage around the warehouse, the voice over has Andy saying he found the cat outside Vance Refrigeration. It was likely that this was written in because Dwight abandoned the cat in the Vance Refrigeration offices.","elements":[]},{"text":"When Michael is talking about the Die Hard films to the other employees at the telemarketing office, he talks about how John McClane jumps a motorcycle into a helicopter. It was actually a cop car that McClane jumps into a helicopter, destroying it in Live Free or Die Hard.","elements":[]},{"text":"When Dwight says good-bye on the phone during the Schrute Farms phone call near the beginning of the episode, he says \"Auf Wiedersehen.\" However, the correct salutation would be \"Auf Wiederhören,\" as Dwight was talking on the phone, not in person. This could possibly be attributed to Dwight's questionable fluency in German as referenced in other episodes, such as when in a talking head interview he says that his German \"is pre-industrial and mostly religious,\" in the episode Two Weeks.","elements":[]},{"text":"When Dwight is reading Harry Potter to Jim and Pam he reads a line incorrectly, based on the book's actual context. In the book, \"Harry\" is actually spoken by Hermione, a female, whereas Dwight reads the line as if it were the old man writhing in agony. See Harry Potter and the Deathly Hallows chapter five.","elements":[]}]}],"images":[]},{"title":"Trivia","level":2,"content":[{"type":"list","elements":[{"text":"Michael's fist in the air after quitting his telemarketing job echoes an identical gesture by the character John Bender in the final scene of the movie The Breakfast Club.","elements":[]},{"text":"Dwight hosts Pam and Jim at his bed and breakfast, even though in the episode Casino Night, Dwight tells Jim, \"I would never, ever serve you. Not in a million, billion years.\"","elements":[{"text":"The above can be explained. Dwight probably would not have let them stay if not for the threat of a bad TripAdvisor review. Also, Dwight and Pam are close friends.","elements":[]}]},{"text":"John Krasinski played a prank on Jenna Fischer when they drove up the Schrute Farms driveway: He surreptitiously turned on Jenna's seat heater, and she never figured out why she was so uncomfortably hot until the scene was done.","elements":[]},{"text":"While the cats are different, the cat Andy found was supposed to be Garbage, the barn cat that Dwight attempted to give Angela and then abandoned in the building. In a talking head interview, Andy explains that he found the cat outside of Vance Refrigeration, which is where Dwight left the cat, as shown by the door with the Vance Refrigeration logo in the background when this happens in Dunder Mifflin Infinity. Garbage reappears later in Stress Relief and Two Weeks, and Angela had renamed him Bandit.","elements":[]},{"text":"In the episode Office Olympics Dwight says that he only has one bathroom on the farm, under the porch. However in this episode, Mose is seen using an outhouse in the middle of a field.","elements":[{"text":"The above can also be explained simply by Dwight adding the outhouse in the long period of time since that episode. Or, possibly because Dwight does not consider an outhouse to be an actual \"bathroom\".","elements":[]}]},{"text":"Michael takes on several habits of his employees while at the telemarketing firm. He makes jokes and is well liked by his coworkers, like Jim. He is also unable to make any sales, like Ryan.","elements":[]},{"text":"In the original script, Michael was supposed to tear up the dollar bill, but the scene was changed when the writers realized that doing so is a violation of federal law.​​​​​​","elements":[]},{"text":"The section Dwight reads from Harry Potter is from Harry Potter and the Deathly Hallows.","elements":[]},{"text":"Earlier in the series, Dwight says that he lives in a nine bedroom farmhouse, but in this episode it appears the only rooms are Dwight's room, Mose's room (assuming he has a room), Irrigation, America, and Nighttime.","elements":[]},{"text":"Even though Michael was trying to keep his second job a secret, it seems that he left his microphone on, as the camera crew was able to get audio of Michael while going into the telemarketing building.","elements":[]}]}],"images":[]},{"title":"Amusing Details","level":2,"content":[{"type":"list","elements":[{"text":"One of the telemarketing employees (in the gray Scranton t-shirt) has fallen asleep on the job. He can be seen when Michael (working as a telemarketer) says, \"I think it's crazy that the coach won't play him.\"","elements":[]},{"text":"When Michael gets into Jan's Porsche after work, he accidentally closes the door on his coat.","elements":[]},{"text":"When Jan throws her keys at Oscar, Kelly and Darryl are hanging out in the background.","elements":[]},{"text":"Many fans have pointed out that, in a deleted scene, it appears Pam and Jim have pushed their twin beds together.","elements":[]},{"text":"Like Dwight, Michael's boss at the telemarketing firm has a Froggy 101 bumper sticker on his desk.","elements":[]},{"text":"Dwight's desk has an iMac on it.","elements":[]},{"text":"Angela asks Dwight for her cherub figurine she left on his nightstand, but Dwight tells her that she took it. When Jim enters the room while Dwight is crying, Dwight is holding the cherub figurine.","elements":[]},{"text":"The employee in the telemarketing call center appears to be wearing the same gray Scranton t-shirt that Jim was wearing in Basketball.","elements":[]},{"text":"After reviewing the Die Hard movies with his coworkers at his telemarketer job, Michael tells them he is writing a spy thriller movie which is a reference to Threat Level Midnight, a script Michael wrote first featured in The Client and later shown in Season 7, finished.","elements":[{"text":"It may also reference Get Smart, a movie which came out a year after this episode aired, starring Steve Carell (Michael) as a spy.","elements":[]}]},{"text":"In a talking head interview, Creed notes that he transfers his debt to his other identity known as \"William Charles Schneider\" whose passport he then holds up. In real life, William Charles Schneider is actually Creed Bratton's birth name and the birthdate on the passport is Bratton's real birthdate: February 8, 1943.","elements":[]},{"text":"When Michael is quitting in Nick Figaro's office, a yellow take-out menu for \"Terry's Diner\" can be seen posted on the wall. When Kelly and Darryl are arguing in Darryl's office, the same menu can be seen on his wall.","elements":[]}]}],"images":[]},{"title":"Connections to Previous Episodes","level":2,"content":[{"type":"list","elements":[{"text":" The movie Million Dollar Baby is also referenced in the episode Grief Counseling. During the group \"counseling\" Pam describes how her aunt died but it is actually how the main character in the movie dies.","elements":[]}]}],"images":[]},{"title":"Cultural References","level":2,"content":[{"type":"list","elements":[{"text":"Mose wears a Jurassic Park T-shirt.","elements":[]},{"text":"Andy tells Pam he comes from a line of WASPs so long it \"goes all the way back to Moses\", meaning he is a Protestant. This is explained by the wealth and influence of his family.","elements":[]},{"text":"Michael compares Die Hard with Live Free or Die Hard, the fourth movie in the series.","elements":[]},{"text":"Dwight reads Harry Potter and the Deathly Hallows to Jim, Pam, and Mose.","elements":[]},{"text":"Kevin tries to seem knowledgeable about women by gesturing to hit fists with Stanley after saying, \"Women be shopping.\" This phrase is part of the Reggie (Dave Chappelle) character's comedy routine in Eddie Murphy's 1996 movie The Nutty Professor. The extended fist is a failed fist bump. For an example of a fist bump, watch Michael and Craig greet each other in the episode Valentine's Day.","elements":[]},{"text":"In a deleted scene, Andy invites Angela to see a lacrosse scrimmage between Scranton U's varsity and J.V. teams. Lacrosse is a sport popular in Canada and the Northeastern United States. In the United States, the sport is associated with upper-class private high schools (\"prep schools\").","elements":[]},{"text":"Michael watches The Devil Wears Prada and Million Dollar Baby offscreen with Netflix' DVD service.","elements":[]},{"text":"Pam calls Dwight's B&B the Beets Motel, a reference to the Bates Motel, the setting of Robert Bloch's 1959 novel Psycho as well as Alfred Hitchcock's film, which was based on the novel.","elements":[]}]}],"images":[]},{"title":"Cast","level":2,"content":[],"images":[]},{"title":"Main Cast","level":3,"content":[{"type":"list","elements":[{"text":"Steve Carell as Michael Scott","elements":[]},{"text":"Rainn Wilson as Dwight Schrute","elements":[]},{"text":"John Krasinski as Jim Halpert","elements":[]},{"text":"Jenna Fischer as Pam Beesly","elements":[]},{"text":"B.J. Novak as Ryan Howard","elements":[]}]}],"images":[]},{"title":"Supporting Cast","level":3,"content":[{"type":"list","elements":[{"text":"Melora Hardin as Jan Levinson","elements":[]},{"text":"Ed Helms as Andy Bernard","elements":[]},{"text":"Leslie David Baker as Stanley Hudson","elements":[]},{"text":"Brian Baumgartner as Kevin Malone","elements":[]},{"text":"Creed Bratton (actor) as Creed Bratton","elements":[]},{"text":"Kate Flannery as Meredith Palmer","elements":[]},{"text":"Mindy Kaling as Kelly Kapoor","elements":[]},{"text":"Angela Kinsey as Angela Martin","elements":[]},{"text":"Paul Lieberstein as Toby Flenderson","elements":[]},{"text":"Oscar Nunez as Oscar Martinez","elements":[]},{"text":"Craig Robinson as Darryl Philbin","elements":[]},{"text":"Phyllis Smith as Phyllis Vance","elements":[]}]}],"images":[]},{"title":"Recurring Cast","level":3,"content":[{"type":"list","elements":[{"text":"Michael Schur as Mose Schrute","elements":[]}]}],"images":[]},{"title":"Guest Cast","level":3,"content":[{"type":"list","elements":[{"text":"Allan Wasserman as Nick Figaro","elements":[]},{"text":"Ramny Chowdhry as Vikram","elements":[]},{"text":"Mary Kathleen Gordon as Telemarketer (Green Sweater)","elements":[]},{"text":"Nick Lashaway as Telemarketer (Gray Scranton T-Shirt)","elements":[]},{"text":"Daniel Lindsay as Telemarketer (Partner of Pregnant Woman)","elements":[]},{"text":"Miki Ann Maddox as Telemarketer","elements":[]}]}],"images":[]},{"title":"References","level":2,"content":[{"type":"list","elements":[{"text":"↑ DVD commentary, Money.","elements":[]}]}],"images":[]}]}