{"sections":[{"title":"Moroccan Christmas","level":1,"content":[{"type":"paragraph","text":"\"Moroccan Christmas\" is the eleventh episode of the fifth season of The Office and the 83rd episode overall. It was written by Justin Spitzer, who also wrote Did I Stutter? and Back From Vacation and directed by Paul Feig. It first aired December 11, 2008. It was viewed by 8.79 million people."}],"images":[]},{"title":"Synopsis","level":2,"content":[{"type":"paragraph","text":"Phyllis throws a Moroccan-themed Christmas party, her first Christmas party as head of the Party Planning Committee. Alcohol is served at the party, of which Meredith takes full advantage - she gets so intoxicated that she accidentally sets her hair on fire while she is dancing around. Dwight puts out the fire with an extinguisher and the party comes to a halt. Michael then stages an intervention by gathering everyone in a circle to discuss how Meredith's alcoholism affects them. When Meredith continues to deny her alcoholism, the rest of the office find it best to go back to the party. Michael then talks with Meredith in his office before leaving the building. Meredith is told by Michael that they are going to a bar, but he actually takes her to a rehabilitation center. When Meredith sees this, she tries to escape, but Michael grabs her and drags her into the center. However, Michael learns that the staff will not check anyone in against their will, so he and Meredith leave and head back to the office."},{"type":"paragraph","text":"Dwight has been performing research to determine what will be the most popular toy of the current Christmas season: a doll named \"Princess Unicorn\", which is (as the name implies) a princess with a unicorn horn on its head. Dwight has bought every doll he could find in the local toy stores and explains he is going to sell the dolls to desperate parents for an enormous profit. Jim is skeptical that people would pay a high price for a doll, but he watches numerous customers come in throughout the day to purchase a doll from Dwight, all paying his asking price of $200. Toby wants to buy a doll for his daughter, Sasha, so he can be the hero this Christmas, which would irritate his ex-wife. When he goes to Dwight to purchase one, he finds that Darryl has already purchased the last one. Toby begs Darryl to the verge of tears, and Darryl offers to sell it to him for twice the price. Toby tells him that he doesn't have the money with him, but Darryl allows him to pay him back later, and Toby becomes visibly happy. He is, however, slightly shocked when the doll he gets from Darryl is a black version of the doll, but he decides not to complain."},{"type":"paragraph","text":"Throughout the day, Phyllis continues to order Angela to do various tasks for the party, such as preparing a plate of bread and hummus during Michael's intervention, or putting away her Nativity scene and removing the Christmas tree (as neither of those are in the theme of Moroccan Christmas). When Phyllis tells Angela to bring back the Christmas tree after Michael and Meredith leave, Angela refuses, telling Phyllis that she will no longer fulfill Phyllis' demands. Phyllis threatens to inform everyone of Angela's affair with Dwight, but Angela still refuses, as Phyllis would no longer be head of the Party Planning Committee if she did. As Phyllis despondently heads toward the door, she suddenly turns around and announces to the office that Angela is having an affair with Dwight, much to everyone's shock. Angela is visibly upset while Dwight is visibly amused. Pam claims that she knew it all along, which Jim initially doubts, but then decides to believe her in the spirit of Christmas. Andy, however, was absent for Phyllis' announcement, having been in the annex teaching himself to play a sitar. At the end of the episode, he returns to the party to play \"Deck the Halls\" for Angela on the sitar, before she asks him to take her home. The rest of the office decide not to reveal the secret to Andy."}],"images":[]},{"title":"Trivia","level":2,"content":[{"type":"list","elements":[{"text":"B.J. Novak (Ryan Howard) is credited but does not appear in this episode.","elements":[]},{"text":"Angela's wooden figurine nativity scene is manufactured by Fontanini.","elements":[]},{"text":"There is a lot of alcohol at the party, although in previous christmas episodes, Toby protests having alcohol because it is against policy.","elements":[]},{"text":"The \"orange vod-juice-ka\" which Michael \"invents\" for Jim, is actually called a Screwdriver. Jim subtly teases Michael, saying that he \"can't believe no-one's thought of that\", to which a proud (and oblivious) Michael responds, \"I know!\"","elements":[]},{"text":"It is unknown where Dwight retrieves the fire extinguisher from.","elements":[]},{"text":"Meredith says that she isn't an alcoholic, however at Jan's women in the workplace seminar, when she is asked what she's good at, she by habit says \"Hi, I'm Meredith, and I'm an alcoho...good at supplier relations.\" Which would imply that she has attended AA meetings.","elements":[]},{"text":"The admitting nurse is played by First Assistant Director Kelly Cantley.","elements":[]},{"text":"After Meredith's reaction to Michael's \"one of everything\" drink, he does a double point right at the camera, a la Isaac from The Love Boat.","elements":[]},{"text":"All the bars mentioned by Meredith, including The Bog, Coopers, Brixx's, Kelly's, Coopers, Carmen's and Andy Gavin's, are all real Scranton Bars. Ed Helms, Angela Kinsey and Brian Baumgartner have all visited The Bog, and Helms sat in with some local musicians there, performing on the banjo.","elements":[]},{"text":"Michael's tie has been worn in every Christmas episode.","elements":[]},{"text":"For the fourth time, the Simpson's doll has been wearing a santa hat.","elements":[]},{"text":"Michael saying he has soft teeth recalls the episode Dinner Party, when Michael dips his meat in wine to get it to be softer so that he can consume it.","elements":[]},{"text":"A stunt woman was used when Meredith was caught on fire, although actor Kate Flannery has done other stunts.","elements":[]},{"text":"Creed Bratton, according to Angela Kinsey, really wears the clothes that he wore in this episode.","elements":[]},{"text":"Michael mentions that he would like a watch for Christmas, recalling the episode Goodbye, Toby, when he was forced to give Toby his watch as a going away gift.","elements":[]},{"text":"This episode showcases more of Ed Helms's musical talent as he plays a sitar.","elements":[]}]}],"images":[]},{"title":"Cultural references","level":2,"content":[{"type":"list","elements":[{"text":"Andy's drinking ritual includes copious SoCo, a nickname for the liqueur Southern Comfort.","elements":[]},{"text":"The \"Place in France\" song that Andy plays badly on the sitar for an disgusted Angela, is called The Streets of Cairo, and was written in 1893 by American Congressman Sol Bloom, for the World's Columbian Exposition.","elements":[]},{"text":"The cookie Phyllis mentioned is known as a \"chebakia\" or \"Halwa Chebakia\" cookie. The cookie is made from sesame seeds, fried and coated with honey. As mentioned, the cookie is of Moroccan origin and is served during Ramadan.","elements":[]},{"text":"Michael reads off a list of personal questions of alcohol consumption one of which is whether Meredith has ever questioned the teachings of the Mormon (Latter-day Saints) Church. The Church of Jesus Christ of Latter-day Saints is widely known for discouraging its members to consume alcohol.","elements":[]}]}],"images":[]},{"title":"Cast","level":2,"content":[],"images":[]},{"title":"Main cast","level":3,"content":[{"type":"list","elements":[{"text":"Steve Carell as Michael Scott","elements":[]},{"text":"Rainn Wilson as Dwight Schrute","elements":[]},{"text":"John Krasinski as Jim Halpert","elements":[]},{"text":"Jenna Fischer as Pam Beesly","elements":[]}]}],"images":[]},{"title":"Supporting cast","level":3,"content":[{"type":"list","elements":[{"text":"Ed Helms as Andy Bernard","elements":[]},{"text":"Leslie David Baker as Stanley Hudson","elements":[]},{"text":"Brian Baumgartner as Kevin Malone","elements":[]},{"text":"Creed Bratton (actor) as Creed Bratton","elements":[]},{"text":"Kate Flannery as Meredith Palmer","elements":[]},{"text":"Mindy Kaling as Kelly Kapoor","elements":[]},{"text":"Angela Kinsey as Angela Martin","elements":[]},{"text":"Paul Lieberstein as Toby Flenderson","elements":[]},{"text":"Oscar Nunez as Oscar Martinez","elements":[]},{"text":"Craig Robinson as Darryl Philbin","elements":[]},{"text":"Phyllis Smith as Phyllis Vance","elements":[]}]}],"images":[]},{"title":"Guest cast","level":3,"content":[{"type":"list","elements":[{"text":"Kelly Cantley as Admitting Nurse","elements":[]},{"text":"Matthew Craig as Desperate Father","elements":[]}]}],"images":[]}]}