{"sections":[{"title":"Murder","level":1,"content":[{"type":"paragraph","text":"\"Murder\" is the tenth episode of the sixth season of The Office and the show's 110th episode overall. It was written by Daniel Chun and directed by Greg Daniels. It first aired on November 12, 2009. It was viewed by 7.76 million people."}],"images":[]},{"title":"Summary","level":2,"content":[{"type":"paragraph","text":"The day gets off to a rocky start when rumors reported in the online edition of The Wall Street Journal point to financial troubles for Dunder Mifflin. In an attempt to get the worried staff under control, Michael and Jim call the monthly staff meeting to provide what few assurances and optimistic viewpoints they can on the steadily worsening news. In a moment of quick thinking, Michael pulls out a party game, Belles, Bourbon & Bullets, but Jim says that they cannot afford to play around. Michael gets his way, saying Jim owes him 'one' after earlier insisting that Michael abandon his idea to run hamster tubes throughout the office, called \"Tube City\"."},{"type":"paragraph","text":"The staff slowly warms up to the game, which is a murder mystery. It is set in Savannah, Georgia, and everyone has to adopt a Southern accent (with varying degrees of success). Thanks to Pam, Andy, and Phyllis, the game quickly becomes a hit. Almost everyone present starts to play along, except for Oscar (who tries to get updates on the situation from corporate) and Creed (who shows up late to work and flees after being told he is a suspect in a murder). Jim continues to believe the entire exercise is pointless."},{"type":"paragraph","text":"Throughout the game, Andy is trying his hardest to make a move on Erin, and with the possible impending closure of Dunder Mifflin, decides he needs to make a move now. While 'in character,' he asks Erin out for a weekend date, but becomes unsure if he really asked her out, or if he just simply asked out her murder mystery character, \"Naughty Nelly.\" He is worried that Erin only said yes because Naughty Nelly, a promiscuous, flirtatious, and scandalous woman, \"says yes to everyone and might be a murderer.\""},{"type":"paragraph","text":"Just as the game seems to get interesting, Oscar returns and reveals even more bad news from corporate. Accounting has been notified to stop payments to vendors, which is in Oscar's words \"unprecedented and should be a cause for concern.\" This brings the staff out of the game and back to the scary reality of losing their jobs. Michael tries to win them back, but accidentally skips to the game's conclusion, revealing the murderer to be Beatrix Bourbon (Phyllis). Michael refuses to give up and continues playing the game with Dwight."},{"type":"paragraph","text":"After the game, Andy and Erin meet at the receptionist desk, where Erin asks him about their upcoming date. Andy chickens out and indicates that the \"date\" was just part of the game, although that was not his original intention. Silence follows, and Erin leaves Andy at reception in embarrassment. She later reveals to the camera that she thought the date was real and was excited about the idea of dating Andy."},{"type":"paragraph","text":"In a vain attempt to salvage the day, Michael tries to introduce another murder and other twists to the story to pull his staff back into the game. This infuriates Jim to his breaking point, and they hold a private talk in Michael's office. Michael stands his ground and points out to Jim \"they need this game\" or they might cave in under the impending bad news and possible closure of Dunder Mifflin. CFO David Wallace finally returns the phone calls to Jim, and reveals that while nothing has been officially decided yet, Dunder Mifflin is expected to be insolvent by year-end. Knowing how damaging this could be to his staff, Jim deliberately hides this news from them and nudges them back into the party. At the end of the day, Jim is \"happy that we have two co-managers today,\" realizing it helps having someone to distract people from pressing issues."},{"type":"paragraph","text":"Michael, Dwight, Andy, and Pam find themselves in a fake Mexican standoff, after each reveals themselves to be double agents, lasting until 6:00 at night. Jim pulls Pam out so they can go home, and the others pretend to shoot each other to death."}],"images":[]},{"title":"Cultural references","level":2,"content":[{"type":"list","elements":[{"text":"Dwight proposes a martial arts scenario that takes place in the Lackawanna Trolley Museum. There is no such museum, although there is The Electric City Trolley Museum in Scranton.","elements":[]},{"text":"The Swedish Chef is a character from the 1970s television show The Muppet Show.","elements":[]},{"text":"The Wall Street Journal is a popular business journal.","elements":[]}]}],"images":[]},{"title":"Characters in the Murder Mystery Game","level":2,"content":[{"type":"list","elements":[{"text":"Voodoo Mama Juju, played by Angela","elements":[]},{"text":"Beatrix Bourbon, played by Phyllis","elements":[]},{"text":"Deb U. Taunt, played by Pam","elements":[]},{"text":"The Butler, played by Dwight","elements":[]},{"text":"Caleb Crawdad, played by Michael","elements":[]},{"text":"Naughty Nellie Nutmeg, played by Erin","elements":[]},{"text":"Nathaniel Nutmeg, played by Andy","elements":[]},{"text":"Jim Halpert (time-traveling co-manager), played by Jim (deleted scene)","elements":[]}]}],"images":[]},{"title":"Amusing details","level":2,"content":[{"type":"list","elements":[{"text":"Creed bought a proper rear-view mirror for his car sometime between \"Cafe Disco\" and this episode.","elements":[]},{"text":"According to series creator and episode director Greg Daniels, the episode explores the idea that Michael is positively motivated due to his subconscious; although his antics seem nonsensical to many members of the office, in the end, his idea to take his coworkers' minds off of the fiscal trouble proves to be the best choice. This was first explored in the third season episode \"Grief Counseling\".","elements":[]},{"text":"Initially, after Michael announces that \"there has been a murder\", the show was supposed to have cut to a commercial break. However, the producers realized that this was too misleading, as it would have implied that a real homicide had taken place.","elements":[]}]}],"images":[]},{"title":"Goofs","level":2,"content":[{"type":"list","elements":[{"text":"When Michael, Dwight and Andy all shoot each other and fall to the ground Andy flips off the camera while lying on the ground and it is uncensored.","elements":[]}]}],"images":[]},{"title":"Cast","level":2,"content":[],"images":[]},{"title":"Main cast","level":3,"content":[{"type":"list","elements":[{"text":"Steve Carell as Michael Scott","elements":[]},{"text":"Rainn Wilson as Dwight Schrute","elements":[]},{"text":"John Krasinski as Jim Halpert","elements":[]},{"text":"Jenna Fischer as Pam Halpert","elements":[]},{"text":"B.J. Novak as Ryan Howard","elements":[]}]}],"images":[]},{"title":"Supporting cast","level":3,"content":[{"type":"list","elements":[{"text":"Ed Helms as Andy Bernard","elements":[]},{"text":"Leslie David Baker as Stanley Hudson","elements":[]},{"text":"Brian Baumgartner as Kevin Malone","elements":[]},{"text":"Creed Bratton (actor) as Creed Bratton","elements":[]},{"text":"Mindy Kaling as Kelly Kapoor","elements":[]},{"text":"Ellie Kemper as Erin Hannon","elements":[]},{"text":"Angela Kinsey as Angela Martin","elements":[]},{"text":"Oscar Nunez as Oscar Martinez","elements":[]},{"text":"Phyllis Smith as Phyllis Vance","elements":[]}]}],"images":[]},{"title":"Recurring cast","level":3,"content":[{"type":"list","elements":[{"text":"Andy Buckley as David Wallace (Voice Only)","elements":[]}]}],"images":[]},{"title":"Guest cast","level":3,"content":[{"type":"list","elements":[{"text":"Suzanne Watson as Stephanie","elements":[]}]}],"images":[]}]}