{"sections":[{"title":"New Leads","level":1,"content":[{"type":"paragraph","text":"\"New Leads\" is the twentieth episode of the sixth season and the 120th episode overall. It was written and directed by Brent Forrester who wrote, \"Mafia,\" \"Blood Drive,\" and \"Business School.\" It aired on March 18, 2010. It was viewed by 7.63 million people."}],"images":[]},{"title":"Synopsis","level":2,"content":[{"type":"paragraph","text":"In the cold open Michael calls Jim into his office and shows him photos of allegedly Johnny Depp at his condo. Jim messes with Michael before bluntly telling him that there is no way it is Johnny Depp. After a short argument Michael relents after stating that the name on the mail box was \"M. Shulman.\" Jim, who is on his way out, pauses and asks, \"M. Night Shulman?\", to which a shocked Michael has no reply."},{"type":"paragraph","text":"Michael holds a meeting but Stanley and Dwight interrupt Michael demanding if there are any sales topics or any news on the $50,000 leads that Sabre bought them. Michael lets them know they aren't here yet. The salespeople are especially anxious to get the leads which is causing them to snap at Michael and their co-workers. They abruptly leave the conference room. Michael tells Dwight that he would like his undivided attention. Dwight responds coldly, \"You couldn't handle my undivided attention.\" Michael explains that Sabre's policy of \"Sales is King\" means that the company emphasizes the importance of the sales staff which reduces the rest of the office to support them. This has gone to the salespeople's heads and is creating tension in the office."},{"type":"paragraph","text":"Dwight comes into Michael's office to ask him patronizingly about news on the leads. Jim texts a potential client, ignoring Micheal when he tries to speak to him and has to literally force his hand to sign Jim's commission check. Phyllis refuses to answer Angela's repeated emails. Andy demands a pencil from Darryl during a sale and wrestles him for it when Darryl refuses. Darryl tells Michael he needs to put the salespeople in their place."},{"type":"paragraph","text":"Thus, when the leads arrive, Michael refuses to hand them out, especially when Phyllis demands, \"hand them over numbnuts\". While this earns him the appreciation of the rest of the branch, Gabe explains that it is Michael's job to hand those leads over. So Michael hands them to the non-sales staff. Jim tries to convince Michael that this plan isn't going to work. Michael responds by giving Jim a list of clues to find his share of the leads which he has hidden all over the industrial park."},{"type":"paragraph","text":"Phyllis asks Angela for her share of the leads. Angela agrees to do so as soon as Phyllis fills out a stack of paperwork that Angela plans to shred in front of her as soon as she's done. Stanley wins leads from Ryan and Kelly by agreeing to both their arguments in a relationship debate. Jim decides to call Pam, tells her about the situation at Dunder Mifflin and Pam helps him solve some of the clues."},{"type":"paragraph","text":"Erin hides her share of the leads, and plays the hot-cold game with Andy which awkwardly leads his hands moving towards her chest before she reveals them underneath her keyboard."},{"type":"paragraph","text":"When Dwight returns from his sales call and demands his share of the leads, Michael advises him, \"If you want to find your leads, go to the man who never breeds.\" Dwight immediately identifies Kevin, who attempts to humiliate Dwight but only results in getting strangled. After a few seconds of being choked by Dwight, Kevin tells him that the leads are in the trash, but Erin already threw it away. Dwight heads to the dumpster, to find nothing there. Michael realizes that it's Friday and runs out into the street where a garbage truck can be seen driving away."},{"type":"paragraph","text":"Michael asks everyone to go to the dump with him to find the leads, but only Dwight will, fearing that Michael won't be able to find them on his own. While at the dump, Michael confronts Dwight about how Dwight no longer shows him respect. Dwight admits that he resents how being under Michael's tutelage hasn't gone as far as he thought it would. He believes he would have been in a higher position at another company had he accepted one of the other job offers he'd been given. As a result, he's still just a salesman at a company that failed under a boss that isn't going anywhere. \"I hitched my wagon to a horse with no legs.\" This results in a short trash fight, which ends when Michael accidentally dumps a sink of garbage water onto himself. The two, exhausted, rest on a bathtub and resume their friendship after a short conversation, acknowledging they'll never find the leads. Jim meanwhile convinces the sales-staff to acknowledge their behavior and to give up 2% of their commissions to appease the rest of the office."},{"type":"paragraph","text":"Jim, Andy, Phyllis, and Stanley present the non-sales staff with a platter of pastries. The other employees are so delighted that Jim realizes that that's all it takes to earn their forgiveness. The 2% commission offer is never made. Michael and Dwight return with a dirty bean bag chair that Dwight exclaims is, \"For me and Michael only!\", showing they have become friends again."},{"type":"paragraph","text":"At the end of the episode, Erin and Andy are at the dump, and Erin gives Andy her coat after he states he is cold. Andy tells her that she is the nicest person he has ever met, and they have their first kiss in the landfill."}],"images":[{"src":"https:\/\/vignette.wikia.nocookie.net\/theoffice\/images\/c\/c1\/Jimnewleads.jpg\/revision\/latest\/scale-to-width-down\/188?cb=20100321021136","caption":"Jim tries to find the new leads."},{"src":"https:\/\/vignette.wikia.nocookie.net\/theoffice\/images\/2\/2d\/Dwightnewleads.jpg\/revision\/latest\/scale-to-width-down\/180?cb=20100321021211","caption":"Dwight tries to find the leads."},{"src":"https:\/\/vignette.wikia.nocookie.net\/theoffice\/images\/b\/bf\/Andyerinnewleads.jpg\/revision\/latest\/scale-to-width-down\/202?cb=20100321021251","caption":"Andy and Erin kiss."}]},{"title":"Cultural references","level":2,"content":[{"type":"list","elements":[{"text":"A lead is a person who has expressed an interest in purchasing a product or service.","elements":[]},{"text":"Johnny Depp is an actor known for roles such as Jack Sparrow in the Pirates of the Caribbean film series.","elements":[]},{"text":"Cap'n Crunch is a sweetened cereal for children.","elements":[]},{"text":"Jim teases Michael by suggesting that his neighbor's name is M. Night Shulman. M. Night Shyamalan is a filmmaker and screenwriter who grew up and lives in Pennsylvania and films nearly all his movies in that state.","elements":[]},{"text":"Michael says that Jim thought he saw Roger Clemens, a former Major League baseball pitcher for the New York Yankees.","elements":[]},{"text":"Sexting is a form of texting in which people send sexually explicit photos, messages, etc., using electronics.","elements":[]},{"text":"A Conspiracy is a usually an attempt to defraud people of their legal rights, or the overthrowing of a government, in some cases.","elements":[]},{"text":"Michael wants to call Stanley uppity but reconsiders and applies the term to Jim instead. Uppity is a racially-tinged term used during the Civil Rights era to refer disparagingly to blacks who tried to improve their social and economic status.","elements":[]},{"text":"While Michael is on the phone with Gabe about holding back the leads, Michael references the idea of the correlation between ice cream and going to jail. This is very similar to the correlation vs causation fallacy that increased ice cream sales leads to increased homicide.","elements":[]},{"text":"Kelly refers to the Kardashians, from the hit reality television series, Keeping Up with the Kardashians, about a family, which consists of an ex-wife and her daughters. Kelly is a devoted fan. Khloe and Kim Kardashian are known for dating\/marrying African-American men, which is likely why Kelly mentioned the show to Darryl.","elements":[]},{"text":"Baba Ghanoush is an Arab dish made from eggplants, which are mixed and mashed with several spices. It is eaten throughout western Asia, and can be dipped with pita bread.","elements":[]},{"text":"A onesie is a garment designed to be worn by infants, much like pajamas, and have snaps.","elements":[]},{"text":"Kevin refers to Ghost Whisperer, a show about a woman who can see dead people and helps to bring closure to families who have recently seen death in their families.","elements":[]},{"text":"A Falafel is a fried ball or patty derived from chickpeas, and usually served within a pita. It is from Egypt, but is eaten throughout the world.","elements":[]},{"text":"Erin plays the hotter\/colder game with Andy. In this children's game, warmer temperatures indicate that the player is closer to the target. (The game was last seen in the episode The Fight.)","elements":[]}]}],"images":[]},{"title":"Goofs","level":2,"content":[{"type":"list","elements":[{"text":"On the board in the conference room, it said that Phyllis made the most sales. However, Dwight says that he made the most sales, and that he is \"King of Kings.\"","elements":[]}]}],"images":[]},{"title":"Deleted Scenes","level":2,"content":[{"type":"list","elements":[{"text":"Creed asks Andy for $10,000, but Andy declines, and offers something else. Creed asks for Andy's hairpiece and $500, which Andy declines.","elements":[]},{"text":"Phyllis and Stanley agree that in over the 31 years that they worked at Dunder Mifflin, they are happy that salesmen are being taken seriously and that Sabre recognizes that Salesman is King.","elements":[]},{"text":"Andy talks to Erin and asks her for leads. Erin says she doesn't have any.","elements":[]},{"text":"An extended scene\/alternate scene of when Andy, Phyllis, Stanley and Jim discuss solutions to the issue. Stanley questions Jim's actions.","elements":[]},{"text":"Dwight and Darryl fight over Sabre's demands about alerting client on freezing rain, which will affect shipping time.","elements":[]}]}],"images":[]},{"title":"Quotes","level":2,"content":[{"type":"paragraph","text":"For quotes, see: New Leads Quotes."}],"images":[]},{"title":"Amusing Details","level":2,"content":[{"type":"list","elements":[{"text":"When Michael is in the conference room, it shows how many sales each salesman made. While Phyllis has the most sales, Jim, Dwight, Andy, and Stanley are also doing well in sales. However, Pam, is once again doing bad in sales, possibly due to her low sales (she had to make cold calls) or also because she is on maternity leave, and only had three days to make sales.","elements":[]},{"text":"In the meeting in the beginning Michael explains the Lost and Found is itself lost and Creed can be seen nervously adjusting glasses clearly made for a woman, indicating he in fact stole the Lost and Found.","elements":[]},{"text":"As receptionist, Pam was always forced to take care of Michael, explaining why she knows everything he means, including his \"Mopey Place.\"","elements":[]},{"text":"Even Kevin seems repulsed by the idea of seeing Meredith naked.","elements":[]},{"text":"Michael refers to Johnny Depp's character as Captain Jack Sparrow which is a running joke throughout the movies. Captain Jack Sparrow and his friends always insist on including his title when he is named.","elements":[]},{"text":"The cold open for this episode appears to have been filmed while Jim was still a co-manager. ","elements":[]},{"text":"Michael says \"Make friends first, make sales second, make love third, in no particular order,\" even though he just put the three items in order.","elements":[]},{"text":"When Michael is signing Jim's seemingly handsome commission check, and Michael comments on how much money it is, Jim says, \"It's good, you know, with the kid.\" And Michael responds, \"Don't gloat,\" referring to his longing for children that is never able to be fulfilled.","elements":[]}]}],"images":[]},{"title":"Connections to Previous Episodes","level":2,"content":[{"type":"list","elements":[{"text":"Pam also had bad sales numbers in \"Koi Pond,\" when she was forced to make cold calls with Andy, as the people with the two lowest sales in the office had to do them. She also only doubled her sales from 2 to 4 in \"Scott's Tots.\"","elements":[]},{"text":"Phyllis wears purple so much, she was called \"Mother Goose,\" by Sasha Flenderson in \"Take Your Daughter to Work Day.\"","elements":[]},{"text":"Kelly also told Charles Miner that her family was much like the Kardashians, showing that she is a huge fan of their show. She later tries to persuade Ryan to watch it.","elements":[]},{"text":"Phyllis and Andy have apparently stepped up their sales ability as in Employee Transfer Dwight scoffs at Andy for \"barely being able to outsell Phyllis\".","elements":[]}]}],"images":[]},{"title":"Trivia","level":2,"content":[{"type":"list","elements":[{"text":"The scenes where Michael, Dwight, Andy, and Erin are at the dump were actually taken using a green screen. Many fans noticed this.","elements":[]},{"text":"Jim says Michael's idea for the fourth Pirates of the Caribbean movie is \"that they should do one.\" Pirates of the Caribbean: On Stranger Tides was the fourth movie in the series.","elements":[]}]}],"images":[]},{"title":"Cast","level":2,"content":[],"images":[]},{"title":"Main Cast","level":3,"content":[{"type":"list","elements":[{"text":"Steve Carell as Michael Scott","elements":[]},{"text":"Rainn Wilson as Dwight Schrute","elements":[]},{"text":"John Krasinski as Jim Halpert","elements":[]},{"text":"Jenna Fischer as Pam Halpert","elements":[]},{"text":"B.J. Novak as Ryan Howard","elements":[]},{"text":"Ed Helms as Andy Bernard","elements":[]}]}],"images":[]},{"title":"Supporting Cast","level":3,"content":[{"type":"list","elements":[{"text":"Leslie David Baker as Stanley Hudson","elements":[]},{"text":"Brian Baumgartner as Kevin Malone","elements":[]},{"text":"Creed Bratton (actor) as Creed Bratton","elements":[]},{"text":"Kate Flannery as Meredith Palmer","elements":[]},{"text":"Mindy Kaling as Kelly Kapoor","elements":[]},{"text":"Ellie Kemper as Erin Hannon","elements":[]},{"text":"Angela Kinsey as Angela Martin","elements":[]},{"text":"Paul Lieberstein as Toby Flenderson","elements":[]},{"text":"Oscar Nunez as Oscar Martinez","elements":[]},{"text":"Craig Robinson as Darryl Philbin","elements":[]},{"text":"Phyllis Smith as Phyllis Vance","elements":[]}]}],"images":[]},{"title":"Recurring Cast","level":3,"content":[{"type":"list","elements":[{"text":"Zach Woods as Gabe Lewis","elements":[]}]}],"images":[]}]}