{"sections":[{"title":"New Guys","level":1,"content":[{"type":"paragraph","text":"\"New Guys\" is the first episode of the ninth season of the The Office and the show's 177th overall. The episode was written and directed by Greg Daniels. It aired September 20, 2012 on NBC and was viewed by 4.28 million people. The episode marked the first appearance of characters Pete and Clark in starring roles, and the last to feature Kelly Kapoor and Ryan Howard until the series finale."}],"images":[]},{"title":"Synopsis","level":2,"content":[{"type":"paragraph","text":"While talking to the camera, Kevin reveals that he tried to save a turtle that he ran over, but only ended up killing it. Jim and Pam reveal that Jim was offered an entrepreneurial sports job by his old college friend based on an idea the two came up with together. Jim tells the camera that he turned it down, because it would not be good for his family. Pam and Jim begin to take off their microphones and Pam makes a remark, noting that, after nine years, the cameramen should have enough footage for a documentary. One of the cameramen then addresses the two, saying that they are more interested in the developments in the office workers themselves rather than the office now. Dwight tells the camera that he invented a drink made from beet runoff and that he found out that he isn't Philip's biological father"},{"type":"paragraph","text":"Two new employees, Pete and Clark, dubbed \"The New Jim\" and \"Dwight Jr.\" are hired by the Scranton branch and cause trouble for Jim and Dwight. At first, Dwight is happy to have a protege, but soon begins to fear that Clark is after his job. Jim, on the other hand, does not feel that Pete is anything like him. However, after hearing Pete discuss his future plans, Jim realizes that he has been stuck at the same job for nine years."},{"type":"paragraph","text":"Meanwhile, Andy returns from Outward Bound manager training—where he became more \"decisive and confident\"—hoping for revenge on Nellie for commandeering his job last year. He takes Nellie into his office and informs her that he's \"gonna be a real bitch to [her]\". Andy sets up a slack line in the parking lot and makes the employees walk across it, humiliating Nellie as she insists on walking in her heels and fails to keep her balance. After Clark proves that he is talented at balancing, Dwight attempts to one-up him, but ends up failing repeatedly and hurting himself. Eventually, Dwight tries to prove his superiority by riding a bicycle across a tight-rope suspended between the roof and a telephone pole, but the photocopier he is using as a counterweight is not heavy enough and he ends up losing his balance and hanging from the bicycle above the parking lot. Much to his embarrassment, he has to be rescued by a team of firefighters, while Creed mistakenly believes the incident to be a circus act."},{"type":"paragraph","text":"While everyone is outside crowding around Dwight, Jim calls up his old college friend and tells him that he wants to be involved in the new business deal—without telling Pam. Meanwhile, Angela puts her cat up for adoption as her baby is allergic to it, although her husband, Senator Robert Lipton, is saddened at having to give up his beloved pet. Oscar agrees to adopt the cat, and it is implied that Robert is having an affair with him, further contributing to growing, widespread suspicion that Robert is gay, revealing he only adopted the cat so Robert could still spend time with his pet."}],"images":[]},{"title":"Cultural references","level":2,"content":[{"type":"list","elements":[{"text":"Kelly thinks she's going to Miami to hang with basketball player LeBron James and singer Gloria Estefan.","elements":[]},{"text":"Much like the sixth season starter Gossip —which featured parkour in the cold opening—the seventh season opener Nepotism—which started with a lip dub—and the eighth season premiere The List—which opened with a bit about planking—New Guys also contains a plot involving a popular internet meme, in this case slacklining, which is a practice in balance that typically uses nylon webbing tensioned between two anchor points.","elements":[]},{"text":"When Ryan is leaving, he claims he is going to Ohio because \"they call it the Silicon Prairie,\" a reference to Silicon Valley, a part of the San Francisco Bay Area in Northern California in the United States that is home to many of the world's largest technology corporations.","elements":[]},{"text":"Andy returns from Outward Bound, an organization that aims to foster the personal growth and social skills of participants by using challenging expeditions in the outdoors.","elements":[]},{"text":"Dwight tries to talk to Clark about the heavy metal band Slayer, noting that he has tickets for a show in ten months.","elements":[]},{"text":"Pete mentions that he likes to watch the reality TV game show The Amazing Race.","elements":[]},{"text":"Jim asks Pete if he likes the Philadelphia Phillies, but Pete mistakes his reference to mean horses and says he prefers the Boston Red Sox.","elements":[]},{"text":"\"C'est la vie\", a French phrase, means \"Such is life\".","elements":[]}]}],"images":[]},{"title":"Connections to previous episodes","level":2,"content":[{"type":"list","elements":[{"text":"One of the many things Kevin used to glue together the turtle's shell is the shamrock keychain Oscar got Creed for Christmas in Christmas Party.","elements":[]},{"text":"Andy is angry to see Nellie still in Scranton, but he seemed more than happy to hire her as the Special Projects Manager in Free Family Portrait Studio.","elements":[]},{"text":"Dwight trying to bicycle on the roof is similarly dangerous and ridiculous to Michael's plan in Safety Training.","elements":[]},{"text":"This episode's opening is similar to the opening of season 4, because something is run over by a car.","elements":[]},{"text":"Dwight is originally eager to have Clark as an honorary son as he learned he wasn't Philip's biological father in this episode's recap of the summer.","elements":[]},{"text":"Dwight trying to prove himself on the slackline is similar to Michael trying and failing to perform the coal walk in Beach Games.","elements":[]},{"text":"Like in Search Committee where he imagined a valet in front of the office, Creed thinks all the events of the episode are actually part of a circus.","elements":[]}]}],"images":[]},{"title":"Trivia","level":2,"content":[{"type":"list","elements":[{"text":"Throughout the episode, Jim finds a few differences and similarities between him and Pete. Among the differences are: Jim likes baseball while Pete doesn't, Pete is from Vermont, Pete works in Customer Service while Jim is a salesman. Among the similarities are: they both work for Dunder Mifflin, they both expected to work at Dunder Mifflin for a short time, they both developed feelings for a receptionist who was in a relationship with someone else at the time, they both refuse to sit on Meredith's face.","elements":[]},{"text":"The episode marks the first time the audience has heard someone from the documentary film crew speak, except in Weight Loss, when we hear a faint sigh after Jim tricks the camera operator.","elements":[]},{"text":"The Dwight Schrute \"Get Glue\" sticker was released alongside the episode.","elements":[]},{"text":"When Clark goes along the slackline, the line is actually slack. When Dwight follows after him in an attempt to prove his talent as well, the rope is made far tighter to make it more difficult to cross the line.","elements":[]},{"text":"When stating her desires for an adopting family for Comstock, Angela says she doesn’t mind either a wealthy white or black couple, however she won’t consider “both” (interracial). This is ironic given her pursuit of Charles Miner in New Boss and Two Weeks, another example of Angela’s moral duality.","elements":[]},{"text":"When asked what happened during his summer, Dwight says he invented a blue power drink made from beet runoff. However, when the clip is played from Dwight finding out that he is not the father of Philip Lipton, he vomits blue all over Angela, presumably from the beet power drink. This would mean that this didn't happen during his summer.","elements":[]},{"text":"Outward Bound changes Andy's wardrobe, just like when he took the manager's job he stopped wearing the sweater vests.","elements":[]}]}],"images":[]},{"title":"Cast","level":2,"content":[],"images":[]},{"title":"Main Cast","level":3,"content":[{"type":"list","elements":[{"text":"Rainn Wilson as Dwight Schrute","elements":[]},{"text":"John Krasinski as Jim Halpert","elements":[]},{"text":"Jenna Fischer as Pam Halpert","elements":[]},{"text":"Ed Helms as Andy Bernard","elements":[]}]}],"images":[]},{"title":"Supporting Cast","level":3,"content":[{"type":"list","elements":[{"text":"Catherine Tate as Nellie Bertram","elements":[]},{"text":"Leslie David Baker as Stanley Hudson","elements":[]},{"text":"Brian Baumgartner as Kevin Malone","elements":[]},{"text":"Creed Bratton as Creed Bratton","elements":[]},{"text":"Clark Duke as Clark Green","elements":[]},{"text":"Kate Flannery as Meredith Palmer","elements":[]},{"text":"Ellie Kemper as Erin Hannon","elements":[]},{"text":"Angela Kinsey as Angela Lipton","elements":[]},{"text":"Jake Lacy as Pete Miller","elements":[]},{"text":"Paul Lieberstein as Toby Flenderson","elements":[]},{"text":"Oscar Nunez as Oscar Martinez","elements":[]},{"text":"Craig Robinson as Darryl Philbin","elements":[]},{"text":"Phyllis Smith as Phyllis Vance","elements":[]}]}],"images":[]},{"title":"Recurring Cast","level":3,"content":[{"type":"list","elements":[{"text":"B.J. Novak as Ryan Howard","elements":[]},{"text":"Mindy Kaling as Kelly Kapoor","elements":[]},{"text":"Jack Coleman as Robert Lipton","elements":[]},{"text":"Andy Buckley as David Wallace (voice only)","elements":[]}]}],"images":[]},{"title":"Guest Cast","level":3,"content":[{"type":"list","elements":[{"text":"Jeff Bee as Rafe","elements":[]},{"text":"Oliver Vaquer as Doctor","elements":[]}]}],"images":[]}]}