{"sections":[{"title":"Pam's Replacement","level":1,"content":[{"type":"paragraph","text":"\"Pam's Replacement\" is the seventh episode of the eighth season of the American television comedy series The Office and is the show's 159th overall. It was directed by Matt Sohn and written by Allison Silverman. It originally aired on NBC on November 10, 2011. It was viewed by 5.96 million people. The episode guest stars Lindsey Broad and Steve Moore."},{"type":"paragraph","text":"\"Pam's Replacement\" relates to Pam's pregnancy; Jenna Fischer was actually pregnant and her pregnancy was written into the series with Pam and Jim having their second baby. The episode received mixed reviews from critics with Myles McNutt from the AV Club calling it one of the \"laziest\" episodes of the series. According to Nielsen Media Research, the episode received 5.96 million viewers and received a 3.0 rating\/7% share among adults between the ages of 18 and 49 marking a slight drop in the ratings from the previous episode, Doomsday."}],"images":[]},{"title":"Synopsis","level":2,"content":[{"type":"paragraph","text":"In the cold open, Andy tries to impress a potential client by pretending to turn down an \"important phone call,\" when in fact it is really a made-up ruse being aided by Erin. However, Erin describes the fake phone call in depth with the \"death\" of Andy's mother, prompting the potential client to urge Andy to take the call (helped along with concern from a knowing Dwight). After pretending to talk to the \"police\" on the phone (actually Darryl, who is reluctantly part of the ruse), a humiliated and embarrassed Andy tells Erin to leave the room and \"hold all other calls\"."},{"type":"paragraph","text":"Pam trains an attractive temporary worker, Cathy Simms, so that she can take her place when she goes on maternity leave. Pam asks Jim if he finds the new temp attractive. Jim, not wanting to upset his pregnant wife, tells her that he does not find her replacement attractive at all. However, Pam is convinced that Jim is lying to her (even after reassurance from the rest of the staff), and she enlists the help of the harshly honest Dwight to prove that Jim finds the new temp attractive. After a battery of tests (including an embarrassing show of Dwight reaching for Jim's crotch to search for an erection), Dwight and Pam convince Jim to go get his blood pressure checked, as a means of a lie-detector test. As Dwight's homemade lie-detector test fails, Pam realizes that Jim has unusually high blood pressure, which his father also suffers from, and forgets about the issue in order to focus on her husband's health."},{"type":"paragraph","text":"Meanwhile, CEO Robert California surprises Andy, Kevin, and Darryl when he asks to join their band after he finds them having a jam session in the warehouse. Soon thereafter, California's friends, skilled musicians themselves, arrive and take over the original band. Andy, Kevin and Darryl, with the help of warehouse worker Val, realize that they were ousted, and after a failed attempt to try getting their original band roles back, they instead satisfyingly jam outside by themselves."}],"images":[]},{"title":"Cultural references","level":2,"content":[{"type":"list","elements":[{"text":"The office discusses the hotness of British actress Helen Mirren.","elements":[]},{"text":"Kelly says Pam wishes she were like Elin Nordegren, the ex-wife of golfer Tiger Woods, who he cheated on.","elements":[]},{"text":"Jim and Cathy discuss the movie Zoolander.","elements":[]},{"text":"Kevin confuses singer Chaka Khan with Khan Noonien Singh from Star Trek.","elements":[]},{"text":"Dwight refers to the elderly man at the drugstore as \"Tin Man\".","elements":[]},{"text":"Dwight and Pam hand Creed a bar of Toblerone chocolate and he thinks it's just a \"long triangle\".","elements":[]},{"text":"The band in the warehouse plays \"Midnight Rambler\" by British rock and roll band The Rolling Stones.","elements":[]}]}],"images":[]},{"title":"Connections to previous episodes","level":2,"content":[{"type":"list","elements":[{"text":"Andy asking Erin to fake a phone call is a callback to Michael's similar request of Pam in The Deposition. The result is similar: The \"call\" ends up having to be taken. However, this is also a common trope.","elements":[]},{"text":"Oscar lives up to his nickname \"Actually\" in this episode, from China.","elements":[]},{"text":"Dwight falling and grabbing Jim's crotch is similar to when in Company Picnic Pam and Jim mention when a guy lost his balance and grabbed Pam's breasts for balance.","elements":[]},{"text":"Andy had his \"scatting\" written down on a piece of paper, which undermines the point of scatting.","elements":[]},{"text":"The newspaper Dwight reads says \"Fee Proposed for City Mural Project\", foreshadowing Pam's later appointment to paint a mural for the city.","elements":[]}]}],"images":[]},{"title":"Cast","level":2,"content":[],"images":[]},{"title":"Main cast","level":3,"content":[{"type":"list","elements":[{"text":"Rainn Wilson as Dwight Schrute","elements":[]},{"text":"John Krasinski as Jim Halpert","elements":[]},{"text":"Jenna Fischer as Pam Halpert","elements":[]},{"text":"B.J. Novak as Ryan Howard","elements":[]},{"text":"Ed Helms as Andy Bernard","elements":[]},{"text":"James Spader as Robert California","elements":[]}]}],"images":[]},{"title":"Supporting cast","level":3,"content":[{"type":"list","elements":[{"text":"Leslie David Baker as Stanley Hudson","elements":[]},{"text":"Brian Baumgartner as Kevin Malone","elements":[]},{"text":"Creed Bratton (actor) as Creed Bratton","elements":[]},{"text":"Kate Flannery as Meredith Palmer","elements":[]},{"text":"Mindy Kaling as Kelly Kapoor","elements":[]},{"text":"Ellie Kemper as Erin Hannon","elements":[]},{"text":"Angela Kinsey as Angela Martin-Lipton","elements":[]},{"text":"Paul Lieberstein as Toby Flenderson","elements":[]},{"text":"Oscar Nunez as Oscar Martinez","elements":[]},{"text":"Craig Robinson as Darryl Philbin","elements":[]},{"text":"Phyllis Smith as Phyllis Vance","elements":[]},{"text":"Zach Woods as Gabe Lewis","elements":[]}]}],"images":[]},{"title":"Recurring cast","level":3,"content":[{"type":"list","elements":[{"text":"Lindsey Broad as Cathy Simms","elements":[]}]}],"images":[]},{"title":"Guest cast","level":3,"content":[{"type":"list","elements":[{"text":"Steve Moore as the Drummer","elements":[]},{"text":"Rodney J. Hobbs as the Pharmacist","elements":[]},{"text":"Linda Taylor as the Guitarist","elements":[]}]}],"images":[]}]}