{"sections":[{"title":"Paper Airplane","level":1,"content":[{"type":"paragraph","text":"\"Paper Airplane\" is the twentieth episode of the ninth season of the American television comedy series The Office and is the show's 196th episode overall. It aired on April 25, 2013."},{"type":"paragraph","text":"In the episode, Dwight and Angela compete in an office-wide paper airplane contest with a cash prize. Local talent agent Carla Fern helps Andy with his first acting role in an industrial film. Jim and Pam try to use new skills they have learned in couples counseling."}],"images":[]},{"title":"Synopsis","level":2,"content":[{"type":"paragraph","text":"The employees hold a paper airplane competition, Andy gets an acting role in a workplace safety video, and Jim and Pam's marriage tensions continue to build."}],"images":[]},{"title":"Summary","level":2,"content":[{"type":"paragraph","text":"There is a paper airplane contest in the warehouse, and Angela and Dwight compete for the prize. Meanwhile, Andy is preparing for an industrial film. He remarks that things in eyes freak him out, when he sees Toby, who got hit in the eye by Pam when she threw her paper airplane. Andy is rather stressed out, and once he overcomes his fear is willing to stick his eyes in the chemical eye washer twice. Back in the office, Jim and Pam confirm they are in couple's counseling. After the first session, they become more honest with each other, lightening the stress on their relationship somewhat. At the end of the episode, Pam runs after Jim when he says he's going to Philly again. She runs out to the taxi to give him his umbrella, which he left on his desk by mistake. They embrace, although Pam is hesitant at first, but passionately kisses Jim. A Bible reading from Jim's brother at their wedding plays in the background about love. They share a synchronized \"I love you\" as the episode comes to an end, repairing and mending the breaks in their past."}],"images":[]},{"title":"Cultural references","level":2,"content":[{"type":"list","elements":[{"text":"Weyerhammer Paper, the company sponsoring the paper airplane contest, is a fictional company that was presumably named after the real-life company Weyerhaeuser and the popular paper brand Hammermill.","elements":[]},{"text":"Dwight refers to the new paper as the \"Cadillac of paper\". The name Cadillac was once associated with luxury and quality. To say that something is the \"Cadillac of X\" means that it is the best X of all.","elements":[]},{"text":"Andy notes that if he is successful in his industrial film, he could potentially land a role in the movie Moneyballs 2, a sequel to the 2011 film Moneyball starring Brad Pitt.","elements":[]},{"text":"When told to act like he is doing a newscast, Andy does a Tom Brokaw impersonation.","elements":[]},{"text":"Andy also says that if necessary he will go nude for the role in a \"full Lena Dunham.\"","elements":[]},{"text":"Darryl tells Andy that he was in a production of The Wiz in high school.","elements":[]},{"text":"Kevin mistakes Orville and Wilbur Wright—the credited inventors of the airplane—for \"Wilbur and Orville Redenbacher\"—a brand of popcorn.","elements":[]},{"text":"In the last scene, when Jim and Pam resolve their differences, the cut-scene shows Jim's brother Tom reading 1 Corinthians 13:7–13 from the Christian Bible.","elements":[]}]}],"images":[]},{"title":"Connections to previous episodes","level":2,"content":[{"type":"list","elements":[{"text":"Near the end of the episode, when Pam and Jim are hugging, we see a flashback of Pam and Jim's wedding, where Jim's brother Tom is reading an excerpt from the Christian Bible, from the episode \"Niagara Part 2.\" Although we do not see the scene in the episode, we can assume it was in that episode.","elements":[]}]}],"images":[]},{"title":"Amusing details\/Trivia","level":2,"content":[{"type":"list","elements":[{"text":"The names of Angela's cats are Tinkie, Crinklepuss, Bandit Two, Pawlick Baggins and Lady Aragorn. She also has ten kittens.","elements":[]},{"text":"The official Office Andy Bernard \"GetGlue\" sticker was released alongside this episode.","elements":[]},{"text":"In the season 7 episode \"Christening\" Andy mentions that he will need contact lens solution and a contact lens case. If he wears contacts, spraying water into his eyes would likely cause issues with his contacts.","elements":[]},{"text":"In the cold open bracket, Stanley has his name x’ed out, implying that Stanley didn’t throw a paper airplane.","elements":[]},{"text":"Final 22-minute episode. All episodes after this one are longer than 22 minutes.","elements":[]}]}],"images":[]},{"title":"Cast","level":2,"content":[],"images":[]},{"title":"Main Cast","level":3,"content":[{"type":"list","elements":[{"text":"Rainn Wilson as Dwight Schrute","elements":[]},{"text":"John Krasinski as Jim Halpert","elements":[]},{"text":"Jenna Fischer as Pam Halpert","elements":[]},{"text":"Ed Helms as Andy Bernard","elements":[]}]}],"images":[]},{"title":"Supporting Cast","level":3,"content":[{"type":"list","elements":[{"text":"Catherine Tate as Nellie Bertram","elements":[]},{"text":"Leslie David Baker as Stanley Hudson","elements":[]},{"text":"Brian Baumgartner as Kevin Malone","elements":[]},{"text":"Creed Bratton as Creed Bratton","elements":[]},{"text":"Clark Duke as Clark Green","elements":[]},{"text":"Kate Flannery as Meredith Palmer","elements":[]},{"text":"Ellie Kemper as Erin Hannon","elements":[]},{"text":"Angela Kinsey as Angela Martin","elements":[]},{"text":"Jake Lacy as Pete Miller","elements":[]},{"text":"Paul Lieberstein as Toby Flenderson","elements":[]},{"text":"Oscar Nunez as Oscar Martinez","elements":[]},{"text":"Craig Robinson as Darryl Philbin","elements":[]},{"text":"Phyllis Smith as Phyllis Vance","elements":[]}]}],"images":[]},{"title":"Guest Cast","level":3,"content":[{"type":"list","elements":[{"text":"Roseanne Barr as Carla Fern","elements":[]},{"text":"Nora Kirkpatrick as Esther","elements":[]},{"text":"Mark Proksch as Nate","elements":[]},{"text":"Blake Robbins as Tom Halpert (archive footage)","elements":[]},{"text":"Bobby Ray Shafer as Bob Vance","elements":[]},{"text":"Joel Ryan Armamento as The Prop Man","elements":[]},{"text":"Todd Aaron Brotze as Robert from Weyerhammer Paper","elements":[]},{"text":"Kate Comer as The Photographer","elements":[]},{"text":"Peter A. Hulne as The HRPDC Executive","elements":[]},{"text":"John Phillips as The Director","elements":[]},{"text":"Steve Carell as Michael Scott (archive footage) (uncredited)","elements":[]}]}],"images":[]}]}