{"sections":[{"title":"Product Recall","level":1,"content":[{"type":"paragraph","text":"\"Product Recall\" is the twentieth episode of the third season of The Office and the 49th overall. It was written by Brent Forrester and Justin Spitzer and directed by Randall Einhorn. It first aired on April 26, 2007. It was viewed by 7.6 million people."}],"images":[]},{"title":"Synopsis","level":2,"content":[{"type":"paragraph","text":"Jim Halpert enters, dressed as Dwight Schrute. He explains that he accidentally found Dwight's glasses at a drug store for four dollars, and was unable to resist recreating the rest of Dwight's ensemble for a grand total of eleven dollars. Jim imitates Dwight's mannerisms and tone: \"Fact. Bears eat beets. Bears. Beets. Battlestar Galactica\" and Dwight starts to get upset: \"Identity theft is not a joke, Jim! Millions of families suffer every year!\" Jim screams \"Michael!\" and ran to his office. Dwight, very annoyed, did the exact same thing."},{"type":"paragraph","text":"Dunder Mifflin Scranton is thrown into damage control when some paper is released with an obscene watermark of a cartoon duck and mouse having sex. Michael addresses the media while Jim and Andy try to calm a school principal who used the affected paper to send out prom invitations. After arriving at the high school, Andy notices that his \"girlfriend\" is a student, and this ruins his day."},{"type":"paragraph","text":"Meanwhile, Kelly is entrusted with training the accountants, Oscar, Kevin, and Angela, to handle customer support calls. Angela is unable to sincerely apologize to customers for the company's mistake, while Oscar seems to handle the calls well and Kevin simply repeats his apology over and over again."},{"type":"paragraph","text":"Michael arranges for a customer to come to the office, so that he may apologize to her personally and present her with a novelty check for free paper. With the media present (a single reporter from the Scranton Times), Michael apologizes to the customer. However, she refuses his apology and asks for his resignation. Dwight attempts to defuse the situation by insisting that the cartoon sex appears consensual. Michael refuses to resign and angrily decides to give the check to someone else. He then decides to make an \"apology video,\" filmed by Pam, in which he reiterates the fact that the mistake was not his fault and that he has become an \"escape goat.\""},{"type":"paragraph","text":"Meanwhile, Creed, who as Quality Assurance failed to catch the error, maneuvers to ensure that he saves his own job (at the expense of an employee at the paper mill). He gets a farewell card for her and money from all the employees. On his way out, Creed pockets the money and tosses the card."},{"type":"paragraph","text":"Later, in the car, Jim cajoles Andy into singing \"The Lion Sleeps Tonight\" to cheer him up. In the closing, Dwight comes to work dressed as Jim and imitates him very poorly."}],"images":[{"src":"https:\/\/vignette.wikia.nocookie.net\/theoffice\/images\/4\/40\/Product_recall.jpg\/revision\/latest\/scale-to-width-down\/180?cb=20120820173845","caption":"The watermark."}]},{"title":"Deleted scenes","level":2,"content":[{"type":"list","elements":[{"text":"Ryan is forced to listen to Kelly repeat the same apology over and over again.","elements":[]},{"text":"Michael compares this crisis to an incident in which \"an aspirin company\" sold bottles with poison in it.","elements":[]},{"text":"Dwight calls CNN and tries to reach the Scranton bureau chief, a position which does not exist.","elements":[]},{"text":"Alternate takes of Kelly's training session.","elements":[]},{"text":"The Scranton Times reporter recognizes Creed, whose obituary he wrote, at which point Creed thanks him for what he considered a flattering portrayal. In a talking head interview, Creed explains that he faked his death ten years ago and is collecting life insurance benefits as his own widow.","elements":[]},{"text":"Andy reels from the realization that his girlfriend is a high school student.","elements":[]},{"text":"Andy describes how he and Jamie met. Jim, mindful of the cameras, tries to rephrase Andy's story in less incriminating terms but eventually gives up.","elements":[]},{"text":"Andy barges into Jamie's Spanish class.","elements":[]},{"text":"In a talking head interview, Michael compares dissatisfied clients to women.","elements":[]},{"text":"Additional footage from the press conference.","elements":[]},{"text":"In a talking head interview, Dwight explains that he doesn't believe in apologies.","elements":[]},{"text":"Angela's refusal to apologize to customers leads to a fight with Kelly.","elements":[]},{"text":"In a talking head interview, Kevin giggles uncontrollably at the thought of cartoon characters having sex.","elements":[]},{"text":"In a talking head interview, Michael explains that the customer is always right, but Ms. Allen was wrong.","elements":[]},{"text":"In a talking head interview, Pam discusses Michael's previous apology videos.","elements":[]},{"text":"Jim unsuccessfully tries to dissuade Andy from talking to Jamie in the courtyard. Jim tries making small talk with Jamie's friend.","elements":[]},{"text":"Creed successfully rebuts Debbie Brown's claim that she is being framed.","elements":[]},{"text":"Michael prepares for his apology video.","elements":[]},{"text":"Kelly and Angela reconcile, and Kelly excitedly declares them best friends. In separate talking head interviews, Kelly expresses satisfaction for having softened Angela's personality, and Angela says that she learned something from Kelly today, but her look to the camera shows that she was speaking sarcastically.","elements":[]},{"text":"Additional footage from Michael's apology video.","elements":[]},{"text":"Dwight announces that Debbie Brown has been fired and thanks Creed for his effort in tracking down the problem.","elements":[]}]}],"images":[]},{"title":"References to previous episodes","level":2,"content":[{"type":"list","elements":[{"text":"Michael calls the situation \"Threat Level: Midnight\", which is the name of his screenplay in The Client.","elements":[]},{"text":"Creed tells Dwight that Debbie Brown told him she had an emergency dentist appointment. In the episode The Fight Michael talks about friends who come to work late \"having dentist appointments that aren't dentist appointments.\" The following year, in the episode The Coup, Dwight tells Michael he has a dentist appointment so he can secretly meet with Jan.","elements":[]}]}],"images":[]},{"title":"Michael's cue cards","level":2,"content":[{"type":"list","elements":[{"text":"Card 1","elements":[]}]},{"type":"list","elements":[{"text":"Card 2","elements":[]}]},{"type":"list","elements":[{"text":"Card 3","elements":[]}]},{"type":"list","elements":[{"text":"Card 4 (seen on screen but not read)","elements":[]}]},{"type":"list","elements":[{"text":"Card 5 (only partly visible, text implied by Michael's reading)","elements":[]}]}],"images":[]},{"title":"Trivia","level":2,"content":[{"type":"list","elements":[{"text":"In the opening scene depicting everyone dealing with disgruntled customers the camera views numerous employees (Pam, Jim, Andy, Phyllis, Stanley and even Michael) on the phone busily talking to customers or someone else. Creed is then seen on the phone not talking and shiftily looking around the office, indicating that he was not really on the phone and only pretending to appear busy like everyone else (this despite the fact he was responsible for the entire crisis).","elements":[]},{"text":"The writing staff appear to have an odd relationship with the teen television show The Hills. In a deleted scene, Jim tries to make small talk by asking about the character Heidi. At Comic-Con 2008, during a writing panel session, the writers compared Jim and Pam to other television couples, and B.J. Novak jokingly compares them to Spencer and Heidi.","elements":[]},{"text":"In the cold open, Jim says he spent 4 dollars on glasses and 7 dollars on the rest of the outfit. Later in the episode, Angela tells Kevin that he didn’t know 4 + 7 on a payroll form. That money could have been from Jim’s spending.","elements":[]},{"text":"Though Jamie plays a high school student, her actress was 25 when this episode was aired. She and Ed Helms only have a 7-year age gap in real life.","elements":[]}]}],"images":[]},{"title":"Cultural references","level":2,"content":[{"type":"list","elements":[{"text":"A part of Jim's Dwight costume is a calculator watch. They were introduced in the mid-1970s and quickly became associated with nerds.","elements":[]},{"text":"Stat (short for statim =immediately) is medical jargon. Appended to a command, it means that the action should be performed immediately.","elements":[]},{"text":"The No Spin Zone is a segment of Bill O'Reilly's political television program The O'Reilly Factor which purports to cover the issues of the day without spin (bias).","elements":[]},{"text":"O.J. is a former NFL football player. O. J. Simpson and his murder trial captured the nation's attention during 1994 and 1995.","elements":[]},{"text":"Bridget Jones is the protagonist in a series of books by Helen Fielding. When the story begins, she is an unhappy single woman struggling to find love. Ice cream is a food stereotypically consumed by women in such situations.","elements":[]},{"text":"Dingo babies is a corruption of the Azaria Chamberlain disappearance in which dingoes in Australia were reported to have taken a baby.","elements":[]},{"text":"Michael announces that the press conference will be in 45. This is shorthand for in 45 minutes.","elements":[]},{"text":"The Washington Post is a major national newspaper published in Washington, DC.","elements":[]},{"text":"The Scranton Times-Tribune is a local Scranton newspaper.","elements":[]},{"text":"Dickson City and Carbondale are suburbs of Scranton.","elements":[]},{"text":"Tourette's is slang for Tourette Syndrome, a medical disorder characterized by motor tics and verbal grunting. In popular culture, it is depicted as a disorder in which victims swear uncontrollably; in reality, the shouting of obscenities is caused by a disorder called coprolalia, which is present only in a small minority of people with tourette's.","elements":[]},{"text":"The Better Business Bureau is an organization which helps to resolve disputes between consumers and its member companies.","elements":[]},{"text":"Newsweek is a national weekly news magazine. CNN is an international cable television news network.","elements":[]},{"text":"A SWAT team is a police unit specializing in operations with a high risk of violence such as hostage rescue or subduing heavily armed criminals.","elements":[]},{"text":"Kevin's exclamation Facial! is a variation of the victory taunt In your face!","elements":[]},{"text":"Michael says escape goat instead of scapegoat. Michael's Botched Phrases","elements":[]},{"text":"When Andy describes in a deleted scene how he met his girlfriend, he rattles off various illegal activities. He purchased wine coolers for them, even though alcoholic beverages cannot be sold to people under age 21. He \"threw in some scratch tickets\", sales of which is illegal to people under age 18. Finally, Andy talks about \"making out in the woods\", which although not strictly illegal, teeters close to statutory rape.","elements":[]},{"text":"Jim tries to make small talk with a high school student in a deleted scene by talking about Heidi, a cast member on the MTV scripted reality show The Hills. The student says that her dad gave her a Lexus, a brand of luxury car.","elements":[]},{"text":"Michael mentions a cartoon duck and a cartoon mouse; a possible reference to Mickey Mouse and Donald Duck.","elements":[]}]}],"images":[]},{"title":"Cast","level":2,"content":[],"images":[]},{"title":"Main Cast","level":3,"content":[{"type":"list","elements":[{"text":"Steve Carell as Michael Scott","elements":[]},{"text":"Rainn Wilson as Dwight Schrute","elements":[]},{"text":"John Krasinski as Jim Halpert","elements":[]},{"text":"Jenna Fischer as Pam Beesly","elements":[]},{"text":"B.J. Novak as Ryan Howard","elements":[]}]}],"images":[]},{"title":"Supporting Cast","level":3,"content":[{"type":"list","elements":[{"text":"Ed Helms as Andy Bernard","elements":[]},{"text":"Leslie David Baker as Stanley Hudson","elements":[]},{"text":"Brian Baumgartner as Kevin Malone","elements":[]},{"text":"Mindy Kaling as Kelly Kapoor","elements":[]},{"text":"Angela Kinsey as Angela Martin","elements":[]},{"text":"Paul Lieberstein as Toby Flenderson","elements":[]},{"text":"Oscar Nunez as Oscar Martinez","elements":[]},{"text":"Phyllis Smith as Phyllis Vance","elements":[]}]}],"images":[]},{"title":"Recurring Cast","level":3,"content":[{"type":"list","elements":[{"text":"Creed Bratton (actor) as Creed Bratton","elements":[]},{"text":"Rashida Jones as Karen Filippelli","elements":[]}]}],"images":[]},{"title":"Guest Cast","level":3,"content":[{"type":"list","elements":[{"text":"Lisa Darr as Barbara Allen","elements":[]},{"text":"Shira Scott Astrof as Jamie","elements":[]},{"text":"Anthony Russell as Chad Ligh","elements":[]},{"text":"Jim Jansen as The High School Principal","elements":[]}]}],"images":[]},{"title":"Quotes","level":2,"content":[{"type":"list","elements":[{"text":"Jim Halpert: Fact, bears eat beets. Bears, beets, Battlestar Galactica.","elements":[]}]}],"images":[]}]}