{"sections":[{"title":"Sabre","level":1,"content":[{"type":"paragraph","text":"For the company see: Sabre (company)"},{"type":"paragraph","text":"\"Sabre\" is the fifteenth episode of the sixth season and the 115th episode overall. It was written by Jennifer Celotta, who previously wrote The Promotion, Company Picnic, and The Duel. It was directed by John Krasinski who marked his directorial debut with the episode. It aired on February 4, 2010. Kathy Bates and Zach Woods guest star. It was viewed by 7.36 million people."}],"images":[]},{"title":"Plot","level":2,"content":[{"type":"paragraph","text":"The office gets a box of printer supplies from Sabre (pronounced 'Say-ber'). Michael thinks it is for him and distributes the items around the office. However, it is for Gabe Lewis, new director of sales (Jan Levinson, Ryan Howard and Charles Miner's former jobs). When Michael realizes this, he tries to put everything back in the box. Everyone works hard and they manage to pack it all away, however Michael accidentally leaves his cell phone in the box and they have to unpack it all again."},{"type":"paragraph","text":"Erin and Andy, assuming that Sabre is pronounced 'Saab-ray', sing a song for Gabe titled \"Dunder Mifflin Is A Part Of Sabre\" to the tune of Miley Cyrus's \"Party In The USA\". Gabe takes a video of the song, however, when 'Sabre' is repeatedly mispronounced, he shuts off his cell phone. Meanwhile, Andy and Erin continue to drop hints that they like each other with both oblivious to the other's advances."},{"type":"paragraph","text":"In the conference room, Gabe shows everyone a promotional video for Sabre, featuring Christian Slater. Michael and the rest of the office learn about Sabre's new policies. He is outraged that sites like YouTube and Twitter are blocked and that he will now be asked to drink out of a metal container rather than waste a huge amount of plastic cups. Gabe also pushes the idea that Sabre is primarily a printer company and that Dunder Mifflin will be a printer company which also sells paper."},{"type":"paragraph","text":"Michael asks Gabe to talk to someone higher up in the company. Gabe talks to CEO Jo Bennett, a stubborn no-nonsense boss who tells Michael to think hard about his future at Dunder Mifflin. It is clear she has no problem telling him off."},{"type":"paragraph","text":"Meanwhile, Pam and Jim try to get into a highly rated daycare center for their unborn baby. They arrive early for their interview and take the time to admire the facility. However, Jim walks into a children's bathroom to find a man sitting on the toilet and becomes embarrassed, before telling Pam about it. Jim and Pam have the meeting with Jerry, the daycare guy (who, it emerges, Jim had earlier walked in on the toilet). He doesn't seem to like Jim and Pam and tells them that they may not get in."},{"type":"paragraph","text":"Pam, finally, asks the guy if his problem is about Jim walking in on him in the bathroom, and Jerry awkwardly tries to defend himself. The meeting does not appear to end well."},{"type":"paragraph","text":"Michael visits a newly unemployed David Wallace, who is at home with his wife Rachel and their son. Their son plays drums loudly while David makes Michael a marshmallow fluff sandwich. David seems to have crashed, much like Jan Levinson after she was fired. David and Michael sit in the outdoor hot tub and Michael asks David how to deal with his problems with Sabre, however David is unable to come to Michael's rescue. They talk about David's future and David asks Michael if he would like to become involved with an idea called Suck It, a vacuum that sucks toys up."},{"type":"paragraph","text":"Michael shares with the documentary crew that he dislikes the new David and leaves."},{"type":"paragraph","text":"Back at Dunder Mifflin, Michael brings in some orange juice for the office to drink out of their containers. He then makes a speech saying he thinks the relationship with Sabre will be a successful one."}],"images":[{"src":"https:\/\/vignette.wikia.nocookie.net\/theoffice\/images\/0\/0b\/Sabredivision.png\/revision\/latest?cb=20100206021657","caption":""}]},{"title":"Amusing Details","level":2,"content":[{"type":"list","elements":[{"text":"The pizza Andy takes out of the refrigerator while looking for strawberries is Alfredo's Pizza, a pizza place mentioned in the episode Launch Party.","elements":[]},{"text":"When Michael brings in some orange juice to make a toast, his Sabre metal container is damaged. This is because he threw it out of his car window whilst driving away earlier in the episode.","elements":[]},{"text":"Stanley has a bunch of Hot Wheels on his desk.","elements":[]},{"text":"After contemplating for about 15 seconds, Dwight finally decides on putting the platter of hotdogs on the floor.","elements":[]},{"text":"When Erin and Andy sing \"Look to the right\", Erin looks to the left.","elements":[]},{"text":"As of this episode, Ed Helms is considered part of the main cast and is in the opening credits of the show along with B.J. Novak, Jenna Fischer, John Krasinski, Rainn Wilson, and Steve Carell.","elements":[]},{"text":"Sabre has its own website. It is full of misspellings and odd quips.","elements":[]},{"text":"Sabre has its own cafeteria.","elements":[]},{"text":"The daycare center is the fictional \"Sandbox Daycare.\"","elements":[]},{"text":"Gabe Lewis uses a MacBook Pro, a computer seen many times on the show as a product placement. Macs are seen at least three times in this episode: at the daycare, at David's house and with Gabe.","elements":[]},{"text":"Michael throws the Sabre thermos and hits Stanley's car, last seen in season opener Gossip. This is the second time that Stanley's car has been hit by an object - the first instance was when Dwight threw a watermelon from the rooftop in Safety Training.","elements":[]},{"text":"David Wallace stocks his refrigerator with beer.","elements":[]},{"text":"The beer that Michael and David drink in the hot tub is Yuengling beer, America's oldest brewery based in Pottsville, PA--- especially cool, as it wasn't distributed west of Ohio. Now it is also available in Tennessee.","elements":[]},{"text":"When David Wallace and Michael are in the hot tub, Rachel watches them closely from the window.","elements":[]},{"text":"Michael has always wanted everybody to be his friend. In this episode, he turns to David Wallace as a boss, but Wallace just wants to be his friend. Ironically, the one time he wants a boss, he gets a friend instead, and he doesn't like it.","elements":[]},{"text":"David Wallace offers Michael a stake in his \"Suck It\" concept, which Michael is non-committal about. In season 8's \"Fundraiser\", it's revealed Wallace made $20 million selling the \"Suck It\" patent to the US Military, meaning Michael missed out on what would likely have been a multi-million dollar opportunity.","elements":[]},{"text":"Despite Gabe saying that paper cups are terrible for the environment when giving out the metal bottles he can be seen drinking tea from a paper cup when Michael asks to speak with Jo.","elements":[]}]},{"type":"list","elements":[{"text":"The building depicted as Sabre's headquarters in the orientation video shown to Dunder Mifflin employees explaining \"Who is Sabre\" is commonly known as \"The Baxter Building\" (named after Baxter Healthcare, not affiliated with any comic universe) in Westlake Village, CA. This building was also featured in the movie Demolition Man.","elements":[]}]}],"images":[]},{"title":"Quotes","level":2,"content":[{"type":"paragraph","text":"For quotes see: Sabre Quotes"}],"images":[]},{"title":"Flashbacks","level":2,"content":[{"type":"list","elements":[{"text":"A scene from The Deposition was seen when Michael was explaining his relationship with David Wallace.","elements":[]},{"text":"When Erin talks about waiting for Andy to ask her out, a scene from Secret Santa was seen, showing Andy getting twelve drummers as part of his gift to Erin. Andy then mentions the scene.","elements":[]}]}],"images":[]},{"title":"Connections to previous episodes","level":2,"content":[{"type":"list","elements":[{"text":"Nick, a graphic design guy who now works for Dunder Mifflin as an IT guy met Pam in Season 4's Job Fair.","elements":[]},{"text":"Teddy Wallace, David Wallace's son was last seen in the Season 3 episode Cocktails, along with Rachel Wallace. The roles were not re-cast.","elements":[]},{"text":"YouTube may have been banned after Michael told Holly Flax that he spent five days watching Cookie Monster Sings Chocolate Rain on the popular website. This was revealed in Business Ethics.","elements":[]}]}],"images":[]},{"title":"Trivia","level":2,"content":[{"type":"list","elements":[{"text":"Dwight's presence in this episode was limited. Actor Rainn Wilson was available for only one day of shooting due to his participation in the movie Si.","elements":[]},{"text":"Michael's hair was so short because Steve Carell was shooting Dinner for Schmucks during the winter hiatus.","elements":[]},{"text":"Lyrics to the \"Sabre\" song:","elements":[]}]},{"type":"list","elements":[{"text":"The scissors in the scene where Michael and Erin pass the sharp utensils were made out of rubber.","elements":[]},{"text":"When Michael says, \"Suck B---,\" it was cut off because the writers thought that either the documentary or NBC would edit it out.","elements":[]}]}],"images":[]},{"title":"Cultural references","level":2,"content":[{"type":"list","elements":[{"text":"Erin joins Michael's chant, \"I got a big box,\" unaware that box is crude slang for vagina.","elements":[]},{"text":"Andy and Erin's \"Sabre\" song was a parody of Miley Cyrus' song \"Party in the USA\".","elements":[]},{"text":"YouTube is a hugely popular website where videos can be uploaded and watched by people.","elements":[]},{"text":"Twitter is a social networking site in which people can post things on walls in under 140 characters. It is used by many people including several crew members of the show.","elements":[]},{"text":"Climate change is a change in the weather and temperature on Earth and has scientists worried.","elements":[]},{"text":"David Wallace makes a Fluffernutter sandwich, a sandwich consisting of bread, peanut butter and marshmallow fluff.","elements":[]},{"text":"Jim asks the daycare administrator about Easter (a religious holiday) and Memorial Day (an American holiday).","elements":[]},{"text":"Michael calls orange juice the sweet nectar of Gabe's homeland. The Florida orange juice industry actively promotes orange juice made in their state.","elements":[]}]}],"images":[]},{"title":"Cast","level":2,"content":[],"images":[]},{"title":"Main cast","level":3,"content":[{"type":"list","elements":[{"text":"Steve Carell as Michael Scott","elements":[]},{"text":"Rainn Wilson as Dwight Schrute","elements":[]},{"text":"John Krasinski as Jim Halpert","elements":[]},{"text":"Jenna Fischer as Pam Halpert","elements":[]},{"text":"B.J. Novak as Ryan Howard","elements":[]},{"text":"Ed Helms as Andy Bernard","elements":[]}]}],"images":[]},{"title":"Supporting cast","level":3,"content":[{"type":"list","elements":[{"text":"Leslie David Baker as Stanley Hudson","elements":[]},{"text":"Brian Baumgartner as Kevin Malone","elements":[]},{"text":"Creed Bratton (actor) as Creed Bratton","elements":[]},{"text":"Kate Flannery as Meredith Palmer","elements":[]},{"text":"Mindy Kaling as Kelly Kapoor","elements":[]},{"text":"Ellie Kemper as Erin Hannon","elements":[]},{"text":"Angela Kinsey as Angela Martin","elements":[]},{"text":"Paul Lieberstein as Toby Flenderson","elements":[]},{"text":"Oscar Nunez as Oscar Martinez","elements":[]},{"text":"Phyllis Smith as Phyllis Vance","elements":[]}]}],"images":[]},{"title":"Special guest star","level":3,"content":[{"type":"list","elements":[{"text":"Kathy Bates as Jo Bennett","elements":[]}]}],"images":[]},{"title":"Recurring cast","level":3,"content":[{"type":"list","elements":[{"text":"Andy Buckley as David Wallace","elements":[]},{"text":"Zach Woods as Gabe Lewis","elements":[]},{"text":"Nelson Franklin as Nick","elements":[]}]}],"images":[]},{"title":"Guest cast","level":3,"content":[{"type":"list","elements":[{"text":"Owen Daniels as Teddy Wallace","elements":[]},{"text":"Jean Villepique as Rachel Wallace","elements":[]},{"text":"Joey Slotnick as Jerry the Daycare Center Director","elements":[]},{"text":"Christian Slater as himself (Uncredited)","elements":[]}]}],"images":[]},{"title":"References","level":2,"content":[{"type":"list","elements":[{"text":"↑ http:\/\/www.officetally.com\/the-office-sabre-qa","elements":[]},{"text":"↑ http:\/\/www.officetally.com\/the-office-sabre-qa\/3","elements":[]}]}],"images":[]}]}