{"sections":[{"title":"Safety Training","level":1,"content":[{"type":"paragraph","text":"\"Safety Training\" is the nineteenth episode of the third season of The Office and the 48th overall. It was written by B.J. Novak and directed by Harold Ramis. It first aired on April 12, 2007. It was viewed by 7.7 million people."}],"images":[]},{"title":"Synopsis","level":2,"content":[{"type":"paragraph","text":"Andy returns to the office after several weeks in anger management training, determined to make a fresh start with all the Dunder Mifflin employees. Meanwhile, it's safety training day in the office, and Michael and Dwight are on a mission to illuminate the true dangers of the workplace."},{"type":"paragraph","text":"Upon his return, Andy requests that the rest of the office refer to him as Drew. Dwight decides to shun Andy for three years. Michael takes the staff of the upper office into the warehouse to hear Darryl's presentation on warehouse safety. Darryl repeatedly reinforces that Michael is not allowed to operate the heavy machinery in the warehouse, and Michael only irritates the warehouse staff more by constantly interrupting Darryl, at which point, Lonnie insults Michael in front of everyone. In a talking head interview, Darryl reveals that he is on crutches because Michael pulled a ladder out from under him as a joke. The office and warehouse staff then head upstairs, where Toby reads office safety tips from a book as Michael frequently interrupts and insults him. Bored with the presentation and of Michael, the warehouse staff depart, and Michael and Darryl exchange words, with Darryl calling Michael's life and job completely safe like \"Nerf.\""},{"type":"paragraph","text":"Meanwhile, the entire office staff begins betting on various things, a trend started by Kevin, who is bored since March Madness has ended and he has nothing to bet on. On one bet, Jim, Kevin, Karen, and Oscar bet on how many jelly beans are in Pam's candy dish. Kevin loses to Jim and calls this unfair since Jim has spent \"hours\" standing at Pam's desk. A look of discomfort spreads across Karen's face when she hears this. Other bets include guessing how long Kelly can talk about Netflix (Ryan wins), how many times she says awesome (twelve times, Pam wins), how many romantic comedies she mentions (six times, Jim wins). The final bet is whether Creed will notice if someone switches his apple with a potato. Karen loses every bet and gets cleaned out."},{"type":"paragraph","text":"Offended by Darryl's comments, Michael decides to show them that working in an office is dangerous because the stress of office life can lead to depression and suicide. Michael plans to demonstrate the dangers of depression by jumping off the roof and secretly landing on a trampoline. However, when he and Dwight test the trampoline by tossing a watermelon, the watermelon bounces off, landing on Stanley's car, so they replace the trampoline with a bouncy castle. Dwight calls the office and warehouse staff to the parking lot, where they see Michael standing on the roof, talking about the dangers of depression. Initially, they do not take Michael seriously, but then they find the bouncy castle and realize that Michael is actually planning to jump, which will probably injure him badly. Darryl talks Michael out of his fake \"suicide attempt\", by convincing him that he is braver than Darryl."},{"type":"paragraph","text":"At the end of the day, Stanley is shocked when he sees his car covered in watermelon from Michael's test."}],"images":[]},{"title":"Deleted scenes","level":2,"content":[{"type":"list","elements":[{"text":"After seeing An Inconvenient Truth \"nearly twice\", Andy trades in his Nissan X-Terra for a Toyota Prius","elements":[]},{"text":"Office workers insult the cookies Andy made.","elements":[]},{"text":"Andy tries to remain calm when Kevin takes the last of the coffee.","elements":[]},{"text":"Angela keys Andy's new car.","elements":[]},{"text":"Michael summons the office staff to safety training.","elements":[]},{"text":"Kelly tells Ryan he would \"look so hot\" if he worked out, which he responds to by saying \"Yeah, we should both work out.\" Kelly says to Ryan, \"Screw you!\"","elements":[]},{"text":"Extension of Michael and Dwight in the hallway discussing how they should respond.","elements":[]},{"text":"In a talking head interview, Michael shows how safety training can be funny by talking like Borat, however, his impression of Borat is a poor one.","elements":[]},{"text":"Dwight helps Michael calculate his trajectory from the roof onto the trampoline.","elements":[]},{"text":"Karen loses a bet to Stanley over how often Bob Vance calls Phyllis - in a talking head, Stanley says that, while his co-workers had always annoyed him, he never realized he could make money off their behavior, and encourages Vance to call Phyllis any time he wants.","elements":[]},{"text":"Several members of the office staff take turns trying to talk Michael down from the roof. Kevin, who is still hoping to collect on his 10,000:1 wager that Michael would jump, says this shows you should always take such a gamble because you never know what's going to happen, adding that, should John Mellencamp ever win an Oscar, his personal finances will take a significant turn for the better.","elements":[]},{"text":"Michael explains how upper middle management is more dangerous than working in a coal mine.","elements":[]},{"text":"Andy sees his keyed car.","elements":[]}]}],"images":[]},{"title":"Trivia","level":2,"content":[{"type":"list","elements":[{"text":"References or similarities to previous episodes:","elements":[{"text":"When Pam apologizes for calling Andy \"Andy,\" rather than his newly preferred nickname, \"Drew,\" he tells her that the apology is not accepted, because it was not necessary. In \"The Negotiation\", Dwight tells Jim that his gratitude is not accepted because it is similarly not necessary.","elements":[]},{"text":"Michael claims that safety training day is going to be \"zoppity.\" In the previous episode, Darryl teaches Michael a \"black man phrase\" that is \"pippity poppity give me the zoppity.\"","elements":[]}]},{"text":"According to the DVD commentary, Greg Daniels thought of the scene where Jim and Pam try to talk Michael down from the roof as if Jim and Pam were a divorced couple, speaking in code to their child (Michael) which makes the new wife (Karen) feel \"left out\".","elements":[]},{"text":"Rainn Wilson came up with the \"unshun\/reshun\" hand gesture.","elements":[]},{"text":"Even though Darryl says that they've never gotten through a full year without an accident, in Boys and Girls, it is shown that the warehouse hasn't had an accident in more than 936 days (far longer than a year) before Michael's shenanigans with the forklift.","elements":[]},{"text":"Kelly mentions the 2003 romantic comedy Love Actually, a film in which the UK Office star Martin Freeman is featured in.","elements":[]},{"text":"Michael's quote, \"Dwight, you ignorant slut!\" is a reference to the 1978 SNL skit \"Point\/Counterpoint\" where Dan Akroyd calls Jane Curtin the same name.","elements":[]}]}],"images":[]},{"title":"In the background","level":2,"content":[{"type":"list","elements":[{"text":"On Creed's desk (visible when he eats the potato) is a binder labeled Academy of Tobacco Studies, which is the fictitious tobacco lobby group in the movie Thank You for Smoking which was directed by Jason Reitman, the son of Harold Ramis' frequent collaborator, Ivan Reitman. Jason Reitman (director of Thank You For Smoking and Juno) would later direct the season four episode \"Local Ad\".","elements":[]}]},{"type":"list","elements":[{"text":"The binders on the shelf by Andy's desk have silly labels: Cheap Stuff from China, Cheaper Crud from Korea, Competition Sabatoge, etc.  One of the binders also says Property of MCA on the bottom of it.  MCA, Inc.'s non-music assets were aquired by NBC Universal in the early 2000s.","elements":[]}]}],"images":[]},{"title":"Cultural references","level":2,"content":[{"type":"list","elements":[{"text":"Anger management is a psychotherapy technique which helps a person control their anger.","elements":[]},{"text":"The grumpies is a slang term for the state of being grumpy.","elements":[]},{"text":"Shunning (social avoidance) is a form of punishment exercised by many groups, including the Amish.","elements":[]},{"text":"How's it hangin'? is slang for a greeting.","elements":[]},{"text":"X-er? I hardly know her? is a lewd joke pattern using a word ending in \"-er\" and reinterpreting the suffix as an elision of \"her\". Michael's choice of X is not particularly funny, but that doesn't stop him from joking about it anyway.","elements":[]},{"text":"March Madness is the common nickname for the NCAA Men's Division I Basketball Championship, an annual basketball tournament which takes place in March to determine the best college basketball team in the United States. It is the subject of widespread sports gambling, even among people otherwise not interested in basketball.","elements":[]},{"text":"Nerf is a brand of toys made from soft foam. Darryl's \"shenanigans\" remarks consist mostly of invented insults.","elements":[]},{"text":"Men's Wearhouse is a chain of men's business clothing stores.","elements":[]},{"text":"A big-box store is a warehouse-sized store which sells large items (or small items in large quantities).","elements":[]},{"text":"Borat is a character portrayed by comedian Sacha Baron Cohen. He is a journalist from Kazakhstan whose humor derives from his violation of social norms and expression of distasteful opinions. Appending Not! to a sentence in a thick accent is one of Borat's catchphrases. (Appending Not! was a catchphrase from the 1980s.)","elements":[]},{"text":"Netflix is an online movie rental service.","elements":[]},{"text":"On his late night program, television host David Letterman would regularly throw objects off a five-story building.","elements":[]},{"text":"Bingo! is an exclamation of success, usually associated with hitting a target either literally or metaphorically (such as guessing a correct answer).","elements":[]},{"text":"Watermelons were often used in racist caricatures of African Americans. This explains Michael's desire to defend himself against accusations of committing a hate crime.","elements":[]},{"text":"A bouncy castle (also known as a moon bounce) is an inflatable structure designed for children to bounce around in.","elements":[]},{"text":"Jane, you ignorant slut! was a catchphrase from the Weekend Update segment of sketch comedy program Saturday Night Live. Michael directs the insult at Dwight.","elements":[]},{"text":"John Mellencamp is a rock singer-songwriter.","elements":[]},{"text":"The Repliee Q1Expo is a lifelike female android.","elements":[]},{"text":"Braveheart is an Academy-award-winning historical epic.","elements":[]}]}],"images":[]},{"title":"Cast","level":2,"content":[],"images":[]},{"title":"Main Cast","level":3,"content":[{"type":"list","elements":[{"text":"Steve Carell as Michael Scott","elements":[]},{"text":"Rainn Wilson as Dwight Schrute","elements":[]},{"text":"John Krasinski as Jim Halpert","elements":[]},{"text":"Jenna Fischer as Pam Beesly","elements":[]},{"text":"B.J. Novak as Ryan Howard","elements":[]}]}],"images":[]},{"title":"Supporting Cast","level":3,"content":[{"type":"list","elements":[{"text":"Ed Helms as Andy Bernard","elements":[]},{"text":"Leslie David Baker as Stanley Hudson","elements":[]},{"text":"Brian Baumgartner as Kevin Malone","elements":[]},{"text":"Kate Flannery as Meredith Palmer","elements":[]},{"text":"Mindy Kaling as Kelly Kapoor","elements":[]},{"text":"Angela Kinsey as Angela Martin","elements":[]},{"text":"Paul Lieberstein as Toby Flenderson","elements":[]},{"text":"Oscar Nunez as Oscar Martinez","elements":[]},{"text":"Phyllis Smith as Phyllis Vance","elements":[]}]}],"images":[]},{"title":"Recurring Cast","level":3,"content":[{"type":"list","elements":[{"text":"Craig Robinson as Darryl Philbin","elements":[]},{"text":"Rashida Jones as Karen Filippelli","elements":[]},{"text":"Creed Bratton (actor) as Creed Bratton","elements":[]},{"text":"Patrice O'Neal as Lonnie Collins","elements":[]},{"text":"Karly Rothenberg as Madge","elements":[]},{"text":"Calvin Tenner as Glenn  (Uncredited)","elements":[]},{"text":"Philip Pickard as Philip (Uncredited)","elements":[]}]}],"images":[]}]}