{"sections":[{"title":"Secretary's Day","level":1,"content":[{"type":"paragraph","text":"\"Secretary's Day\" is the twenty-second episode of the sixth season and the 122nd episode of The Office overall. It was written by Mindy Kaling and directed by Steve Carell. It aired on April 22, 2010. It was viewed by 6.30 million people."}],"images":[]},{"title":"Synopsis","level":2,"content":[{"type":"paragraph","text":"It's Secretary's Day, and Andy tries to make Erin's special holiday a memorable one. He convinces a reluctant Michael to take her to lunch to a place of her choosing. While they are out, Michael accidentally reveals to Erin that Andy used to date, and was engaged to, fellow office worker Angela. However, Andy has not yet revealed this fact to Erin. She becomes visually disturbed, but tries to keep it in as best she can. Back at the office, during the main party, Andy begins to serenade her and she hurls a piece of cake at his face. She angrily reveals that she knows about Angela and Andy's relationship from Michael, and begins to accuse the other women in the office of sleeping with Andy. Despite numerous attempts from fellow office workers to help console and calm her, Erin ultimately decides to take some time away from Andy. At the end of the day, Andy looks on as it is Michael who makes her happy on Secretary's Day."},{"type":"paragraph","text":"Meanwhile, Oscar circulates a video he made, which compares Kevin's voice to Cookie Monster's. Kevin finds it offensive rather than funny, and complains to Gabe about the video. In an effort to assert his authority, Gabe bans the office from talking about the video and about Cookie Monster. However, this doesn't stop Pam and Jim from sharing a laugh, while Kevin is at Erin's desk. In retaliation, Gabe suspends Pam without pay for contradicting his orders, then Jim for defending her, and eventually (and ironically) Dwight for applauding Gabe's actions. It all comes apart when Gabe calls corporate and finds out he has virtually no power. He returns to the office to try to undo the damage and make everyone forget about the incident, but Toby tips off Pam about the mistake. Pam and Jim team up and reverse the situation, getting a \"two day paid vacation,\" while Dwight apologizes and kisses Gabe's hand instead. After Jim and Pam leave, he decides to save face and mock Kevin as well (\"I WANT COOKIES\"), but does a poor impression. Kevin finally retaliates by doing an impression of Gabe, and the rest of the office joins in on mocking Gabe as he leaves the room humiliated."},{"type":"paragraph","text":"At the end of the episode, Kevin tries to get Oscar back by making his own parody video by using Oscar's voice and comparing him to The Count. However, everyone finds it in poor taste, but Michael ends up finding it funny, probably just because he thought that everybody else did."}],"images":[]},{"title":"Deleted scenes","level":2,"content":[{"type":"list","elements":[{"text":"In her desk, Pam discovers fruit flies on a forgotten cupcake and maggots which Dwight was harvesting.","elements":[]},{"text":"Michael explains that his plan was to give Erin $15. That is what he did every Secretary's Day with Pam, since Pam always requested the cash equivalent of lunch.","elements":[]},{"text":"In a talking head with Erin, she shares her excitement and her admiration for Michael. She says that he's even more awesome than Sully Sullenberger.","elements":[]},{"text":"Ryan consoles Erin in an attempt to get her to join him and Kelly in a threesome, a goal Ryan shared with the documentary crew in The Mentor: BFFs?. For more information, see Ryan-Erin Relationship.","elements":[]},{"text":"Pam, Jim, and Dwight ask Toby to check whether Gabe has the authority to suspend them. Toby reluctantly agrees.","elements":[]}]}],"images":[]},{"title":"Amusing Details","level":2,"content":[{"type":"list","elements":[{"text":"Writer Mindy Kaling explains Erin's Secretary's Day gifts:","elements":[{"text":"Ryan gives her a box of chocolates.","elements":[]},{"text":"Creed gives her a Beanie Baby teddy bear, presumably stolen from a local gas station.","elements":[]},{"text":"Meredith gives her a $5 Amazon gift certificate.","elements":[]},{"text":"Dwight gives her a crate of beets, with reminder emails to \"make sure to return the crate as soon as possible.\"","elements":[]}]},{"text":"Ryan, continuing to explore with fashion, wears an untied bow-tie. Ever since Ryan has become 'sober', his fashion sense has become more and more 'hipster'-esque.","elements":[]},{"text":"Angela is once again head of the Party Planning Committee, a development which is not explained.","elements":[]},{"text":"This is again another time an exact date is mentioned, because Secretary's Day (or Administrative Professional's Day), which would be on the last Wednesday of April every year, which would be April 21st in 2010, the day before the episode aired. This would also mean Andy and Erin started dating around April 1st.","elements":[]},{"text":"Michael gets angry that the resturaunt only gives him five or six pickles for his burger, which is already way too many for a burger.","elements":[]},{"text":"Michael takes Erin to lunch even though in \"Cafe Disco\" he says there is a strict no lunch with the boss policy at Dunder Mifflin-Sabre.","elements":[]},{"text":"Kevin thinks the word suspension begins with the letter C.","elements":[]}]}],"images":[]},{"title":"Connections to previous episodes","level":2,"content":[{"type":"list","elements":[{"text":"Kevin wishes Darryl a happy bird-day, a callback to The Alliance.","elements":[]},{"text":"The first time we saw Pam's plant alive was in Michael Scott Paper Company .","elements":[]}]}],"images":[]},{"title":"Goofs","level":2,"content":[{"type":"list","elements":[{"text":"Andy's suit shows no trace of cake stains at the end of the episode.","elements":[]},{"text":"Michael is reluctant to go to lunch with Erin, obviously getting very annoyed, not wanting to be there and not liking her very much. This is odd, considering at the end of the episode Scott's Tots, Michael says he has a good feeling about her, and the two seem to start the positive \"father-daughter type\" relationship that continues throughout the series.","elements":[]},{"text":"Kevin tells Erin that if he had been engaged that he would have told her, however Kevin was engaged to Stacy up until Season 5. (Not necessarily a goof - Seeing as Kevin is meant to have told Erin, if the two of them were dating, he would have told her about Stacy.)","elements":[]},{"text":"When Angela and Erin are at Reception, talking about Angela's past with Andy, Toby suddenly appears and laments that his fax isn't going through. He wasn't there when Angela walked over and it doesn't seem like there's time for him to sneak in and fail to send a fax between cuts. However, the lack of awareness of Toby's presence by the characters and audience does play on the idea of his blandness and forgetability.","elements":[]},{"text":"Andy says, \"If it wasn't for secretaries, I wouldn't have a stepmom,\" but in a previous episode states that his parents are married.","elements":[]}]}],"images":[]},{"title":"Cultural References","level":2,"content":[{"type":"list","elements":[{"text":"Secretary's Day (more generally Administrative Professionals' Day) is a day which recognizes the efforts of secretaries, receptionists, assistants, and similar professionals.","elements":[]},{"text":"Sesame Street is an award-winning children's television program. It is set on an urban street with a variety of human and Muppet residents.","elements":[{"text":"Dwight identifies it as a show set in the barrio, a derogatory term for a lower-class Hispanic neighborhood. Many of the characters on Sesame Street are bilingual in English and Spanish.","elements":[]},{"text":"Cookie Monster is a character with a gravelly voice. He is known for his craving for cookies (which he eats with the sound om nom nom) and his signature song \"C is for Cookie\". Cookie Monster habitually substitutes the word \"me\" for \"I\", as in the sentence \"Me eat cookie\" used in the episode.","elements":[]},{"text":"The Count is a vampire who loves to count.","elements":[]},{"text":"Oscar the Grouch is a character who lives in a trash can and enjoys complaining and being unhappy.","elements":[]}]},{"text":"Girl Scout cookies have been sold by Girl Scouts (an organization for girls) as a fundraiser since 1917.","elements":[]},{"text":"Chimichanga, chalupa and tostada are different types of Mexican foods.","elements":[]},{"text":"Kevin asks that Oscar call him back ASAP, short for as soon as possible.","elements":[]},{"text":"Ryan asks Oscar to CC me. CC originally stood for carbon copy and refers to someone other than the addressee who receives a message.","elements":[]},{"text":"Hayworth's is a fictitious restaurant in Scranton.","elements":[]},{"text":"M&M's are a popular candy, Kevin's favorite.","elements":[]},{"text":"Precious: Based on the Novel \"Push\" by Sapphire (usually shortened to Precious) is a 2009 movie which won two Academy Awards in 2010.","elements":[]},{"text":"Taco Bell is a chain of fast-food restaurants serving Mexican-style food. Taco Bell Express is a version of Taco Bell with a more limited menu.","elements":[]},{"text":"At the restaurant, Michael announces, \"I'll have what she's having,\" the punch line to the deli scene in the movie When Harry Met Sally, another scene in which a character creates a disturbance in a restaurant.","elements":[]},{"text":"Cadillac is a brand of luxury cars. It is common to describe something as \"the Cadillac of X\" to mean that it is the most luxurious X in the world.","elements":[]},{"text":"Mrs. Fields is a national chain of stores which sell freshly-baked cookies and other snacks.","elements":[]},{"text":"Gabe suggests that people leave the impressions to the pros at MADtv, a sketch comedy show which ran from 1995 to 2009.","elements":[]},{"text":"Mr. & Mrs. Smith is a romantic, action, comedy film about a couple who learn that they are secret agents hired by competing agencies to kill each other.","elements":[]},{"text":"Cooper's Seafood is a seafood restaurant in Scranton, frequently referenced by the show.","elements":[]},{"text":"Andy's song, \"Secretary of Love,\" is a play on Lou Reed's \"Satellite of Love.\"","elements":[]}]}],"images":[]},{"title":"Cast","level":2,"content":[],"images":[]},{"title":"Main Cast","level":3,"content":[{"type":"list","elements":[{"text":"Steve Carell as Michael Scott","elements":[]},{"text":"Rainn Wilson as Dwight Schrute","elements":[]},{"text":"John Krasinski as Jim Halpert","elements":[]},{"text":"Jenna Fischer as Pam Halpert","elements":[]},{"text":"B.J. Novak as Ryan Howard","elements":[]},{"text":"Ed Helms as Andy Bernard","elements":[]}]}],"images":[]},{"title":"Supporting Cast","level":3,"content":[{"type":"list","elements":[{"text":"Leslie David Baker as Stanley Hudson","elements":[]},{"text":"Brian Baumgartner as Kevin Malone","elements":[]},{"text":"Creed Bratton (actor) as Creed Bratton","elements":[]},{"text":"Kate Flannery as Meredith Palmer","elements":[]},{"text":"Mindy Kaling as Kelly Kapoor","elements":[]},{"text":"Ellie Kemper as Erin Hannon","elements":[]},{"text":"Angela Kinsey as Angela Martin","elements":[]},{"text":"Paul Lieberstein as Toby Flenderson","elements":[]},{"text":"Oscar Nunez as Oscar Martinez","elements":[]},{"text":"Craig Robinson as Darryl Philbin","elements":[]},{"text":"Phyllis Smith as Phyllis Vance","elements":[]}]}],"images":[]},{"title":"Recurring Cast","level":3,"content":[{"type":"list","elements":[{"text":"Zach Woods as Gabe Lewis","elements":[]}]}],"images":[]},{"title":"Guest Cast","level":3,"content":[{"type":"list","elements":[{"text":"Aaron Shure as Waiter (uncredited)","elements":[]}]}],"images":[]},{"title":"References","level":2,"content":[{"type":"list","elements":[{"text":"↑ Secretary's Day Q&A with Mindy Kaling, Office Tally","elements":[]}]}],"images":[]}]}