{"sections":[{"title":"Shareholder Meeting","level":1,"content":[{"type":"paragraph","text":"\"Shareholder Meeting\" is the eleventh episode of the sixth season of The Office and the show's 111th episode overall. It was written by Justin Spitzer who wrote Michael Scott Paper Company and Moroccan Christmas and directed by Charles McDougall who directed Conflict Resolution and Christmas Party. It originally aired on November 19, 2009. It was viewed by 7.43 million people."}],"images":[]},{"title":"Synopsis","level":2,"content":[{"type":"paragraph","text":"When invited to be honored at the Dunder Mifflin shareholders meeting in New York by CFO David Wallace, Michael is enthusiastic and prepares to present himself in a fashionable manner. When Michael is informed that a limo was sent by corporate, Michael believes it was a town car sent to pick him up, only to find out it was indeed a limo. Michael is exalted, as well as the rest of the staff, and decides to bring Andy, Oscar, and Dwight along to the meeting with him. On the way, the group enjoy their time in the limo until reaching New York. Michael meets up with Wallace and several members of corporate, and is then escorted to prepare for the conference. Meanwhile, Andy and Oscar are finding a seat for the conference, only Oscar criticizes corporate's decision on spending money on the meeting. Andy reacts by telling Oscar to express his opinions, only to have Oscar berate him for endangering his job. While Andy and Oscar are discussing what was to be done, Dwight waits in a severely long line to ask a question, only to run into trouble with the people waiting."},{"type":"paragraph","text":"As the meeting commences, the audience jeers and heckles each member coming onto the stage, with Michael uncomfortable with the situation. After strongly condemned by the audience and starting of a break, Michael counters the company's critics by explaining a 45 day plan is on the way to resolve the crisis, only to make matters more difficult. Unable to figure out how to resolve the crisis, Michael invites Oscar to join the representatives, only to be embarrassed in front of the members. After Chris O'Keefe, former U.S. Congressman and board member of Dunder Mifflin, insults Michael, he counters the comments made by demanding more praise and insulting O'Keefe. Michael, alarmed when O'Keefe angrily states he and his colleagues can take the bus, then makes a run for the limo with Andy, Oscar and Dwight and immediately heads back to Scranton. The camera then focuses on Dunder Mifflin's stock on a ticker tape which has dropped severely. It is later revealed that Dwight was up and able to speak at the microphone in the line, only to criticize about how the line for the microphone was slow and unproductive; this ends up confusing the entire audience and makes the CEO impatient with Dwight."},{"type":"paragraph","text":"Meanwhile, Jim, being placed in charge during Michael's absence, is frustrated with Ryan and his incompetence to work in the office. Jim also becomes further annoyed when Ryan spreads rumors that Jim is \"not manager type like Michael\" and is teased by the other employees. Meeting with Pam, Jim decides to make an example out of Ryan, only to be discouraged from yelling at Ryan by Pam. Jim, when catching Ryan playing games, has everyone pay attention and relocates Ryan to a broom closet, furnished with a desk and computer. Ryan, embarrassed, attempts to apologize and ends up with the door shutting behind him with everyone watching."}],"images":[]},{"title":"Trivia","level":2,"content":[{"type":"list","elements":[{"text":"The environmental theme in the cold open was part of a \"green week\" promotion by NBC. NBC ran a similar promotion in 2007, resulting in the episode Survivor Man.","elements":[]},{"text":"David sends a limo and calls it a towncar because in Business Trip, David sends a van and calls it a towncar, much to Michael's upset.","elements":[]},{"text":"A deleted scene shows Oscar receiving a text message from Michael to come to the hospitality suite. This proves this episode occurred on Tuesday, November 17, 2009.","elements":[]},{"text":"One of the shareholders was ex-NBA Champ Alonzo Mourning.","elements":[]},{"text":"Each of the previous secretaries that served at Dunder Mifflin Scranton have a minor guest role in the cold open.","elements":[{"text":"Pam, 1st appearance (5 years~so about November of 2004)","elements":[]},{"text":"Ryan, happening sometime before Weight Loss (November of 2005)","elements":[]},{"text":"Ronni, happening between Weight Loss and Business Ethics (November of 2006)","elements":[]},{"text":"Pam again, presumably as it doesn't show the receptionist.","elements":[]}]},{"text":"Michael refers to the shareholder meeting in this episode when he is negotiating the buyout of Michael Scott Paper Company. He tells David that if he doesn't budge, the Scranton branch will continue to bleed until the shareholders eventually oust him at the upcoming shareholder meeting.","elements":[]},{"text":"The new waste processing plant that Alan Brand announces gets noticeably more applause than Michael's recognition does.","elements":[]},{"text":"When Ryan and Jim are talking in the annex, Kelly's desk has multiple gift bags on top.","elements":[]}]}],"images":[]},{"title":"Goofs","level":2,"content":[{"type":"list","elements":[{"text":"When the group leaves the shareholder meeting in the limo, all four are seen inside. Yet in the outro where Dwight asks a question and Andy is shown in the crowd, the space to David Wallace's left (where Michael was sitting, and his name tag is shown) is empty. Since outros are generally implied to have happened after the episode (and 'Q&A' sessions generally happen at the end of meetings), Dwight and Andy would have to have returned after the limo left. Note also that the people behind Dwight are different than when he is shown in-line earlier in the episode.","elements":[]},{"text":"Obviously, the outside shots were not of New York City.","elements":[]},{"text":"Continuity: when Oscar checks the Dunder Mifflin (DMI) stock price on his computer, it is trading at $0.27, up $0.01. After the shareholder meeting, they pass a sign that says the stock price is $1.13, down $6–7\/8.","elements":[]},{"text":"When Ryan is playing Tetris, each shot of his computer monitor shows a different position of blocks in the game.","elements":[]}]}],"images":[]},{"title":"Cultural References","level":2,"content":[{"type":"list","elements":[{"text":"Recyclops is an invented portmanteau of recycling and Cyclops. Dwight created the character for Earth Day, celebrated on April 22 in the United States.","elements":[]},{"text":"The whole enchilada is slang for the whole thing. Michael, naturally, uses it when talking with Oscar.","elements":[]},{"text":"Jim asks Ryan to transfer information from a Rolodex (a device for business contact information) to Outlook, a computer program for information management.","elements":[]},{"text":"Andy suggests Dwight ask Michael a softball question (a very easy question) that he can hit out of the park (have overwhelming success with).","elements":[]},{"text":"Michael addresses the former Senator as your eminence, an honorific usually reserved for Catholic archbishops or cardinals.","elements":[]},{"text":"Michael asks the bodyguards whether they have guarded Madonna (a singer) or the Obama twins. President Barack Obama has two daughters, but they are not twins. Michael has confused them with the twin daughters of former president George W. Bush. The bodyguard admits to having protected Canadian singer Nelly Furtado.","elements":[]},{"text":"Dwight mentions the holiday Erntedankfest, the German name for Thanksgiving.","elements":[]},{"text":"Dunder Mifflin has a waste processing plant in Milford. There are many towns named Milford, but the best-known one is in Connecticut.","elements":[]},{"text":"There does not appear to be a restaurant named Capello's in the Scranton area.","elements":[]},{"text":"Oscar dismisses the shareholder questions as bush league, slang for low in quality. The term comes from professional baseball.","elements":[]},{"text":"Andy organized a protest over the SATs, a standardized test for college admissions in the United States. Andy's score of 1220 puts him in approximately the 80th percentile nationally, but in the bottom quarter of the students at Cornell.","elements":[]},{"text":"Michael promises the crowd that Dunder Mifflin will become carbon neutral, an environmental position that became popular in 2007.","elements":[]}]}],"images":[]},{"title":"Cast","level":2,"content":[],"images":[]},{"title":"Main cast","level":3,"content":[{"type":"list","elements":[{"text":"Steve Carell as Michael Scott","elements":[]},{"text":"Rainn Wilson as Dwight Schrute","elements":[]},{"text":"John Krasinski as Jim Halpert","elements":[]},{"text":"Jenna Fischer as Pam Halpert","elements":[]},{"text":"B.J. Novak as Ryan Howard","elements":[]}]}],"images":[]},{"title":"Supporting cast","level":3,"content":[{"type":"list","elements":[{"text":"Ed Helms as Andy Bernard","elements":[]},{"text":"Leslie David Baker as Stanley Hudson","elements":[]},{"text":"Brian Baumgartner as Kevin Malone","elements":[]},{"text":"Creed Bratton (actor) as Creed Bratton","elements":[]},{"text":"Kate Flannery as Meredith Palmer","elements":[]},{"text":"Mindy Kaling as Kelly Kapoor","elements":[]},{"text":"Ellie Kemper as Erin Hannon","elements":[]},{"text":"Angela Kinsey as Angela Martin","elements":[]},{"text":"Oscar Nunez as Oscar Martinez","elements":[]},{"text":"Phyllis Smith as Phyllis Vance","elements":[]}]}],"images":[]},{"title":"Recurring cast","level":3,"content":[{"type":"list","elements":[{"text":"Andy Buckley as David Wallace","elements":[]}]}],"images":[]},{"title":"Guest cast","level":3,"content":[{"type":"list","elements":[{"text":"Dale Raoul as Ronni","elements":[]},{"text":"Alan Fudge as Alan Brand","elements":[]},{"text":"Chris Ellis as Chris O'Keefe","elements":[]},{"text":"Amy Cale Peterson as Laurie","elements":[]},{"text":"Gregory A. Schmauss as Angry Shareholder","elements":[]}]}],"images":[]}]}