{"sections":[{"title":"St. Patrick's Day","level":1,"content":[{"type":"paragraph","text":"\"St. Patrick's Day\" is the nineteenth episode of the sixth season and the 119th episode overall. It was written by Jonathan Hughes, who wrote \"The Office: Subtle Sexuality,\" and directed by Randall Einhorn who directed \"Golden Ticket\" and \"Blood Drive\". It aired on March 11, 2010. Kathy Bates guest stars. It was viewed by 7.51 million people."}],"images":[]},{"title":"Summary","level":2,"content":[{"type":"paragraph","text":"It's St. Patrick's Day in Scranton and everyone in the office is thrilled, since it is one of the biggest holidays in Scranton. Meredith left her kids somewhere, while everyone looks forward to go to the parade. Everyone dresses up in green, and many things across the office are green as well."},{"type":"paragraph","text":"Jim is welcomed back by the rest of the office from paternity leave, but comes back to see Dwight using three desks to make up a huge \"megadesk,\" which Jim takes apart. Dwight is extremely angry that his megadesk is getting destroyed. Later, Dwight sets up megadesk again, to the dismay of Jim, who takes it apart on seeing it. Jim and Pam talk about Cecilia, and Jim is sad that he is missing it. Dwight tries to get him to go back home so that he can have megadesk and tries to convince him that Cecilia is finding the world without him and that Mose was scarred without his father. Although Jim realizes what Dwight is doing, he realizes that he is missing her and Pam."},{"type":"paragraph","text":"Dwight starts to play \"Cat's in the Cradle\" loudly to show Jim that he is missing fatherhood. Jim calls Pam and decides to keep working for the meantime, but he is surprised that Dwight's plan is working. Dwight continues to try to get Jim to leave."},{"type":"paragraph","text":"Jo Bennett comes back to the office and is thrilled to see everyone in team spirit for St. Patrick's Day. It is her last day at Dunder Mifflin Scranton for awhile, and she says that the people at the branch are lovely. Michael comes to talk to Jo and gives her a gift. She thanks him and offers him a room at her house in Tallahassee, which he takes very seriously. Jo holds an office meeting and asks if anyone has any ideas relating to the business. Michael bothers Jo by telling her about everyone who asks her a question and tries to get her to like him. Darryl tells Jo about how Sabre's delivery system isn't efficient, and he catches her eye. Jo accepts Darryl's plan and offers Darryl Jim's old office. Gabe tells her that he is working there, but scared of Jo, tells her that it's okay and he will go clean it out immediately."},{"type":"paragraph","text":"Michael hugs Jo and tells her he bought tickets and planned a trip. Jo is surprised, and says that he should check with her office. When Michael continues to bother her, she snaps and tells Michael, \"enough,\" leaving the office surprised. Michael is sad that Jo still doesn't like him despite his attempts. Michael asks Jo out to lunch, and she tells him to do some work. Michael asks Darryl why Jo likes him and asks him if her family owes him something. Michael says that he is going home for the day, and Jo says that he can go if he believes that he did a great day of work, but she decides to stay to work. Michael tells everyone not to leave because Jo wants them to stay until they did superb work, and Michael is trying to get Jo to like him. Kevin is outraged."},{"type":"paragraph","text":"Dwight tries to bail out early by claiming to have a late meeting with a client, but Jim gets in ahead of him. Erin lucks out and sneezes, causing a sympathetic Jo to urge her to go home and get some rest. When Andy, who's wearing his sister's field hockey skirt as a kilt, pretends to be sick so he can visit Erin, Jo sends him home, too, telling him to put some pants on. Michael calls an inebriated Todd Packer who's been drinking since three and complains that the girls are fat and ugly. Calvin and the rest of the warehouse workers come to ask Darryl to come back, but he refuses. The cleaning crew comes to the office, but can't do anything since Jo and everyone else is still there. While Angela wants to leave so she can protest St. Patrick's Day, Gabe helps get Jo's bags and explains that he has no time for a personal life because Jo is very demanding. Michael enters the conference room, explains to Jo that it's a holiday and he is dismissing his hard-working employees so they can enjoy their evening. He also lets her know that he's cancelled his Florida trip, but is looking forward to their working relationship. She is looking forward to it, as well."},{"type":"paragraph","text":"Todd Packer and Michael enjoy the St. Patrick's Day party at Cooper's. Michael says that he rather be with people he likes than Jo. Todd Packer is humped by a drunken Meredith."},{"type":"paragraph","text":"Erin and Andy are going on their first date, despite Erin being sick. Angela is disgusted by her being sick, while Jo sends her home, because she doesn't want her dogs to catch a bug. Andy decides to pretend to be sick in front of Jo, who sends him home. Andy comes to Erin's house, even though she is sick. Andy and Erin hold hands and watch a movie. It is revealed that Erin was a foster child and lives with her foster brother, who seems to have an interest in her. Andy realizes this and becomes threatened by the thought that someone else likes Erin."},{"type":"paragraph","text":"Andy leaves the date, and Erin kisses him on the cheek. Jim sets up a \"Quad-Desk\" with three desks, and Dwight is angry."}],"images":[{"src":"https:\/\/vignette.wikia.nocookie.net\/theoffice\/images\/f\/f8\/Kevinst.patrick%27sday.jpg\/revision\/latest\/scale-to-width-down\/220?cb=20100313041425","caption":"Kevin is outraged."},{"src":"https:\/\/vignette.wikia.nocookie.net\/theoffice\/images\/1\/10\/Joandmichael.jpg\/revision\/latest\/scale-to-width-down\/180?cb=20100314055642","caption":"Michael starts to bother Jo."},{"src":"https:\/\/vignette.wikia.nocookie.net\/theoffice\/images\/e\/e6\/Erinandandyandreedst.patrick%27sday.jpg\/revision\/latest\/scale-to-width-down\/200?cb=20100313041455","caption":"Andy has an \"interesting\" first date."}]},{"title":"Deleted Scenes","level":2,"content":[{"type":"list","elements":[{"text":"Michael explains to Oscar that he is leaving for Tallahassee, and Michael tells Oscar that they are close. Oscar says that Jo is very friendly, but doesn't always mean what she says. Jo then comes up and tells them that they are both skinny and good-looking.","elements":[]}]}],"images":[]},{"title":"Trivia","level":2,"content":[{"type":"list","elements":[{"text":"This episode was supposed to air on March 18th, however, it moved up because \"The Delivery\" became an hour-long rather than a two-parter and \"New Leads\" was put as the March 18th episode. The producers wanted the Scranton St. Patrick's Day parade to be filmed, however, since the date was brought up, this was impossible. This fact is more supplemented as Jo wasn't seen in the two parter.","elements":[]},{"text":"The music that the office cleaners are listening to when they enter the office is Yarilo, by the Pagan Metal band Arkona (Аркона in Russian).","elements":[]},{"text":"First appearance of Todd Packer since Season 3.","elements":[]}]}],"images":[]},{"title":"Errors","level":2,"content":[{"type":"list","elements":[{"text":"Andy says that his kilt is his sister's old field hockey skirt; however, Andy does not have a sister. He could've lied about it being his sister's to avoid admitting he owned a skirt himself.","elements":[]}]},{"type":"list","elements":[{"text":"At the end of the episode, when Dwight sees Jim using \"Quad-desk\", a tiny chair appears. In the first shot of the encounter, there is no chair in front of Dwight's desk setup underneath Quad-desk. However when Dwight's phone rings, Dwight crouches down to answer his phone and places his briefcase on a tiny chair that was not originally in the frame.","elements":[]}]}],"images":[]},{"title":"Amusing details","level":2,"content":[{"type":"list","elements":[{"text":"The water tank near Stanley's desk is green, not blue.","elements":[]},{"text":"Even the exit sign (normally red) is green.","elements":[]},{"text":"Michael, Jim, and (possibly) Andy all have Scottish roots. Michael explained that he was Scottish and \"2\/15\" Native American. . Jim's dad was seen wearing a kilt at his wedding. . Andy was seen wearing a kilt, possibly for St. Patrick's Day or for Scottish roots.","elements":[]},{"text":"Angela's mask has her name on it in red.","elements":[]},{"text":"Michael likes to tell new bosses about Oscar's homosexuality. Michael tells Charles Miner that Oscar broke up with a man and never brought it into work , while he tells Jo that Oscar is a \"homosexual accountant\".","elements":[]},{"text":"Michael's desk flag is Italian.","elements":[]},{"text":"Gabe laments that because of his schedule he has to go to Amsterdam seven times a year, presumably for sex with a prostitute. ","elements":[]},{"text":"Oscar is sitting next to Matt at the bar.","elements":[]}]}],"images":[]},{"title":"Cultural References","level":2,"content":[{"type":"list","elements":[{"text":"St. Patrick's Day is an annual holiday on March 17th that celebrates Saint Patrick. Over time, it has turned from a religious holiday to a holiday to celebrate Irish culture. Symbols of the holiday include shamrocks, corned beef and cabbage, and the color green. (Even the beer is colored green.) Ireland is predominantly Catholic, and they do celebrate Christmas, despite Michael's remarks to the contrary.","elements":[]},{"text":"Andy wears a kilt, an skirt-like article of clothing for men. While more closely associated with Scottish culture, the kilt also has a place in Irish culture. (However, Irish kilts are solid colors.)","elements":[]},{"text":"Michael calls green M&M's candies \"nature's Viagra.\" Viagra is the brand name for a drug to treat erectile dysfunction, and according to folklore, green M&Ms are an aphrodisiac.","elements":[]},{"text":"Dwight calls Jim and Pam Tweedle Dee and Tweedle Dumbass, referring to the characters Tweedledum and Tweedledee from the children's story Through the Looking-Glass.","elements":[]},{"text":"Andy greets Erin by saying \"Erin Go Bragh\", an Irish phrase which means \"Ireland Forever\". The phrase is associated with St. Patrick's Day. Erin doesn't understand this and responds, \"Andy go Bragh.\"","elements":[]},{"text":"Dwight disputes the statement that No man is an island, a phrase famously used by writer John Donne in Devotions upon Emergent Occasions.","elements":[]},{"text":"Michael reveals information in the spirit of \"fool disclosure\", misstating the phrase \"full disclosure.\"","elements":[]},{"text":"Dwight taunts Jim by listening to (and singing along to) the song Cat's in the Cradle, a song about a father who is too busy to spend time with his son.","elements":[]},{"text":"How I Met Your Mother is a television show told in flashback form in which the main character describes to his children the events leading up to meeting his future wife.","elements":[]},{"text":"Todd Packer tells Michael that he booted (vomited) and rallied (resumed drinking) twice.","elements":[]},{"text":"Bobby McFerrin is an American musician (not an Irish poet) best known for his song Don't Worry, Be Happy.","elements":[]},{"text":"Jo misunderstands Michael's gift to mean that she's been naughty. According to American culture, good kids get presents from Santa Claus while naughty kids get a lump of coal.","elements":[]},{"text":"Jo is wearing Dolce & Gabbana glasses.","elements":[]}]}],"images":[]},{"title":"Connections to Previous Episodes","level":2,"content":[{"type":"list","elements":[{"text":"Dwight also enjoys other games. He used Second Life to replicate his real life.","elements":[]},{"text":"Jo Bennett's great danes were last seen in \"Manager and Salesman.\"","elements":[]},{"text":"The cleaning crew has changed since \"Chair Model,\" when the cleaning crew was a group of only Spanish speaking ladies, who Oscar talked to.","elements":[]},{"text":"Meredith and Packer also had a bit of a relationship in other parties, especially when they are drunk.","elements":[]}]}],"images":[]},{"title":"Quotes","level":2,"content":[{"type":"paragraph","text":"For quotes see: St. Patrick's Day Quotes."}],"images":[]},{"title":"Cast","level":2,"content":[],"images":[]},{"title":"Main Cast","level":3,"content":[{"type":"list","elements":[{"text":"Steve Carell as Michael Scott","elements":[]},{"text":"Rainn Wilson as Dwight Schrute","elements":[]},{"text":"John Krasinski as Jim Halpert","elements":[]},{"text":"Jenna Fischer as Pam Halpert","elements":[]},{"text":"B.J. Novak as Ryan Howard","elements":[]},{"text":"Ed Helms as Andy Bernard","elements":[]}]}],"images":[]},{"title":"Supporting Cast","level":3,"content":[{"type":"list","elements":[{"text":"Leslie David Baker as Stanley Hudson","elements":[]},{"text":"Brian Baumgartner as Kevin Malone","elements":[]},{"text":"Creed Bratton (actor) as Creed Bratton","elements":[]},{"text":"Kate Flannery as Meredith Palmer","elements":[]},{"text":"Mindy Kaling as Kelly Kapoor","elements":[]},{"text":"Ellie Kemper as Erin Hannon","elements":[]},{"text":"Angela Kinsey as Angela Martin","elements":[]},{"text":"Oscar Nunez as Oscar Martinez","elements":[]},{"text":"Craig Robinson as Darryl Philbin","elements":[]},{"text":"Phyllis Smith as Phyllis Vance","elements":[]}]}],"images":[]},{"title":"Special Guest Star","level":3,"content":[{"type":"list","elements":[{"text":"Kathy Bates as Jo Bennett","elements":[]}]}],"images":[]},{"title":"Recurring Cast","level":3,"content":[{"type":"list","elements":[{"text":"Zach Woods as Gabe Lewis","elements":[]},{"text":"David Koechner as Todd Packer","elements":[]},{"text":"Calvin Tenner as Calvin","elements":[]},{"text":"Sam Daly as Matt","elements":[]}]}],"images":[]},{"title":"Guest Cast","level":3,"content":[{"type":"list","elements":[{"text":"Sean Davis as Reed","elements":[]},{"text":"Boris Kievsky as the Cleaner","elements":[]}]}],"images":[]}]}