{"sections":[{"title":"Suit Warehouse","level":1,"content":[{"type":"paragraph","text":"\"Suit Warehouse\" is the eleventh episode of the ninth season of the American television comedy series The Office and is the show's 187th episode overall. It was written by Dan Greaney and directed by Matt Sohn. It aired on January 17, 2013."}],"images":[]},{"title":"Synopsis","level":2,"content":[{"type":"paragraph","text":"Dwight receives an instant message from David Wallace telling him that Stone & Son just lost their paper provider. Dwight decides to call Jim in to help him. He reflects on all the good times he and Jim had pretending to be brothers in order to better appeal to family-owned businesses. However, Jim is unable to help as he is in Philadelphia. Jim suggests that Dwight take Phyllis to pretend to be his sister, but Dwight refuses citing Phyllis as more likely to play his \"great great grandmother who died of stupidity\" to which Phyllis remarks that she heard that. Dwight tells Jim that if he drove 240 mph he could make it to Scranton in 30 minutes. Jim then asks how long it would take if he drove 300 mph and proceeds to hang up while Dwight is calculating it. Dwight is embarrassed and pretends to finish his conversation by thanking Jim for saying he is better than him. He accidentally says \"love you\" at the end and everyone looks at him. Dwight hangs up, clearly embarrassed."},{"type":"paragraph","text":"Darryl is going to Philadelphia to interview for a position at Jim's company. When Pam tells him to tell Jim \"hi\", Darryl suggests that she come along. Pam realizes that there would be no consequences of her leaving work as Andy is not around. On the way out, she tells Erin to receive a pen delivery that she was expecting. Erin becomes worried as she is not sure what to do when the pens arrive."},{"type":"paragraph","text":"Clark returns to his job after a trip to Italy with Jan. He leaves a gift from her, an espresso machine, on the reception desk before heading back to the annex. The office staff become interested in it and all decide to try it."},{"type":"paragraph","text":"Dwight goes back to the annex and welcomes Clark back before offering him the chance to play his son at the sales pitch. Clark agrees as he is interested in one day being a salesman."},{"type":"paragraph","text":"During the drive to Philadelphia, Darryl admits to Pam he is nervous about the interview because he had Andy's job in the bag until he blew his interview. When Darryl and Pam arrive at Jim's company, Darryl becomes nervous when he sees what a prosperous and serious business it is."},{"type":"paragraph","text":"Dwight and Clark arrive at Stone & Son Suit Warehouse and pretend to be father and son, but they overdo it by making a constant and exceedingly inappropriate series of comments."},{"type":"paragraph","text":"The office staff all begin to try the multiple flavors of espresso and realize that there are so many flavors to try. They all decide to try each one. They all stand in a circle, put their hand in the center and agree to try them all."},{"type":"paragraph","text":"While Clark is out of the room for a moment, the father reveals to Dwight that he and his son really don't have a very good relationship causing Dwight to realize he has to pretend that he and Clark also have that relationship. When Clark returns, he begins to criticize Clark and tries to argue, but Clark doesn't understand. He finally gets it and they begin to argue."},{"type":"paragraph","text":"The people back at the office soon begin to try many of the different espresso flavors and soon become very caffeinated and energized. Erin begins to worry as she is not sure whether to unpack the pens or not."},{"type":"paragraph","text":"During the interview, Darryl makes a bad joke and is not sure how to answer the question of why he would be a good fit for the company. Darryl apologizes and admits he is a warehouse manager and is not qualified to work at the company. However, the people interviewing him admit that they all had jobs that do not relate to their current jobs at all, including Jim. Darryl feels better and they all decide to start the interview over, this time, Darryl making a better joke."},{"type":"paragraph","text":"As Dwight and Clark continue to insult one another, the client's son comes in. It is revealed that he is the boss and that his father mainly is in the job for the human companionship. With the son now being the one to decide whether to buy from them or not, Clark takes the lead. He makes a joke about Dwight's suit, but Clark does not have one himself. He convinces Dwight to buy him a suit, which Dwight approves of and decides to buy one himself."},{"type":"paragraph","text":"Pam talks to the receptionist and is happy when the receptionist says that Jim talks about her all the time. However, Pam becomes worried when the receptionist makes a comment about them moving to Philadelphia."},{"type":"paragraph","text":"The office staff, being very energized, become very productive. They decide to use their energy to move the copier to the annex like they always wanted to do, but as they do so, they accidentally tear up the carpet. Oscar notices that the floor beneath the carpet is hardwood and they decide to tear up the rest of the carpet."},{"type":"paragraph","text":"Darryl does very well in the interview, but he decides to make an interesting move and shoot a basketball into a basketball hoop on one of the walls. He shoots it and it bounces off the rim and slams into the light fixture on a fish tank causing it to fall in and electrocute the fish, killing them all, much to the horror of everyone in the room and Darryl."},{"type":"paragraph","text":"As everyone works, they all begin to get angry and yell at each other. Stanley notices that it's 5 p.m. and they all attempt to leave at the same time leading to a traffic jam in the parking lot."},{"type":"paragraph","text":"Darryl waits with Pam near the receptionist desk looking horrified. Pam tries to make Darryl feel better but does not succeed. She tries to remind Darryl that Philadelphia is not the greatest city on earth, and that he would only be able to see his daughter on weekends. Darryl realizes that this is true and that he still has a great job in Scranton. He becomes confident he can live without the job. Jim comes out of the room and tells Darryl they will make him pay for the fish and that he has gotten the job. Darryl becomes excited and hugs Jim and picks him up, but Pam looks worried, still not sure about wanting to move to Philadelphia."},{"type":"paragraph","text":"Dwight and Clark leave with their new suits, having made the sale. Dwight realizes that he and Clark form a good team."},{"type":"paragraph","text":"Darryl and Pam arrive back at the office to find it messy with patches of the carpet torn up. As Erin comes out of the annex she tells Pam that \"the pens happened\" before leaving. Darryl and Pam look around the office confused."}],"images":[]},{"title":"Deleted scenes","level":2,"content":[{"type":"list","elements":[{"text":"After making incestuous remarks, Dwight and Clark pretend to have sex with office supplies.","elements":[]}]}],"images":[]},{"title":"Cultural references","level":2,"content":[{"type":"list","elements":[{"text":"Dwight says \"The boys are back in town!\" to Clark following the sale at the suit warehouse. The line is from a song of the same name by the Irish rock band, Thin Lizzy.","elements":[]},{"text":"Oscar screams \"YOLO\", and explains it means \"You Only Live Once\". Kevin comments that Oscar doesn't sound cool saying it. ","elements":[]},{"text":"When joking about how Clark \"cups his hands under the cat's tail\", Dwight's voice replicates that of Oliver from Oliver Twist, and says, \"Please, kitty, may I have some more?\" which is a direct reference to the movie. ","elements":[]}]}],"images":[]},{"title":"Connections to Previous Episodes","level":2,"content":[{"type":"list","elements":[{"text":"Darryl is worried about the interview, as he talks about doing poorly in his interview for manager in Search Committee.","elements":[]},{"text":"Oscar is happy when they tear the carpet and see the hardwood flooring that he discovered when Dwight shot a hole in the carpet in the episode Dwight K. Schrute, (Acting) Manager.","elements":[]},{"text":"Meredith is wearing a wig after having shaved her head in the previous episode.","elements":[]}]}],"images":[]},{"title":"Amusing details\/Trivia","level":2,"content":[{"type":"list","elements":[{"text":"The Phyllis Vance \"Get Glue\" sticker was released alongside the episode.","elements":[]}]}],"images":[]},{"title":"Goofs","level":2,"content":[{"type":"list","elements":[{"text":"When on the phone with Jim, Dwight tells him to \"drive on down\" to Scranton from Philadelphia. However, Scranton is north of Philadelphia.","elements":[]},{"text":"Darryl says, \"Y'all ready for this?\" then proceeds to sing a different song.","elements":[]},{"text":"In a talking head Erin says she's never had an espresso before but in Cafe Disco she accepts an espresso from Michael and is even seen bringing it back to her desk in the following scene.","elements":[]}]}],"images":[]},{"title":"Cast","level":2,"content":[],"images":[]},{"title":"Main Cast","level":3,"content":[{"type":"list","elements":[{"text":"Rainn Wilson as Dwight Schrute","elements":[]},{"text":"John Krasinski as Jim Halpert","elements":[]},{"text":"Jenna Fischer as Pam Halpert","elements":[]},{"text":"Ed Helms as Andy Bernard","elements":[]}]}],"images":[]},{"title":"Supporting Cast","level":3,"content":[{"type":"list","elements":[{"text":"Catherine Tate as Nellie Bertram","elements":[]},{"text":"Leslie David Baker as Stanley Hudson","elements":[]},{"text":"Brian Baumgartner as Kevin Malone","elements":[]},{"text":"Creed Bratton as Creed Bratton","elements":[]},{"text":"Clark Duke as Clark Green","elements":[]},{"text":"Kate Flannery as Meredith Palmer","elements":[]},{"text":"Ellie Kemper as Erin Hannon","elements":[]},{"text":"Angela Kinsey as Angela Lipton","elements":[]},{"text":"Jake Lacy as Pete Miller","elements":[]},{"text":"Oscar Nunez as Oscar Martinez","elements":[]},{"text":"Craig Robinson as Darryl Philbin","elements":[]},{"text":"Phyllis Smith as Phyllis Vance","elements":[]}]}],"images":[]},{"title":"Guest Cast","level":3,"content":[{"type":"list","elements":[{"text":"Ed Lauter as Sam Stone, Sr.","elements":[]},{"text":"Will Greenberg as Sam Stone, Jr.","elements":[]},{"text":"Rene Gube as Athlead Male Receptionist","elements":[]},{"text":"Analeis Loring as Athlead Employee","elements":[]},{"text":"Adam Lustick as Athlead Employee","elements":[]},{"text":"Ross Mackenzie as Dennis","elements":[]},{"text":"Sam Richardson as Colin, Athlead Employee","elements":[]},{"text":"Ben Silverman as Isaac","elements":[]}]}],"images":[]}]}