{"sections":[{"title":"The Return","level":1,"content":[{"type":"paragraph","text":"\"The Return\" (also referred to as \"Oscar's Return\") is the thirteenth episode of the third season of The Office and the 42nd overall. It was written by Lee Eisenberg, Michael Schur, and Gene Stupnitsky and directed by Greg Daniels. It first aired on January 18, 2007. It was viewed by 10.2 million people."}],"images":[]},{"title":"Summary","level":2,"content":[{"type":"paragraph","text":"Dwight attends job interviews, including one where he offers his prospective employer a three-volume résumé; one packet represents his professional career, the second, his athletic history, and the last, Dwight Schrute trivia. At another, describing himself in \"three words\", Dwight offers: \"Hardworking. Alpha male. Jackhammer. Merciless. Insatiable...\" Dwight settles for a job at Staples to earn money while he continues his job search. Dwight alienates his coworker who has never heard of Dunder-Mifflin."},{"type":"paragraph","text":"Andy is obnoxiously testing the last nerve of his coworkers, including Michael, who is growing weary of Andy's incessant badgering and brown-nosing. He has relocated to Dwight's former desk where he severely irritates Jim and Ryan, whom he attempts to nickname \"Big Turkey.\" Andy casts an invisible fishing line in a pantomimed attempt to hook Jim (the \"Big Tuna\") and calls his own cell phone in order to demonstrate his new \"Rockin' Robin\" ringtone. Andy explains he recorded himself singing all four parts of harmony. He also repeatedly sings one portion of The Cranberries song \"Zombie.\" Despite his earlier claims of a cappella singing experience, his pitch goes flat."},{"type":"paragraph","text":"Oscar returns from his paid vacation, and Kevin asks him how he enjoyed his \"gay-cation.\" Oscar takes the joke in good humor and chuckles. This pleases Kevin, who admits he devised the joke shortly after Oscar left and had been waiting weeks for the opportunity to use it. Angela pensively invites Oscar to join the party planning committee. At first, he is offended, believing she is ridiculing him since the committee consists only of women. However, Angela respectfully continues to ask, apologizing for the way that \"certain events\" transpired. She breaks into tears explaining how she \"would just like to make some changes about certain things and certain situations and certain accountants...\" Oscar quickly accepts, reassuring her."},{"type":"paragraph","text":"Michael welcomes Oscar by asking the party planning committee to have a Mexican-themed fiesta celebrating his return, offending Oscar in the process. The committee outfits the office with numerous piñatas and Ryan uses a marker to change the spelling on the bottle of lemonade to read \"Lemoñadé.\""},{"type":"paragraph","text":"Jim tries to enlist Karen's help in pulling a prank on Andy, but she is busy with the influx of clients inherited upon Dwight's departure, stating that Dwight's files are password-protected with the names of different mythical creatures. Ryan also gruffly refuses to join in the high jinks to Jim's dismay. Finally, Jim approaches Pam, who readily agrees. In a carefully choreographed plan, Jim steals Andy's cell phone and leaves it with Pam. Later, Pam hands it back to Jim as he heads for the kitchen and stands guard as Jim pushes up a ceiling tile and launches the phone through the empty space to its final resting place, atop a tile roughly above Andy's desk. Karen briefly notices the actions of the two. The pair trade calls to Andy's phone, frustrating him to the point of accusing Phyllis of the theft, who ignores him."},{"type":"paragraph","text":"Andy, still happy that Dwight is gone, continues sucking up to Michael. Due to Andy's pursuit of \"face time\" with his boss, Michael begins avoiding him, stating that Andy is \"annoying the bejesus\" out of him, even walking with him to the bathroom."},{"type":"paragraph","text":"Angela reveals to Michael that the reason Dwight visited the corporate office was to deliver her tax documents, noting that no other employee — Andy in particular — would have done so. Andy offers to hang out with Michael, but Michael declines, requesting that Andy stop his annoying behavior. Michael's rejection of Andy's offered friendship, combined with Pam and Jim's prank, pushes Andy over the edge. He punches a hole in a wall, shocking his co-workers and quickly prompting a petrified Jim to hang up the phone. Michael leaves the office to try to get Dwight back."},{"type":"paragraph","text":"Michael finds Dwight working at Staples and admits to him that he was wrong, telling Dwight that if he would go out of his way for a \"random coworker\" like Angela, he had misjudged him from the beginning. Michael apologizes and asks Dwight to return to the office. Dwight accepts Michael's apology, asks not to do Michael's laundry anymore (Michael is non-committal), and returns to the office in a daze, finding his coworkers celebrating Oscar's welcome back party, which he presumes is being held for him."},{"type":"paragraph","text":"At the party, Karen observes Pam and Jim laughing together about the prank. She confronts Jim, asking him if he still has feelings for Pam. After several seconds of silence, Jim nods and answers \"Yes.\" Karen stands up and walks out, visibly upset."},{"type":"paragraph","text":"Dwight is handed a broom and blindfold to break open a piñata. Declining the blindfold, he knocks the piñata to the ground and begins pummeling it into shards. He triumphantly continues throughout the office, decimating the decorative piñatas hung from the ceiling as he goes. Andy sulks and watches Dwight's antics from the kitchen. Michael states that he prefers being sucked up to for reasons of love rather than career advancement."}],"images":[]},{"title":"Deleted scenes","level":2,"content":[{"type":"paragraph","text":"The Season Three DVD contains deleted scenes beyond those included in the Producer's Cut. Notable cut scenes include:"},{"type":"list","elements":[{"text":"Oscar and Toby make awkward small talk.","elements":[]},{"text":"Extension of the phone-throwing scene.","elements":[]},{"text":"Michael learns that Dwight turned down payment for his unused three months of vacation days. \"He'd rather the company have the money.\"","elements":[]},{"text":"Andy makes up a new nickname for Michael.","elements":[]},{"text":"Dwight is promoted to management ahead of schedule.","elements":[]},{"text":"Kevin is amused by the word \"ass.\"","elements":[]},{"text":"Kevin hums the Mexican Hat Dance.","elements":[]},{"text":"Karen feels left out because she doesn't see what's funny about Andy punching a hole in the wall.","elements":[]}]}],"images":[]},{"title":"Trivia","level":2,"content":[{"type":"list","elements":[{"text":"The man who interviews Dwight is Kevin Reilly, at the time the president of NBC Entertainment. Reilly was a strong supporter of The Office in its early days despite low ratings.","elements":[]},{"text":"The woman who interviews Dwight initially had no name in the script. Writer Michael Schur made up the name Gwendolyn Trundlebed as a placeholder and thought nothing of it. The set designers saw the name and decorated her office in the style seen in the episode, assuming that Schur was trying to convey a message with that unusual name.","elements":[]},{"text":"Andy's plans for hanging out with Michael include watching the television program Lost (which was on hiatus at the time) and the Cornell-Hofstra game (even though the college football season had already ended).","elements":[]},{"text":"Dwight wears a Battlestar Galactica sweatshirt upon his return to the office. When he left Staples, he was wearing a plain white t-shirt. It is not explained where the shirt came from. (The shirt could have been in Dwight's car). Michael also wears the same sweatshirt later on in season four's \"Survivor Man\" after he cuts up his own suit and Dwight saves him from eating mushrooms.","elements":[]},{"text":"According to Greg Daniels, the Battlestar Galactica sweatshirt was created by the wardrobe department because such shirts were not yet available at the time the episode was filmed.","elements":[]},{"text":"After the episode aired, a memo was circulated at the real Staples that read, \"Effective immediately, and to the relief of many, Dwight Schrute is no longer a Staples associate... Despite his promising start in business machines (selling 2 printers in one morning), it was soon clear he wasn't a good fit with the Staples culture.\"","elements":[]},{"text":"One of Dwight's coworkers at Staples is played by Yvette Nicole Brown, who would later go on to star in the NBC show Community.","elements":[]}]}],"images":[]},{"title":"Analysis","level":2,"content":[{"type":"list","elements":[{"text":"Jim remarks, \"I liked you better when you were the Temp,\" to which Ryan quietly replies, \"Me too.\" Some viewers interpret this to be a reference to Ryan's previous remarks that he did not want to remain with the company. Others consider it a meta-humorous remark by the writers, lamenting that Novak's character was more affable and had more screen time before he was promoted.","elements":[]}]}],"images":[]},{"title":"Amusing details","level":2,"content":[{"type":"list","elements":[{"text":"Andy has the Dunder Mifflin logo on his cell phone. His efforts to suck up to Michael have no bounds.","elements":[]},{"text":"The anger management company is named \"Calm Visions\".","elements":[]},{"text":"Marcy, the trainer at the anger management company, smokes. Some people smoke as a way to calm their nerves.","elements":[]},{"text":"When Michael finds Dwight in Staples an instrumental version of \"Up Where We Belong\" is being played in the background. Richard Gere reunites with his lover to the same song at her workplace in An Officer and a Gentleman.","elements":[]},{"text":"At one point Andy begins singing the song \"Zombie\" by The Cranberries. It is possible that ‘Zombie’ was one of the mythical creature passwords that Dwight used to encrypt his sales folders.","elements":[]},{"text":"Andy calls Ryan \"big turkey\", just like he calls Jim \"big tuna\" because he ate a tuna sandwich on his first day in Stamford.","elements":[]},{"text":"When Michael and Pam are talking about the plant that is suddenly not doing very well, the plant on the wall between accounting and reception is also dying.","elements":[]},{"text":"Dwight goes out of his way to help customers at Staples, knowing that big market chains lack in customer service.","elements":[]},{"text":"This is Jim's third prank on Andy that has resulted in him having a meltdown (Putting his calculator in Jello, pretending to not know he went to Cornell, hiding his phone and calling it repeatedly).","elements":[]},{"text":"Michael compliments the \"German engineering\" of Oscar's new car. The car is a Lexus RX, manufactured by Japanese automaker Toyota.","elements":[]}]}],"images":[]},{"title":"Connections to Previous Episodes","level":2,"content":[{"type":"list","elements":[{"text":"When Oscar asks what happened to Dwight, Creed says that he was decapitated and that the whole office had a funeral for a bird. Jim says that he doesn't believe it, and Creed gets angry. In fact, Creed describes what happened during Grief Counseling, although it was Ed Truck who was decapitated, not Dwight. As well, neither Jim nor Oscar could have known; Jim was in Stamford at the time, and Oscar was still on vacation.","elements":[]}]}],"images":[]},{"title":"Cultural references","level":2,"content":[{"type":"list","elements":[{"text":"Andy says TGI Wednesday, a pun on TGIF, short for \"Thank God it's Friday\", an expression of relief at the end of the work week.","elements":[]},{"text":"Andy's expression Get my beer on is a snowclone of get my X on which means start doing X. He continues in the same fashion with Get my Lost on; Lost is a television drama that takes place on an island. (See also get our skate on in the episode \"Michael's Birthday\".)","elements":[]},{"text":"Ebonics is a term for the dialect of English spoken by some African-Americans in the United States. Michael says the word \"business\" as \"bidness\" as an example.","elements":[]},{"text":"Oscar night is the nickname given to the Academy Award ceremony.","elements":[]},{"text":"Swanson is a frozen food company that invented the TV dinner. As with most frozen dinners, the quality is mediocre.","elements":[]},{"text":"Unknown reference: Riding in on a donkey like Pepe.","elements":[]},{"text":"Marv Albert is a sportscaster who in 1997 pled guilty to biting a female sex partner.","elements":[]},{"text":"Cornell is Andy's alma mater. Hofstra is another university also in New York. The two teams did not play each other in football during the 2006-2007 season.","elements":[]},{"text":"A piñata is a traditional Mexican party accessory, typically filled with candy and toys. Blindfolded guests take turns trying to smash the piñata with a stick in order to release the contents.","elements":[]},{"text":"Meredith tells Creed that she bought the chimichangas at Gerrity’s, a chain of groceries stores in eastern Pennsylvania.","elements":[]}]}],"images":[]},{"title":"Cast","level":2,"content":[],"images":[]},{"title":"Main Cast","level":3,"content":[{"type":"list","elements":[{"text":"Steve Carell as Michael Scott","elements":[]},{"text":"Rainn Wilson as Dwight Schrute","elements":[]},{"text":"John Krasinski as Jim Halpert","elements":[]},{"text":"Jenna Fischer as Pam Beesly","elements":[]},{"text":"B.J. Novak as Ryan Howard","elements":[]}]}],"images":[]},{"title":"Supporting Cast","level":3,"content":[{"type":"list","elements":[{"text":"Leslie David Baker as Stanley Hudson","elements":[]},{"text":"Brian Baumgartner as Kevin Malone","elements":[]},{"text":"Kate Flannery as Meredith Palmer","elements":[]},{"text":"Mindy Kaling as Kelly Kapoor","elements":[]},{"text":"Angela Kinsey as Angela Martin","elements":[]},{"text":"Paul Lieberstein as Toby Flenderson","elements":[]},{"text":"Oscar Nunez as Oscar Martinez","elements":[]},{"text":"Phyllis Smith as Phyllis Lapin","elements":[]}]}],"images":[]},{"title":"Recurring Cast","level":3,"content":[{"type":"list","elements":[{"text":"Ed Helms as Andy Bernard","elements":[]},{"text":"Rashida Jones as Karen Filippelli","elements":[]},{"text":"Creed Bratton (actor) as Creed Bratton","elements":[]}]}],"images":[]},{"title":"Guest Cast","level":3,"content":[{"type":"list","elements":[{"text":"Yvette Nicole Brown as Paris","elements":[]},{"text":"Eric Christie as Al","elements":[]},{"text":"Charlotte Stewart as Woman in Staples","elements":[]},{"text":"Kevin Reilly as Dwight's First Interviewer","elements":[]},{"text":"Susie Geiser as Marcy (Andy's Anger Management Counselor, only in the Producer's Cut)","elements":[]}]}],"images":[]},{"title":"References","level":2,"content":[{"type":"list","elements":[{"text":"↑ Schur, Michael. The Office Convention, Writer's Block panel discussion.","elements":[]},{"text":"↑ Parade Magazine, The Office Quiz","elements":[]}]}],"images":[]}]}