{"sections":[{"title":"The Incentive","level":1,"content":[{"type":"paragraph","text":"\"The Incentive\" is the second episode of the eighth season, and the 154th episode overall. It was written by Paul Lieberstein and directed by Charles McDougall. The episode originally aired on September 29, 2011."},{"type":"paragraph","text":"\"The Incentive\" received mixed reviews from critics with Myles McNutt mainly criticizing the episode for recycling stories. According to Nielsen Media Research, the episode was viewed by 6.7 million viewers and received a 3.5 rating\/9% share among adult between the ages of 18 and 49, marking a drop in the ratings from the season premiere, \"The List\"."}],"images":[]},{"title":"Synopsis","level":2,"content":[{"type":"paragraph","text":"Robert challenges office manager Andy to double sales after a rousing motivational speech. After Andy institutes a point system and promises to \"wear a dress\" for 500 points, \"run naked through the parking lot with a donut on [his] ding-dong\" for 1,000 points, and tattoo whatever his co-workers would like on \"[his] ass\" in exchange for 5,000 points, everyone in the office suddenly gets motivated to sell, eventually earning 5,000 points by the end of the day."},{"type":"paragraph","text":"When Andy and the crew go to the tattoo parlor, however, Andy suddenly is unnerved and admits to Jim that he isn't sure why Robert made him manager. Jim reassures Andy that he managed to pick up sales, and that no one in the office expects him to go through with the tattoo idea. Andy responds by getting the tattoo, which Pam changes, without telling Andy, to an image of a dog that has \"Nard\" written on it, a reference to Andy's nickname \"Nard Dog.\" Upon seeing his completed tattoo in a mirror, Andy is pleased with the result. Robert then reveals to the cameras that he picked Andy because he is \"all surface...uncomplicated, what you see is what you get\" and that causes people to rally behind him, because he is an underdog."},{"type":"paragraph","text":"Meanwhile, Pam and Angela become walking buddies at Angela's request, but after Angela says she's reported Pam to Social Services for drinking herbal tea with traces of caffeine it, a disgusted Pam tells Angela they should not have anything else to do with each other. Pam and Angela then continue to walk rapidly–and away from each other."}],"images":[{"src":"https:\/\/vignette.wikia.nocookie.net\/theoffice\/images\/0\/0b\/Nard_dog.jpg\/revision\/latest\/scale-to-width-down\/180?cb=20131208005405","caption":""}]},{"title":"Cultural references","level":2,"content":[{"type":"list","elements":[{"text":"Sabre's Pyramid tablet serves as a parody of several tablet computers, specifically the Apple iPad.","elements":[]},{"text":"Dwight says that \"Oscar's friend\" Neil Patrick Harris, the openly gay actor, really made him laugh.","elements":[]},{"text":"This is the only episode in Season 8 to use the full intro sequence.","elements":[]}]}],"images":[]},{"title":"References to Previous Episodes","level":2,"content":[{"type":"list","elements":[{"text":"Andy jumps at the alcohol swab before his tattoo, thinking it was the needle. He reacted the same way when Kelly pierced his ear at the end of the episode, Café Disco. It is also a common trope.","elements":[]},{"text":"When Kevin freaks out because he thinks Justine believes him to be the receptionist it is most likely a callback to when he was a bad receptionist after Charles appoints him to run the phones in Two Weeks and Dream Team . He also yells, \"DARRYL, A GIRL\", most likely a callback to when he didn't know how to transfer calls and would just yell who was on the phone.","elements":[]}]}],"images":[]},{"title":"Amusing Details\/Trivia","level":2,"content":[{"type":"list","elements":[{"text":"In the cold open, when Kevin tries to save time by only saying half the words normal speech requires, Angela says \"He's always been like that. I mean, it's gotten worse over the years.\" This is likely a reference to how Kevin is progressively written dumber and dumber as the series goes on.","elements":[]},{"text":"Kevin shouts \"NO!\" when Dwight pours walnuts into his brownie mix. When Angela comes back from maternity leave with brownies that have walnuts, Pam points out that Kevin is allergic to walnuts, however he says he is willing to work through that for the brownie.","elements":[]},{"text":"When Andy admires his new tattoo outside of the tattoo parlor, Jim can be heard saying \"Okay, pull up your pants.\"","elements":[]}]}],"images":[]},{"title":"Cast","level":2,"content":[],"images":[]},{"title":"Main Cast","level":3,"content":[{"type":"list","elements":[{"text":"Rainn Wilson as Dwight Schrute","elements":[]},{"text":"John Krasinski as Jim Halpert","elements":[]},{"text":"Jenna Fischer as Pam Halpert","elements":[]},{"text":"B.J. Novak as Ryan Howard","elements":[]},{"text":"Ed Helms as Andy Bernard","elements":[]},{"text":"James Spader as Robert California","elements":[]}]}],"images":[]},{"title":"Supporting Cast","level":3,"content":[{"type":"list","elements":[{"text":"Leslie David Baker as Stanley Hudson","elements":[]},{"text":"Brian Baumgartner as Kevin Malone","elements":[]},{"text":"Creed Bratton (actor) as Creed Bratton","elements":[]},{"text":"Kate Flannery as Meredith Palmer","elements":[]},{"text":"Mindy Kaling as Kelly Kapoor","elements":[]},{"text":"Ellie Kemper as Erin Hannon","elements":[]},{"text":"Angela Kinsey as Angela Martin-Lipton","elements":[]},{"text":"Paul Lieberstein as Toby Flenderson","elements":[]},{"text":"Oscar Nunez as Oscar Martinez","elements":[]},{"text":"Craig Robinson as Darryl Philbin","elements":[]},{"text":"Phyllis Smith as Phyllis Vance","elements":[]}]}],"images":[]},{"title":"Guest Cast","level":3,"content":[{"type":"list","elements":[{"text":"Erica Vittina Phillips as Justine","elements":[]},{"text":"Jaime Jorn as Tattoo Artist","elements":[]}]}],"images":[]}]}