{"sections":[{"title":"The Farm","level":1,"content":[{"type":"paragraph","text":"\"The Farm\" is the seventeenth episode of the ninth season of the American television comedy series The Office and is the show's 193rd episode overall. It was written and directed by Paul Lieberstein. It aired on March 14, 2013 and was viewed by 3.54 million people."},{"type":"paragraph","text":"In the episode, Dwight travels home for a customary Schrute funeral. He and his siblings receive a surprise inheritance that's not entirely welcome. Back at Dunder Mifflin, Todd Packer tries to make amends for a lifetime of bad behavior."}],"images":[]},{"title":"Synopsis","level":2,"content":[{"type":"paragraph","text":"Dwight arrives dressed in black clothing and he tells the office that he is dressed according to the rules of Schrute mourning. He tells the office staff that his Aunt Shirley has died. While people try to express their condolences, Dwight is not interested and explains that the two pails he holds each contain either red, fertile dirt in which if he throws it in your face, you are invited to the funeral and the other contains black, acidic dirt to which if thrown in your face he asks that you keep away from him during his time of mourning. He throws the black dirt in everyone's face except Oscar. When he gets to Jim, Dwight fills his hand with acidic dirt, but instead of throwing it at Jim, he throws it directly on and across Pam's cheek. Then he soaks another one in coffee and throws it at Jim's face."},{"type":"paragraph","text":"Dwight stands on the porch of his house at Schrute Farms, while Mose gently plays guitar and sings. His cousin Zeke pulls up on his motorcycle to take Dwight to the funeral at Shirley's farm nearby. Both of them argue over who has to get in the sidecar and the argument culminates in both of them in the drivers seat. Dwight and Oscar meet at the funeral and Oscar expresses surprise when he see's Dwight's brother pull up in a car that drives into the grave intended for Aunt Shirley. Oscar is even more struck by Dwight's beautiful sister, Fanny from Chicago. She is a single mother of a boy named Cameron."},{"type":"paragraph","text":"While at the funeral, rather than recall fond memories of Shirley like most families, all the guests instead state a fact about her while she was alive to which Oscar sarcastically says of the Schrutes \"they're a descriptive people\". A group of farmers arrive at the funeral and Dwight flirts with Esther, one of the girls from a neighboring farm. Oscar becomes worried and leaves after Dwight takes a shotgun and begins firing into the open coffin in order to ensure that Shirley is dead and not just a deep sleeper as incidents in the past have occurred."},{"type":"paragraph","text":"Back at the office Todd Packer reappears and admits that he is in recovery and is on step 8 of Alcoholics Anonymous (and step 9 of Narcotics Anonymous) in which he must make amends with the people he has wronged. He proceeds to apologize to everyone, but Pam points out that he is just insulting people and disguising it as an apology. Packer realizes this and to show he is truly sorry, begins to distribute cupcakes that he bought for everyone. Everyone seems willing to accept his apology, but Pam calls a meeting in the conference room as she is not willing to let everyone forgive Packer just because he is handing out cupcakes."},{"type":"paragraph","text":"As everyone gathers in the living room at the funeral, they watch a tape Aunt Shirley recorded for her family to watch upon her death. In the video, she tells Dwight, his brother Jeb, and Fanny that she will give them her farm if they move back home. She thinks that Jeb, a pot farmer in California, and Fanny, a single mom in the city, need to return home and get back to their family traditions. Jeb seems interested, but Fanny doesn't want to and Dwight's usual means of manipulation don't work on his sister."},{"type":"paragraph","text":"Pam convinces the office that they should not accept Packer's offering. Meanwhile, Packer continues to insult people and Kevin struggles not to eat his cupcake as everyone tries to distract him."},{"type":"paragraph","text":"Dwight uses the tactic of nostalgia to convince his sister to return home. As the Schrute family sings, Fanny begins to realize that she misses her home and becomes impressed when Dwight begins to court Esther by placing a pair of crow's beaks at her feet. According to Schrute tradition, if the girl is interested, she will crush the beaks, and Esther does. Dwight later goes to the barn at night and begins to do his usual work and Cameron follows him. He observes Dwight perform the task of taking eggs from hens and Cameron overcomes his fear of chickens to take an egg and Dwight seems proud. Dwight later tries to show him how to milk a goat, but when Cameron is unable to discern between good milk and bad milk, Dwight loses his patience and his uncle instincts prove fickle."},{"type":"paragraph","text":"When Pam comes in the next morning, she announces that she thought about it and that she is going to eat her cupcake. The rest of the office looks terrible and they reveal to Pam that Packer had laced the cupcakes with a wide range of drugs. In an earlier scene, before the cupcakes were eaten, Packer proudly tells the cameras he was never in rehab and spent six hours carefully removing the frosting and layering in both legal and illegal drugs in order to get revenge on the office staff who he believes were responsible for his firing. Everyone is recovering from the effects of the drugs and they tell stories of the incidents that occurred. When people ask Andy what his effects were, he and Kevin start acting very awkward and pretend that nothing happened, as the cameras show clips of them becoming high and performing a number of weird activities such as rubbing each other's faces, trying on each other's clothes, and dancing."},{"type":"paragraph","text":"Fanny realizes how much she misses home and sees that Cameron seems to enjoy the farm life. She agrees to return home and work Shirley's farm with Dwight and Jeb. As they arrive at her farm and realize how big it is, they all look at each other and agree that they are ready for the task. "},{"type":"paragraph","text":"Todd Packer is seen apologizing to two men who are unseen before he hands each a box with a drug-filled cupcake in it. The cameras reveal that the two men are Jim and Darryl and Todd is visiting them at Athlead. Both thank Todd for this and Todd proceeds to give a devilish smile to the camera."}],"images":[]},{"title":"Connections to previous episodes","level":2,"content":[{"type":"list","elements":[{"text":"Dwight's nephew, Cameron (Blake Garrett Rosenthal), is seen coming out of the Hay Ride from Dwight's Hay Place in Season 7 Episode 9, \"WUPHF.com\"","elements":[]}]}],"images":[]},{"title":"Amusing details\/Trivia","level":2,"content":[{"type":"list","elements":[{"text":"The Farm was meant to be a spin-off of The Office, but NBC declined to pick up the series. Additional material was then filmed for the episode so that it would better fit into the season. The song intended for The Farm can be heard just before the ending credits.","elements":[{"text":"Paul Lieberstein wrote and directed the episode and intended to be showrunner of the spinoff. This is why he stepped down as showrunner for season 9.","elements":[]},{"text":"Had the spinoff been approved, Rainn Wilson probably would have left The Office midseason.","elements":[]}]},{"text":"Blake Garrett Rosenthal, who appears in this episode as Fanny’s son Cameron, can be seen playing at Dwight’s Hay Place in the episode titled “WUPHF.com”","elements":[]},{"text":"Blake Garrett Rosenthal (Cameron) and Matt Jones (Zeke) later play a father and son in the CBS sitcom Mom. Spencer Daniels (who plays Meredith's son, Jake) is also a regular on season one of the same show.","elements":[]},{"text":"The farm house is the same house owned by Stanley Richmond in Jericho (2006 TV Series).","elements":[]},{"text":"Ironically, Dwight does not receive a cupcake, despite working with Jim to get rid of Todd Packer, and intentionally letting Todd get fired from the Sabre store.","elements":[]}]}],"images":[]},{"title":"Cast","level":2,"content":[],"images":[]},{"title":"Main Cast","level":3,"content":[{"type":"list","elements":[{"text":"Rainn Wilson as Dwight Schrute","elements":[]},{"text":"John Krasinski as Jim Halpert","elements":[]},{"text":"Jenna Fischer as Pam Halpert","elements":[]},{"text":"Ed Helms as Andy Bernard","elements":[]}]}],"images":[]},{"title":"Supporting Cast","level":3,"content":[{"type":"list","elements":[{"text":"Catherine Tate as Nellie Bertram","elements":[]},{"text":"Leslie David Baker as Stanley Hudson","elements":[]},{"text":"Brian Baumgartner as Kevin Malone","elements":[]},{"text":"Creed Bratton as Creed Bratton","elements":[]},{"text":"Clark Duke as Clark Green","elements":[]},{"text":"Kate Flannery as Meredith Palmer","elements":[]},{"text":"Ellie Kemper as Erin Hannon","elements":[]},{"text":"Angela Kinsey as Angela Martin","elements":[]},{"text":"Oscar Nunez as Oscar Martinez","elements":[]},{"text":"Craig Robinson as Darryl Philbin","elements":[]},{"text":"Phyllis Smith as Phyllis Vance","elements":[]}]}],"images":[]},{"title":"Guest Cast","level":3,"content":[{"type":"list","elements":[{"text":"Majandra Delfino as Fannie","elements":[]},{"text":"Matt Jones as Zeke","elements":[]},{"text":"Thomas Middleditch as Jeb","elements":[]},{"text":"Blake Garrett Rosenthal as Cameron","elements":[]},{"text":"David Koechner as Todd Packer","elements":[]},{"text":"Allan Havey as Mr. Bruegger","elements":[]},{"text":"Nora Kirkpatrick as Esther","elements":[]},{"text":"Mary Gillis as Aunt Shirley","elements":[]},{"text":"Michael Schur as Mose","elements":[]},{"text":"Michael \"Tuba\" Heatherton as The Minister","elements":[]},{"text":"Stewart Skelton as Dipido Smith","elements":[]},{"text":"Tom Bower as Heinrich Manheim (deleted scene)","elements":[]}]}],"images":[]}]}