{"sections":[{"title":"The Sting","level":1,"content":[{"type":"paragraph","text":"\"The Sting\" is the fifth episode of the seventh season of the American sitcom The Office, and the show's 131st episode overall. Written by Mindy Kaling and directed by Randall Einhorn, the episode aired on NBC in the United States on October 21, 2010. This episode has received positive reviews. It was viewed by 6.87 million people."}],"images":[]},{"title":"Synopsis","level":2,"content":[{"type":"paragraph","text":"When a Dunder Mifflin client is stolen by a rival salesman named Danny Cordray, Michael, Dwight and Jim decide to set up a sting in order to uncover his sales secret. Meanwhile, Andy starts a band when he learns that one of his old college friends has a successful music career."},{"type":"paragraph","text":"Jim and Dwight are sent on assignment to make a sales pitch to a client named Steve Nash, and are eager to land the sale. However, their eagerness is short-lived as they see Danny Cordray, a rival and very successful paper salesman, the best in the Scranton Wilkes-Barre area, has also arrived for a sales pitch. Desperate, Jim and Dwight call in Michael, who is ecstatic at getting a chance to make a sale, to come and try to save them. However, the company ends up taking Danny's offer, even after Michael promises at-cost paper sales and weekend delivery. The trio leaves the client's office and head back home, defeated. It is also revealed by Dwight that Danny had a romantic history with Pam (while Jim was dating Karen), a fact which Pam tries to reiterate to Jim that it was only a brief relationship."},{"type":"paragraph","text":"During a brainstorm session, Michael, Jim, and Dwight decide to set up a sting operation to see how Danny is stealing all of their clients and observe his sales techniques. They set up Meredith, as the CEO of Solartech (a fictional company), in Dwight's office, fitted with security cameras, and watch from another room. Danny is then sent in to try to make a sale. All starts well until Meredith attempts to seduce him, forcing Dwight and Jim to send in Oscar and Ryan to save the sting. When Meridith strong arms both of them, a grossed out Michael rushes in to call the whole thing off. Danny becomes infuriated and walks off, but before he leaves the building, Michael offers him a job, mentioning how much money he could make as a traveling salesman for them. He reluctantly accepts the offer, and Michael introduces him as the new salesman to the office. The rest of the sales staff (minus a distracted Andy) act disrespectful towards him, worrying that Danny will take their clients. Michael mentions to them how well sales numbers will go up with Danny a part of the branch now, and that just because he is good doesn't mean he should be turned away. Before Dwight leaves for the day, he viciously insults Danny, then near immediately welcomes him to the company."},{"type":"paragraph","text":"In a final interview with the documentary crew, Michael boasts of his coup of stealing Danny, bragging that Dunder Mifflin didn't even need another traveling salesman since they have Todd Packer in the field, before immediately lamenting that he \"forgot about Packer.\""},{"type":"paragraph","text":"Andy starts a band after reading about how well one of his friends is doing in the music business. He manages to get Darryl and Kevin to join him in writing a song, with Andy singing from the perspective of a little girl in a falsetto. The song is poorly received by the rest of the office, and Andy returns to the drawing board. Seeing that Andy is dejected, Kevin and Darryl offer to stay and jam with him for a little extra time, and the trio come up with another, much better song."}],"images":[]},{"title":"Cultural references","level":2,"content":[{"type":"list","elements":[{"text":"Oscar's bicycle is the same model ridden by cycling champion Lance Armstrong, whose \"Livestrong\" bracelet has appeared in Basketball and Michael's Birthday. Kelly has mixed feelings because \"I'm on Cheryl Crow's side,\" referring to the couple's broken engagement in 2006.","elements":[]},{"text":"Steve Nash is a South African-born Canadian professional basketball player for the NBA. Unlike Jim, Dwight isn't familiar with him because he doesn't watch basketball religiously.","elements":[]},{"text":"Dwight calls Jim a \"jock hipster\", which is a big contradiction: jock is a term for athletes, while hipsters are known for their dislike of organized sports.","elements":[]},{"text":"Mount Kilimanjaro is the highest mountain in Africa and the highest free-standing mountain in the world.","elements":[]},{"text":"Danny Cordray works for the Osprey Paper Company in Throop. Throop is a town not far from Scranton. Dwight mispronounces the town name, however. Throop is pronounced like the word \"troop\". (On the other side of Throop from Scranton is the town of Olyphant.)","elements":[]},{"text":"Michael talks about swimmer Michael Phelps coming out of retirement and drowning in a pool. Phelps is the most decorated Olympian of all time who retired 2 years after the episode aired.","elements":[]},{"text":"Michael and Jim argue about the title of the 1973 movie The Sting.","elements":[]},{"text":"Kevin says his voice is \"unique like Bob Dylan\", the American folk musician.","elements":[]},{"text":"Dwight tries to make Oscar and Ryan pose as executives from Stark Industries, the fictitious company owned by character Tony Stark in the Iron Man comic book and movie.","elements":[]},{"text":"Ryan wants to be the owner of Internet giant Google. He proposes a backstory in which \"Larry and Sergey bought me a...\" He mispronounces the name of Google co-founder Sergey Brin.","elements":[]},{"text":"Kelly and Angela agree that Danny Cordray looks like actor Josh Duhamel. The resemblance between Timothy Olyphant and Josh Duhamel has been noted by many, and people have even taken sides as to which actor they prefer. When Michael introduces Danny to the office staff Kelly utters an epithet that is censored audibly and visually, but was most likely \"fuck me\".","elements":[]},{"text":"When Darryl rehearses with Andy, behind him taped to a cabinet is a calendar from Scranton Printing and its characteristic \"SP\" logo.","elements":[]},{"text":"Meredith, posing as the CEO of Solartech, is referred to as \"Ms. van Hellsing\", which is possibly a reference to the anime Hellsing, in which a main character is called Ms. Hellsing. It may also be a pun at the expense of the Hellsing series, since the plot is based around a conflict between the British and the Germans, and a \"van\" is added to a main character's name. Dwight states that Van Hellsing was a professor prior to his more famous occupation which Jim references but never states outright. That occupation was a vampire hunter, portrayed recently by Hugh Jackman in the movie Van Helsing.","elements":[]},{"text":"When Meredith is posing as the head of Solartech, she introduces Oscar as \"Manuel, my cleaning man\" and remarks that he \"doesn't speak any English\", which is possibly a reference to the character Manuel from the popular British sitcom \"Fawlty Towers\".","elements":[]}]}],"images":[]},{"title":"Connections to previous episodes","level":2,"content":[{"type":"list","elements":[{"text":"In the cold open, Michael fails in his attempt to ride Oscar's bike and while he denies it, it is implied that Michael cannot ride a bike. This contradicts a scene in A Benihana Christmas in which Michael brings his own bike to the office for a toy drive and rides (and crashes) it in the office. Michael also says in the episode Double Date that he can ride a bike.","elements":[]},{"text":"Stanley gets offended when Michael \"assumes\" he has diabetes. This is strange because he has previously mentioned his diabetes.","elements":[]},{"text":"Meredith says the meeting with Danny feels more like a third date, implying that she's ready to have sex with him. Michael and Holly discussed having sex on their third date in Crime Aid, and later did so.","elements":[]},{"text":"Danny is worried about having parked his car in a compact space, which is for smaller cars, as stated by Michael and Dwight in their \"Lazy Scranton\" skit from The Merger.","elements":[]},{"text":"Dwight objects to Danny joining the staff because of the lack of seats, despite the fact that there is plenty of space in the annex (for Pete and Clarke season 9) and as many as four extra employees occupied the office after the Scranton-Stamford merger.","elements":[]}]}],"images":[]},{"title":"Cast","level":2,"content":[],"images":[]},{"title":"Main Cast","level":3,"content":[{"type":"list","elements":[{"text":"Steve Carell as Michael Scott","elements":[]},{"text":"Rainn Wilson as Dwight Schrute","elements":[]},{"text":"John Krasinski as Jim Halpert","elements":[]},{"text":"Jenna Fischer as Pam Halpert","elements":[]},{"text":"B.J. Novak as Ryan Howard","elements":[]},{"text":"Ed Helms as Andy Bernard","elements":[]}]}],"images":[]},{"title":"Supporting Cast","level":3,"content":[{"type":"list","elements":[{"text":"Leslie David Baker as Stanley Hudson","elements":[]},{"text":"Brian Baumgartner as Kevin Malone","elements":[]},{"text":"Creed Bratton (actor) as Creed Bratton","elements":[]},{"text":"Kate Flannery as Meredith Palmer","elements":[]},{"text":"Mindy Kaling as Kelly Kapoor","elements":[]},{"text":"Ellie Kemper as Erin Hannon","elements":[]},{"text":"Angela Kinsey as Angela Martin","elements":[]},{"text":"Oscar Nunez as Oscar Martinez","elements":[]},{"text":"Craig Robinson as Darryl Philbin","elements":[]},{"text":"Phyllis Smith as Phyllis Vance","elements":[]},{"text":"Zach Woods as Gabe Lewis","elements":[]}]}],"images":[]},{"title":"Recurring Cast","level":3,"content":[{"type":"list","elements":[{"text":"Timothy Olyphant as Danny Cordray","elements":[]}]}],"images":[]},{"title":"Guest Cast","level":3,"content":[{"type":"list","elements":[{"text":"Kaily Smith as Kim the Receptionist","elements":[]}]}],"images":[]}]}