{"sections":[{"title":"The Delivery","level":1,"content":[{"type":"paragraph","text":"\"The Delivery\" is the seventeenth\/eighteenth episode of the sixth season, and was a one-hour long episode. It was the 117th\/118th episode overall. Part 1 was written by Daniel Chun and directed by Harold Ramis. Part 2 was written by Charlie Grandy and directed by Seth Gordon. It originally aired on March 4, 2010. It was viewed by 9 million people."},{"type":"paragraph","text":"The episode featured the highly anticipated birth of Jim and Pam's baby."}],"images":[]},{"title":"Synopsis","level":2,"content":[],"images":[]},{"title":"Part One","level":3,"content":[{"type":"paragraph","text":"When Pam and Jim call their clients to ask them if they need anything before they have their baby, Dwight thinks that they are abusing their situation to ring up sales. Convinced by Pam that sharing personal details with clients is an acceptable sales technique, Dwight calls a client and mentions that Mose has a goat fungus. In a talking head interview, Dwight says he needs a baby, because he needs to get more sales and that he is lonely."},{"type":"paragraph","text":"Although Pam's labor has begun, she and Jim try to delay checking into the hospital until after midnight because their health plan covers only one day in the hospital."},{"type":"paragraph","text":"Pam and Kevin eat together because they are both hungry at the same times. Kevin wants to have an \"ultra feast\" for him and Pam, but their plans are interrupted by Pam's contractions. Michael notices that Pam is in labor and offers to drive her to the hospital. Michael takes responsibility for taking Pam to the hospital because he believes that the baby was conceived in the office, but Jim tells him that it was conceived at a Burning Man concert in a Port-A-Potty. In response to Michael's remarks, the new IT guy Nick tries to make a joke and Michael and Angela berate him."},{"type":"paragraph","text":"After surfing the Internet for information, Kelly concludes that giving birth is a horrific experience for the mother."},{"type":"paragraph","text":"Dwight goes to Angela and asks Angela to be the mother of their child. Angela agrees, as she misses Dwight. They meet in their old \"meeting\" spot."},{"type":"paragraph","text":"Pam's contractions continue, and Jim tries to convince Pam that she needs to go to the hospital, but Pam refuses. Andy also tells Pam not to worry about baby names because his name wasn't chosen until he was six years old. When Michael distracts Jim, Pam wants Michael and everyone else to distract her so that she can remain calm and slow down the rate of contractions. Michael explains he is awesome at distracting people, even at an early age in school. Michael holds a meeting so that he can keep Pam entertained."},{"type":"paragraph","text":"Pam's contractions become more painful as the office tries to entertain her: Ryan reads a poem, Andy does the Evolution of Dance and Erin recites the 11 triple crown winners. Angela and Dwight decide that they want to name the child Jedediah, and Angela talks to Dwight, but Dwight doesn't seem as interested. As they do this, Pam is in much more pain, and Jim tries to call the doctor, but Pam continues to refuse."},{"type":"paragraph","text":"Michael decides that it is a good idea for Pam not to induce labor, by touching the nipples. Meredith offers to bring her a shirt with holes, and Jim starts to become frazzled, which he notes, when Kevin suggests to stick spicy food up her butt. Jim thinks that Pam has gone crazy, and tries to convince the documentary crew that she is crazy and says that all the books say that they should go to the hospital at 5–7 minutes apart from each contraction. Pam goes to see Jim in his car and accidentally tells him that the baby is a girl. Jim starts to cry, out of joy and Pam and him are thrilled."},{"type":"paragraph","text":"Pam starts to have even bigger contractions and her water breaks. She still continues to refuse to go to the hospital and Pam says that if she doesn't get to the hospital, she doesn't get there. She wants to have ultra feast with Kevin. Pam starts to not be able to talk through her contractions, which are now two minutes apart. Pam tries to convince them that she doesn't need to and Jim, Michael, and Kevin grab her. Pam screams at them to let her go and starts to cry because she doesn't think she can do it, but finally learns that she needs to go and says that she waited too late, and becomes more and more worried."},{"type":"paragraph","text":"Michael drives them to the hospital while the office follows them. Michael calls Toby an idiot when he tries to get in the elevator. Dwight escorts them to the hospital, but is forced to pullover when he impersonates a police officer, and the police officer tries to get him out. He throws out his weapons."},{"type":"paragraph","text":"Pam realizes that she forgot her iPod and Michael sends Dwight to get the iPod. Pam tells him not to touch anything else. Pam and Jim arrive at the hospital while Michael parks the car in a restricted area."}],"images":[{"src":"https:\/\/vignette.wikia.nocookie.net\/theoffice\/images\/9\/9b\/Presentbaby.jpg\/revision\/latest\/scale-to-width-down\/226?cb=20100306171856","caption":"Andy's present for Cecilia."},{"src":"https:\/\/vignette.wikia.nocookie.net\/theoffice\/images\/d\/d6\/Angelaanddwightdelivery.jpg\/revision\/latest\/scale-to-width-down\/180?cb=20100306172225","caption":"Dwight and Angela in their \"meeting\" place."},{"src":"https:\/\/vignette.wikia.nocookie.net\/theoffice\/images\/0\/01\/Our-family.jpg\/revision\/latest\/scale-to-width-down\/180?cb=20100306000447","caption":"The Halpert Family."}]},{"title":"Part Two","level":3,"content":[{"type":"paragraph","text":"Jim says that Pam is doing fine, and tells the documentary crew that everything is fine. The nurse informs Jim that Pam is ready to push and Michael tries to see Pam, but sees her pushing instead, and becomes traumatized. Everyone in the office comes to the hospital at midnight. Andy made the baby a present, a framed newspaper from the day she was born, but since she was born after midnight, he has to put a new newspaper in the frame, which has an unfortunate headline about the Scranton strangler."},{"type":"paragraph","text":"Michael listens to Pam screaming about pushing her baby out, and she gives birth. The documentary crew hears Pam's baby and Michael is thrilled. Pam and Jim watch the baby and try to let her rest. Her name is announced as Cecelia Halpert. Everyone from the office is happy and Helene brings Pam her coffee. Michael comes in to the room to see the baby, but instead sees Pam, Jim, and Helene, and Helene awkwardly leaves. Michael holds the baby and is thrilled at the birth of Pam and Jim's baby daughter."},{"type":"paragraph","text":"Dwight sees that Pam's kitchen has mold when he gets to their house and decides that he needs to destroy the kitchen. Michael and everyone else returns to the office and Michael says that he made the family and he offers to help everyone else form relationships. Meredith says she is never getting married, while Andy says he is going to ask out Erin."},{"type":"paragraph","text":"Pam and Jim continue to spend time with their baby, and the nurse tries to get them to bring the baby to the nursery. Pam and Jim try to get her to be quiet, and try to breastfeed her, however she won't latch. Jim says to push it out, but Pam says that is impossible. The nurse says that Pam should take a break and bring the baby to the nursery, and she does."},{"type":"paragraph","text":"Michael sets up Kevin and Erin on a date, and Erin is shocked and unhappy and she tells Michael she likes Andy. Erin says that she can't be with Kevin, and Michael tells her that it would hurt Kevin. Meanwhile, a new couple comes into Pam and Jim's room and Pam is shocked when they can breastfeed easily."},{"type":"paragraph","text":"Dwight continues to destroy Pam's kitchen while Erin and Kevin have an awkward and boring lunch together. Andy spies on them. A male lactation consultant touches Pam's breast to see if she has milk. Pam is okay and Jim looks on awkwardly. However, the baby still is unable to latch on. Erin says that she has to break up with Kevin, although they never had a real relationship, and Michael belittles Erin, who is shaken. Andy is caught spying on them."},{"type":"paragraph","text":"Dwight and Angela talk to each other about their impending baby. A sleep-deprived Pam accidentally breast-feeds the other couples' baby, but they don't notice for a while. Isabel comes in and Pam finally realizes that it's the wrong baby and is shocked and scared. Isabel looks awkwardly at the baby as Pam and Jim try to stay calm. Pam and Jim are told by the nurse that they need to leave soon and tries to force them to get out."},{"type":"paragraph","text":"Isabel drops off a present at Pam's house and she sees Dwight. Dwight is shocked to see her and says that he'll call her and they flirt. Isabel looks happy. At the hospital, a hospital employee tells Pam to get out of the wheelchair and she again tries to get the baby to latch on. Pam is scared and worried and starts to breakdown, however the baby latches on and Jim and Pam sit on the bench outside the hospital."},{"type":"paragraph","text":"Andy gives Erin a paper and asks her to fax it for him. Secretly, the note would be faxed to the office, asking her to go on a date with him. However, the fax is busy and Andy jokingly tells Erin that she needs to fax it or she is going to be fired. Erin suddenly gets angry at Andy and starts crying because she has been having a rough day, but Andy reveals that he was actually asking her out. Erin happily and immediately accepts. Michael says that there is nothing like seeing true love form, in Jim and Pam and Andy and Erin. (Michael convinced Jim to keep persuing for Pam even though she was engaged )."},{"type":"paragraph","text":"Angela and Dwight agree to have the baby after all paperwork is done. Dwight has second thoughts, but signs the contract. Jim and Pam arrive at their home only to see their kitchen destroyed, and walk away."}],"images":[{"src":"https:\/\/vignette.wikia.nocookie.net\/theoffice\/images\/6\/62\/Baby.png\/revision\/latest\/scale-to-width-down\/180?cb=20101017200250","caption":""}]},{"title":"Amusing Details","level":2,"content":[{"type":"list","elements":[{"text":"A professional cat trainer was used to get the diaper on Angela's cat, Bandit.","elements":[]},{"text":"Along with a sword and an ax, a sai and a nunchaku were also thrown out of Dwight's car.","elements":[]},{"text":"The officer pulling Dwight over addresses him by name, implying that him getting pulled over for impersonating an officer is a regular occurrence.","elements":[]},{"text":"The hospital that Jim and Pam delivered their baby in was Moses Taylor Hospital, a real hospital in Scranton.","elements":[]},{"text":"Fax cover sheets now contain \"Dunder Mifflin: A Division of Sabre,\" instead of Dunder Mifflin.","elements":[]},{"text":"Despite how Michael acts in this episode, it’s pretty clear that he is a terrible matchmaker. In Booze Cruise Michael claims he never would have put Pam and Jim together (despite the obviousness of the connection), and in this episode, he pairs Kevin and Erin despite no romantic attraction.","elements":[]},{"text":"In the scene with Angela and Dwight creating the contract for creating a baby, there's a sign on a box that says \"petty cash 1990\"","elements":[]}]}],"images":[]},{"title":"Deleted Scenes","level":2,"content":[{"type":"list","elements":[{"text":"Ryan reads his poem, which is horrible and causes Pam and everyone else to laugh. Pam tells Ryan that it is awful, but awesome, and he starts to agree, saying that he didn't write it. Everyone starts to tell Ryan that he told them he wrote the poem, but Ryan storms out and tells the office to look at the footage (from the documentary).","elements":[]},{"text":"Ryan starts to smoke after Michael tells him that he knows models.","elements":[]},{"text":"Creed explains that he is going to die because Pam and Jim's baby is going to be born, and the cycle of life is returning.","elements":[]},{"text":"Jim says that Cameron Diaz would be the person he would hook up with if he could, while Pam's would be Clark (the lactation consultant and real life husband of Jenna Fischer).","elements":[]},{"text":"Pam tells Jim, \"F**k you,\" and then later sticks up the middle finger.","elements":[]}]}],"images":[]},{"title":"Trivia","level":2,"content":[{"type":"list","elements":[{"text":"While Michael, Jim and Pam are driving to the hospital Pam realizes she doesn't have her iPod that has the birthing song on it so Jim offers his iPod. Pam replies that she doesn't want the first thing Cece hears to be the 8 Mile soundtrack, showing that Jim is a big Eminem fan.","elements":[]},{"text":"Pam has been pregnant for over ten months.","elements":[]},{"text":"Pam and Jim have a blog for their baby and update it regularly. Their blog was once used for their wedding updates, at which time Pam was only five months pregnant.","elements":[]},{"text":"Jenna Fischer's husband Lee Kirk played the lactation consultant for Pam so he could 'really go for it.'","elements":[]},{"text":"\"Cecilia\" is the name of Jenna Fisher's niece, who was born during the filming of the episode. \"Marie\" is Jenna Fischer's middle name.","elements":[]},{"text":"This episode was originally planned to be split into two parts, explaining the time gap between two sections of the episode.","elements":[]},{"text":"Dwight is drinking Lionshead beer. It is brewed in the Northeast region of Pennsylvania and is the second largest brewery in the state.","elements":[]},{"text":"While Dwight is being stopped, the police officer in the car says \"Don't make this difficult, Dwight\" meaning that Dwight has already had trouble with the police before, or that the officer remembers Dwight back then, when he served as a volunteer Sheriff.","elements":[]},{"text":"With Michael saying that he was the cause for Pam and Jim getting together and that there was no chance of this before he intervened, this shows that Michael has missed the obvious attraction between multiple people; Andy and Erin (various), Megan and Eric (Gossip), and Jim and Pam (various).","elements":[]},{"text":"This episode does not mention Sabre (despite being the story arc in surrounding episodes). The only reference to Sabre is the newly added \"Sabre\" sign in the hallway outside of the Dunder Mifflin office.","elements":[]}]}],"images":[]},{"title":"Cultural References","level":2,"content":[{"type":"list","elements":[{"text":"Jim and Pam try to delay checking into the hospital due to the rules of their HMO, short for health maintenance organization, an organization which companies use to manage their health care plans.","elements":[]},{"text":"Andy performs The Evolution Of Dance, a YouTube phenomenon, though without music.","elements":[]},{"text":"Burning Man is an annual counter-cultural event held in the Nevada desert, culminating in the burning of a giant wooden man.","elements":[]},{"text":"A gourd is a plant similar to a squash, or pumpkin, or a hollowed out shell of a fruit used to drink or eat out of.","elements":[]},{"text":"Diesel is a type of fuel used for diesel engines. Using it in gasoline engines is not recommended.","elements":[]},{"text":"Fancy Feast is a type of cat food known especially for its commercials.","elements":[]},{"text":"Oktoberfest, or as Michael called it, \"October Feast,\" is a 16-Day festival held in Germany and it is a very important part of Bavarian life, bringing many international visitors.","elements":[]},{"text":"Meredith compares herself to actor George Clooney. Clooney has been romantically linked to many women but has stated that he has no intentions of ever getting married.","elements":[]},{"text":"Kelly is disgusted by pictures of the placenta she finds on the Internet.","elements":[]},{"text":"Erin recites the winners of the Triple Crown of Thoroughbred Racing.","elements":[]},{"text":"Julia Child is a famous chef who wrote several cookbooks, and was featured in the movie Julie and Julia.","elements":[]},{"text":"Twilight is an extremely popular hit book series, especially among teenage girls. There is, in fact, a Twilight Cookbook found on Amazon.","elements":[]}]}],"images":[]},{"title":"Connections to Previous Episodes","level":2,"content":[{"type":"list","elements":[{"text":"Dunder Mifflin's health care plan has undergone several changes. In the episode \"Health Care\", Dwight chooses a horrible health care plan for the office. In the Toby Wraparounds, Toby says that he changed it to an HMO. After being taken over by Sabre, the health care plan for the office almost certainly changed yet again.","elements":[]},{"text":"Dwight's obsession with weapons once again appears.","elements":[]},{"text":"Dwight screaming \"A la, A la, A la...\" when he doesn't want to hear something is from \"The Duel,\" where Dwight doesn't want to listen to Andy, who is fighting for Angela along with him.","elements":[]},{"text":"Fancy Feast has also been used on the show when Andy is trying to figure out what commercial song is, \"Break me off a piece of that...,\" which Andy later decides is Fancy Feast.","elements":[]},{"text":"The teapot Jim gave Pam in Christmas Party can be seen in their kitchen (before Dwight remodels it).","elements":[]},{"text":"Pam now has an iPod, replacing the Prism Durosport she received from Roy in \"The Injury\".","elements":[]},{"text":"Dwight and Angela's meeting spot was last seen in \"Weight Loss.\"","elements":[]},{"text":"The events of this episode officially nullify the pact Pam and Michael made in the cold open of \"The Convention\".","elements":[]},{"text":"It can be inferred that Jim and Pam sleep in the room that belonged to Jim's parents, even though Pam didn't seem happy at that prospect when Jim told her he had bought the house in \"Frame Toby\".","elements":[]},{"text":"Dwight had already been recognized by a police officer in \"Dinner Party\". It is unclear whether it was the same policeman.","elements":[]}]}],"images":[]},{"title":"Goofs","level":2,"content":[{"type":"list","elements":[{"text":"Andy says that he was born as \"Walter Jr.\" after his father in this episode, but his name got changed to Andy because his parents felt his brother better personified the name Walter, and that they got the name Andrew from a baby book. This is a continuity error, as during the episode \"Goodbye Toby\" before he proposes to Angela he calls his father \"Andrew Bernard\".","elements":[]},{"text":"Near the end of the episode, Jim is able to pull the car around even though Michael had previously thrown away the keys.","elements":[]},{"text":"The above can be easily explained by someone just picking up the keys since Michael only threw them into the street 10 feet away. Jim also complains that there were 5 tickets on the windshield when he brings the car around.","elements":[]},{"text":"Dwight thinks Isabel is joking when she says that adults are also supposed to go to the dentist, but in \"The Coup\" he uses a fake dental appointment as an excuse to meet with Jan without Michael's knowledge.","elements":[]},{"text":"The newspaper Andy has framed (for the day Pam went into labor and CeCe was supposed to be born) says that spring had just begun. Spring 2010 began on March 20, a Saturday.","elements":[]}]}],"images":[]},{"title":"Quotes","level":2,"content":[{"type":"paragraph","text":"For quotes see: The Delivery Quotes."}],"images":[]},{"title":"Cast","level":2,"content":[],"images":[]},{"title":"Main Cast","level":3,"content":[{"type":"list","elements":[{"text":"Steve Carell as Michael Scott","elements":[]},{"text":"Rainn Wilson as Dwight Schrute","elements":[]},{"text":"John Krasinski as Jim Halpert","elements":[]},{"text":"Jenna Fischer as Pam Halpert","elements":[]},{"text":"B.J. Novak as Ryan Howard","elements":[]},{"text":"Ed Helms as Andy Bernard","elements":[]}]}],"images":[]},{"title":"Supporting Cast","level":3,"content":[{"type":"list","elements":[{"text":"Leslie David Baker as Stanley Hudson","elements":[]},{"text":"Brian Baumgartner as Kevin Malone","elements":[]},{"text":"Creed Bratton (actor) as Creed Bratton","elements":[]},{"text":"Kate Flannery as Meredith Palmer","elements":[]},{"text":"Mindy Kaling as Kelly Kapoor","elements":[]},{"text":"Ellie Kemper as Erin Hannon","elements":[]},{"text":"Angela Kinsey as Angela Martin","elements":[]},{"text":"Paul Lieberstein as Toby Flenderson","elements":[]},{"text":"Oscar Nunez as Oscar Martinez","elements":[]},{"text":"Phyllis Smith as Phyllis Vance","elements":[]}]}],"images":[]},{"title":"Recurring Cast","level":3,"content":[{"type":"list","elements":[{"text":"Linda Purl as Helene Beesly","elements":[]},{"text":"Kelen Coleman as Isabel Poreba","elements":[]},{"text":"Nelson Franklin as Nick","elements":[]},{"text":"Sam Daly as Matt","elements":[]}]}],"images":[]},{"title":"Guest Cast","level":3,"content":[{"type":"list","elements":[{"text":"James Urbaniak as Rolf","elements":[]},{"text":"Sarah Baker as Josie","elements":[]},{"text":"Evan Gaustad as Dale","elements":[]},{"text":"Melissa Rauch as Cathy","elements":[]},{"text":"Lee Kirk as Clark the Lactation Specialist","elements":[]},{"text":"Anna Vocino as VO Operator","elements":[]},{"text":"Keeshan Giles as Hospital Employee","elements":[]},{"text":"Nicholas Daly Clark as Hospital Employee","elements":[]}]}],"images":[]},{"title":"References","level":2,"content":[{"type":"list","elements":[{"text":"↑ http:\/\/www.officetally.com\/wp-content\/uploads\/2010\/02\/tv-guide-baby-1.jpg","elements":[]},{"text":"↑ http:\/\/www.officetally.com\/the-office-the-delivery-qa\/3","elements":[]},{"text":"↑ http:\/\/www.officetally.com\/the-office-the-delivery-qa\/5","elements":[]},{"text":"↑ http:\/\/www.lifeintheoffice.com\/2010\/03\/08\/scrantonicity-the-delivery\/#more-2366","elements":[]}]}],"images":[]}]}