{"sections":[{"title":"The Meeting","level":1,"content":[{"type":"paragraph","text":"\"The Meeting\" is the second episode of Season 6 and the show's 102nd episode, overall. It was written by Aaron Shure and directed by Randall Einhorn. It originally aired on September 24, 2009 and was viewed by 7.33 million people."}],"images":[]},{"title":"Synopsis","level":2,"content":[{"type":"paragraph","text":"Jim tries to advance in the company; he talks to David Wallace at the office about making him manager and making Michael director of sales. Michael desperately tries to find out what is happening and is suspicious. First, he asks Pam if she knows anything, however she refuses to tell him. Then he looks to Andy for direction. Andy suggests making a cheese cart with a tablecloth where Michael can hide. Andy brings the cheese cart and Michael into the conference room where David and Jim are meeting."},{"type":"paragraph","text":"They finish, and Michael is still left with no information."},{"type":"paragraph","text":"Meanwhile, Dwight talks to Toby about Darryl's claim that he fell off a ladder in the warehouse while trying to reach an item and hurt himself. Dwight is suspicious at Darryl's explanation and Toby agrees to help him prove or disprove his theory."},{"type":"paragraph","text":"As Dwight and Toby search for information, Pam tries to settle her guest list for her wedding in Niagara Falls. She first asks Kelly who replies she will go if Ryan goes, because without him, \"It's kind of a waste.\" Kelly then rewords her answer and says that she would like Ryan to go so that she can support Jim."},{"type":"paragraph","text":"After his meeting with Jim, David Wallace wants to talk with Michael in his office. David Wallace asks Michael what he thinks about Jim, and Michael says that he is a good guy, but not capable of running Dunder Mifflin Scranton. He shows David a negative review in Jim's file and then David reveals Jim's idea to make Michael director of all Northeast sales and to make him branch manager. Then, David leaves and tells Jim to walk him out, and Jim comes back looking angry at Michael."},{"type":"paragraph","text":"Dwight and Toby go to Darryl's house and think they see Darryl, without crutches, wearing a football jersey. Toby then calls \"him\" an asshole and the person turns around, and we see that Toby actually yelled at Darryl's little sister, Gwyneth, who looks very similar to Darryl. In a hurry, Dwight pulls away from the house, and crashes into a garbage can, hurting Toby."},{"type":"paragraph","text":"At the office Pam asks Ryan if he is going to their wedding, and tries to get him not to go by saying that it is $75 for the trip. He, however, says he is coming, and a moderately angry Pam checks off Kelly and Ryan as guests that are coming to their wedding."},{"type":"paragraph","text":"Jim, realizing that Michael probably worsened his chances, decides to talk to Michael about his conversation, and Michael finally admits that Jim came up. Michael also admits that he showed David his file and decides to call David Wallace, but in doing so, worsens Jim's chances (and his own) and loses Jim's trust. However, David then calls back, saying that the board had a plan to make both Michael and Jim co-managers, and they agree to the plan."},{"type":"paragraph","text":"Jim and Michael announce to the office that they are now both co-managers, to Dwight's obvious dismay."},{"type":"paragraph","text":"Darryl and his sister come to the office and tell Toby and Dwight that they are making a complaint to corporate. Dwight says that they thought that Darryl's sister was in fact Darryl, and Darryl questions them. Dwight points out the sister's remarkable resemblance to Darryl. Dwight then goes to the warehouse with Toby and realizes that Darryl was lying, that the lift was misused and that Darryl didn't want to tell Toby that. Darryl rebukes that he will tell corporate that Dwight sexually harassed his sister, but Dwight asks, \"What judge would ever believe that?\""},{"type":"paragraph","text":"Both Darryl with his sister and Dwight make complaints to corporate, the paperwork of which is left for Toby to fill out."},{"type":"paragraph","text":"In the end, Pam talks to Meredith about coming to the wedding. Meredith says she'll text Pam on the wedding day for directions and that she'll have the fanciest thing, unless there are ribs. Angela and Pam are complaining about Meredith to each other when Pam moves Angela's bag to sit down. This causes Angela to say, \"Pam, my bag was there.\""}],"images":[]},{"title":"Amusing details","level":2,"content":[{"type":"list","elements":[{"text":"In the intro, Michael tells Oscar he's having a colonoscopy. This is what he previously told David Wallace in Golden Ticket in which he descriptively explained how a colonoscopy is performed, and was a lie about why he had not answered or returned David's calls. He was reading a description of a colonoscopy off of the internet.","elements":[]},{"text":"As Michael describes his cheese cart plan, Andy can be seen removing cheese from a sandwich -- presumably, all the cheese on the cart was obtained this way.","elements":[]},{"text":"In the beginning of the episode, David Wallace asks Michael for a \"run-down\" of his clients. Michael seems to know exactly what it is, unlike Jim in Heavy Competition.","elements":[]},{"text":"Michael says he will need to \"talk to [his] guy at H&R Block\" when offered the promotion. In Job Fair, he says \"H&R Block? Come on. I mean I don't even know what they do.\"","elements":[]},{"text":"When Jim and David enter the conference room, Michael can be seen pressing his head against his office wall, seemingly trying to hear what is happening. He quickly moves away from the wall as he notices the camera pan on him.","elements":[]},{"text":"When Dwight screams in his talking head near the end of the episode, Stanley and Creed are both startled.","elements":[]},{"text":"Michael says that the Scranton branch absorbed all of the Buffalo branch's clients, however several of the other Dunder Mifflin branches are far closer to the Buffalo branch than Scranton.","elements":[]}]}],"images":[]},{"title":"Goofs","level":2,"content":[{"type":"list","elements":[{"text":"When Michael interrupts the meeting between Jim and David, the TV is in front of the picture on the conference room wall. Later, when Andy interrupts the same meeting with the cheese cart, the TV is to the far right of the screen (left of the picture on the wall).","elements":[]}]}],"images":[]},{"title":"Cast","level":2,"content":[],"images":[]},{"title":"Main cast","level":3,"content":[{"type":"list","elements":[{"text":"Steve Carell as Michael Scott","elements":[]},{"text":"Rainn Wilson as Dwight Schrute","elements":[]},{"text":"John Krasinski as Jim Halpert","elements":[]},{"text":"Jenna Fischer as Pam Beesly","elements":[]},{"text":"B.J. Novak as Ryan Howard","elements":[]}]}],"images":[]},{"title":"Supporting cast","level":3,"content":[{"type":"list","elements":[{"text":"Ed Helms as Andy Bernard","elements":[]},{"text":"Leslie David Baker as Stanley Hudson","elements":[]},{"text":"Brian Baumgartner as Kevin Malone","elements":[]},{"text":"Creed Bratton (actor) as Creed Bratton","elements":[]},{"text":"Kate Flannery as Meredith Palmer","elements":[]},{"text":"Mindy Kaling as Kelly Kapoor","elements":[]},{"text":"Ellie Kemper as Erin Hannon","elements":[]},{"text":"Angela Kinsey as Angela Martin","elements":[]},{"text":"Paul Lieberstein as Toby Flenderson","elements":[]},{"text":"Oscar Nunez as Oscar Martinez","elements":[]},{"text":"Craig Robinson as Darryl Philbin","elements":[]},{"text":"Phyllis Smith as Phyllis Vance","elements":[]}]}],"images":[]},{"title":"Recurring cast","level":3,"content":[{"type":"list","elements":[{"text":"Andy Buckley as David Wallace","elements":[]},{"text":"Hideotoshi Imura as Hidetoshi Hasagawa","elements":[]}]}],"images":[]},{"title":"Guest cast","level":3,"content":[{"type":"list","elements":[{"text":"Jahmilla Jackson as Gwyneth, Darryl's Sister","elements":[]}]}],"images":[]}]}