{"sections":[{"title":"The Lover","level":1,"content":[{"type":"paragraph","text":"\"The Lover\" is the seventh episode of Season 6 and the 107th overall. It was written by Lee Eisenberg and Gene Stupnitsky, who most recently had written the episodes New Boss and The Surplus. It was directed by Lee Eisenberg, who marked his directorial debut. It originally aired on October 22, 2009. It was viewed by 8.52 million people."}],"images":[]},{"title":"Synopsis","level":2,"content":[{"type":"paragraph","text":"Pam and Jim come back from their honeymoon in Puerto Rico. Everyone is happy that they are back, and Pam and Jim share that they loved their trip to Puerto Rico. Michael uses Blind Guy McSqueezy, a character of his who is blind, to welcome them back. Meredith asks Pam what she got for them and Pam says candy. Meredith asks, \"What else?\""},{"type":"paragraph","text":"Pam tells Erin to put her candy on the desk, but Erin tells Pam that she is going to ask Michael for permission first. It is learned that Michael is dating Helene, Pam's mother. Jim is shocked and outraged that Michael is dating Helene and begs Michael not to tell Pam."},{"type":"paragraph","text":"Meanwhile, Dwight tries to get information on Jim by putting a wooden mallard in his office, which contains a listening device. Jim gives the duck to Kelly and Ryan. Dwight takes it back and gives it to Jim again. Jim sees it and makes Dwight wash and buff his car as punishment. After everyone has left for the day, Dwight tells the documentary crew that he used the mallard as a diversion. His real listening device was a pen that recorded Jim's entire workday. As he is listening to Jim's customer calls, Dwight proudly tells the camera that he got eight hours of this."},{"type":"paragraph","text":"Pam eventually learns that Michael is, in fact, dating her mother. She is outraged, shocked and belittles Michael all day. She has awkward encounters with Oscar when he tells her she is going overboard. Angela, cheery, asks Pam how her day is going. Pam calls her mom to tell her she is crazy for dating Michael. Toby tries to calm Pam down, after Michael treats Toby like a friend, but Toby doesn't succeed. Michael calls him a jackass. Michael leaves while Jim tries to calm her down with thoughts about their honeymoon, including a couple they met named Frank and Benny (\"Frank and Beans\") and a brother and sister named Jim and Pam."},{"type":"paragraph","text":"Jim shows Pam that Dwight is washing their car and they reminisce about their honeymoon. Pam continues to think that she is not going overboard, and Jim agrees."}],"images":[]},{"title":"Cultural References","level":2,"content":[{"type":"list","elements":[{"text":"Coco Leche is a candy deriving from hardened coconut milk.","elements":[]},{"text":"The opera song that Jim plays in his office is \"M'appari\".","elements":[]},{"text":"A cancer cluster is an area that has a population with an abnormally large amount of cancers.","elements":[]},{"text":"The conference room scene was part of iParticipate.","elements":[]},{"text":"\"Frank and Beans\" is a reference to the movie There's Something About Mary.","elements":[]}]}],"images":[]},{"title":"Amusing Details","level":2,"content":[{"type":"list","elements":[{"text":"Michael mentions that Blind Guy McSqueezy is not liked by the women in his improv class. Michael's improv class was introduced in the episode, \"Email Surveillance.\" However this is unique due to the fact that it’s implied Michael stopped going to his improv class in \"The Job.\"","elements":[]},{"text":"Dwight repeatedly corrects anyone who calls the mallard a \"duck\" (a mallard is a kind of duck).","elements":[]},{"text":"Bottecelli's isn't a real restaurant in Scranton.","elements":[]},{"text":"Michael's parrot holding Rum is named \"Oscuro Rum.\" Oscuro Rum translates to dark or obscure rum.","elements":[]},{"text":"Creed cries when the opera is playing. Later, when Michael says that Dunder Mifflin wasn't involved with the Peruvian cancer cluster, Creed shrugs. However, Creed agrees that dating mothers is despicable.","elements":[]},{"text":"When Pam starts to shout, \"No more meetings!\", Stanley can be seen grinning and joining in.","elements":[]},{"text":"Jim yells at Toby, continuing the gag of managers not liking Toby. Jim also has issues with Toby in Survivor Man, also while he was in charge.","elements":[]}]}],"images":[]},{"title":"Connections to previous episodes","level":2,"content":[{"type":"list","elements":[{"text":"In \"Chair Model\" Jim tells Pam he is putting her mother's phone number on the index card for Michael.","elements":[]}]}],"images":[]},{"title":"Goofs","level":2,"content":[{"type":"list","elements":[{"text":"Segway riding is not recommended or suitable for pregnant women, however, Jim and Pam fondly remember their Segway tour. No tour operator would allow her on their tour, especially not in a place like Puerto Rico.","elements":[]},{"text":"Dwight says he would like to introduce Michael to his mother. But in Fun Run, two seasons earlier, Dwight suggests to Angela that she should bury Sprinkles \"in the east field, with Mother,\" implying his mother is dead.","elements":[]},{"text":"While Michael is talking to Toby, the monitor changes from Microsoft Word to the Dunder Mifflin desktop between two set-ups.","elements":[]}]}],"images":[]},{"title":"Deleted Scenes","level":2,"content":[{"type":"list","elements":[{"text":"Erin tells everyone that there is Coco Leche on her desk. No one cares about her. Pam, from experience, tells her not to make announcements and that Kevin will eat them.","elements":[]},{"text":"Kevin comes to the reception desk, and takes much of the Coco Leche. Erin announces that it is going fast.","elements":[]},{"text":"Michael sweet talks Helene who left her socks at Michael's condo. Michael sexually calls her \"bad.\"","elements":[]},{"text":"Pam yells even louder and then throws up.","elements":[]},{"text":"Pam is pissed and explains that Michael Stupid Scott is dating her mother. She says that she has to be the adult however, because \"Michael is incapable.\"","elements":[]},{"text":"Michael calls Pam a bully.","elements":[]},{"text":"Michael complains to Jim about Pam and tells him to talk to her. Jim begins complimenting Michael, who in turn insults himself, so that neither one will have to talk to her.","elements":[]}]}],"images":[]},{"title":"Cast","level":2,"content":[],"images":[]},{"title":"Main Cast","level":3,"content":[{"type":"list","elements":[{"text":"Steve Carell as Michael Scott","elements":[]},{"text":"Rainn Wilson as Dwight Schrute","elements":[]},{"text":"John Krasinski as Jim Halpert","elements":[]},{"text":"Jenna Fischer as Pam Halpert","elements":[]},{"text":"B.J. Novak as Ryan Howard","elements":[]}]}],"images":[]},{"title":"Supporting Cast","level":3,"content":[{"type":"list","elements":[{"text":"Ed Helms as Andy Bernard","elements":[]},{"text":"Leslie David Baker as Stanley Hudson","elements":[]},{"text":"Brian Baumgartner as Kevin Malone","elements":[]},{"text":"Creed Bratton as Creed Bratton","elements":[]},{"text":"Kate Flannery as Meredith Palmer","elements":[]},{"text":"Mindy Kaling as Kelly Kapoor","elements":[]},{"text":"Ellie Kemper as Erin Hannon","elements":[]},{"text":"Angela Kinsey as Angela Martin","elements":[]},{"text":"Paul Lieberstein as Toby Flenderson","elements":[]},{"text":"Oscar Nunez as Oscar Martinez","elements":[]},{"text":"Phyllis Smith as Phyllis Vance","elements":[]}]}],"images":[]}]}