{"sections":[{"title":"The Deposition","level":1,"content":[{"type":"paragraph","text":"\"The Deposition\" is the 12th episode of the fourth season of The Office and the 65th overall. It was written by Lester Lewis and directed by Julian Farino. It first aired November 15, 2007. It was viewed by 8.86 million people."}],"images":[]},{"title":"Synopsis","level":2,"content":[{"type":"paragraph","text":"Michael shows us how he impresses people by having Pam give him fake messages telling him there's a call for him so he can say he'll call back later no matter how important the call or caller may be. On one occasion, Ryan is visiting, and Pam brings the usual fake message. Michael initially passes it up, but Ryan insists that customer service is the first priority and has Michael take the call, which requires Michael to do a surprise bit of improv."},{"type":"paragraph","text":"Jan and Michael drive to the corporate office in New York City to do a deposition for Jan's lawsuit over her dismissal. They rehearse Michael's testimony in the car, and he makes up absurd mnemonic devices so he won't forget what to say. He has also memorized Jan's answers and plans to throw in some \"errs\" and \"ahhs\" for the deposition to appear not so scripted."},{"type":"paragraph","text":"Meanwhile, back at the warehouse, Darryl is wiping Jim out in a ping pong game while Pam and Kelly watch. Kelly goes all trash talk on Pam, about how Pam's boyfriend \"sucks\" at ping pong, but Kelly calls it \"talking smack.\" Pam gets ticked off and sets up a practice ping pong table in the conference room so she can get back at Kelly by way of Jim and Darryl. She gets Kevin and then Dwight as \"sparring partners\" for Jim, but Dwight easily defeats Jim. Dwight reveals for the first time that he is a huge lifelong table tennis fan, and he reels off the names of immortals of the sport whom he idolizes."},{"type":"paragraph","text":"At corporate, Michael is (maybe) all set to support Jan during the deposition hearing, but Ryan then takes him aside and urges him to do the right thing and not hurt Dunder Mifflin. Michael agrees and then is left with a terrible conflict. Michael's testimony starts well when he mentions the inappropriate way corporate handled Jan's situation, but his comments about her drinking and about apparent conflicts in statements he made about the nature of their relationship and when it started to cause problems."},{"type":"paragraph","text":"When he finds out that Jan has stolen his diary in order to prove the timeline of their relationship, Michael is extremely upset. Jan points out that he emailed a nude photo of her to the entire company. Toby tries to comfort him, to no avail."},{"type":"paragraph","text":"Then, to add insult to injury, Dunder Mifflin's attorney reveals to Michael that Jan gave him a scathing performance review after they had begun dating. In it, she argued that Michael is an unmanageable employee and unfit for his position as branch manager, and should be demoted."},{"type":"paragraph","text":"In a last-ditch attempt to win Michael back to her side, Jan has her lawyer read the deposition of David Wallace. From it, Michael, who always felt that he was a front-runner for the job at Corporate, learns that Wallace reluctantly admitted that, while Michael is a nice guy, he was never a serious contender for the job."},{"type":"paragraph","text":"But David has shown more consideration to Michael than Jan so, when asked if he believes Dunder Mifflin really showed a pattern of mistreatment to Jan, Michael declares that it did not. He does not hold David's words against him, stating \"You expect to get screwed by your company. But you never expect to get screwed by your girlfriend.\""},{"type":"paragraph","text":"Michael and Jan drive home, clearly angry at each other. Jan suggests they pick up some Chinese food. Michael states he'd prefer something cheap, and Jan replies that Chinese is cheap. They agree to fast food."}],"images":[]},{"title":"Trivia","level":2,"content":[{"type":"list","elements":[{"text":"The Hiya buddy! drawing was sketched freehand by producer Greg Daniels. The crew then had to try several times to reproduce the drawing on a Post-It note. The original drawing can be seen in the introductory video to the Writer's Block on the Season 4 DVD: Look on the whiteboard behind Mindy Kaling when she throws the football. Greg Daniels' artistic talent also appeared in the episode The Client.","elements":[]},{"text":"Jan and Michael drive to NYC in a PT Cruiser.","elements":[]},{"text":"The Robert Mifflin memorial conference room is just the Corporate reception area set with different wall paneling and furniture.","elements":[]},{"text":"For the final scene, Rainn Wilson and Michael Schur merely mimed playing ping pong, and the ball and sound effects were added later. In some takes, they dove wildly for the ball.","elements":[]},{"text":"This is the first time Mose has left Schrute Farms assuming Michael's description in Office Olympics is correct and Mose hasn't left the farm in the interim.","elements":[]},{"text":"This episode marks a change in Kelly's style. She is seen wearing a brightly colored wrap dress here and in several subsequent episodes, which is a bit of a stylistic change from her earlier outfits.","elements":[]},{"text":"In the scene where Dwight is listing off professional table tennis players, a white square is visible in the reflection of his glasses. It is possible that the names were memorized but it is also possible that the reflection is that of a piece of paper from which he is reading the names.","elements":[]}]}],"images":[]},{"title":"Amusing details","level":2,"content":[{"type":"list","elements":[{"text":"The talking head interviews are conducted in the annex because the conference room is being used for ping pong.","elements":[]},{"text":"When Michael reveals the document that Jan and Michael had to provide to H.R. disclosing their relationship in Cocktails, he claims that he will frame the document. When he reveals the document during the deposition, it is in a frame.","elements":[]}]}],"images":[]},{"title":"Cast","level":2,"content":[],"images":[]},{"title":"Main Cast","level":3,"content":[{"type":"list","elements":[{"text":"Steve Carell as Michael Scott","elements":[]},{"text":"Rainn Wilson as Dwight Schrute","elements":[]},{"text":"John Krasinski as Jim Halpert","elements":[]},{"text":"Jenna Fischer as Pam Beesly","elements":[]},{"text":"B.J. Novak as Ryan Howard","elements":[]}]}],"images":[]},{"title":"Supporting Cast","level":3,"content":[{"type":"list","elements":[{"text":"Melora Hardin as Jan Levinson","elements":[]},{"text":"Ed Helms as Andy Bernard","elements":[]},{"text":"Leslie David Baker as Stanley Hudson","elements":[]},{"text":"Brian Baumgartner as Kevin Malone","elements":[]},{"text":"Creed Bratton (actor) as Creed Bratton","elements":[]},{"text":"Kate Flannery as Meredith Palmer","elements":[]},{"text":"Mindy Kaling as Kelly Kapoor","elements":[]},{"text":"Angela Kinsey as Angela Martin","elements":[]},{"text":"Paul Lieberstein as Toby Flenderson","elements":[]},{"text":"Oscar Nunez as Oscar Martinez","elements":[]},{"text":"Craig Robinson as Darryl Philbin","elements":[]},{"text":"Phyllis Smith as Phyllis Vance","elements":[]}]}],"images":[]},{"title":"Recurring Cast","level":3,"content":[{"type":"list","elements":[{"text":"Andy Buckley as David Wallace","elements":[]},{"text":"Michael Schur as Mose Schrute","elements":[]},{"text":"Calvin Tenner as Calvin (Uncredited)","elements":[]}]}],"images":[]},{"title":"Guest Cast","level":3,"content":[{"type":"list","elements":[{"text":"Holly Maples as Diane Kelly","elements":[]},{"text":"Patrick O'Connor as Lester Schneider","elements":[]},{"text":"Michael Potter as Court Reporter","elements":[]},{"text":"Valeri Ross as Stenographer","elements":[]}]}],"images":[]},{"title":"References","level":2,"content":[{"type":"list","elements":[{"text":"↑ Season 4 DVD commentary for The Deposition.","elements":[]},{"text":"↑ The Scrum, Podcast XIX: Michael Schur","elements":[]}]}],"images":[]}]}