{"sections":[{"title":"The Banker","level":1,"content":[{"type":"paragraph","text":"\"The Banker\" (alternately titled, \"Clip Show\") is the fourteenth episode of the sixth season of The Office and the 114th episode overall. It was written by Jason Kessler and was directed by Jeffrey Blitz, who directed Stress Relief and Business Ethics. It aired on January 21, 2010, and is partially a clip show. It was viewed by 7.29 million people."}],"images":[]},{"title":"Synopsis","level":2,"content":[{"type":"paragraph","text":"An investment banker comes to Scranton to perform a \"due diligence\" check on Dunder Mifflin to verify that the company can be purchased without any hidden liabilities. Michael is devoted to making the branch look good, including replacing Stanley Hudson with an attractive young man and having Dwight pose as the branch HR representative. The second ruse is exposed when Toby returns to his desk, however. The banker asks Toby about any misconduct in the company (for example, time wasting), and after every question, several flashbacks are shown from previous episodes regarding the topic being discussed. Toby admits to the documentary crew that he doesn't want to lie, \"and I don't want to tell the truth.\""},{"type":"paragraph","text":"Michael comes to talk to the banker. When the banker asks a question about if anyone is near retirement age, Michael and Toby awkwardly look at each other and flashbacks of Creed are shown. Dwight eavesdrops on the banker checking back with the main office and begins to get suspicious that the banker may not sign off on the deal."},{"type":"paragraph","text":"Over Toby's objection, Michael brings up that many people in the office have been in sexual relationships. Scenes of many office relationships are shown."},{"type":"paragraph","text":"After the banker leaves, Michael expresses sympathy for the banker because he must determine the value of the office. Michael says that he doesn't care about the banker's opinion. Everyone waits for the banker to say he'll buy the company, however, it never happens."}],"images":[]},{"title":"Amusing Details","level":2,"content":[{"type":"list","elements":[{"text":"Michael had \"helmet hair\" in this episode (flat and compressed), thanks to the helmet he wore while riding the Segway. The practical reason for this is that actor Steve Carell had just returned from filming a movie for which he had his hair cut very short.","elements":[]},{"text":"Ryan Howard still works inside the closet in the break room.","elements":[]},{"text":"Most of the office didn't have lines and this was the first episode where Jim Halpert had no lines.","elements":[]},{"text":"During the flashback to the hot dog eating contest from Beach Games in Season 3, Michael tells Phyllis to \"dip it in the water so it slides down your gullet more easily,\" to which everyone responds, \"That's what she said!\" This is from a deleted scene not shown in the episode.","elements":[]}]}],"images":[]},{"title":"Connections to Previous Episodes","level":2,"content":[{"type":"list","elements":[{"text":"Michael's parking space reads \"Employee of the Month\" which was introduced in Scott's Tots. Michael expressed how much he wanted to win Employee of the Month to Jim, who told him it wasn't possible because he was a branch co-manager. ","elements":[]},{"text":"Dunder Mifflin was bought out in the episode, Secret Santa. Dunder Mifflin started to become insolvent in the episode, Murder.","elements":[]}]}],"images":[]},{"title":"List of Scenes","level":2,"content":[],"images":[]},{"title":"Q: \"Are there any outstanding liability issues? Safety issues, injuries, that could leave the company open to potential lawsuits?\"","level":3,"content":[{"type":"list","elements":[{"text":"Michael knocks over shelves with the forklift.","elements":[]},{"text":"Michael hits Meredith with his car.","elements":[]},{"text":"Dwight launches a spud with his spud gun, crashing it into Darryl's office in a deleted scene.","elements":[]},{"text":"Dwight and Michael test the trampoline with a watermelon, which lands on Stanley's car.","elements":[]},{"text":"Andy jumps onto an empty refrigerator box, which collapses, while performing Parkour with Dwight and Michael.","elements":[]},{"text":"Dwight starts a fire to test his co-workers' knowledge of the fire evacuation procedure, and clips of the ensuing panic.","elements":[]},{"text":"Jim slams the brakes in his car, pushing Dwight's head into the back of Jim's seat.","elements":[]},{"text":"Dwight traps the loose bat and Meredith's head inside a garbage bag.","elements":[]}]}],"images":[]},{"title":"Q: \"Are people generally happy?\"","level":3,"content":[{"type":"list","elements":[{"text":"Andy punches a hole into the wall.","elements":[]},{"text":"Pam slaps Michael in the face for dating her mother.","elements":[]},{"text":"Dwight takes a couple jabs at Michael, who granted him a free shot.","elements":[]},{"text":"Jim slaps Dwight for not answering the \"door\" in a \"Ding-Dong\" joke, in answer to a joke told by Dwight to Michael.","elements":[]},{"text":"Dwight attempts to knock Michael unconscious while driving him to the \"wilderness\".","elements":[]},{"text":"Phyllis throws her crumpled-up notes on how to deal with Angela, in Angela's face.","elements":[]},{"text":"Kelly slaps Michael for mocking people of her ethnicity.","elements":[]},{"text":"Oscar shoves Angela out of his way, and Dwight tries to go after him.","elements":[]},{"text":"Michael asks, \"Can't we all just get along?\"","elements":[]}]}],"images":[]},{"title":"Q: \"Sexual harassment?\"","level":3,"content":[{"type":"list","elements":[{"text":"Michael refers to a picture of Stanley's daughter as \"hot\" and \"center-fold\" and says that he enjoys staring at it.","elements":[]},{"text":"Pam walks in on Michael while he is changing in his office.","elements":[]},{"text":"Toby asks Meredith to pull down her dress, one of her breasts falls out, and then she pulls it up to reveal she isn't wearing any undergarments.","elements":[]},{"text":"Michael hugs and kisses Phyllis after one of Packer's jokes offended her.","elements":[]},{"text":"Dwight thinks that Meredith's vagina was removed during her hysterectomy.","elements":[]},{"text":"Michael declares he will no longer tell jokes or forward jokes by email, his \"retirement from comedy\" including \"that's what she said\", then Jim gets him to immediately break it when he provokes him with many \"that's what she said\" lines.","elements":[]},{"text":"Kevin asks Michael why he got the Christmas tree so big, and Michael answers, \"That's what she said.\"","elements":[]},{"text":"The doctor asks if Michael's foot is \"red, or swollen\" and Dwight answers, \"That's what she said.\"","elements":[]},{"text":"Michael adds a \"that's what she said\" after he asks about a \"Phyllis-Angela dispute\" and Angela replies, \"You already did me.\"","elements":[]},{"text":"Michael directs Phyllis to dip her hot dog in the water so it will slide down her gullet more easily, and several employees remark with \"that's what she said.\"","elements":[]}]}],"images":[]},{"title":"Q: \"Waste of time and resources?\"","level":3,"content":[{"type":"list","elements":[{"text":"Michael and Dwight go on an \"old-fashioned raid, sales on accounting\" and dump binders and papers on the floor.","elements":[]},{"text":"Phyllis and Kevin play Flonkerton, Phyllis winning \"by a nose\" and Jim and Pam announcing.","elements":[]},{"text":"Dwight finds his desk missing, while Jim acts baffled as well. (Jim relocated it to the men's room which is not shown in the clip.)","elements":[]},{"text":"Dwight finds his desk and chair wrapped in gift wrap, but when he sits down, the desk and chair collapse.","elements":[]},{"text":"Dwight opens his desk drawer to find his stapler suspended in Jell-O and accuses Jim of putting his stuff in Jell-O again.","elements":[]},{"text":"Michael wobbles into the conference room in his sumo suit as his Michael Klump character.","elements":[]},{"text":"Stanley charges at Jim, both in sumo suits at the \"beach\", and Jim runs in fear.","elements":[]},{"text":"Jim impersonates Dwight including his speech, topics of conversation, and dress, and Dwight catches on, informing him of the seriousness of identity theft.","elements":[]}]}],"images":[]},{"title":"Q: \"Is anyone near retirement age?\"","level":3,"content":[{"type":"list","elements":[{"text":"Michael introduces Creed to the children of various office employees, and Creed asks if they have ever seen a foot with four toes.","elements":[]},{"text":"Michael reads a complaint filed by Ryan about Creed's \"old man\" smell, which Creed attributes to the Mung beans he sprouts in his desk and eats throughout the day.","elements":[]},{"text":"Oscar, just back from vacation, asks where Dwight is. Without pause, Creed says that he was decapitated and that they had a funeral for a bird.","elements":[]}]}],"images":[]},{"title":"A: \"This is a building where friends become lovers and lovers become sexually interactive\"","level":3,"content":[{"type":"list","elements":[{"text":"Jan forcefully kisses Michael.","elements":[]},{"text":"Angela kisses Andy to make Dwight jealous.","elements":[]},{"text":"Dwight kisses Angela, and Jim discovers them.","elements":[]},{"text":"Darryl advises Kelly to access her \"uncrazy side\", and the ensuing talking head interview with Kelly.","elements":[]},{"text":"Kelly kisses Ryan in celebration that they don't have to break up because their jobs are safe.","elements":[]},{"text":"Michael complains to Jan about his vasectomies.","elements":[]},{"text":"Kelly tells Ryan that she's pregnant, and the ensuing talking head interview with her where she admits she's lying.","elements":[]},{"text":"Michael kisses Oscar.","elements":[]},{"text":"Kevin tells Creed, \"Jim has got it bad for Pam.\" Creed asks, \"Which one is Pam?\"","elements":[]},{"text":"A drunk Pam falls off her barstool.","elements":[]},{"text":"Pam tells a jinxed Jim, \"You can tell me anything.\"","elements":[]},{"text":"Pam and Jim listen to music together on his iPod.  (Sing by Travis plays and continues through the next clips.)","elements":[]},{"text":"Jim and Pam encourage Dwight to ask out the purse girl.","elements":[]},{"text":"Pam kisses Roy before the basketball game starts.","elements":[]},{"text":"A drunk Pam kisses Jim after receiving her Dundie.","elements":[]},{"text":"Pam looks inside the teapot Jim gave her for Christmas.","elements":[]},{"text":"Jim leaves Pam after kissing her on Casino Night.","elements":[]},{"text":"Pam's talking head wishing Jim well on his new job, ending with Jim interrupting the interview to ask her to dinner.","elements":[]},{"text":"Jim proposes to Pam.","elements":[]},{"text":"Jim and Pam kiss at their wedding.","elements":[]},{"text":"Pam rests her head on Jim's shoulder at Niagara falls.","elements":[]},{"text":"Pam rests her head on Jim's shoulder on Diversity Day.","elements":[]}]}],"images":[]},{"title":"Trivia","level":2,"content":[{"type":"list","elements":[{"text":"David Costabile is the third member of The Wire to appear on The Office, following Amy Ryan (Holly Flax) and Idris Elba (Charles Miner).","elements":[]},{"text":"John Krasinski (Jim Halpert) does appear at the very end of this episode. He's briefly seen with the transition from the clip show and is standing by Jim's office.","elements":[]},{"text":"This episode is the only clip show in the entire series. (A clip show is where the bulk of the plot is shown through clips from previous episodes).","elements":[]},{"text":"One of the clips shown is Michael telling Phyllis to dip the hotdogs in water to make it \"slide down her gullet faster\". In the clip shown, the entire cast says \"that's what she said\" in unison. However, in Beach Games, where this scene actually occurs, the cast falls silent when Michael says this.","elements":[]}]}],"images":[]},{"title":"Cultural references","level":2,"content":[{"type":"list","elements":[{"text":"Lady Gaga is a musician known for her outlandish make-up and costumes. She intentionally portrays herself androgynously.","elements":[]},{"text":"Michael rides a Segway device. The device was introduced to great fanfare in 2002 but quickly became relegated to a niche product.","elements":[]},{"text":"H.R. Pufnstuf was a live-action life-size puppet television program.","elements":[]},{"text":"NFL stands for National Football League, the professional American football league in the United States. It celebrated its 50th anniversary in 1970 and not 1972 as claimed by \"Computron\".","elements":[]},{"text":"Maine Lobster is a variety of lobster found in the Atlantic coast of North America.","elements":[]},{"text":"Mul Yam is a seafood restaurant in Tel Aviv, considered by many to be the best restaurant in Israel.","elements":[]},{"text":"Cooper's Seafood is a Scranton seafood restaurant.","elements":[]},{"text":"The song Michael and Dwight sing at the end of the episode prior to the credits is a parody of Lazy Sunday, a musical skit by The Lonely Island made for Saturday Night Live.","elements":[{"text":"The song was first used in Season 3's episode The Merger, where Michael attempts to welcome all of the new empoyees from Stamford to Scranton.","elements":[]}]}]}],"images":[{"src":"https:\/\/vignette.wikia.nocookie.net\/theoffice\/images\/6\/60\/MichaelSegway.jpg\/revision\/latest\/scale-to-width-down\/150?cb=20100208081218","caption":"Michael on a Segway"}]},{"title":"Cast","level":2,"content":[],"images":[]},{"title":"Main Cast","level":3,"content":[{"type":"list","elements":[{"text":"Steve Carell as Michael Scott","elements":[]},{"text":"Rainn Wilson as Dwight Schrute","elements":[]},{"text":"John Krasinski as Jim Halpert","elements":[]},{"text":"Jenna Fischer as Pam Halpert","elements":[]},{"text":"B.J. Novak as Ryan Howard","elements":[]}]}],"images":[]},{"title":"Supporting Cast","level":3,"content":[{"type":"list","elements":[{"text":"Ed Helms as Andy Bernard","elements":[]},{"text":"Leslie David Baker as Stanley Hudson","elements":[]},{"text":"Brian Baumgartner as Kevin Malone","elements":[]},{"text":"Creed Bratton (actor) as Creed Bratton","elements":[]},{"text":"Kate Flannery as Meredith Palmer","elements":[]},{"text":"Mindy Kaling as Kelly Kapoor","elements":[]},{"text":"Ellie Kemper as Erin Hannon","elements":[]},{"text":"Angela Kinsey as Angela Martin","elements":[]},{"text":"Paul Lieberstein as Toby Flenderson","elements":[]},{"text":"Oscar Nunez as Oscar Martinez","elements":[]},{"text":"Craig Robinson as Darryl Philbin","elements":[]},{"text":"Phyllis Smith as Phyllis Vance","elements":[]}]}],"images":[]},{"title":"Guest Cast","level":3,"content":[{"type":"list","elements":[{"text":"David Costabile as Eric Ward; The Banker","elements":[]}]}],"images":[]},{"title":"Only Appearing in Clip Footage","level":3,"content":[{"type":"list","elements":[{"text":"Melora Hardin as Jan Levenson","elements":[]},{"text":"David Denman as Roy Anderson","elements":[]},{"text":"David Koechner as Todd Packer","elements":[]},{"text":"Rashida Jones as Karen Filippelli","elements":[]},{"text":"Bobby Ray Shafer as Bob Vance","elements":[]},{"text":"Amy Ryan as Holly Flax","elements":[]}]}],"images":[]},{"title":"References","level":2,"content":[{"type":"list","elements":[{"text":"↑ Hair today, gone tomorrow, Office Tally, January 22, 2010","elements":[]}]}],"images":[]}]}