{"sections":[{"title":"The Search","level":1,"content":[{"type":"paragraph","text":"\"The Search\" is the fifteenth episode of the seventh season of the American television comedy series The Office and the show's 141st overall. It was written by Brent Forrester and directed by Michael Spiller. It originally aired on February 3, 2011. It was viewed by 7.29 million people."}],"images":[]},{"title":"Plot","level":2,"content":[{"type":"paragraph","text":"Michael continues to try to ask Holly to get back together with him, but she continually refuses, stating she doesn't want a relationship with someone she works with. Michael and Jim then go out on a sales call. After landing the sale, an irritable Michael needs to stop to use the bathroom. While at a gas station, Jim gets a call from Pam's mother Helene, who was taking a feverish Cece to see the doctor when she accidentally locked the child in the car. Jim leaves to attend to Cece, but not before attempting in vain to tell Michael through the door of the bathroom; he also tells a guy in coveralls to tell Michael what happened, but the guy is a customer rather than a gas station employee and drives away. Michael is left at the gas station with no way of contacting the office, as his cell phone and wallet are with Jim and he doesn't remember the office's number, so he ends up wandering around Scranton and making stops at a pet store and a hot dog stand."},{"type":"paragraph","text":"Jim, now with Cece, calls Pam and tells her Michael is at the gas station, so Holly, Dwight, and Erin plan to head out before Dwight insults them both and says he'll lead the expedition. Dwight and Erin are rude to Holly, but when Dwight suggests that he walked back to the office, Holly correctly guesses that he went in the direction of the bakery next door \"just for the smell of it\". After stopping at a grocery store to get some things for Pam, Dwight and Erin notice Holly changing cell phone services at a kiosk outside the store. They and the kiosk attendant are annoyed to discover that Holly used a joke name to complete the forms in order to get a rubber stress ball, but when the attendant mentions that someone else had done the exact thing earlier, Dwight and Erin recognize a fake name that is used by Michael. Believing that Holly can subconsciously determine where Michael has been, they follow her to a Chinese restaurant, where they find his picture on the wall along with others who have dined there without paying (Creed also being among them, twice)."},{"type":"paragraph","text":"Michael eventually runs away from the camera crew so they can't find him. Dwight demands Holly to tell him where Michael is, but Holly says she doesn't know. She suggests that they find a high vantage point at which they can try to spot him, but Dwight rejects this idea, and the two split up. Holly walks away while Dwight decides to look in a bowling alley. Holly heads up to the roof of a tall building to see if she can spot Michael from above. On the roof, she finds Michael who was similarly trying to spot the office from above. They both admit that they've missed each other and kiss. Erin, who opted to follow Holly instead of Dwight, walks in and is happy for Michael."},{"type":"paragraph","text":"Meanwhile, Pam notices her Sabre printer doodle on the refrigerator has funny captions that insult Sabre, and she gets the office to participate in a caption contest involving a cartoon of two dogs on a tropical island. Gabe, who finds the captions insulting, implements a list of annoying rules, stating that they can't insult Sabre or use pop culture references, and that they have to use new Sabre \"sticky quips\". The office instead decides to use an instant messenger to share quips. Gabe catches them and prints out the list of quips and reads them to the office, which start off insulting Sabre before they attack Gabe personally. The favored entry involves one where one of the dogs says he's going to piss on one of the palm trees because it reminds him of Gabe; an interview reveals that Angela came up with that one. The office continues to get good laughs out of the ones that insult Gabe, who is once again defeated and miserable."}],"images":[]},{"title":"Captions from the IM chat","level":2,"content":[{"type":"list","elements":[{"text":"\"Darn it, Bob, I told you not to buy a Sabre brand lifeboat.\" —Unknown, possibly Kevin","elements":[]},{"text":"\"Wake up, Fred. The power cord on your Sabre printer shocked you into a coma, and you're dreaming you're a dog on a desert island.\" —Darryl","elements":[]},{"text":"\"You don't have to sniff my rear end anymore, Bob. I'm the only one here.\" —Gabe, not on the IM chat but made up on the spot","elements":[]},{"text":"\"Is that a palm tree, or did Gabe get skinnier? Either way, let's pee on it.\" —Angela, although she wouldn't admit it, winner of the contest","elements":[]},{"text":"\"Oh, thank God. I had a horrible nightmare that I was stuck in America with Gabe.\" —Oscar","elements":[]},{"text":"\"I know what it smells like but I didn't roll in anything. It's from listening to all of Gabe's bull—.\" —Meredith","elements":[]},{"text":"\"Isn't this the perfect romantic getaway, Erin? Sitting on a desert island in dog costumes? I'm Gabe, and I'm a weirdo.\" —Andy","elements":[]},{"text":"\"Gabe's mom. Hmm... Gabe's mom? Wait! Tall woman? Looks like Gabe? Yeah, I banged her.\" —Unknown, most likely Phyllis","elements":[]}]}],"images":[]},{"title":"Cultural references","level":2,"content":[{"type":"list","elements":[{"text":"Dwight categorizes Michael's facial style as marsupial. Most marsupials are characterized by the fact that they carry their young ones in a pouch; there are no universally common facial features among different marsupials that could apply when describing the face of a person. Dwight most likely thinks that Michael looks like a possum.","elements":[]},{"text":"According to Erin, Michael responds to Michael J. Fox, Mr. Fox, and The Incredible Mr. Fox, in addition to his own name.","elements":[]},{"text":"Michael's name for his millionaire character who farts popcorn is Orville Tootenbacher.","elements":[]}]}],"images":[]},{"title":"Connections to previous episodes","level":2,"content":[{"type":"list","elements":[{"text":"The jokes about Sabre printers malfunctioning reference back to The Cover-Up.","elements":[]},{"text":"Creed is on the Chinese restaurant's wall of shame for stealing because he loves to steal (Casino Night).","elements":[]}]}],"images":[]},{"title":"Trivia\/Continuity","level":2,"content":[{"type":"list","elements":[{"text":"Pam invented something she calls an \"APB\" which stands for \"Ask Pam Beesly\", but her last name has been Halpert since she married Jim a year and a half ago. In real-life, an APB stands for All-Points Bulletin.","elements":[]},{"text":"Creed is on the wall of thieves at the Chinese restaurant twice. The picture to the left of his is of him in a wig.","elements":[]},{"text":"Nobody is able to find out who wrote the IM caption about Gabe being a palm tree, but they should've been able to just look at the IM username.","elements":[]}]}],"images":[]},{"title":"Cast","level":2,"content":[],"images":[]},{"title":"Main cast","level":3,"content":[{"type":"list","elements":[{"text":"Steve Carell as Michael Scott","elements":[]},{"text":"Rainn Wilson as Dwight Schrute","elements":[]},{"text":"John Krasinski as Jim Halpert","elements":[]},{"text":"Jenna Fischer as Pam Halpert","elements":[]},{"text":"B.J. Novak as Ryan Howard","elements":[]},{"text":"Ed Helms as Andy Bernard","elements":[]}]}],"images":[]},{"title":"Supporting cast","level":3,"content":[{"type":"list","elements":[{"text":"Leslie David Baker as Stanley Hudson","elements":[]},{"text":"Brian Baumgartner as Kevin Malone","elements":[]},{"text":"Creed Bratton (actor) as Creed Bratton","elements":[]},{"text":"Kate Flannery as Meredith Palmer","elements":[]},{"text":"Mindy Kaling as Kelly Kapoor","elements":[]},{"text":"Ellie Kemper as Erin Hannon","elements":[]},{"text":"Angela Kinsey as Angela Martin","elements":[]},{"text":"Oscar Nunez as Oscar Martinez","elements":[]},{"text":"Craig Robinson as Darryl Philbin","elements":[]},{"text":"Phyllis Smith as Phyllis Vance","elements":[]},{"text":"Zach Woods as Gabe Lewis","elements":[]},{"text":"Amy Ryan as Holly Flax","elements":[]}]}],"images":[]},{"title":"Recurring cast","level":3,"content":[{"type":"list","elements":[{"text":"Linda Purl as Helene Beesly (voice only)","elements":[]}]}],"images":[]},{"title":"Guest cast","level":3,"content":[{"type":"list","elements":[{"text":"Ben Wang as Chinese Restaurant Waiter","elements":[]},{"text":"Eugene Cordero as Gas Station Attendant","elements":[]},{"text":"Cris D'Annunzio as Joe the Hot Dog Vendor","elements":[]},{"text":"Jesse Mackey as Jumpsuit Guy","elements":[]}]}],"images":[]}]}