{"sections":[{"title":"The Carpet","level":1,"content":[{"type":"paragraph","text":"\"The Carpet\" is the fourteenth episode of the second season of The Office and the 20th overall. It was written by Paul Lieberstein and directed by Victor Nelli Jr. It first aired on January 26, 2006. It was viewed by 8.6 million people."}],"images":[]},{"title":"Synopsis","level":2,"content":[{"type":"paragraph","text":"When someone deposits a malodorous substance on the carpet in Michael's office, he spends the day at Jim's desk, relegating Jim to a back room with Kelly. Michael institutes a sales contest, promising $100 (which later turns out to be $83) to the person who racks up the most sales that day."},{"type":"paragraph","text":"At his temporary new desk, Jim suffers Kelly's constant chattering. She asks Jim to hook her up with Ryan. Jim continues to yearn for Pam, but her fiancé, Roy, is in the office replacing the carpet along with Darryl, and Jim is unable to speak with her. Interestingly, while exiled in the back of the room, Jim makes an awkward (but later revealed to be a successful) attempt to ask Brenda, who joined the office on the Booze Cruise, out on a date.  As the day wears on, Michael becomes convinced that what happened to his office is a hate crime and an act of terrorism. Believing it to be done by someone in the office, he begins to lose his faith in his employees, who he considers his \"friends\". But his mood changes drastically when he finds out the object in his office was actually left there by his \"Best Friend Forever,\" Todd Packer. Michael instantly finds the joke hilarious, and his faith in his friends is restored. It is never revealed what the substance Todd left on the carpet is, but it can be seen in one shot, and it appears to be feces of some sort."},{"type":"paragraph","text":"At the end of the day, Jim is seen looking rather unhappy as he notices some unheard voicemails. He looks at the blinking light for a few seconds and decides to listen to all seven unheard voicemails, all left by Pam throughout the day. As we listen to the voicemails, Jim leaves work with a noticeable smile on his face."}],"images":[{"src":"https:\/\/vignette.wikia.nocookie.net\/theoffice\/images\/5\/5c\/The_carpet.jpg\/revision\/latest?cb=20120820200148","caption":"The smelly substance highly believed to be feces."}]},{"title":"Trivia","level":2,"content":[{"type":"list","elements":[{"text":"This episode is the only one which features an appearance by Ed Truck, the manager who preceded Michael. Ed is mentioned several times throughout the series.","elements":[]}]},{"type":"list","elements":[{"text":"This episode shares some characteristics with Episode Two of the UK version of the show, in which David Brent is offended that someone superimposed his face on a pornographic image until he finds out that it was his good friend, Chris Finch. Notably Finch and Packer do not physically appear in each episode, and in both episodes Michael\/David only discovers Packer\/Finch as the culprit over the phone near the end.","elements":[]}]},{"type":"list","elements":[{"text":"Rock 107, the radio station Dwight keeps calling, is an actual radio station in the Scranton area, WEZX.","elements":[]}]},{"type":"list","elements":[{"text":"This is the first episode in which Kelly is a chatterbox. In earlier episodes, she did not exhibit this personality trait.","elements":[]}]},{"type":"list","elements":[{"text":"This episode was originally intended to air before \"The Secret\".[1] This explains why this episode does not credit the non-starring cast as series regulars even though \"The Secret\" does.","elements":[]},{"text":"Michael says,\"I am Pam.\" to Pam and cites it as a \"Spicoli\", Sean Penn in \"Fast Times at Ridgemont High\", reference but it is actually from Sean Penn in \"I am Sam\".","elements":[]},{"text":"It is thought that the majority of this episode occurred on January 23, 2006","elements":[]}]}],"images":[]},{"title":"Behind the scenes","level":2,"content":[{"type":"list","elements":[{"text":"Unknown to the rest of the cast, Steve Carell had thrown a stinkbomb in Michael's office moments before shooting began on the scene in which employees smell the odor in his office.","elements":[]}]}],"images":[]},{"title":"Interesting details","level":2,"content":[{"type":"list","elements":[{"text":"Michael cuts short his first talking-head interview because the smell in his office is overpowering. When Michael leaves the office, notice that the cameraman was filming the interview from outside Michael's office. The smell was that bad it is the first instance of a talking head being cut short.","elements":[]},{"text":"According to the scoreboard in the office, Stanley appeared to be winning the sales competition and Michael was in last place.","elements":[]},{"text":"Above Kelly's desk hangs a whiteboard with quarterly sales numbers. Dwight had the most sales for the quarter","elements":[]},{"text":"When Packer calls Michael to reveal that he left him a \"package\", it is thought by some that he can be heard saying \"Shit on the floor, Michael\" as Michael is talking, but he is actually saying \"Sit on the throne\".","elements":[]},{"text":"Michael uses Jim's clients even though in future episodes Michael has his own clients as Regional Manager.","elements":[]},{"text":"Michael told Ed there was a problem with his pension to get him to come.","elements":[]},{"text":"It is implied that Todd Packer did the same thing he did to Michael to Ed Truck many years ago.","elements":[]},{"text":"Creed is the only one that finds what Packer did amusing.","elements":[]},{"text":"The article \"Top Salesman Award\" in the Dunder Mifflin Staff Newsletter reads as follows:","elements":[]}]},{"type":"paragraph","text":"\"Welcome to yet another exciting edition of the Dunder Mifflin Employee Newsletter. Thanks to all of the staff and new contributing writers for putting this together for all of you, and also many thanks to the folks at Designtown for printing this up for us. Hopefully you will find alot (sic) of useless information contained herein that will help you do your job better, faster and quicker and cheaper and happier."},{"type":"paragraph","text":"As anybody can easily tell, this newsletter doesn't really have alot (sic) to say. It's really just a prop to fill some space and sort of look like a newsletter without really being much of a newsletter at all. By typing alot (sic) of words in two columns on the front of this page, we can achieve the look of a newsletter without really reporting much news or provide any real information to the reader at all. In fact, at times we can probably get away with not using real english (sic) words, such as kjgowbiwiwpo, ovcviqvck, or the much beloved dfbiouvsulegphaelk. These words can also be strung together to form a sentence, paragraph or even a whole prop book, magazine or newspaper.\""},{"type":"paragraph","text":"This text then repeats. It is the same text used in the newsletter from The Alliance."}],"images":[]},{"title":"Deleted scenes","level":2,"content":[{"type":"paragraph","text":"The Season Two DVD will most likely contain a number of deleted scenes from this episode. Notable cut scenes include:"},{"type":"list","elements":[{"text":"In a talking head interview, Dwight believes that a higher power brought Michael to the desk next to him.","elements":[]},{"text":"In separate talking head interviews, Angela and Kevin speculate on who may have soiled Michael's carpet.","elements":[]},{"text":"A picture on Jim's computer prompts Kelly to begin chattering. Jim excuses himself to get some food and commiserates with Toby. In a talking-head interview, Toby admits, \"I don't even hear her any more.\" Jim eats his lunch in his car.","elements":[]},{"text":"Michael has computer problems and can't complete the sale. He walks the office and finds the others busy selling paper. The contest scoreboard shows Michael in last place.","elements":[]},{"text":"When Dwight loses a sale, Michael insists that he call the customer back and tell a joke. Dwight's joke falls flat, and Michael takes the phone. \"Sorry about that. Dwight is an idiot.\" Michael steals the sale.","elements":[]},{"text":"Roy and Darryl play a drinking game in Michael's office.","elements":[]},{"text":"Dwight and Angela have a secret conversation in the kitchen. Angela lends her support.","elements":[]},{"text":"In a talking head interview, Michael remembers his best friend ever. \"I wonder where he lives.\"","elements":[]}]}],"images":[]},{"title":"Cultural references","level":2,"content":[{"type":"list","elements":[{"text":"Michael attributes \"I Am Pam\" to \"Spicoli Guy\". The character of Sam in the movie I Am Sam is played by Sean Penn, who also played Jeff Spicoli in the movie Fast Times at Ridgemont High.","elements":[]},{"text":"Joe Rogan is the host of the reality game show Fear Factor, wherein contestants must do something dangerous or disgusting to advance.","elements":[]},{"text":"I will gladly pay you Tuesday for a hamburger today is a catch phrase of the character Wimpy from the Popeye cartoons.","elements":[]},{"text":"Presidents Day is a national holiday (formally known as Washington's Birthday) that falls on the third Monday of February.","elements":[]},{"text":"Working for the Weekend is a 1981 song by Loverboy.","elements":[]},{"text":"Michael's exclamation Out of sight, out of the contest is a modification of the adage \"Out of sight, out of mind,\" which means \"You don't think about things which you can't see.\"","elements":[]},{"text":"Michael misidentifies the home remodeling program Extreme Makeover: Home Edition as Extreme Home Makeover. It is actually known as this in some foreign markets.","elements":[]},{"text":"Ryan catches himself before he finishes the phrase Junk in the trunk, slang for large buttocks.","elements":[]},{"text":"Sudoku is a number puzzle that became wildly popular in 2005.","elements":[]}]}],"images":[]},{"title":"Cast","level":2,"content":[],"images":[]},{"title":"Main cast","level":3,"content":[{"type":"list","elements":[{"text":"Steve Carell as Michael Scott","elements":[]},{"text":"Rainn Wilson as Dwight Schrute","elements":[]},{"text":"John Krasinski as Jim Halpert","elements":[]},{"text":"Jenna Fischer as Pam Beesly","elements":[]},{"text":"B.J. Novak as Ryan Howard","elements":[]}]}],"images":[]},{"title":"Recurring cast","level":3,"content":[{"type":"list","elements":[{"text":"Mindy Kaling as Kelly Kapoor","elements":[]},{"text":"Brian Baumgartner as Kevin Malone","elements":[]},{"text":"Creed Bratton (actor) as Creed Bratton","elements":[]},{"text":"Oscar Nunez as Oscar Martinez","elements":[]},{"text":"David Denman as Roy Anderson","elements":[]},{"text":"Craig Robinson as Darryl Philbin","elements":[]},{"text":"David Koechner as Todd Packer","elements":[]},{"text":"Angela Kinsey as Angela Martin","elements":[]},{"text":"Leslie David Baker as Stanley Hudson","elements":[]},{"text":"Phyllis Smith as Phyllis Lapin","elements":[]},{"text":"Kate Flannery as Meredith Palmer","elements":[]},{"text":"Paul Lieberstein as Toby Flenderson","elements":[]}]}],"images":[]},{"title":"Guest cast","level":3,"content":[{"type":"list","elements":[{"text":"Ken Howard as Ed Truck","elements":[]}]}],"images":[]}]}