{"sections":[{"title":"The Negotiation","level":1,"content":[{"type":"paragraph","text":"\"The Negotiation\" (also referred to as \"Labor Negotiation\") is the eighteenth episode of the third season of The Office and the 47th overall. It was written by Michael Schur and directed by Jeffrey Blitz. It first aired on April 5, 2007. It was viewed by 6.7 million people."}],"images":[]},{"title":"Synopsis","level":2,"content":[{"type":"paragraph","text":"The episode opens with Roy waiting outside the building, presumably for Jim. Inside, Jim is talking to Karen on what they should do for the night. An infuriated Roy makes his way up to the office, first to speak to Pam until he sees Jim with Karen. He calls Jim by his last name, and advances on him with his fist raised. Pam screams at Roy to stop and Jim pushes Karen out of the way. As soon as Roy gets his hands on Jim, Dwight sprays large amounts of pepper spray at Roy (it spreads throughout the front of the office as well). In an interview, Dwight is seen crying, from the pepper spray, explaining that everybody laughed at him for bringing pepper spray in to the office. \"Who's laughing now?\" he asks smugly."},{"type":"paragraph","text":"A week later, Michael and Toby are talking to Jan over the speaker phone, and it is revealed that Roy has been fired, and that Darryl now wants a raise. In separate interviews, Pam says that the attack on Jim by Roy \"sucked\", and Jim says that he was lucky that Dwight had been there and that Roy was lucky that Dwight only used pepper spray. Dwight is then seen showing his cache of weapons that contains nun-chuks and ninja stars."},{"type":"paragraph","text":"Jim is then seen thanking Dwight, but Dwight will not accept the thanks. Jim then tries to give Dwight a gift, but Dwight claims he \"doesn't want it, doesn't need it, and won't accept it\". In an interview, Dwight explains his reasoning for not accepting the thanks, saying the \"real heroes\" were superheroes. Meanwhile, Oscar tells Angela about Dwight's brave efforts, and Angela struggles not to appear too enthralled, but is clearly very proud of Dwight."},{"type":"paragraph","text":"Michael and Jim are then seen in Michael's office, and Michael asks Jim to role-play as Darryl, asking for a raise. Michael is equipped with a list of negotiation tactics that he acquired from Wikipedia, \"the best thing ever\". In Michael's first tactic, he lowers his voice to create a position of power, but Jim is less than impressed. Michael's second tactic, \"leaving the room unexpectedly\", is a \"surprise\". When Michael leaves the room in their second role-play, somewhat expectedly, Jim starts talking quietly, stopping Michael on his way out the door, and confusing him."},{"type":"paragraph","text":"Later, Dwight recites the attack on Jim to Toby rather monotonously, ending his description of the events with \"...the end\". After Dwight leaves, Kelly and Ryan begin arguing in the next cubicle, rather loudly, and Toby, in an interview, questions whether Michael would have moved Ryan in with Kelly as a way to punish him, well aware that the relationship between Toby and Michael is rather unpleasant."},{"type":"paragraph","text":"Meanwhile, Darryl enters Michael's office, and Michael employs a tactic in which he changes the location at the last second, presumably as another way to gain a position of power. In the conference room, Michael attempts to employ a tactic in which he declines to speak first, but fails. While Darryl and Michael enter a discussion relating to Darryl's request for a raise, Michael stands and walks to the window, and Darryl notices that Michael is wearing a woman's power-suit."},{"type":"paragraph","text":"Michael quickly leaves the conference room, and desperately tries to prove Darryl wrong by getting Pam to look at his suit. Pam agrees that it is a woman's suit, and Michael says in an interview that he got it out of a clothing bin. Kevin asks Michael who makes the suit, and Michael looks at the label on the inside of the jacket (which is lined with pink silk). The label reads \"MISSterious\". Michael shows Pam the back of his pants, which don't use a belt, but thin elastic. Also, the pants don't have any pockets."},{"type":"paragraph","text":"Michael later regrets making one \"tiny\" little mistake in his negotiation: he \"wore a woman's clothes\"."},{"type":"paragraph","text":"Later, Karen tells Angela about the attack on Jim, and Angela experiences a euphoric interest in Dwight's bravery. Meanwhile, Michael is back to discussing Darryl's raise, and uses his tactic of lowering his voice, but ends up simply talking with a slow, strained voice."},{"type":"paragraph","text":"Pam apologizes to Jim, and Jim accepts her apology, but seems slightly resentful at Pam and Roy's connection. He comments on the way that Pam and Roy are \"bound to find their way back to one another eventually\". Still in discussion, Michael reveals to Darryl how much he makes each week, and Darryl seems to find Michael's salary unbelievably low, especially considering how long Michael has been with the company (fourteen years)."},{"type":"paragraph","text":"Meanwhile, Jim offers Dwight a free beer after work, but Dwight refuses this gesture, as well. Jim confides in Karen as to why Dwight is so easy to play pranks on, but so hard to be nice to. Karen tries to help, but suggests that Jim simply \"try and sell some paper\" so that they can take a trip. Kevin and Creed are later seen giving Michael money, presumably because they found out about Michael's low salary, and Stanley, in an interview, claims that Michael is still \"way overpaid\"."},{"type":"paragraph","text":"Eventually, Darryl convinces Michael to ring Jan and ask for a raise for himself. Outside Michael's office, Creed tells his version of the attack on Jim to Angela, but Creed is clearly confusing events, and Angela, disappointed, calls him \"useless\". Michael is then seen talking to Jan over the speaker phone, with Darryl nearby, and Jan says that Michael should come to Corporate Headquarters to negotiate a raise. Michael agrees, but almost backs out when he finds out he has to bring Toby. Michael is eventually convinced, though."},{"type":"paragraph","text":"Toby is grateful to get away from Ryan and Kelly's bickering, and Michael, Darryl and Toby head to Corporate HQ in Darryl's cramped truck."},{"type":"paragraph","text":"On the way there, Darryl says that his cousin has a big place in New York, and that Toby could stay with them. Michael says that he might stay, to which Darryl replies \"it's not that big\". Meanwhile, Kelly is describing the attack on Jim to Angela, but Kelly gets a phone call, and says that Angela should just look at Toby's report. While Kelly is on the phone, Angela takes the report from Toby's desk."},{"type":"paragraph","text":"At Corporate HQ, Michael enters Jan's office, with some encouragement from Darryl."},{"type":"paragraph","text":"Meanwhile, Roy returns to the office with a security guard to get his last paycheck, and apologizes to Jim. Dwight tenses and stands up, but doesn't do anything except discreetly take out his nun-chuks. On his way out, Roy convinces Pam to meet him for coffee after work to talk things through. As Roy leaves, Kevin warns Jim of Roy's presence in the office."},{"type":"paragraph","text":"At Corporate Headquarters, the negotiation begins. Michael meets Jan's new assistant, a young man, and asks Jan \"who's the boy-toy?\". After specifically being told not to bring their relationship in to the negotiation, Michael, disappointed at Jan's six percent raise offer, threatens Jan with no sex. Toby, who is being a third-party stand-in, writes something down, and Michael calls him a \"perv-ball\"."},{"type":"paragraph","text":"While getting coffee, it is initially tense between Pam and Roy, but eventually they talk openly. Roy is puzzled when Pam says she isn't going to try to win Jim over, saying if she does not, then all of what had happened would be for nothing. They hug, Pam wipes a tear from her face, and they part ways. Back at the office, Jim leaves a fake certificate of bravery on Dwight's desk, but Dwight unexpectedly sees through Jim's ploy, and Jim is left once again with no way to repay Dwight for his bravery."},{"type":"paragraph","text":"At HQ, Toby is asked to leave the room and Michael tells Jan about all the bad things that had happened to him lately: \"I accidentally cross-dressed...and then Darryl made me feel bad for not making any money...and then I had to ride up here with stupid Toby...and then your assistant was all young and hot...\". Jan eventually offers Michael a twelve percent raise."},{"type":"paragraph","text":"Michael reflects in an interview about the day's events. He claims that \"life isn't about salary - it's about perks, like having sex with Jan\", of which Jan is standing next to him and immediately rebuffs his comments as they leave. Back at the office, Angela tells Dwight about how proud she is of him, and they begin to passionately kiss. Jim emerges from the washroom and sees this from the window, a distance away. He quickly runs back inside the washroom, and says that he and Dwight are now even, because he won't tell anybody about what he saw."},{"type":"paragraph","text":"The episode closes with Andy returning from anger management.  He enters the office seemingly ready to make amends with his co-workers. However, he can barely get a word out when Dwight hits him with the pepper spray and Andy falls to the floor in pain. Toby is then seen confiscating all of Dwight's weapons (which include, a taser, a boomerang, handcuffs, a nightstick, a pair of brass knuckles, and a samurai sword) In an interview Dwight claims that unlike Hiro from Heroes and Bono, he is \"not a hero\"."}],"images":[]},{"title":"Trivia","level":2,"content":[{"type":"list","elements":[{"text":"As of this episode, Ed Helms (Andy Bernard) is credited as part of the main cast.","elements":[]},{"text":"In this episode, Michael mentions printing a list of negotiation tactics from Wikipedia and calls it \"the best thing ever.\"","elements":[]},{"text":"Ryan's middle name is revealed to be \"Bailey.\"","elements":[]},{"text":"This episode contains references or similarities to earlier episodes:","elements":[{"text":"Dwight confuses heroes and superheroes. (\"Diversity Day\")","elements":[]},{"text":"Admiration towards Bono. (\"Pilot\")","elements":[]},{"text":"Michael role-plays with Jim. (\"Halloween\")","elements":[]},{"text":"Kevin has Jim's back in case Roy gets violent. (\"Boys and Girls\")","elements":[]},{"text":"Darryl teaches Michael slang, and Creed returns money that Michael \"gave\" him. (\"Casino Night\")","elements":[]},{"text":"Jim mutters \"sex, Steve Martin ('Health Care' and 'Valentine's Day'), Teri Hatcher ('Michael's Birthday').\"","elements":[]},{"text":"Michael employs win-win-win negotiation skills. (\"Conflict Resolution\")","elements":[]},{"text":"Roy calls Pam \"Pammy\". (\"Cocktails\" and \"Hot Girl\")","elements":[]},{"text":"In the episode \"Boys and Girls\", Darryl says to Michael regarding his wage \"... but we get compensated very differently.\" And in the episode \"Email Surveillance\", Michael states \"There are certain things a boss does not share with his employees. His salary, that would depress them.\" However, in this episode, Darryl was more amazed than depressed to learn that Michael earns little more than he does.","elements":[]}]},{"text":"When Kelly answers the phone she deals with a customer that received an order of 12,000 reams of paper instead of the 12 reams that was ordered.","elements":[]}]}],"images":[]},{"title":"In the background","level":2,"content":[{"type":"list","elements":[{"text":"When Jim and Karen discuss their weekend plans, Creed is playing Spider Solitaire.","elements":[]}]}],"images":[]},{"title":"Amusing details- Caution, here be spoilers","level":2,"content":[{"type":"list","elements":[{"text":"When Darryl points out that Michael is wearing a woman's suit, Michael says that he \"would not make that mistake again,\" implying that he has made this mistake at least once before. He would, in fact, arguably make that mistake twice again. First in Launch Party, when he calls Pam, Kelly, Meredith, Angela, and Oscar into the conference room to ask if his shirt is too tight (the consensus is that it is too tight and it seems that it could be a woman's shirt), and second in the episode \"Nepotism\", when Erin mentions the pants that Michael wanted to return to Talbot's, a chain of high-end women's clothing stores.","elements":[]},{"text":"While waiting to speak to Jan, Michael is seated next to a woman wearing the same suit as he is.","elements":[]},{"text":"This will be the first of two times Dwight has his office weapons confiscated. (Three if you include the cutscenes from Season 8 Episode 5 \"Spooked\".)","elements":[]},{"text":"When Toby is confiscating Dwight's weapons he does not take his pepper spray.","elements":[]}]}],"images":[]},{"title":"Cultural references","level":2,"content":[{"type":"list","elements":[{"text":"The Philadelphia Phillies are a professional baseball team.","elements":[]},{"text":"Even Steven is an informal term meaning that a situation has been resolved equitably. Coincidentally, on The Daily Show, actor Steve Carell participated in a debate against Stephen Colbert in a regular sketch called Even Stevphen.","elements":[]},{"text":"Dwight's concept of \"real heroes\" comes from superheroes Superman and Batman.","elements":[]},{"text":"Roy picks up his last paycheck. Payment in the form of a paper check is still common in the United States.","elements":[]},{"text":"Wikipedia is a collaborative Web site. It is open to editing by anyone.","elements":[]},{"text":"Steve Martin is a comedian and actor. Teri Hatcher is an actress.","elements":[]},{"text":"Hillary Clinton is a prominent female politician.","elements":[]},{"text":"A gas card is a gift card which can be used to purchase gasoline. They are a form of scrip.","elements":[]},{"text":"The story of Han Solo comes from the first Star Wars movie.","elements":[]},{"text":"James Van Der Beek is an actor best known for his role on the teen drama Dawson's Creek, which went off the air four years before this episode takes place.","elements":[]},{"text":"Ross is a chain of discount clothing stores.","elements":[]},{"text":"Missy Elliott is a female rap artist.","elements":[]},{"text":"Trenton, New Jersey is the capital of the state of New Jersey, about two and a half hours' drive from Scranton.","elements":[]}]}],"images":[]},{"title":"Cast","level":2,"content":[],"images":[]},{"title":"Main Cast","level":3,"content":[{"type":"list","elements":[{"text":"Steve Carell as Michael Scott","elements":[]},{"text":"Rainn Wilson as Dwight Schrute","elements":[]},{"text":"John Krasinski as Jim Halpert","elements":[]},{"text":"Jenna Fischer as Pam Beesly","elements":[]},{"text":"B.J. Novak as Ryan Howard","elements":[]}]}],"images":[]},{"title":"Supporting Cast","level":3,"content":[{"type":"list","elements":[{"text":"David Denman as Roy Anderson","elements":[]},{"text":"Melora Hardin as Jan Levinson","elements":[]},{"text":"Ed Helms as Andy Bernard","elements":[]},{"text":"Leslie David Baker as Stanley Hudson","elements":[]},{"text":"Brian Baumgartner as Kevin Malone","elements":[]},{"text":"Kate Flannery as Meredith Palmer","elements":[]},{"text":"Mindy Kaling as Kelly Kapoor","elements":[]},{"text":"Angela Kinsey as Angela Martin","elements":[]},{"text":"Paul Lieberstein as Toby Flenderson","elements":[]},{"text":"Oscar Nunez as Oscar Martinez","elements":[]},{"text":"Phyllis Smith as Phyllis Vance","elements":[]}]}],"images":[]},{"title":"Recurring Cast","level":3,"content":[{"type":"list","elements":[{"text":"Craig Robinson as Darryl Philbin","elements":[]},{"text":"Rashida Jones as Karen Filippelli","elements":[]},{"text":"Creed Bratton (actor) as Creed Bratton","elements":[]},{"text":"Nicholas D'Agosto as Hunter","elements":[]}]}],"images":[]},{"title":"Guest Cast","level":3,"content":[{"type":"list","elements":[{"text":"Liz Ross as Woman in Waiting Room","elements":[]}]}],"images":[]}]}