{"sections":[{"title":"The Injury","level":1,"content":[{"type":"paragraph","text":"\"The Injury\" is the twelfth episode of the second season of The Office and the 18th overall. It was written by Mindy Kaling and directed by Bryan Gordon. It first aired on January 12, 2006. It was viewed by 10.3 million people."}],"images":[]},{"title":"Synopsis","level":2,"content":[{"type":"paragraph","text":"Michael burns his foot stepping on to a George Foreman grill, and then tries to convince his staff that he has a serious injury. To do this, he irritates the office (Pam and Ryan, notably) to help him with his \"injury\". For example: He asks Pam to spread butter on his foot, and when Michael falls off the toilet, he yells for Ryan to help him. When Ryan refuses to do this, Michael calls a meeting in the conference room. During all this, Dwight, who tries to pick Michael up and bring him in to work upon hearing of his injury, crashes his car exiting Dunder Mifflin's parking lot, giving himself a concussion. Because of this Dwight is more helpful and friendly to Pam, which Jim notes. In the conference room meeting, Michael shows pictures of handicapped people (Forrest Gump, Franklin D. Roosevelt, Tom Hanks as Josh Baskin in Big which he mistakes for Philadelphia.) Then the handicapped business park manager enters and is told he was invited by Michael to come. When he asks if anyone has any questions about the building rules, Dwight raises his hand and says nothing. When Michael tells the building's manager that they are similar because they are \"disabled\" this causes him to wheel out. When Jim sees him enter the elevator he asks Jim \"What's wrong with that guy?\" meaning Dwight. He then states that he looks like he has a concussion. Ryan, sick of Michael, puts medicine in his pudding to help him recover. While Michael is boasting about his recovery, Dwight collapses, and Jim and Michael (Michael being less than willingly) take him to the hospital. While Jim waits in the waiting room, he calls Pam at the office, and tells her that Michael is taking Dwight to get a CATscan. Angela tries to listen into this. The episode ends with Michael trying to stick his foot into the CATscan machine."}],"images":[]},{"title":"Deleted scenes","level":2,"content":[{"type":"paragraph","text":"The Season Two DVD contains a number of deleted scenes from this episode. Notable cut scenes include:"},{"type":"list","elements":[{"text":"Jim popping some of Michael's foot packaging bubbles. Jim then says he has had a grill for six years, and has never burnt himself on it because he does not use it as a pillow.","elements":[]},{"text":"Michael explains that sometimes when he is zoned out, he will pop some bubble wrap at home.","elements":[]},{"text":"Dwight explaining that the pioneers never wasted anything, and Jim says Michael should go to the hospital.","elements":[]},{"text":"Ryan is assigned to draw a handicapped sign for Michael so he can park closer to the building.","elements":[]},{"text":"Michael rubbing butter on his foot, and Angela passes and asks, \"Who made popcorn?\"","elements":[]},{"text":"Michael talking to someone on the phone, but he hangs up on him when Ryan walks in with Michael's movies. He rented some for Michael to watch, and then gives Michael some dark meat chicken. Michael then tells the camera no matter what you have, if you eat dark meat chicken, you can walk on the moon.","elements":[]},{"text":"Dwight using the copier to copy nothing. In a talking head interview, Dwight describes the signs of a concussion, but his explanation becomes disjointed and incoherent.","elements":[]},{"text":"Dwight getting scared that he needs to go into a machine. He then asks Michael if he will come into the room with him and stand next to him.","elements":[]},{"text":"Michael and Jim watch a movie in Spanish in the hospital waiting room.","elements":[]}]}],"images":[]},{"title":"Trivia","level":2,"content":[{"type":"list","elements":[{"text":"Brian Baumgartner and Angela Kinsey are caught out of character in the opening seconds of the episode. Kinsey admits that she didn't realize the cameras were rolling.","elements":[]},{"text":"Dwight refers to Pam's MP3 player as a Prism Durosport. In reality, it looks much more like a Creative Zen Micro. The show's writers developed a fake Web site for the Prism Durosport.","elements":[]},{"text":"In Christmas Party, Roy says he was planning to buy Pam an iPod, and since Pam traded with Dwight for the teapot, it makes sense for her to have an MP3 player from Roy.","elements":[]}]}],"images":[]},{"title":"Amusing details","level":2,"content":[{"type":"list","elements":[{"text":"When Michael says (in the conference room meeting), \"When I clamped my foot into a non-stick grill,\" Pam turns to Dwight and laughs.","elements":[]},{"text":"Michael's exasperated, \"I'm sick of Chuck E. Cheese,\" suggests that he goes to the children's restaurant often.","elements":[]},{"text":"Despite Michael's anger about Pam not having any messages, he did have messages when he showed up. Pam says he missed two calls from \"corporate.\"","elements":[]},{"text":"The talking heads are conducted outside of the break room, instead of the conference room, because of Michael resting there (in the conference room).","elements":[]},{"text":"After the exchange in which Dwight gives Pam the cover for her mp3 player he taps on the counter the same way Jim usually does as he walks away.","elements":[]},{"text":"When Jim, Michael, and Dwight are driving to the hospital, an allusion to a three person family, Jim being the Mother, Michael being the Father, and Dwight being the child, can possibly be seen.","elements":[]},{"text":"Pam has a standard MP3 Player instead of the video iPod that Roy was going to get her, implying that he instead took the cheaper route.","elements":[]},{"text":"Michael calls his mom to complain about coworkers several other times in the series.","elements":[]},{"text":"Creed says he was in an iron lung as a teenager, suggesting he had polio as a child.","elements":[]},{"text":"Michael is completely dry when he leaves the bathroom, even though when he falls you can hear several splashes.","elements":[]},{"text":"The property manager complains that someone parked in the handicap spot, and it is suggested that Michael was the one who did it. This goes back to him calling himself a disabled person.","elements":[]},{"text":"Michael says Meredith has \"one kid and no husband\", but several other times in the series it is referenced that she has more than one kid.","elements":[]},{"text":"Michael should not be at work if he is injured as he should have taken time off to recover.","elements":[]},{"text":"Dwight uses the the phrase \"that's what she said\" to which Michaels scolds him for it because it is his joke it is the first time someone other then Michael uses the phrase.","elements":[]},{"text":"Michael should have called an ambulance for Dwight if he suffered a concussion instead of driving himself to the hospital as it could likely lead to an accident.","elements":[]}]}],"images":[]},{"title":"Cultural references","level":2,"content":[{"type":"list","elements":[{"text":"Oscar mentions the Lord of the Rings trilogy, a series of movies released between 2001 and 2003.","elements":[]},{"text":"Michael interjects Sue me! into opening his talking head. The litigious nature of United States culture is reflected in its slang. \"Sue me!\" means roughly \"So what are you going to do about it?\", suggesting that if the listener doesn't like it, they can sue the speaker.","elements":[]},{"text":"A George Foreman Grill is a small cooking appliance sold under the name of the former heavyweight boxer. It has a hinged cover.","elements":[]},{"text":"Protruberance is a mispronunciation of protuberance.","elements":[]},{"text":"Stroudsburg is a town about an hour's drive from Scranton.","elements":[]},{"text":"Dwight mentions this Russian website where you can download songs for two cents apiece. At the time this episode aired, the Russian web site AllofMP3.com made songs available for pennies per song.","elements":[]},{"text":"Country Crock is a brand of oil-based butter substitute.","elements":[]},{"text":"Mail Boxes Etc. (a UPS company) is a chain of mailing supply stores.","elements":[]},{"text":"Stevie Wonder is a singer who is blind.","elements":[]},{"text":"Helen Keller is a woman who was deaf and blind. Larry Flynt is a publisher of pornography, paralyzed from a murder attempt. Franklin D. Roosevelt was the 32nd President of the United States and hid his paralysis from the public. Tom Hanks portrayed Forrest Gump, a man with low intelligence; He also played the adult Josh Baskin in Big, where the main character is a boy in a man's body.","elements":[]},{"text":"Born on the Fourth of July is a movie about a paralyzed Vietnam War veteran.","elements":[]},{"text":"Carbondale is a town about a half-hour's drive from Scranton.","elements":[]},{"text":"Shotgun is a protocol for determining who sits in the front passenger seat.","elements":[]},{"text":"Chuck E. Cheese is a chain of restaurants targeting children.","elements":[]}]}],"images":[]},{"title":"Cast","level":2,"content":[],"images":[]},{"title":"Main cast","level":3,"content":[{"type":"list","elements":[{"text":"Steve Carell as Michael Scott","elements":[]},{"text":"Rainn Wilson as Dwight Schrute","elements":[]},{"text":"John Krasinski as Jim Halpert","elements":[]},{"text":"Jenna Fischer as Pam Beesly","elements":[]},{"text":"B.J. Novak as Ryan Howard","elements":[]}]}],"images":[]},{"title":"Recurring cast","level":3,"content":[{"type":"list","elements":[{"text":"Leslie David Baker as Stanley Hudson","elements":[]},{"text":"Brian Baumgartner as Kevin Malone","elements":[]},{"text":"Creed Bratton (actor) as Creed Bratton","elements":[]},{"text":"Kate Flannery as Meredith Palmer","elements":[]},{"text":"Mindy Kaling as Kelly Kapoor","elements":[]},{"text":"Angela Kinsey as Angela Martin","elements":[]},{"text":"Paul Lieberstein as Toby Flenderson","elements":[]},{"text":"Oscar Nunez as Oscar Martinez","elements":[]},{"text":"Phyllis Smith as Phyllis Lapin","elements":[]},{"text":"Marcus A. York as Billy Merchant","elements":[]}]}],"images":[]},{"title":"Guest cast","level":3,"content":[{"type":"list","elements":[{"text":"David Doty as Doctor","elements":[]},{"text":"Julia Prud'homme as Nurse","elements":[]},{"text":"Stephen Pisani as Hospital Visitor (Uncredited)","elements":[]}]}],"images":[]}]}