{"sections":[{"title":"The Cover-Up","level":1,"content":[{"type":"paragraph","text":"\"The Cover-Up\" is the twenty-fourth episode of the sixth season and the 124th episode of The Office overall. It was written by Lee Eisenberg and Gene Stupnitsky who wrote Scott's Tots and The Lover and directed by Rainn Wilson, who marked his directorial debut with this episode. It aired on May 6, 2010. It was viewed by 6.84 million people."}],"images":[]},{"title":"Synopsis","level":2,"content":[{"type":"paragraph","text":"Jim and Pam prank Dwight by discussing him using Morse code in front of him. Dwight, who knows Morse code, asks Michael to intervene but cannot prove that the couple are doing anything more than clicking their office equipment. Michael, in a good mood due to his wildly successful relationship with Donna, is unsympathetic to Dwight's plight."},{"type":"paragraph","text":"During a meeting, Michael asks the office for recommendation for an upcoming trip with Donna. In the meeting, the other members of the office, particularly Ryan and Kelly, convince him that she might be cheating on him. Worried sick, Michael hires Dwight to tail her to see if she is spending time with anyone else. Dwight follows Donna to her gym and attempts to seduce her. Donna rebukes him and calls security on him, whereby he openly admits he was sent there by Michael to watch her. Dwight comes back to the office and says to Michael that Donna isn't cheating, and that Michael has to pay for his gym membership (since he must pay for any of the fees Dwight had during the investigation). An enraged Donna comes to the office to talk to Michael about the whole situation, but the two forgive each other and reconcile by planning a private vacation together."},{"type":"paragraph","text":"Andy receives a call from a concerned customer that a Sabre printer he bought caught fire during a routine print-job. Andy becomes frustrated when Gabe fails to take his customer's complaint seriously. Capitalizing on his fears, Darryl pranks Andy into believing he has uncovered a major conspiracy. Darryl is pranking Andy in retaliation for his blaming one of his mistakes on the warehouse a few years earlier, an act that put Darryl's career at Dunder Mifflin in jeopardy. After pretending to help Andy to not get fired for knowing that the printers may be dangerous, Darryl agrees to film Andy testing a printer in a typical fashion to test his burning printer theory. During the shooting of the video, while Darryl is pranking Andy into speaking with a high pitch voice, the printer indeed catches fire and explodes. This confirms Andy's suspicions, and terrifies Darryl who vows to never prank again."},{"type":"paragraph","text":"Both Pam and Kelly become suspicious when Donna, wearing earrings that no woman would buy for herself, cannot remember where she got them. While Donna and Michael are planning their trip, Pam investigates Donna's Facebook account and finds pictures of her hugging and kissing another man. At first she and Jim had been skeptical of Donna cheating, and even berated Michael for having destructive tendencies with his personal life, as well as his eating a bowl of mayonnaise and olives due to stress. But now they realize his fears had been correct and try to warn him as best they can. Pam shows Michael the pictures she found and he confronts Donna with the evidence. At the end of the episode, Donna reveals that she is indeed cheating, but not on Michael - with Michael. She is actually married to someone."},{"type":"paragraph","text":"In the last scene, Dwight is taking a spin class at Donna's gym. While Dwight is instructing the class (with an imaginary scenario involving going up a hill and cycling off a cliff), the instructor tries to regain control. Everyone in the class ends up listening to Dwight."}],"images":[]},{"title":"Trivia","level":2,"content":[{"type":"list","elements":[{"text":"The episode is dedicated to the memory of Larry Einhorn, father of Randall Einhorn, the show's director of photography and occasional director.","elements":[]},{"text":"The episode title continues in the tradition of titles with multiple meanings. In this episode, there are two cover-ups: Donna hides her married status, and Sabre hides the fact that their printers catch fire.","elements":[]},{"text":"Andy and Darryl test the printer in the storage room previously home to The Michael Scott Paper Company.","elements":[]},{"text":"The printer Andy and Darryl are testing is the Sabre 9900 All-in-One Color Ink-jet","elements":[]},{"text":"After the episode aired, the producers of the show created the Dwight Schrute, P.I. Web site in which Dwight offers his services as a private investigator.","elements":[]},{"text":"This is the first episode that Rainn Wilson directed. This season also featured John Krasinski and Mindy Kaling directing for the first time.","elements":[]},{"text":"The pictures Pam holds up are from the album \"profile pictures\" by \"Donna.\" The album has eleven photos, but both photos Pam shows are \"1 of 11.\" Everything else on the page is the same as well, including an advertisement for \"Sid Dexter's,\" titled \"Donna's Networks\" and saying \"find out who has been stalking your online profiles and searching your name.\" This suggests the prop team created an image and merely swapped the photos, as opposed to creating a fake profile or album for Donna or it could simply mean that the ads on Facebook didn't change, which frequently happens. It also appears that Pam has one unseen message and four unseen notifications.","elements":[]},{"text":"Angela is disgusted by Michael and Donna kissing, while Hank watches intently while eating cereal.","elements":[]},{"text":"Michael hangs up a fake phone call before he finishes talking. He does this several times while on pretend phone calls in the series.","elements":[]},{"text":"The scene where Michael is in the kitchen with Jim and Pam eating his “comfort food” (mayonnaise with black olives), you can see that his bowl, in between different camera angles, has moved further away from him, and then closer to him, and then back to being far away from him.","elements":[]}]}],"images":[]},{"title":"Cultural references","level":2,"content":[{"type":"list","elements":[{"text":"P.F. Chang's is an American casual dining restaurant chain which serves American-Chinese cuisine.","elements":[]},{"text":"Facebook is a widely popular social networking site that was launched on February 4, 2004.","elements":[]},{"text":"Andy's voice during the test prank sounds like Pinocchio from the Shrek movie.","elements":[]},{"text":"Meredith is seen reading the magazine Men's Health.","elements":[]},{"text":"Michael mentions a Weird Al and Spice Girls concert.","elements":[]},{"text":"The Great Wall, mentioned by Kelly, is a Chinese restaurant located in the San Fernando Valley in Los Angeles, CA.","elements":[]}]}],"images":[]},{"title":"Cast","level":2,"content":[],"images":[]},{"title":"Main cast","level":3,"content":[{"type":"list","elements":[{"text":"Steve Carell as Michael Scott","elements":[]},{"text":"Rainn Wilson as Dwight Schrute","elements":[]},{"text":"John Krasinski as Jim Halpert","elements":[]},{"text":"Jenna Fischer as Pam Halpert","elements":[]},{"text":"B.J. Novak as Ryan Howard","elements":[]},{"text":"Ed Helms as Andy Bernard","elements":[]}]}],"images":[]},{"title":"Supporting cast","level":3,"content":[{"type":"list","elements":[{"text":"Leslie David Baker as Stanley Hudson","elements":[]},{"text":"Brian Baumgartner as Kevin Malone","elements":[]},{"text":"Creed Bratton (actor) as Creed Bratton","elements":[]},{"text":"Kate Flannery as Meredith Palmer","elements":[]},{"text":"Mindy Kaling as Kelly Kapoor","elements":[]},{"text":"Ellie Kemper as Erin Hannon","elements":[]},{"text":"Angela Kinsey as Angela Martin","elements":[]},{"text":"Paul Lieberstein as Toby Flenderson","elements":[]},{"text":"Oscar Nunez as Oscar Martinez","elements":[]},{"text":"Craig Robinson as Darryl Philbin","elements":[]},{"text":"Phyllis Smith as Phyllis Vance","elements":[]}]}],"images":[]},{"title":"Recurring cast","level":3,"content":[{"type":"list","elements":[{"text":"Zach Woods as Gabe Lewis","elements":[]},{"text":"Amy Pietz as Donna","elements":[]},{"text":"Hugh Dane as Hank Tate","elements":[]},{"text":"Calvin Tenner as Calvin","elements":[]}]}],"images":[]},{"title":"Guest cast","level":3,"content":[{"type":"list","elements":[{"text":"David Mate as Flex","elements":[]},{"text":"Fay DeWitt as Lady at the Gym","elements":[]}]}],"images":[]}]}