{"sections":[{"title":"The Job","level":1,"content":[{"type":"paragraph","text":"\"The Job\" is the twenty-fourth\/twenty-fifth and the final episode of the third season of The Office, as well as the 52nd\/53rd episode overall. It was written by Paul Lieberstein and Michael Schur and directed by Ken Kwapis. It first aired on May 17, 2007 and was an hour-long episode. It was viewed by 7.9 million people."}],"images":[]},{"title":"Plot","level":2,"content":[{"type":"paragraph","text":"Michael is overconfident that he will be getting the corporate job. He has sold his condo on eBay and names Dwight as his successor as Regional Manager. Back in Scranton, Oscar, Kelly and Stanley poke fun at Pam's speech at the beach (in \"Beach Games\") (Creed also claims to have documented the speech on the website he created with Ryan's help, but in a talking head Ryan reveals that the \"blog\" is actually a Microsoft Word document, as he had been unwilling to expose humanity to the innermost workings of Creed's mind), but Pam insists the evening was an important milestone in her life and reveals that she and Jim had privately agreed to try to mend their friendship. Pam explains to Karen that she is not sorry about what she said, but does regret putting Karen in such an awkward position."},{"type":"paragraph","text":"In an attempt to win Michael back, Jan arrives at the office telling him that she's been more confident and better than ever after taking a vacation. In a panic, Michael consults the women of the office. Pam tells him to be strong and to not get back together with her. Michael attempts to reject Jan's request, but reverses himself immediately when he sees that Jan had a breast augmentation. Soon after, Jim and Karen leave to spend the night in New York City before their interviews. Karen tells Jim that if either of them gets the job, both should move to New York. She promises to do so, but is met with awkward silence when she asks Jim to reciprocate. Back in Scranton, Dwight begins his new regime, assigning Andy the role of his No. 2. Not surprisingly. Dwight's new motivational tool \"Schrute Bucks\" is not popular. He and Andy repaint the walls of Dwight's new office black in order to instill fear."},{"type":"paragraph","text":"During his interview at Corporate, Michael learns from CFO David Wallace that he is interviewing for the job currently held by Jan, who will be fired. Michael immediately tells Jan, who storms into Wallace's office while he's interviewing Karen and has an emotional breakdown. Jan refuses to leave, and must be escorted out by security. As Michael leaves, Wallace tells him that he won't be getting the position. While being driven home by Michael, Jan begins to realize that she's ruined her career and ponders making their relationship her \"full-time job,\" much to Michael's visible discomfort."},{"type":"paragraph","text":"Karen leaves to meet friends for lunch, asking Jim to call her when his interview is finished. Jim's interview with David begins very well. When asked for his sales report numbers, Jim discovers Pam had slipped in an encouraging note along with a yogurt lid medal (a reference to a scene from \"Office Olympics\"). Jim, visibly distracted, stumbles through the rest of the interview until Wallace asks him where Jim thinks he will be in ten years. The scene flashes back to Jim and Pam's talk after her confession on the beach. He tells her why he left and how he feels that he has never really come back. She tells him that she wishes that he would. After the interview, Jim drives back to Scranton without Karen."},{"type":"paragraph","text":"In her interview, Pam says she is convinced Jim will be hired in New York. She reaffirms that she is fine with the way things worked out with her and Jim, and that they just \"never got the timing right.\" Her interview is interrupted when Jim bursts in and asks her if she is available that evening for dinner. Pam, who is caught completely off-guard, answers, \"Yes.\" Jim replies, \"All right, then it's a date,\" and leaves just as quickly as he arrived. Pam smiles with tears in her eyes."},{"type":"paragraph","text":"The episode and season end with Wallace offering the job over the phone to Ryan, despite the fact that in the previous episode \"Business School\" Michael said that Ryan had never made a sale. Wallace indicates that Ryan's MBA was a key factor. A gleeful Ryan accepts and says without missing a beat to a nosy Kelly: \"You and I are done.\""}],"images":[{"src":"https:\/\/vignette.wikia.nocookie.net\/theoffice\/images\/f\/fa\/SchruteBuck.jpg\/revision\/latest\/scale-to-width-down\/208?cb=20091220194410","caption":"One Schrute Buck"}]},{"title":"Deleted scenes","level":2,"content":[{"type":"list","elements":[{"text":"Michael takes photographs of the office as mementos. Inspired by Pam's speech in \"Beach Games\", Michael tells Toby that he hates him and then exults at how good it feels to 'get that off (his) chest'. Toby barely reacts to this news. As Michael leaves for his interview, Toby wishes him good luck and Michael snarls at Toby for jinxing him, adding that everyone in the office hates Toby as much as he does, to no response from anyone else.","elements":[]},{"text":"Ryan chuckles at a fax he receives. When Pam asks him what the fax said, he grins and says he'll tell her if she'll promise not to make a speech about it to everyone in two years (alluding to Pam's speech at the end of \"Beach Games\") and Pam grins good-naturedly. Meanwhile, Kevin continues comparing Pam and Karen.","elements":[]},{"text":"Michael bids a confused farewell to the accounting department.","elements":[]},{"text":"Dwight caresses his new office. Michael asks him not to change anything for one month to allow the staff to grieve.","elements":[]},{"text":"Michael finds an apartment in Jamaica, Queens, on his transit line's very last stop, where he will room with Vijay Chokalingham and live directly over an Indian restaurant.","elements":[]},{"text":"Additional scenes from Andy's interview with Dwight. Andy says, among other things, that \"Eli Edison\" invented the cotton mill and goes through a several step description of how to do an emergency appendectomy.","elements":[]},{"text":"Extension of Andy's \"my brain\" talking head interview.","elements":[]},{"text":"In a talking head interview in his new office, Dwight describes his management style.","elements":[]},{"text":"Extension of Pam's \"Absolutely I do.\"","elements":[]},{"text":"Kelly gives Pam erroneous advice about Jim's feelings for her, telling Pam that \"he's just not that into you.\" In a talking head interview, Pam realizes that she and Kelly have nothing in common.","elements":[]},{"text":"Michael answers the interview question, \"Where do you see yourself in ten years?\"","elements":[]},{"text":"Dwight sits behind his new desk, and Angela tells him he looks \"like Sean Hannity.\"","elements":[]},{"text":"Several of the office workers talk about who will get the Corporate job, and Kevin is insistent that Karen will be the winner. In a talking head interview, Kevin says that he bet a friend at the Albany branch one month's salary that Karen would get the job, and realizes that he might have a gambling addiction.","elements":[]},{"text":"Additional scenes from Dwight's conference room presentation.","elements":[]},{"text":"Creed produces $2.1 million in counterfeit Schrute Bucks and demands that they be converted to their cash equivalent.","elements":[]},{"text":"In a talking head interview, Dwight discusses how he can't pal around with his colleagues now that he is the boss.","elements":[]},{"text":"Dwight and Andy paint Dwight's office.","elements":[]},{"text":"Additional footage of Michael's face-saving speech when he returns to Scranton.","elements":[]},{"text":"In a talking head interview, Dwight reflects on his one-day reign as regional manager.","elements":[]},{"text":"Stanley tells Michael he never thought he'd say this, but he's glad Michael is back. Michael opens his arms to offer Stanley a hug, but Stanley just looks at him and then walks back to his desk.","elements":[]},{"text":"As Michael settles back into his office, he talks about how he loves Scranton, then mentions Jan is moving in with him the next day. Jan gives specific orders to the movers while Michael watches her with abject horror.","elements":[]}]}],"images":[]},{"title":"Cultural References","level":2,"content":[{"type":"list","elements":[{"text":"Michael says, No further questions to David Wallace, jokingly using a phrase conventionally used by lawyers in the United States to indicate to the judge that they are finished eliciting testimony from a witness.","elements":[]},{"text":"Michael's note for Dwight calls him an A-wipe, abbreviating the vulgar word ass. To screw the pooch is an off-color way of saying to mess up something.","elements":[]},{"text":"Michael sold his condo on eBay, an online auction site.","elements":[]},{"text":"Dwight's ideal choice for his Number Two is Jack Bauer, the fictional government agent in the television suspense series 24.","elements":[]},{"text":"DEFCON is a measure of the activation and readiness level of the United States Armed Forces. However, readiness increases as the scale decreases; DEFCON 1 is maximum readiness.","elements":[]},{"text":"Michael says Houston, we have a problem, a common misquote of the message \"Houston, we've had a problem\" sent from Apollo 13 after an oxygen tank ruptured.","elements":[]},{"text":"\"Swing Low, Sweet Chariot\" is a Negro spiritual.","elements":[]},{"text":"Andy brags, Saving the best for first, turning around the idiom \"Saving the best for last.\"","elements":[]},{"text":"The cash value of a Schrute Buck is 1\/100 of a cent. Some states require that coupons be assigned a cash value. Manufacturers set the value high enough to be legal but low enough that nobody will actually attempt to redeem them for cash.[1] Creed attempts to redeem Schrute Bucks for cash in a deleted scene.","elements":[]},{"text":"When Dwight and Andy are painting Michael's office, Dwight says \"Abandon all hope ye who enter here.\" referencing Dante Alighieri's Divine Comedy, specifically Inferno in which the phrase is inscripted on the gates of Hell.","elements":[]},{"text":"Michael says \"I'm baaaack, for gooood!\" and erroneously attributes it to Kevin Nealon. In the \"Hans and Franz\" series of skits on Saturday Night Live, Nealon portrayed Hans, one of the two Austrian bodybuilders. The characters were spoofs of former bodybuilder Arnold Schwarzenegger. The line \"I'll be back\" is properly attributed to Schwarzenegger's character in the movies The Terminator and Terminator 2.","elements":[]}]}],"images":[]},{"title":"Trivia- Caution, here be spoilers","level":2,"content":[{"type":"list","elements":[{"text":"In Creed's blog, he uses commas as apostraphes.","elements":[]},{"text":"In a deleted scene, Michael says his potential roommate in Queens is named Vijay Chokalingam, a nod to Mindy Kaling's older brother.","elements":[]},{"text":"Jim and Karen have dinner at The Spotted Pig in New York City.","elements":[]},{"text":"According to the DVD commentary, the episode was originally supposed to begin with the Pam\/Jim beach flashback, but the scene was moved till near the end mainly because, given how happy and right for each other Jim and Karen appeared to be in the NYC sequence, it was important to show just how deep his feelings for Pam were when he realizes where he truly belongs.","elements":[]},{"text":"This is the first time someone other than Michael has a word \"bleeped\".","elements":[]},{"text":"Wallace dislikes his HR representative, paralleling Michael's hatred of Toby.","elements":[]},{"text":"When Jim pulls out his quarterly numbers, he finds a note Pam left him as well as a gold yogurt lid from Office Olympics .","elements":[]},{"text":"Wallace states that Michael lost no clients after the merger but did reduce the budget. The budget reduction can be explained by the loss of three people from the Stamford branch after the merger.","elements":[]},{"text":"After Dwight informs Angela about his promotion and leaves the room, Angela says to herself, \"Goodbye, Kelly Kapoor.\" Angela's disdain for Kelly goes back to Christmas Party when Kelly got drunk at the Christmas Party. Other reasons for Angela's dislike of Kelly could include a conversation in Initiation, when Kelly told Angela that Dwight was a freak, and Kelly being very talkative and flashy.","elements":[]},{"text":"Also, in Initiation Michael uses The Terminator line, 'I'll be back'.","elements":[]},{"text":"In the end of the episode, Michael tells the staff that he will \"never, ever\" leave the office, however he does so when he moves to Colorado with his fiance Holly Flax in Goodbye, Michael.","elements":[]},{"text":"With the start of Pam and Jim's relationship at the end of this episode, all of Jim's relationships over the course of the show began in a Dunder Mifflin office; Katy in Hot Girl through Booze Cruise; Karen Filippelli in The Merger through The Job; and Pam Halpert in The Job through forever.","elements":[]},{"text":"\"The Job\" has a double meaning. One is the job that Karen, Jim, and Michael interview for at corporate, and the other is Jan's breast enhancement, often called a \"boob job.\"","elements":[]}]}],"images":[]},{"title":"Cast","level":2,"content":[],"images":[]},{"title":"Main Cast","level":3,"content":[{"type":"list","elements":[{"text":"Steve Carell as Michael Scott","elements":[]},{"text":"Rainn Wilson as Dwight Schrute","elements":[]},{"text":"John Krasinski as Jim Halpert","elements":[]},{"text":"Jenna Fischer as Pam Beesly","elements":[]},{"text":"B.J. Novak as Ryan Howard","elements":[]}]}],"images":[]},{"title":"Supporting Cast","level":3,"content":[{"type":"list","elements":[{"text":"Melora Hardin as Jan Levenson","elements":[]},{"text":"Ed Helms as Andy Bernard","elements":[]},{"text":"Leslie David Baker as Stanley Hudson","elements":[]},{"text":"Brian Baumgartner as Kevin Malone","elements":[]},{"text":"Kate Flannery as Meredith Palmer","elements":[]},{"text":"Mindy Kaling as Kelly Kapoor","elements":[]},{"text":"Angela Kinsey as Angela Martin","elements":[]},{"text":"Paul Lieberstein as Toby Flenderson","elements":[]},{"text":"Oscar Nunez as Oscar Martinez","elements":[]},{"text":"Phyllis Smith as Phyllis Vance","elements":[]}]}],"images":[]},{"title":"Recurring Cast","level":3,"content":[{"type":"list","elements":[{"text":"Rashida Jones as Karen Filippelli","elements":[]},{"text":"Creed Bratton (actor) as Creed Bratton","elements":[]},{"text":"Andy Buckley as David Wallace","elements":[]},{"text":"Nicholas D'Agosto as Hunter","elements":[]}]}],"images":[]},{"title":"Guest Cast","level":3,"content":[{"type":"list","elements":[{"text":"Vivianne Collins as Grace","elements":[]}]}],"images":[]}]}