{"sections":[{"title":"The Merger","level":1,"content":[{"type":"paragraph","text":"\"The Merger\" is the eighth episode of the third season of The Office and the 36th overall. It was written by Brent Forrester and directed by Ken Whittingham. It first aired on November 16, 2006."}],"images":[]},{"title":"Synopsis","level":2,"content":[{"type":"paragraph","text":"Pam congratulates Toby on a road race but Dwight questions the merit of the accomplishment and says he could finish a mile faster on a skateboard. He brags that he outran a black pepper snake just last week and reveals in an interview that his speed falls between that of \"a snake and a mongoose ... and a panther.\" Outside, Dwight stretches as he plans to run around the building in his suit and dress shoes. Pam purportedly times him but admits her \"stopwatch\" is a digital thermometer and goes inside."},{"type":"paragraph","text":"In Stamford, the office is being packed up in anticipation of the move to Scranton. Jim high-fives Karen and briefly wears a paper hat reading \"Stamford R.I.P.\" made by Andy, and a stack of the hats are seen in a recycling bin. Andy questions Jim about his new supervisor, Michael Scott, but Jim plays it close to the chest. Andy threatens to crush Jim if he gets in his way and rolls away with a PC from Josh Porter's office."},{"type":"paragraph","text":"Pam returns with two paper grocery bags full of supplies. Michael instructs her to arrange the conference room \"as though you are trying to impress an older man way out of your league.\" In an interview, she professes excitement over the merger of Stamford employees into the Scranton branch, including the return of her old friend Jim. Kevin is given the job of shredding the company documents from Stamford, which he relishes. As he demonstrates the power of his shredder from Staples, Kevin gets carried away and accidentally shreds his credit card. As Michael is putting nameplates on the ex-Stamford employee's desks Dwight suggests that they fire Tony Gardner to consolidate power. In an interview, Dwight says that he would have been good as the Japanese soldier who chose which prisoner to execute once a new batch of prisoners arrived."},{"type":"paragraph","text":"In a parking lot interview next to his Nissan Xterra, Andy proclaims he'll be the No. 2 man in Scranton in six weeks time through \"name repetition, personality mirroring and never breaking off a handshake.\" Indeed, he echoes Michael's \"Aloha\" greeting and refers to his \"nifty gifty\" bag, which contains mostly pencils and coupons to local Scranton \"hot spots\". Pam is sitting at her desk fascinated by their semi-awkward conversation. Michael admits during a talking head that he is fond of Andy and thinks he has a likable way about him. Jim walks in the door, and Pam is obviously extremely smitten to see him since she hasn't seen him in a long time, and still has feelings for him. Meanwhile, Dwight instructs Jim not to mess with him, as he is older and wiser. Jim gapes at Dwight's forehead, freaking him out."},{"type":"paragraph","text":"Dwight introduces himself to Andy and each man believes the other shall report to him in the office hierarchy. Andy mentions his title contains the word 'director' which outranks a 'manager' on a film set and questions Dwight if he knows anything about film. Dwight states he knows everything about film since he has seen over 240 of them. Jim goes over to say \"hi\" to Toby and is then somewhat confused when Toby invites him to \"pound\" it.  An elated Kelly hugs Jim and informs him there is a lot she must catch him up on and proceeds to tell him about the babies Tom Cruise & Katie Holmes and Brad Pitt & Angelina Jolie had. Jim then asks Kelly what's new with her and she replies, \"I just told you.\""},{"type":"paragraph","text":"Michael plans an orientation in the \"banquet hall\", but stops Meredith from drinking champagne, and beseeches Kelly not to eat the snacks, telling her to treat it like beef. When informed she eats beef, he says to treat it like poisoned beef, because the snacks are for guests. In a familiar manner, Karen gives Jim a stick of gum and Pam notices. Michael plays a videotape he has created called \"Lazy Scranton\" featuring himself and Dwight rhyming over the music of Saturday Night Live's \"Lazy Sunday\". Jim says the video treat reminds him of his orientation film: \"The Scranton Witch Project.\" The viewer is shown a brief clip of that film, which features Michael illuminated by a flashlight saying he \"gets so scared when people don't label their personal food.\" While it is clear that everyone is bored, Michael says that he thought the video would be an \"A\" or an \"A+\"; then, he remembered that there is an \"A++\"."},{"type":"paragraph","text":"In the coffee room, Pam notes that Jim has purchased a bottle of water from the vending machine instead of grape soda that he used to frequently purchase while at Scranton. Jim simply replies \"I'm evolving, Pam.\" which to note, his sleeves are buttoned up. Pam then questions when Jim is going to tell her everything and if he is interested to go for a coffee after work. Jim replies not tonight since he is still settling in and then Michael walks in the room, making things more awkward."},{"type":"paragraph","text":"In a series of vignettes, Stamford transplants are distracted by their new Scranton coworkers: Ryan by Hannah's open use of a breast pump; Karen by Phyllis's perfume from metropolitan Orlando; Martin by Creed's feet-up, boisterous phone conversation. In an interview, Stanley questions the audacity of \"these new people\" and mentions he's silently sat downwind from Phyllis's stinky perfume for years."},{"type":"paragraph","text":"The integration portion of Michael's orientation finds four new employees sitting in chairs on the banquet room table. Karen asks Michael why they aren't being treated as equal. The boss and Dwight try to force hefty, skeptical Tony up on the table, and he quits instead. Jan later calls Michael and yells at him for firing Tony when he tried to quit (an impulsive decision Michael made after feeling insulted by Tony's attempt). She complains that because Michael fired Tony rather than letting him quit like he wanted to, Dunder Mifflin has to pay him severance. Michael initially uses Dwight as a scapegoat by saying \"Bad advice from my number two.\" of which Jan corrects him and says Jim is actually going to be the number two. This is eventually brought into a meeting between Michael, Dwight, Jim and Andy and culminates in yet another battle between Dwight and Andy for Michael's respect."},{"type":"paragraph","text":"After Tony leaves the room, Hannah walks out, agreeing Michael is unprofessional. A short while later, Michael runs into the office and tells everyone to go down to the parking lot because someone has let the air out of all their tires. The employees rush down to see what is going on and Michael blames Vance Refrigeration employees. Michael suggests stealing all of the refrigerators from Bob Vance in retribution. Martin notes Michael's tires remain fully inflated, but Michael says they left a hate note under his windshield wiper reading, \"You guys suck! You can never pull together as one and revenge us. That is why you suck!\" Everyone shakes their heads in disbelief at what Michael has done. Once again, Pam noticed Karen casually touching Jim's back with her hand as they walk away. Later, all the employees are shown talking to each other and getting along due to a common interest: Michael as an unprofessional boss. Michael watches from his office and comments how a common enemy has brought the Stamford and Scranton employees together, although he apparently believes that the employees have fallen for his scheme and consider Vance Refrigeration the common enemy, not Michael himself."},{"type":"paragraph","text":"Jim sits in his Toyota Corolla and receives a call from Karen to meet up. He quickly ends the conversation as he sees Pam and runs over to say the day had been awkward and that he feels he should tell her he is seeing someone. She denies awkwardness and states that they'll always be friends."},{"type":"paragraph","text":"Kevin uses the shredder to make a salad. Dwight and Andy trade numerous barbs on a downward elevator ride. Andy disses Dwight's Trans Am, which is defended as classic American muscle. Andy praises his luxurious, rugged, Japanese Xterra, but Dwight says the vehicle's name isn't even a word and makes little sense."}],"images":[{"src":"https:\/\/vignette.wikia.nocookie.net\/theoffice\/images\/b\/ba\/JAM_M.png\/revision\/latest\/scale-to-width-down\/272?cb=20131128043700","caption":""}]},{"title":"Deleted scenes","level":2,"content":[{"type":"list","elements":[{"text":"Philip and Lester move new desks into the office area.","elements":[]},{"text":"Michael prepares for Martin Nash's arrival.","elements":[]},{"text":"Kevin welcomes Jim back and quietly informs him that the M&M's are hidden under his desk so \"they\" won't find them. Jim greets Angela, who brusquely informs him that he needs a haircut.","elements":[]},{"text":"Pam notes how weird it is that Jim is facing a different side of the office. Jim asks Pam who the various people are in the office, including Stanley, Meredith (whom Pam \"introduces\" as \"Janet Fenstermaker\"), and Creed. Ryan, annoyed by their shenanigans, tells them he needs to get his work done.","elements":[]},{"text":"Karen notes that Meredith and she have the same thermos. Meredith offers to share her alcohol.","elements":[]},{"text":"Andy introduces himself to Kevin. Kevin calls him \"Penguin\" because of an emblem on Andy's shirt.","elements":[]},{"text":"Michael says that if Phyllis and Karen start hanging out, they will start sharing the same menstrual cycle.","elements":[]},{"text":"Martin gets a whiff of Creed's mung beans, first referenced in Conflict Resolution.","elements":[]},{"text":"Hannah and Meredith, who share a desk edge, fight over desk space.","elements":[]},{"text":"Andy asks Kevin if he lost weight. Kevin says that Andy had never met him before. Andy responds by saying that Kevin has the vibe of someone who has lost weight. Kevin later says he really likes Andy.","elements":[]},{"text":"In a talking head, Michael examines differences, which he believes are the reason that people can't all get along.","elements":[]},{"text":"At the integration celebration, Michael has Andy pick a card. Saying that to be a great salesman is to be a king of hearts, Michael reveals all his cards are kings of hearts. Dwight says that Michael's presentation was \"super perfect\".","elements":[]},{"text":"Michael asks the Scranton branch to name one thing they like about a new Stamford transfer. Meredith volunteers, saying that she loves Martin's complexion because it's like \"devil's food cake.\"","elements":[]},{"text":"Dwight has a talking head about singeing one's eyebrows when fighting the fire.","elements":[]},{"text":"Dwight tries to cough out \"bull****\" when referring to something Andy says and Michael says that he didn't cover it all. Michael, in turn, coughs out insults about Dwight.","elements":[]}]}],"images":[]},{"title":"Trivia","level":2,"content":[{"type":"list","elements":[{"text":"Pam says that \"My mom made it [her sweater] for me.\" The actual sweater was not hand-knit. It was bought at a store and modified to appear hand-knit. [1]","elements":[]},{"text":"The digital thermometer which Pam is holding when she makes Dwight run around the building, is a real 1990s-era multi-function (F°\/C°) thermometer made by K-jump Health Company.","elements":[]},{"text":"The scenes with Kevin using the Staples shredder were removed on iTunes and the DVD.","elements":[]},{"text":"Michael most likely learned about Lazy Sunday from Kelly in the episode \"Initiation\".","elements":[]},{"text":"Michael makes all the new employees stand on the table. In the episode Motivation of the original UK series, David Brent specifically says to the camera that he would never make his employees stand on a table, as it is \"against health and safety regulations\".","elements":[]}]}],"images":[]},{"title":"Amusing details","level":2,"content":[{"type":"list","elements":[{"text":"Dwight tells Jim that the promotion to Assistant Regional Manager \"doesn't come with a pay raise.\" Jim corrects him, \"It does, actually.\" Dwight has been underpaid for the year.","elements":[]},{"text":"Dunder Mifflin and Staples are competing office suppliers yet Kevin is using a Staples shredder.","elements":[]},{"text":"Dwight is bothered by Jim not meeting his eye, but later in the series when Angela says she can't look into Dwight's eyes, Dwight says \"Then just look right here, \" pointing above his eyes, and says \"It's an old sales trick.\"","elements":[]},{"text":"Andy sits with the accountants and Hannah Smoterich-Barr sits  closer to sales even though Andy is a sales representative and Hannah is an accountant.","elements":[]}]}],"images":[]},{"title":"Cultural references","level":2,"content":[{"type":"list","elements":[{"text":"R.I.P. stands for requiescat in pace (\"may he rest in peace\"), a traditional inscription on tombstones.","elements":[]},{"text":"Out of your league is slang for someone or something significantly superior, against which one has little to no chance of success. It is most often applied to dating.","elements":[]},{"text":"Dwight repeats Hannah's name in the style of Ed McMahon, sidekick to former late night talk show host Johnny Carson. He did the same in the episode \"Performance Review\".","elements":[]},{"text":"Take me to your leader is a stereotypical greeting from a space alien. Karen is confused because Michael says it while pretending to be a robot.","elements":[]},{"text":"Michael asks, Was your dad a G.I.? \"G.I.\" is a nickname for a United States soldier. Michael is implying that Karen's father served in an exotic location and fathered a child with a local woman. (In reality, Rashida Jones's father, music legend Quincy Jones, is African-American, while her mother, The Mod Squad actress Peggy Lipton, is of Russian-Jewish descent.)","elements":[]},{"text":"Look what the cat dragged in is an insult made upon someone's arrival, implying that the subject is unattractive or sloppy in appearance.","elements":[]},{"text":"When Toby greets Jim, he extends his fist, expecting a fist bump which never comes. For an example of a fist bump, watch Michael and Craig greet each other in the episode \"Valentine's Day\".","elements":[]},{"text":"Tom Cruise and Katie Holmes are actors whose wedding and first child Suri was the subject of significant popular interest. One month after Suri's birth, actors Brad Pitt and Angelina Jolie had a child named Shiloh, also the subject of significant media attention.","elements":[]},{"text":"Michael's made-up word borientation is a combination of orientation and boring.","elements":[]},{"text":"Michael's request Cell phones and pagers off, please mirrors similar announcements made at theater performances.","elements":[]},{"text":"Michael's orientation video Lazy Scranton is inspired by Lazy Sunday, a rap song performed on the sketch comedy program Saturday Night Live.","elements":[]},{"text":"The Electric City is the nickname of the city of Scranton.","elements":[]},{"text":"Poison Control is short for the Poison Control Center, which despite its name, does not control poison. Rather, it is an organization which provides information to the public on treatment for poisoning.","elements":[]},{"text":"The Scranton Witch Project is inspired by the movie The Blair Witch Project.","elements":[]},{"text":"Anthracite is a type of coal, and the Anthracite Museum is a real museum in Scranton.","elements":[]},{"text":"A compact spot is a smaller-than-normal parking space designed for smaller cars.","elements":[]},{"text":"A and A+ are grades. In the United States school system, the A is highest grade, and sometimes a teacher will grant an A+ to indicate that the score was at the top of the A range. The grade A++, on the other hand, is ridiculous.","elements":[]},{"text":"Jim goads Karen into recording her telephone greeting with a thicker and thicker Italian accent.","elements":[]},{"text":"The Roxbury Guys is a recurring sketch on the sketch comedy program Saturday Night Live (subsequently turned into the movie A Night at the Roxbury). Michael and Andy recreate elements of the sketch, including its theme song What is Love.","elements":[]},{"text":"Nose candy is slang for cocaine.","elements":[]},{"text":"Hooters is a chain of casual dining restaurants featuring buxom waitresses.","elements":[]},{"text":"Can't we all just get along? was spoken by Rodney King, not the Reverend Martin Luther King, Jr.","elements":[]},{"text":"The words merger and marriage are etymologically unrelated.","elements":[]},{"text":"Michael shouts, They punk'd us! The television program Punk'd played pranks on people, revealing the ruse with the phrase \"You just got Punk'd!\" Writer B.J. Novak was a prankster on the show's second season.","elements":[]},{"text":"Michael answers his phone Jell-O, substituting the name of the dessert food for the more traditional Hello.","elements":[]},{"text":"Severance (short for severance package) describes payment and benefits given to an employee who leaves a company involuntarily. In the United States, the policies surrounding severance packages vary from company to company, but it typically includes money and assistance in finding a new job.","elements":[]},{"text":"Dwight taunts Andy with \"I hope 1985 has a time machine\". The time travel movie Back to the Future was released in 1985.","elements":[]},{"text":"Andy taunts Dwight by suggesting he could teach at Cor-not University, a pun on Cornell University, Andy's alma mater.","elements":[]},{"text":"The Nissan Xterra is a compact SUV. The Pontiac Trans Am is a classic American muscle car.","elements":[]}]}],"images":[]},{"title":"Cast","level":2,"content":[],"images":[]},{"title":"Main Cast","level":3,"content":[{"type":"list","elements":[{"text":"Steve Carell as Michael Scott","elements":[]},{"text":"Rainn Wilson as Dwight Schrute","elements":[]},{"text":"John Krasinski as Jim Halpert","elements":[]},{"text":"Jenna Fischer as Pam Beesly","elements":[]},{"text":"B.J. Novak as Ryan Howard","elements":[]}]}],"images":[]},{"title":"Supporting Cast","level":3,"content":[{"type":"list","elements":[{"text":"Melora Hardin as Jan Levenson","elements":[]},{"text":"Leslie David Baker as Stanley Hudson","elements":[]},{"text":"Brian Baumgartner as Kevin Malone","elements":[]},{"text":"Kate Flannery as Meredith Palmer","elements":[]},{"text":"Mindy Kaling as Kelly Kapoor","elements":[]},{"text":"Angela Kinsey as Angela Martin","elements":[]},{"text":"Paul Lieberstein as Toby Flenderson","elements":[]},{"text":"Phyllis Smith as Phyllis Lapin","elements":[]}]}],"images":[]},{"title":"Recurring Cast","level":3,"content":[{"type":"list","elements":[{"text":"Ed Helms as Andy Bernard","elements":[]},{"text":"Rashida Jones as Karen Filippelli","elements":[]},{"text":"Creed Bratton (actor) as Creed Bratton","elements":[]},{"text":"Mike Bruner as Tony Gardner","elements":[]},{"text":"Ursula Burton as Hannah Smoterich-Barr","elements":[]},{"text":"Wayne Wilderson as Martin Nash","elements":[]}]}],"images":[]}]}