{"sections":[{"title":"The Secret","level":1,"content":[{"type":"paragraph","text":"\"The Secret\" is the thirteenth episode of the second season of The Office and the 19th overall. It was written by Lee Eisenberg and Gene Stupnitsky and directed by Dennie Gordon. It first aired on January 19, 2006. It was viewed by 8.7 million people."}],"images":[]},{"title":"Synopsis","level":2,"content":[{"type":"paragraph","text":"The show starts of with Jim telling a joke to Pam, which Michael then goes to tell everyone else that he can, only he keeps messing it up. Meanwhile, Dwight is assigning everyone their spring cleaning tasks, but soon discovers that Oscar isn't at work. He tells Michael and they proceed to call his house. Oscar says that he has the flu, and Dwight and Michael interrogate him about his symptoms to see if he is lying. Dwight is given permission to investigate Oscar's sickness."},{"type":"paragraph","text":"Afterwards, Pam is talking to Kelly about her wedding stuff, like her hair and veil. Pam's hair is down at the time and Michael notices, calling it sexy.  Pam puts it back up. On his way to the breakroom he tells Jim that it must be torture for him, knowing what he knows of Jim's feelings for Pam. Jim tells Michael that this subject needs to remain a secret."},{"type":"paragraph","text":"Since Dwight is investigating Oscar, he gives Ryan the task of spring cleaning. In the meantime, Jim and Michael get a soda, and Michael asks about Pam in code, i.e., he spells her name, while Stanley is in the room, causing Jim to leave. Dwight continues to call Oscar. Dwight then tells the camera that there are ways to tell if someone is lying but you must speak face-to-face, and since Dwight talked to Oscar over the phone, he cannot tell. Next, Michael continues to talk to Jim, but Dwight interrupts and asks what the secret is. Michael then lies to Dwight, doing everything on Dwight's list of ways to determine if someone is lying. Michael takes Jim to Hooters, and wants to talk about Pam. Dwight talks to Pam about Oscar's sick phone call. He asks about Oscar's sniffling, and rummages through all of the jelly beans, taking the remaining black ones, forcing Pam to throw the remainder out. Later on, Michael keeps asking about Pam, he also tells the staff that it was his birthday. They return to the office, and Dwight updates Michael on the Oscar situation."},{"type":"paragraph","text":"Michael eventually reveals Jim's secret and Jim is forced to admit his crush, wanting to tell Pam himself rather than let her find out from Michael or someone else who knows. However, he plays it down and tells her that while he used to have a crush on her, he is over it. Unbeknownst to Jim, Michael later adds to the ambiguity by implying to Pam that Jim's crush on her had not really ended.  Pam and Jim leave together, however, and she does not seem to feel too awkward."}],"images":[]},{"title":"Trivia","level":2,"content":[{"type":"list","elements":[{"text":"In the Hooters scene, a guy from the film crew stands up in the background and takes his headphones off while looking at the camera, immediately after Michael orders a gourmet hotdog. ","elements":[]},{"text":"There are three secrets in this episode: Jim's crush on Pam, Oscar's gay relationship, and Dwight and Angela's relationship.","elements":[]},{"text":"As of this episode, Leslie David Baker (Stanley Hudson), Brian Baumgartner (Kevin Malone), Kate Flannery (Meredith Palmer), Angela Kinsey (Angela Martin), Oscar Nunez (Oscar Martinez), and Phyllis Smith (Phyllis Lapin) are listed as cast regulars.","elements":[]},{"text":"The shooting location for Oscar's house is 5232 Longridge Ave, Los Angeles.","elements":[]},{"text":"Jim orders a ham and cheese sandwich. This is the first time we see Jim's lunch routine. It is pointed out by Ryan in \"Dwight's Speech.\"","elements":[]},{"text":"A continuity error in the final cut of the episode has Jim tell Pam that his crush on her began when she started work at Dunder Mifflin. However, later in the epiosde, Pam recants this, saying that Jim's crush began when he started at Dunder Mifflin.","elements":[]}]}],"images":[]},{"title":"Deleted scenes","level":2,"content":[{"type":"paragraph","text":"The Season Two DVD contains a number of deleted scenes from this episode. Notable cut scenes include:"},{"type":"list","elements":[{"text":"Michael plays with his new putting toy. On his second attempt, the ball goes under the bookshelf. While Dwight retrieves the ball, Michael accidentally knocks his \"World's Best Boss\" mug off his desk, destroying it. He retrieves a new mug from the drawer.","elements":[]},{"text":"In a talking head interview, Dwight expounds on the hazards posed by dust bunnies.","elements":[]},{"text":"Michael surveys his worker bees and decides that he is the King Bee, nay, the Ace Bee.","elements":[]},{"text":"Ryan shows the camera an unfinished TV Guide crossword puzzle from Michael's office. In answer to \"Mary-Kate and Ashley _____ (5 letters)\" Michael wrote \"Judd?\"","elements":[]},{"text":"In a talking head interview, Michael explains that he rushed a few fraternities but decided not to accept any offers, which turned out well since no offers were made.","elements":[]},{"text":"Dwight tries to extract information about Oscar from Ryan.","elements":[]},{"text":"Michael buys Jim a Hooters t-shirt from the gift shop.","elements":[]}]}],"images":[]},{"title":"Amusing details","level":2,"content":[{"type":"list","elements":[{"text":"When Dwight asks Ryan if he can handle running spring cleaning, he flashes a page from his notebook. Dwight takes his investigation so seriously, he even made himself a fake badge.","elements":[]},{"text":"Immediately after Dwight brags in a talking head interview that he can spot a liar, he fails to detect that Michael is lying to him.","elements":[]},{"text":"Michael copies Jim by drinking grape soda and later styles his hair like him in attempt to bond with him.","elements":[]},{"text":"Jim orders a ham and cheese sandwich from Hooters, which is what he said that he was going to eat in the break room for lunch earlier that day anyway.","elements":[]},{"text":"The birthday apron Jim wears has balloons under it to give the impression that the person wearing it has boobs.","elements":[]},{"text":"During Michael's talking head interview defending his magic shop spending spree, he is wearing a false thumb, which magicians use to conceal objects.","elements":[]}]}],"images":[]},{"title":"Connections to previous episodes","level":2,"content":[{"type":"list","elements":[{"text":"In Sexual Harassment Michael says that he and Todd Packer use the \"we're brothers\" line to get women.","elements":[]}]}],"images":[]},{"title":"Cultural references","level":2,"content":[{"type":"list","elements":[{"text":"Spring cleaning is the tradition of cleaning one's house at the beginning of the spring season.","elements":[]},{"text":"Michael sings Our lips are sealed by the Go-Go's but misidentifies the artist as The Bangles.","elements":[]},{"text":"Michael announces, \"It's Grrrrrrape!\", mimicking cereal mascot Tony the Tiger's exclamation \"They're grrreat!\"","elements":[]},{"text":"Bogey at 3 o'clock is military jargon for \"unidentified object on the right.\"","elements":[]},{"text":"Michael's proclamation \"We are not worthy!\" and accompanying mock prostration come from the recurring Wayne's World sketch on Saturday Night Live. Dana Carvey played Garth in the sketch. He made this reference because the waitress' name was Dana.","elements":[]},{"text":"There is no such movie as More Secrets of a Call Girl.","elements":[]},{"text":"The Hokey Pokey is a dancing song. It is performed pretty much as shown in the episode, except that \"front side\" is more typically mundane body parts such as \"left hand\". Coincidentally, the original copyright holders are from Scranton.","elements":[]}]}],"images":[]},{"title":"Cast","level":2,"content":[],"images":[]},{"title":"Main cast","level":3,"content":[{"type":"list","elements":[{"text":"Steve Carell as Michael Scott","elements":[]},{"text":"Rainn Wilson as Dwight Schrute","elements":[]},{"text":"John Krasinski as Jim Halpert","elements":[]},{"text":"Jenna Fischer as Pam Beesly","elements":[]},{"text":"B.J. Novak as Ryan Howard","elements":[]}]}],"images":[]},{"title":"Supporting cast","level":3,"content":[{"type":"list","elements":[{"text":"Leslie David Baker as Stanley Hudson","elements":[]},{"text":"Brian Baumgartner as Kevin Malone","elements":[]},{"text":"Kate Flannery as Meredith Palmer","elements":[]},{"text":"Angela Kinsey as Angela Martin","elements":[]},{"text":"Oscar Nunez as Oscar Martinez","elements":[]},{"text":"Phyllis Smith as Phyllis Lapin","elements":[]}]}],"images":[]},{"title":"Recurring cast","level":3,"content":[{"type":"list","elements":[{"text":"Paul Lieberstein as Toby Flenderson","elements":[]},{"text":"Mindy Kaling as Kelly Kapoor","elements":[]},{"text":"Creed Bratton (actor) as Creed Bratton","elements":[]},{"text":"Tom W. Chick as Gil","elements":[]}]}],"images":[]},{"title":"Guest cast","level":3,"content":[{"type":"list","elements":[{"text":"Lindsay Stoddart as Dana (Hooters waitress)","elements":[]}]}],"images":[]}]}