{"sections":[{"title":"The List","level":1,"content":[{"type":"paragraph","text":"\"The List\" is the first episode of the eighth season and the 153rd episode overall. The episode aired on September 22, 2011. It was written and directed by B.J. Novak. In the episode, Robert California stops by for the first time as CEO and leaves behind a mysterious list that has a line down the middle and every member of the office on either one side or the other. The office members frantically try to figure out what it means. Meanwhile, the new manager Andy Bernard faces a crisis."},{"type":"paragraph","text":"The episode received mostly positive reviews with many commenting that it proved the series could survive without the lead actor, Steve Carell. According to Nielsen Media Research, \"The List\" drew an estimated 7.63 million viewers and received a 3.9 rating\/10% share in the 18-49 demographic making it the lowest rated season premiere since the first-season premiere."}],"images":[]},{"title":"Synopsis","level":2,"content":[{"type":"paragraph","text":"Robert California is appointed Regional Manager of the Scranton Branch, but quits on his first day, travels to Florida and convinces Jo Bennett to give him her position as CEO of Dunder Mifflin-Sabre. Andy is then appointed Regional Manager in Scranton, and makes it his goal for the office to receive a half day off on the Friday before the Columbus Day weekend."},{"type":"paragraph","text":"Erin finds Robert's notebook recording a list of Scranton's employees in two columns with a line down the middle. This causes the office to become frantic with what the list attributes to. Andy asks Robert about it, who brushes it off as \"doodles,\" and conspicuously moves Andy's name from the left column to the right. Later that day, Robert invites the employees in the left column to lunch, including Jim, Dwight, Angela, Kevin, Phyllis, Toby and Oscar. After they leave, Andy treats the remaining staff to a pizza party, but they are not happy about being left behind and do not respond to his sincere efforts to make them feel better."},{"type":"paragraph","text":"During lunch, the \"left-siders\" pester Robert about the list, who, in-between beers, informs them that the left-siders are \"winners\" while the right side are \"losers\". Jim is astonished, but the others become cocky. Kevin sends a mass text to the right-siders, mocking them as \"losers\", and later squirts Meredith with a water pistol. Andy does not like this and confronts Robert with a demand to alter the list. Robert refuses, and then speaks to everyone by admitting to calling certain members of the office losers, but also saying he will be working with them a long time and that his opinions on certain people may very well change, finishing with \"Winners, prove me right; losers, prove me wrong\". Andy, unfazed, lists off the qualities the right-siders have, stating that Stanley may be a grump, but has the best sales record in the office (something Robert admits to being unaware of); Meredith is persistent and does not know what the word \"no\" means; and Pam is one of the kindest people he knows. Andy concedes to Robert that putting Gabe in the losers' column was \"astute\". Andy then demands the Columbus half day, responds to Robert's comment about Columbus being responsible for genocide with \"I DON'T CARE\" and exits, prompting a respecting smile from Robert. Though the office annually gets the half day in any case, they happily wish him good evening as they depart, and Andy looks very pleased with his work as the boss."},{"type":"paragraph","text":"Pam is pregnant with her and Jim's second child (revealed to be a boy) and is emotional, easily brought to tears throughout the day. Angela is also pregnant, having married the state senator Robert Lipton over the summer, and says that she's \"Little Preg\" to Pam's \"Big Preg\". When Jim picks up his things to leave for the day, he knocks over a piece of paper. Pam picks it up and sees Jim's personal winners and losers list: Pam, CeCe and their new baby are on the left, and everything else is on the right. Pam tearfully vows to frame it."}],"images":[]},{"title":"Cultural references","level":2,"content":[{"type":"list","elements":[{"text":"The cold open features multiple workers \"planking\", an activity consisting of lying face down in an unusual or incongruous location.","elements":[]},{"text":"Pam cries at a commercial for The Travelers Companies featuring a dog trying to keep his dog bone safe.","elements":[]},{"text":"Columbus Day is an official holiday on the anniversary of Christopher Columbus's arrival in the Americas, which occurred on October 12, 1492. It is celebrated in many countries in the New World and elsewhere.","elements":[]},{"text":"Robert overanalyzes Sesame Street, a children's TV series.","elements":[]},{"text":"Andy says \"Not my job, not my prob. I'm going to the warehouse to polish my knob!\", which is slang for masturbating.","elements":[]}]}],"images":[]},{"title":"Connections to previous episodes","level":2,"content":[{"type":"list","elements":[{"text":"This is the third season premiere in a row to include an internet trend in the cold open. The first was in Gossip (parkour) and the second Nepotism (lip dub).","elements":[]},{"text":"Robert seems to have an obsession with Sesame Street.","elements":[]},{"text":"The situation of the episode is reminiscent of The Inner Circle, where a group of people were favored over the others.","elements":[]}]}],"images":[]},{"title":"\"The List\"","level":2,"content":[{"type":"list","elements":[{"text":"The Winners: Dwight, Jim, Phyllis, Angela, Oscar, Kevin, Toby, Darryl, and Andy (before being moved).","elements":[]}]},{"type":"list","elements":[{"text":"The Losers: Pam, Erin, Ryan, Kelly, Creed (Old man), Meredith, Stanley, Gabe, and Andy (after being moved).","elements":[]}]}],"images":[]},{"title":"Amusing Details\/Trivia","level":2,"content":[{"type":"list","elements":[{"text":"In this episode, Robert California quits after two seconds in the office, breaking the record for shortest time as branch manager. The previous record holder is Jim Halpert, when he was the sole manager for four hours.","elements":[]},{"text":"Robert lists everyone's name correctly but puts 'Old Man' instead of Creed. Ironic because Creed is known for not remembering names correctly.","elements":[]},{"text":"Stanley begins making jokes, showing he may have taken Michael's advice to be more fun.","elements":[]},{"text":"This is the first mention of Michael Scott since his last appearance, \"Goodbye, Michael\".","elements":[]},{"text":"In the opening credits, James Spader himself appears but his name does not appear.","elements":[]},{"text":"Stanley is identified as having the most consistently high sales numbers in the office, despite Jim and Dwight being known as the top salesmen of the office.","elements":[]},{"text":"When Andy tells Robert about Stanley's sales and his two lovers, Robert states he did not know about the sales, possibly implying he knew about the lovers.","elements":[]},{"text":"Meredith planks in two different spots in the men's restroom during the cold open.","elements":[]}]}],"images":[]},{"title":"Cast","level":2,"content":[],"images":[]},{"title":"Main Cast","level":3,"content":[{"type":"list","elements":[{"text":"Rainn Wilson as Dwight Schrute","elements":[]},{"text":"John Krasinski as Jim Halpert","elements":[]},{"text":"Jenna Fischer as Pam Halpert","elements":[]},{"text":"B.J. Novak as Ryan Howard","elements":[]},{"text":"Ed Helms as Andy Bernard","elements":[]},{"text":"James Spader as Robert California","elements":[]}]}],"images":[]},{"title":"Supporting Cast","level":3,"content":[{"type":"list","elements":[{"text":"Leslie David Baker as Stanley Hudson","elements":[]},{"text":"Brian Baumgartner as Kevin Malone","elements":[]},{"text":"Creed Bratton (actor) as Creed Bratton","elements":[]},{"text":"Kate Flannery as Meredith Palmer","elements":[]},{"text":"Mindy Kaling as Kelly Kapoor","elements":[]},{"text":"Ellie Kemper as Erin Hannon","elements":[]},{"text":"Angela Kinsey as Angela Martin-Lipton","elements":[]},{"text":"Paul Lieberstein as Toby Flenderson","elements":[]},{"text":"Oscar Nunez as Oscar Martinez","elements":[]},{"text":"Craig Robinson as Darryl Philbin","elements":[]},{"text":"Phyllis Smith as Phyllis Vance","elements":[]},{"text":"Zach Woods as Gabe Lewis","elements":[]}]}],"images":[]}]}