{"sections":[{"title":"The Client","level":1,"content":[{"type":"paragraph","text":"\"The Client\" is the seventh episode of the second season of The Office and the 13th overall. It was written by Paul Lieberstein and directed by Greg Daniels. It first aired on November 8, 2005. It was viewed by 7.5 million people."}],"images":[]},{"title":"Summary","level":2,"content":[{"type":"paragraph","text":"Michael and Jan take a client to Chili's for an important meeting. Jan is disgusted with Michael's antics and general refusal to talk business but discovers at the end of the day that there is a method to his madness when the client bonds with Michael, allowing him to close the deal. Afterwards in the parking lot, Michael and recently-divorced Jan share a kiss."},{"type":"paragraph","text":"Meanwhile, Pam finds a screenplay written by Michael, and Jim leads the office staff in a table read of the script. An editing error in the script reveals that Michael based the incompetent sidekick on Dwight, who quickly shuts down the exercise to invite everyone to set off fireworks outside. Jim and Pam break off their respective evening plans to enjoy an impromptu dinner on the roof and watch the firework show, followed by swaying to music on his iPod. The next day, Jim makes a joke about their \"first date\", and Pam is too quick to tell him bluntly it was not a date, and that swaying is not dancing. Jim makes a snide comment about Roy and Pam's first date, at which he left her at a hockey game. Pam is offended by his comment and walks away."},{"type":"paragraph","text":"The following morning, Dwight (who has slept in the office) and Angela independently observe Jan returning to her car (still parked at Dunder Mifflin), and word quickly travels around the office. Michael initially tells the documentary crew that \"nothing happened,\" that they talked for several hours before falling asleep, but his story gradually changes to imply that they did more than just talk. Jan calls, clearly regretful for what she did the previous evening, but Michael refuses to accept her change of heart."}],"images":[]},{"title":"Deleted scenes","level":2,"content":[{"type":"list","elements":[{"text":"Michael tells an uninterested Pam about his new egg yolk diet. (Jenna Fischer breaks character and starts laughing.)","elements":[]},{"text":"Michael empties the kitchen refrigerator of all foods containing carbs.","elements":[]},{"text":"Michael jokes around with an unamused Jan regarding plans for the client meeting. In a talking head interview, Michael explains that he's a closer.","elements":[]},{"text":"Jim visits the reception desk and asks Pam what she's doing. She admits she was just staring at her desk.","elements":[]},{"text":"Phyllis tries gossip with Stanley, but Stanley ignores her.","elements":[]},{"text":"The table reading reaches the last page of Threat Level: Midnight, which ends abruptly with Agent Michael Scarn jumping out of an airplane without a parachute.","elements":[]},{"text":"Jim describes to the camera his worst first date. He's being evasive and vague about details, but gradually it becomes clear that he's describing a date he went on with Pam before he learned she was engaged to Roy. He says he found out later that she didn't even think of it as a real date and she was in love with another guy. Jim concludes, \"My best first date was also my worst first date.\"","elements":[]}]}],"images":[]},{"title":"Trivia","level":2,"content":[{"type":"list","elements":[{"text":"The illustrations which accompany Michael's screenplay were drawn by producer Greg Daniels. The crew initially used a professional artist, but the artist couldn't make the drawing bad enough.","elements":[]},{"text":"Michael refers to the name of his screenplay, Threat Level: Midnight, in the episodes Product Recall and Money.","elements":[]},{"text":"All of the lines that the characters read from the Threat Level: Midnight script were completely improvised by the actors, and Brian Baumgartner (Kevin Malone) remarked that it was difficult to improvise the lines and give the impression that the character was actually reading the script.","elements":[]},{"text":"Devon appears in the background of some deleted scenes even though he was fired in the episode Halloween. The original plan was to air this episode before Halloween, but NBC changed the airing order.[1]","elements":[]},{"text":"Dwight is the only person to follow Michael's instructions. Michael tells the office to \"wish us luck\" and to \"sit tight until I return\", both of which only Dwight does.","elements":[]},{"text":"Michael's lucky tie was sold at auction by NBC as a charity fundraiser. [2]","elements":[]},{"text":"Near the start of the episode, the group does \"worst first dates\", Oscar tells his story about a date with the woman with a checklist. At this point in the series, the writers had not chosen him to be gay yet. He could be making it all up. It is possible he really did go on this date, however, since in season 9 he says, \"When this thing (documentary) started I was still having sex with women. As was Kevin, I believe.\"","elements":[]},{"text":"Chili's makes its second appearance in the series however it is not the same Chili's from the Dundies.","elements":[]},{"text":"Michael hides under his desk when he talks with Jan on the phone. This allowed the editors to combine the best parts of multiple takes, since you can't see Steve Carrell's lips moving.","elements":[]},{"text":"The writers started with the final scene of Jim and Michael sharing looks and then worked backward to figure out how they could get there.","elements":[]}]}],"images":[]},{"title":"Amusing details","level":2,"content":[{"type":"list","elements":[{"text":"In his pitch to Christian, Michael casually notes that he knows how many schools and hospitals there are in the county. Jan included this information in her briefing at the start of the episode.","elements":[]},{"text":"Watch Jan's face change as she slowly realizes that Michael is closing the deal.","elements":[]},{"text":"Even though Jan refused to agree on a secret signal, Michael uses an improvised signal to get her to keep quiet as he closes the sale.","elements":[]},{"text":"Michael drives through a stop sign on the way to Chili's.","elements":[]},{"text":"In the script reading Michael's character’s love interest, Catherine Zeta-Jones, is reading back messages for his character. This could allude that Michael used his real life receptionist, Pam, as a model for his fictional love interest","elements":[]},{"text":"The Chili's in this episode is not the same one from the Dundies.","elements":[]}]},{"type":"list","elements":[{"text":"Jan says the reason she and Gould divorced was because she wanted kids and he did not. However, in Dinner Party, Jan is adamint about not bring a kid into this f****** world. ","elements":[]}]}],"images":[]},{"title":"Cultural references","level":2,"content":[{"type":"list","elements":[{"text":"Casual Fridays is the practice of dressing less formally for work on Fridays. It became popular in the late 1990s.","elements":[]},{"text":"USA Today is a national newspaper known for its colorful charts.","elements":[]},{"text":"Radisson is a mid-range hotel chain. In reality, there is a Radisson in downtown Scranton.","elements":[]},{"text":"Chili's is a chain of casual dining restaurants. In this episode, Michael says that there's a Chili's just a few blocks away. In reality, the nearest Chili's to Scranton is about 30 minutes' drive away in Wilkes-Barre.","elements":[]},{"text":"To burn the midnight oil is to work late into the evening. Michael modifies the phrase in order to sound clever.","elements":[]},{"text":"An Awesome Blossom® is a battered and deep-fried onion. A single blossom contains 203 grams of fat.","elements":[]},{"text":"The story about the lighthouse and the naval vessel is a well-known joke. Read it here.","elements":[]},{"text":"Saturn, Escort and Probe are models of automobile. The joke is based on puns: Saturn is the sixth planet from the sun. An escort is a euphemism for a prostitute. A probe is a device that is inserted into something to obtain information.","elements":[]},{"text":"Abercrombie & Fitch is an American clothing store attracted toward teenagers and college students. Pam asks Michael if his jeans are from Abercrombie.","elements":[]},{"text":"Catherine Zeta-Jones is an Academy Award-winning actress.","elements":[]},{"text":"Baby back ribs are pork ribs, typically prepared barbecued. Chili's has a special song to advertise its baby back ribs, which Michael and Christian perform together.","elements":[]},{"text":"Oklahoma! is a prize-winning musical.","elements":[]},{"text":"Samuel L. Chan is a combination of the names of actors Samuel L. Jackson and Jackie Chan. The character speaks in a bizarre mixture of Asian and black caricatures. The grammatical errors (incorrect verb forms) are associated with Asian speech, and word and brotha are associated with black urban speech. The term word is used incorrectly: It is a term of agreement.","elements":[]},{"text":"Kevin gives Michael's screenplay two thumbs down. Thumbs up\/thumbs down is the movie rating system used and trademarked by Roger Ebert and Gene Siskel in their movie review program At the Movies.","elements":[]},{"text":"Goldenface may be derived from the James Bond movie Goldfinger.","elements":[]},{"text":"Truth or Dare? is an adolescent party game in which players challenge each other with embarrassing questions and embarrassing tasks.","elements":[]},{"text":"To kiss and tell is to reveal information about a romantic encounter.","elements":[]},{"text":"Jan accuses Michael of slipping her something. The full phrase is to slip someone a mickey, to surreptitiously place an incapacitating drug into someone's drink in order to take advantage of the person.","elements":[]},{"text":"Rocky is a movie about the boxer Rocky Balboa. In the movie, the title character drinks raw eggs for breakfast.","elements":[]},{"text":"Michael throws away bread from the refrigerator. The Atkins Diet, which emphasizes avoidance of carbohydrates, became wildly popular in 2003.","elements":[]},{"text":"The movie Glengarry Glenn Ross is about a highly competitive group of salesmen. Michael quotes the catch phrase always be closing and refers to the Glengarry leads scene.","elements":[]},{"text":"Cugino's is an Italian restaurant in nearby Dunmore.","elements":[]}]}],"images":[]},{"title":"Cast","level":2,"content":[],"images":[]},{"title":"Main Cast","level":3,"content":[{"type":"list","elements":[{"text":"Steve Carell as Michael Scott","elements":[]},{"text":"Rainn Wilson as Dwight Schrute","elements":[]},{"text":"John Krasinski as Jim Halpert","elements":[]},{"text":"Jenna Fischer as Pam Beesly","elements":[]},{"text":"B.J. Novak as Ryan Howard","elements":[]}]}],"images":[]},{"title":"Recurring Cast","level":3,"content":[{"type":"list","elements":[{"text":"Melora Hardin as Jan Levenson","elements":[]},{"text":"David Denman as Roy Anderson","elements":[]},{"text":"Leslie David Baker as Stanley Hudson","elements":[]},{"text":"Brian Baumgartner as Kevin Malone","elements":[]},{"text":"Kate Flannery as Meredith Palmer","elements":[]},{"text":"Mindy Kaling as Kelly Kapoor","elements":[]},{"text":"Angela Kinsey as Angela Martin","elements":[]},{"text":"Paul Lieberstein as Toby Flenderson","elements":[]},{"text":"Oscar Nunez as Oscar Martinez","elements":[]},{"text":"Phyllis Smith as Phyllis Lapin","elements":[]},{"text":"Creed Bratton (actor) as Creed Bratton (Uncredited)","elements":[]}]}],"images":[]},{"title":"Guest Cast","level":3,"content":[{"type":"list","elements":[{"text":"Tim Meadows as Christian","elements":[]},{"text":"Allyson Everitt","elements":[]}]}],"images":[]},{"title":"References","level":2,"content":[{"type":"list","elements":[{"text":"↑ Season 2 DVD commentary, The Client.","elements":[]},{"text":"↑ Kinsey, Angela and Jenna Fischer, Office Ladies: The Client with Melora Hardin podcast","elements":[]}]}],"images":[]}]}