{"sections":[{"title":"The Convention","level":1,"content":[{"type":"paragraph","text":"\"The Convention\" is the second episode of the third season of The Office and the 30th overall. It was written by Lee Eisenberg and Gene Stupnitsky, and directed by Ken Whittingham. It first aired on September 28, 2006. It was viewed by 7.8 million people."}],"images":[]},{"title":"Synopsis","level":2,"content":[{"type":"paragraph","text":"Michael asks Pam to research information so that he may adopt a Chinese baby, an idea stemming from Angelina Jolie's Oprah appearance. After Pam convinces him to hold off on the idea, Michael implies that he and Pam should conceive a baby together if neither of them has a child in ten years. Pam rejects the suggestion and his substitution of twenty years. She finally agrees to the scenario when Michael suggests thirty years."},{"type":"paragraph","text":"Michael and Dwight receive per diem money from Angela for their train trip to Philadelphia, Pennsylvania for the Northeastern Mid-Market Office Supply Convention. Ryan reviews Michael's checklist of his luggage for the trip, including three boxes of condoms and his white \"fun jeans\" which are folded on a hanger and wrapped in plastic. Angela is angry with Dwight for leaving when they had planned to spend time together."},{"type":"paragraph","text":"Kelly is excited for a double date she has arranged with herself, Ryan, Pam, and Kelly's neighbor, Alan, a cartoonist for the local newspaper. Kelly urges Pam not to sleep with Alan on the first date. Pam admits in an interview that she is nervous and has not been on a first date in nine years. Overhearing date chat, Michael suggests Pam wear her wedding dress as a joke, and Dwight chimes in that her veil should complete the ensemble. Pam steadfastly says she will wear the same clothes she wore to work that day, and Michael tells her to unbutton her top button to \"let those things breathe a little.\" Noting that Jim will be at the convention, Michael asks Pam if she wants him to relay a message, then teases her as she is only able to get out an, \"Um...\" before he cuts her off."},{"type":"paragraph","text":"Creed, having earlier seen Angela \"handing out some shekels\" to Michael and Dwight, wonders how he can \"get on that train\". After being told the cash is for the Philadelphia trip, he and Meredith bash the city of brotherly love. An indignant Angela storms out of the room despite earlier mentioning a Martin family phrase — \"The slow train from Philly\" — used to indicate a potential prostitute in the vicinity. She leaves behind a plate of food that Creed immediately begins to eat. He informs Meredith that \"Andrea is the office bitch\" and proceeds to introduce himself, apparently not recognizing Meredith from the many years they have worked together."},{"type":"paragraph","text":"In Philadelphia, Michael calls out \"traitor\" as a friendly greeting to Jim in the hotel lobby. Dwight asks him if he's made any sales and Jim says he has \"sold about $40,000\". Dwight believes the feat impossible, and then says he has done the same, though Michael shakes his head \"no\" in reference to the fact that Dwight has not done $40,000 in sales. (In a talking head, Jim admits that he thought he had matured beyond all of the \"stupid and petty\" antics he'd pulled — at which point Dwight opened his mouth; he then takes it upon himself to obtain a key to Dwight's hotel room.) Michael also converses briefly with Stamford regional manager Josh, who informs Michael that should his branch swallow the Scranton branch, he will find a position within his new Stamford branch for Michael. A cause for concern washes across Michael's face when he hears this. Michael also queries Jan about \"the 800-pound gorilla in the room,\" Carol. Saying that Jan must keep her hands off of him during the convention, Jan tells Michael to move away from her, and Michael thanks her for her cooperation. Angela secretly arrives at the convention incognito under the name \"Jane Doe\"."},{"type":"paragraph","text":"Michael and Dwight meet Jerome Bettis, who is signing autographs at the convention, and appear to mistake him for Mr. T. Bettis is reluctant to commit to Michael's party in Room 308. Michael informs Dwight that Bettis is nicknamed \"The Bus\" because of the pro-footballer's fear of flight. During lunch, Michael updates Jim on the Scranton happenings including Ryan taking over Jim's position and desk. Jim sends his regards and Michael promises to phone him that afternoon with the sentiment. Jim begins to ask how a former co-worker is doing, but briefly hesitates before the name, eventually naming Toby. Michael responds by asking if Toby was why Jim left, or if he had considered bosses, leading to an inquiry as to what Jim thought of Josh compared to Michael. Jim states that it's not a competition."},{"type":"paragraph","text":"Michael assigns Dwight to dig up any dirt on Josh. Michael takes a work-related phone call from Pam, and Jim is surprised when Michael wishes her luck on her date. Dwight informs Michael his contact at the sheriff's office isn't volunteering this day."},{"type":"paragraph","text":"Michael promotes a Scranton v. Stamford paper airplane game at the Hammermill booth, but his plane crashes upon takeoff. Jim and Josh head off to other business and Michael brings the Hammermill salesperson to his room where he shares his emotions over Jim leaving his branch and discusses paper with the rep. As a result, Michael surprises the entire Dunder Mifflin contingent with the news he broke Staples' exclusive hold on Hammermill products and secured a deal with the company, impressing Jan. Michael even proceeds to tip the hotel waiter with his company per diem of $100 as just another way to try and impress Jan (which belittles her)."},{"type":"paragraph","text":"Jim has Dwight's room key and walks in on Angela (whom he mistakes for a prostitute) and he immediately leaves the room. He is shocked by the experience and tries to think of someone to call to share the news."},{"type":"paragraph","text":"Back in the Scranton office, Kevin expresses to Toby his lust for Pam now that she has started dating again. Toby responds by pondering and eventually aborting asking her out. Phyllis suggests Pam order an expensive entree at dinner to show she's worth it. Stanley concludes an expensive dinner requires Pam to \"put out.\" which Phyllis agrees would happen."},{"type":"paragraph","text":"On the double date, Kelly looks to be the only one having a good time, chatting and shoving food into a fairly embarrassed Ryan's mouth. Pam is nervous and talks to her dull date who states that he gets his comic strip ideas from the world around him, or in a dream. On a napkin, he sketches a scene referencing the 2003 freedom fries controversy, and states that it works on many levels. He reveals people tell him not to be edgy in his cartoons, but it is the only way he knows. When Pam politely laughs, Alan appears to briefly look down her shirt, causing Pam to subtly button it higher."},{"type":"paragraph","text":"Jim arrives on the third floor to pulsating vocoder-based electronic music and finds Michael sitting and playing with convention swag by strobe light. He says people have been filtering in and out of the party. Jim asks for a drink, and as Michael serves him a Cosmo, says he realizes that their boss-employee friendship was brief but not something Jim wanted to keep. Jim tells him he did not leave because he is a bad boss and calls Michael a great boss, and he left after he laid himself on the line to Pam and she rejected him, twice."},{"type":"paragraph","text":"Now understanding of the situation, Michael says he will talk to Pam, which Jim insists he does not do. Michael also suggests that Jim talk to Roy, because Roy knows exactly how he is feeling. Jim says he might. He and Michael make up and their renewed friendship is announced to party guests from the Hammermill staff."},{"type":"paragraph","text":"Pam's date ends with Alan picking his teeth and telling her to bring her sketches next time. She informs the camera that she has not found a love connection."},{"type":"paragraph","text":"A final tidbit finds Michael and Dwight preparing the black light for the Room 308 party. The light reveals stains covering the walls, comforter and headboard. Dwight speculates the stains are blood, urine, or semen, and a disgusted Michael says he hopes they are urine."}],"images":[{"src":"https:\/\/vignette.wikia.nocookie.net\/theoffice\/images\/7\/7b\/JimTC.jpg\/revision\/latest\/scale-to-width-down\/197?cb=20131128043129","caption":""}]},{"title":"Deleted scenes","level":2,"content":[{"type":"paragraph","text":"The Season Three DVD contains a number of deleted scenes."},{"type":"list","elements":[{"text":"Michael reiterates his invitation to Ryan to join him at the convention.","elements":[]},{"text":"Michael fondly recalls a convention he attended with Todd Packer.","elements":[]},{"text":"Dwight signs for his per-diem and leaves a note for Angela in return.","elements":[]},{"text":"Michael points out that he almost worked at a bottle factory they ride past on the train.","elements":[]},{"text":"Michael and Dwight pick up their convention identification. Michael mistakes the woman at the registration desk for someone from a \"sexy singles\" chat line. Dwight makes corrections to his identification badge.","elements":[]},{"text":"Michael introduces himself to one of Josh's regular clients.","elements":[]},{"text":"Dwight clumsily interrogates Josh about his criminal record.","elements":[]},{"text":"Michael describes a high school classmate whom Josh reminds him of.","elements":[]},{"text":"While waiting for Michael, Dwight talks with Josh and is fascinated.","elements":[]},{"text":"Dwight surreptitiously calls Angela to remind her how to hide in the closet of the hotel room.","elements":[]},{"text":"Michael prepares cosmos in his hotel room. Dwight clumsily excuses himself.","elements":[]},{"text":"Dwight returns to his hotel room and has trouble releasing Angela.","elements":[]},{"text":"Jan invites Josh to her room for a drink. He declines.","elements":[]},{"text":"Josh declines to comment on Michael and Jan's history, feeling it would be unprofessional to do so, and being somewhat grossed-out by it.","elements":[]},{"text":"Michael and Dwight show off their \"World's Best Boss\" t-shirts.","elements":[]}]},{"type":"paragraph","text":"After the episode aired, NBC made some deleted scenes available online, including the following scenes not included on the DVD:"},{"type":"list","elements":[{"text":"Creed sees Michael signing for his per-diem.","elements":[]},{"text":"Extension of Ryan going over Michael's convention checklist.","elements":[]}]}],"images":[]},{"title":"Trivia","level":2,"content":[{"type":"list","elements":[{"text":"In the break room, Meredith complains that Philadelphia \"smells like cheese steaks.\" Kate Flannery, who plays Meredith, was born in Philadelphia and grew up in the area.","elements":[]},{"text":"The establishing shot of the convention is of the Pennsylvania Convention Center.","elements":[]},{"text":"The song playing during Michael's \"party\" in his hotel room is \"Girls Gone Wild\" by Captain Ahab.","elements":[]},{"text":"This is the first episode Oscar is gone due to his 3 month paid vacation","elements":[]},{"text":"Scranton does not offer a passenger rail service to Philadelphia so Michael and Dwight should have driven to Philadelphia instead.","elements":[]}]}],"images":[]},{"title":"Goofs","level":2,"content":[{"type":"list","elements":[{"text":"When Michael gives Jim a welcoming hug, Dwight is wearing his conference name tag. After Michael's talking head interview, Dwight is shown putting on his name tag.","elements":[]}]}],"images":[]},{"title":"Amusing details","level":2,"content":[{"type":"list","elements":[{"text":"Dwight altered his conference name tag. He inserted his middle name, crossed out \"to the\" from \"Assistant to the Regional Manager\", and added his cell phone number, home phone number, pager number, and his hotel room number.","elements":[]},{"text":"Angela seems very upset with Michael while he signs off on his per diem, likely because she does not want Dwight to go to the convention.","elements":[]},{"text":"Creed thinks that Meredith is new to the office (even though they sit right next to each other), thinks Angela's name is Andrea, and eats Angela's leftover cereal.","elements":[]},{"text":"When Michael tells Jan about \"the 800-pound gorilla in the room,\" Dwight is carefully studying the fire escape map.","elements":[]},{"text":"After Josh and Jim share the inside joke, Josh checks his watch, and a wedding band is visible on his finger. Nevertheless, Jan invites Josh to her room for a drink in a deleted scene.","elements":[]},{"text":"In the first half of the episode, when Michael and Dwight meet up with Josh and Jim, both of them are wearing identical shirts. Michael and Dwight are wearing grey while Josh and Jim are wearing white","elements":[]},{"text":"In the second half of the episode, Michael wears the Microsoft Office \"swag\" shirt he picked up while talking about \"swag\" earlier in the episode.","elements":[]},{"text":"Dwight's room number is 556; Michael's is 308. Even though they are colleagues, Michael chose a room far away from Dwight's.","elements":[]},{"text":"When Michael announces that he broke Hammermill's exclusivity, Dwight raises his hand and waits, in vain, for a high-five.","elements":[]},{"text":"While on the phone with Pam, Michael says that he will give Toby \"general specifics\" later, an amusing oxymoron.","elements":[]},{"text":"When Jan says, \"I can't be on top of you 24\/7,\" Michael smiles at the camera, as if to say, \"That's what she said.\"","elements":[]},{"text":"When Kelly comes over to Pam to talk to her about their double date, Ryan quickly picks up the phone.","elements":[]}]}],"images":[]},{"title":"Behind the scenes","level":2,"content":[{"type":"list","elements":[{"text":"According to Angela Kinsey, she improvised, \"Why are there flies in here?\", because there really was a fly in the room in one take. The writers liked it so much they added it to the script.","elements":[]}]}],"images":[]},{"title":"Cultural references","level":2,"content":[{"type":"list","elements":[{"text":"Oprah Winfrey (commonly known by just her first name) is a popular daytime talk show host.","elements":[]},{"text":"Angelina Jolie is an actress who has adopted three children from underdeveloped countries.","elements":[]},{"text":"You are correct, sir! is a catch phrase of Ed McMahon, sidekick to Johnny Carson on The Tonight Show.","elements":[]},{"text":"The shekel is the official currency of Israel. It can be used in American English as a slang for money.","elements":[]},{"text":"A cheesesteak sandwich consists of thin slices of steak served with cheese on a long roll. It was invented in Philadelphia and is considered a hallmark food of the city.","elements":[]},{"text":"To hit that is slang for \"to have sex with that person\".","elements":[]},{"text":"An 800-pound gorilla is an entity that dominates by sheer size. The elephant in the room is the topic everybody knows but nobody wants to mention. Michael confuses these two idioms.","elements":[]},{"text":"Swag is slang for items given away at conventions and trade shows. Michael's claim that it stands for stuff we all get is a folk etymology. The term more likely derives from the British slang term swag meaning stolen goods.","elements":[]},{"text":"American football player Jerome Bettis is nicknamed The Bus for his ability to continue running even with opposing players on his back. Michael may have confused Bettis with fictional character B. A. Baracus (played by Mr. T) and football coach and sports announcer John Madden, both of whom have a fear of flying.","elements":[]},{"text":"Skeletons in one's closet are embarrassing secrets from one's past. Michael misstates the idiom as skeletons in his attic.","elements":[]},{"text":"Stat is medical jargon meaning immediately.","elements":[]},{"text":"24\/7 is business slang for 24 hours a day, seven days a week; in other words, constantly.","elements":[]},{"text":"For a woman to put out on a date means to agree to have sex.","elements":[]},{"text":"Jane Doe is a name traditionally used for a woman who cannot or does not wish to be identified.","elements":[]},{"text":"Freedom fries is a replacement term for \"French fries\" (French-fried potatoes) developed in retaliation against the French for their opposition to the 2003 war in Iraq. The term was already outdated when the episode aired.","elements":[]},{"text":"Love Connection was a dating game show.","elements":[]},{"text":"Michael offers to make Jim a Cosmo, short for Cosmopolitan, a stereotypical \"girly\" drink thanks to its popularity on the television program Sex and the City.","elements":[]}]}],"images":[]},{"title":"Cast","level":2,"content":[],"images":[]},{"title":"Main Cast","level":3,"content":[{"type":"list","elements":[{"text":"Steve Carell as Michael Scott","elements":[]},{"text":"Rainn Wilson as Dwight Schrute","elements":[]},{"text":"John Krasinski as Jim Halpert","elements":[]},{"text":"Jenna Fischer as Pam Beesly","elements":[]},{"text":"B.J. Novak as Ryan Howard","elements":[]}]}],"images":[]},{"title":"Supporting Cast","level":3,"content":[{"type":"list","elements":[{"text":"Melora Hardin as Jan Levenson","elements":[]},{"text":"Leslie David Baker as Stanley Hudson","elements":[]},{"text":"Brian Baumgartner as Kevin Malone","elements":[]},{"text":"Kate Flannery as Meredith Palmer","elements":[]},{"text":"Mindy Kaling as Kelly Kapoor","elements":[]},{"text":"Angela Kinsey as Angela Martin","elements":[]},{"text":"Paul Lieberstein as Toby Flenderson","elements":[]},{"text":"Phyllis Smith as Phyllis Lapin","elements":[]}]}],"images":[]},{"title":"Recurring Cast","level":3,"content":[{"type":"list","elements":[{"text":"Charles Esten as Josh Porter","elements":[]},{"text":"Creed Bratton (actor) as Creed Bratton","elements":[]}]}],"images":[]},{"title":"Guest Cast","level":3,"content":[{"type":"list","elements":[{"text":"Robert Bagnell as Alan","elements":[]},{"text":"Matt Price as Evan","elements":[]},{"text":"Jerome Bettis as Himself","elements":[]},{"text":"Chelsea Crisp as Convention worker","elements":[]},{"text":"Steve Little as Conventioneer","elements":[]},{"text":"Roscoe Myrick","elements":[]},{"text":"Douglas Sarine","elements":[]}]}],"images":[]}]}