{"sections":[{"title":"Todd Packer","level":1,"content":[{"type":"paragraph","text":"Todd Finch Packer, mostly referred to simply by his surname, Packer, is a fictional character played by David Koechner in the television series The Office. He is based on Chris Finch in The Office UK."}],"images":[]},{"title":"Season 1","level":2,"content":[{"type":"paragraph","text":"Packer calls Michael during his meeting with Jan. In one deleted scene from Basketball, Michael is uncomfortable when Packer starts telling a Jewish joke and quickly changes the subject. Packer does say they are friends. Todd Packer is a member of Michael's pickup basketball game, but is not shown playing, which questions the notion of him being a member of Michael's basketball team."}],"images":[]},{"title":"Season 2","level":2,"content":[{"type":"paragraph","text":"Packer's license plate is WLHUNG. It's a play on the phrase \"Well Hung\", however it is often misunderstood as a reference to William Hung. Packer has no idea who William Hung is and wonders why people always ask him if he's a William Hung fan."},{"type":"paragraph","text":"Michael tells a story of the two of them meeting twins and taking them back to a motel, where Packer had sex with both of them."},{"type":"paragraph","text":"Todd Packer is Michael's emergency contact."},{"type":"paragraph","text":"Packer is seen attending the Christmas Party."},{"type":"paragraph","text":"According to Michael, Packer used to sit at Dwight's desk while Michael sat at Jim's desk."},{"type":"paragraph","text":"As a prank, Packer left an unidentified object with an atrocious smell in Michael's office, causing Michael to have to replace the carpet in his office. While the object was never fully identified and was only partially seen by the camera, it is commonly believed that it was human feces."}],"images":[]},{"title":"Season 3","level":2,"content":[{"type":"paragraph","text":"Michael tells a story of a convention in Hartford at which he and Packer met a girl in a bar. Packer makes out with her, only to discover that her boyfriend is a bouncer at the bar. The bouncer chases them, and Packer manages to get away, leaving Michael behind to get beat up."},{"type":"paragraph","text":"After returning from a vacation with Jan Levinson in Jamaica, Michael calls Packer in Atlanta to brag about it. Packer doesn't believe him, so Michael attempt to email Packer a photo of Michael with Jan sunbathing topless at the resort. Unfortunately Michael clicks on the wrong email address and instead of sending it to packer@dundermifflin.com, he send to the packaging@dundermifflin.com, which leads to the photo being forwarded to staff and acquaintances all over the branch."},{"type":"paragraph","text":"It is Packer's idea for Michael to get a stripper for Bob Vance's bachelor party. Upon Michael's objections, based on sexual harassment grounds, he recommends that he hire a stripper for Phyllis' wedding shower as well."}],"images":[]},{"title":"Season 4","level":2,"content":[{"type":"paragraph","text":"In a Deleted Scene Michael talks about how Packer asks if the carpet matches the drapes."}],"images":[]},{"title":"Season 6","level":2,"content":[{"type":"paragraph","text":"Packer is seen in Clips from Sexual Harassment."},{"type":"paragraph","text":"While celebrating St. Patrick's Day at Cooper's Seafood, Todd Packer calls Michael to convince him to join him (in his characteristically vulgar way). Eventually, most of the office employees meet there, and Meredith starts to hump him. This marked his first appearance in three years."},{"type":"paragraph","text":"Packer calls Michael so he can tease him after he appears on television denying any problems with Sabre printers."}],"images":[]},{"title":"Season 7","level":2,"content":[{"type":"paragraph","text":"After hiring Danny Cordray as a Traveling Salesman, Michael said he forgot that they already had a Traveling Salesman, Packer."},{"type":"paragraph","text":"Packer shows up at the office Halloween party dressed as a pregnant nun."},{"type":"paragraph","text":"Packer appears as a drunk in a bar in Michael's movie, \"Threat Level Midnight\". When Michael and the rest of the cast start dancing \"The Scarn,\" Packer stands up and yells, \"If doing the Scarn is gay, then I'm the biggest queer on Earth!\""},{"type":"paragraph","text":"After Michael gives Holly a glowing recommendation, Packer gets a full-time job in the Scranton branch, much to the dismay of the other employees. However, after Packer mocks Kevin's weight and insults his, Holly soon realizes that Packer has a horrible personality. Fed up with Packer's presence in the office, Jim and Dwight prank Packer into working at Sabre in Tallahassee and to move down there. When Michael discovers this, he intends to tell Packer and apologize. However, when Packer openly insults Holly, Michael decides to let him quit."}],"images":[]},{"title":"Season 8","level":2,"content":[{"type":"paragraph","text":"In Tallahassee, Packer competes with Dwight for a Vice President position. Nellie chooses Dwight. Shortly after, Robert California reveals to Jim that he is going to fire Dwight for Nellie's incompetence. Jim protects Dwight, and Packer is fired in his place, after 20 years at Dunder Mifflin-Sabre."}],"images":[]},{"title":"Season 9","level":2,"content":[{"type":"paragraph","text":"Todd returns to the Scranton branch claiming to be on step 8 of Alcoholics Anonymous and on step 9 of Narcotics Anonymous. He apologizes to several people but includes veiled insults. He gives everyone cupcakes to which people seem ready to forgive him however Pam prevents everyone from accepting them as she feels that Packer has been so mean to them that a cupcake should not win them over. Todd later talks to Clark and gives him a cupcake as well. Packer later leaves after everyone eats the cupcake and reveals that he laced them all with various drugs, some legal and some illegal, as payback for his firing. He proudly tells the cameras this as he sits on his convertible (illegally parked in between a handicapped spot and a no-parking zone), his license plate reading \"WL HUNG\" still there."},{"type":"paragraph","text":"Later, he drives to Philadelphia to give cupcakes to Daryl and Jim."}],"images":[]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":"Sexual Harassment","elements":[]},{"text":"Christmas Party","elements":[]},{"text":"Ben Franklin","elements":[]},{"text":"The Banker (clip from Sexual Harassment)","elements":[]},{"text":"St. Patrick's Day","elements":[]},{"text":"Costume Contest","elements":[]},{"text":"Threat Level Midnight","elements":[]},{"text":"Todd Packer","elements":[]},{"text":"Tallahassee","elements":[]},{"text":"After Hours","elements":[]},{"text":"Test the Store","elements":[]},{"text":"Last Day in Florida","elements":[]},{"text":"The Farm","elements":[]}]}],"images":[]}]}