{"sections":[{"title":"Traveling Salesmen","level":1,"content":[{"type":"paragraph","text":"\"Traveling Salesmen\" is the twelfth episode of the third season of The Office and the 41st overall. It was written by Lee Eisenberg, Michael Schur and Gene Stupnitsky and directed by Greg Daniels. It first aired on January 11, 2007. It was viewed by 10.2 million people."}],"images":[]},{"title":"Plot","level":2,"content":[{"type":"paragraph","text":"Michael dresses the rear of his flat screen computer monitor with novelty teeth, a tiny Fez and Post-It eyes and commands it to say rude things to Jim and Pam via a text-to-speech application on his computer."},{"type":"paragraph","text":"Kevin informs Angela that the corporate office has yet to receive important tax documents and warns Angela that if she forgot to send them in, \"it is a big deal.\" Angela states that Corporate received the documents that morning, but appears troubled. Dwight arrives at the office, where Angela has intently perched herself near reception. Angela asks if everything is okay, and Dwight informs her that she \"is in the clear.\" Angela is visibly relieved."}],"images":[]},{"title":"Sales calls","level":3,"content":[{"type":"paragraph","text":"Dwight, fresh from the road, arrives late to Michael's \"dream team\" sales meeting, prompting taunts from Andy Bernard regarding his tardiness. Michael informs them that at Andy's suggestion, they'll be pairing up for sales-call duty. Given first choice, Andy selects Michael, flattering him. Phyllis, whom Michael refers to as \"our resident senior\" picks Karen. Told he cannot select \"pass\", Stanley selects Ryan. Dwight is angered when he is left to partner with Jim. Dwight seeks coworkers willing to trade, but as Jim is the sole volunteer, the four pairs head out to the parking lot."},{"type":"paragraph","text":"Michael tosses a bag of laundry to Dwight who in turn throws it into his Trans Am. Michael dubs the sales calls The Amazing Race, prompting some confusion as he explains that there will be no winner, and that a prize will not be awarded for the largest sale. To supplement his statement, he assigns each pair a nickname based on previous contenders from Race. Michael dubs Stanley and Ryan \"the retired Marines\", Phyllis and Karen \"mother and daughter\", Jim and Dwight \"the gay couple\", and his own team \"the firefighter heroes\". Before heading out, Michael snatches Phyllis's car keys from her hand and tosses them underneath her vehicle. Upon the team's departure, Angela invites Pam for coffee."},{"type":"paragraph","text":"Facilitated by a series of unique stationary in-car shots, the sales calls unfold."}],"images":[]},{"title":"Andy and Michael","level":4,"content":[{"type":"paragraph","text":"Andy, riding shotgun in Michael's convertible, continually badmouths Dwight, using suggestive language in an attempt to sway Michael's opinion of the man. He becomes frustrated, however, as Michael casually deflects his suggestions. Andy questions Michael as to why Dwight does his laundry. Michael explains that Dwight's laundry duty is punishment for attempting to take Michael's job in a secret meeting with Jan."},{"type":"paragraph","text":"At the sales call, Michael's attempt to sell the small-town personal feel of Dunder Mifflin is thwarted as Andy interrupts with tales of his privileged upbringing and boasting of the company's listing on the New York Stock Exchange. Afterward Andy apologizes for losing the sale, informing Michael that he really \"screwed that up... I really Schruted it\"."}],"images":[]},{"title":"Stanley and Ryan","level":4,"content":[{"type":"paragraph","text":"En route, Ryan asks Stanley if he can take the lead on the sales call, and Stanley happily accepts. The pair meet with four African American men in the lobby of their business, one of whom knows Stanley; and, actually, Stanley then tells Ryan to make the pitch, while he does some crosswords. Flustered, Ryan is unable to mutter anything but \"Hi. Hi. Hi. Hi.\" Later Stanley mocks Ryan for his ineptitude, comparing his behavior to that of his six-month-old niece."}],"images":[]},{"title":"Jim and Dwight","level":4,"content":[{"type":"paragraph","text":"Before they depart, Jim reveals to the camera that he and Dwight used to frequently go on sales calls in the past, and produces an old picture of the young sales duo. Dwight sits in the rear driver's-side seat of Jim's Subaru. Before entering the building, Dwight requests that Jim leave the keys to the car, to which Jim replies, \"You still do that thing?\" Dwight then proceeds to listen to a heavy metal solo (Kickstart My Heart by Mötley Crüe) while punching the driver seat's headrest and playing an \"air guitar\". At the sales call, the pair enact a tag-team sales routine, wherein Dwight borrows a phone and works his way through the call center of what he says is a competing paper company and is put on hold for several minutes while Jim dials Dunder Mifflin customer service and Kelly answers immediately and amicably. A sale is quickly made."}],"images":[]},{"title":"Phyllis and Karen","level":4,"content":[{"type":"paragraph","text":"Rather than immediately head out on their call, Phyllis drives Karen to a nearby beauty salon and purchases an outlandish beauty treatment she describes as \"makeovers\" for the pair, which results in their taking on hairstyles of a horrible, earlier era. At their sales call, a large sale is quickly procured. Karen is impressed with Phyllis' savvy as it is revealed through a photograph on the client's desk that his wife subscribes to a similar beauty sensibility. Later, Phyllis mentions her happiness for Karen and Jim's relationship as she had worried he would never overcome his crush on Pam, inadvertently revealing its existence to Karen."}],"images":[]},{"title":"Angela and Pam","level":3,"content":[{"type":"paragraph","text":"At a coffee shop, Pam notices Angela's happy glow and inquires. Angela tells Pam a thinly-veiled story of her friend \"Noelle\", who missed a deadline to send in important documents to corporate in New York and the \"gallant gentleman\", \"Kurt\" who drove the documents all the way to New York and handed them in for her. Pam glances knowingly at the camera. (Angela, never very imaginative, uses her and Dwight's middle names to disguise their identity.)"}],"images":[]},{"title":"Dwight's decision","level":3,"content":[{"type":"paragraph","text":"Upon their return, Karen invites Jim to coffee where he assures her that his crush on Pam has passed and that he is glad that Karen moved to Scranton. Meanwhile, Andy steals Dwight's car keys and searches his car, yielding a tollbooth receipt from a trip that morning to New York. Proffering the stolen ticket as evidence, Andy's suggestions finally begin to take hold as Michael is coaxed into believing that Dwight has gone behind his back to the corporate office, betraying him again. After confirming with Jan that Dwight was present at corporate that morning, Michael approaches him with Andy in tow, demanding an explanation. Dwight refuses to acknowledge or explain his presence at the corporate office, but assures Michael that he has not betrayed him. Michael insists on an explanation by the end of the day, implying that Dwight may be fired if he does not comply with his request."},{"type":"paragraph","text":"Dwight and Angela consult. It is made clear that Dwight will have to choose between betraying Angela by making their relationship public or betraying Michael by withholding information about his whereabouts that morning. Shortly after, Dwight stands up at his desk, requests the attention of the office and announces his resignation:"},{"type":"paragraph","text":"He bequeaths his box of desk items to Michael, but pulls away two bobblehead dolls, including the likeness of himself. On his way out, Dwight approaches and embraces Jim who is walking with Karen through the parking lot, confusing the two; both were talking over coffee when Dwight's resignation occurred. Andy gloats to the camera about his clever plan to get rid of Dwight while Angela vengefully glares at Andy from the background, suspicious that he's responsible for Dwight's resignation."}],"images":[]},{"title":"Newpeat","level":2,"content":[{"type":"paragraph","text":"When the episode re-aired on March 15, 2007, it was re-cut to introduce a new story line (which NBC called a \"Newpeat\"):"},{"type":"list","elements":[{"text":"Pam answers the phone and learns that her watercolor won an elementary school art contest. To the documentary camera she gives a short acceptance speech, thanking her parents and the sixth-grade class that picked her painting.","elements":[]},{"text":"Pam tells Kevin about winning the contest and the $100 prize. Kevin tells Pam that he won $400 betting on a basketball game. Pam congratulates Kevin and waits in vain for Kevin to congratulate her.","elements":[]},{"text":"Pam tells Angela about winning the contest, and Angela congratulates her. Angela's cat Sprinkles has had kittens, and she offers the dominant male to Pam. Pam declines awkwardly, and Angela once again becomes cold to her.","elements":[]},{"text":"As Jim leaves with Karen for coffee, Pam tells him about winning the contest, and Jim high-fives her and begins asking her about it. Karen, somewhat annoyed, reminds Jim that they're going to coffee.","elements":[]}]}],"images":[]},{"title":"Deleted scenes","level":2,"content":[{"type":"list","elements":[{"text":"Andy dramatically illustrates to Karen that they are the only two Stamford employees remaining.","elements":[]},{"text":"Michael asks if Pam left a message for Dwight telling him that \"his ass was grass and that I [Michael] am the lawn mower.\" Pam answers, \"Yes, except I didn't use those words.\" Andy makes a show out of the fact that he needs Dwight for \"something.\"","elements":[]},{"text":"In a talking head interview, Andy admits that he doesn't actually need anything from Dwight.","elements":[]},{"text":"In a talking head interview, Michael emphasizes the importance of punctuality. \"I need them to show up on time, so when I finally show up, we can get started right away.\"","elements":[]},{"text":"Michael tells the sales force that they're \"going to double-team the crap out of them.\" In a talking head interview, Dwight expresses his doubt that doubling everything necessarily makes things better.","elements":[]},{"text":"In a talking head interview, Ryan tries to sound excited about going on a sales call.","elements":[]},{"text":"In a talking head interview, Dwight explains that Andy is merely reinventing the wheel with his traveling salesman plan. Dwight, on the other hand, reveals his sketches for reinventing the roof.","elements":[]},{"text":"Walking to the elevator, Jim remarks to Dwight that it's just like the old days. Dwight agrees, \"You drive me there, I dominate, you drive me back.\" Jim concludes, \"Just like the old days.\"","elements":[]},{"text":"In a talking head interview, Dwight explains that he brings to the sales call \"a fierce competitive attitude, plus an extra jacket and roadside flares and business cards and condensed milk.\"","elements":[]},{"text":"Pam offers to get coffee. Toby asks for a chai latte and is quietly pleased that Pam is getting the same thing. When Pam returns from the coffee shop, she asks Kelly to deliver Toby's coffee. Toby watches Pam leave and then puts his drink in the trash.","elements":[]},{"text":"Scenes from Michaels' car: Extensions of the \"I'm a really good folder\" and \"super powers\" conversations in Michael's car. In other conversations, Michael thinks Andy keeps bringing up Dwight because he has a crush on him, Michael asks Andy to rate Jan on a scale of 1 to 10, Andy continues bad-mouthing Dwight, Andy compliments Michael's physique, and Michael think Kevin smells good all the time. Andy does impressions of Sean Connery and the Church Lady from SNL, but Michael is unable identify them.","elements":[]},{"text":"Scenes from Jim's car: Dwight jots down the license plate number of a car he sees with an expired registration. Dwight counts only sixteen wheels on an 18-wheeler. Dwight asks Jim if he thinks Andy is out to get him. Jim responds, \"I think that depends on what you mean by 'get you', but... yes.\" Dwight punches Jim when he sees a VW Beetle. Dwight is fascinated when he sees a police car by the side of the road. When Jim runs a red light, Dwight tries to take down Jim's license plate but Jim can't remember it. When Dwight talks about his girlfriend, Jim offers to go on a double date.","elements":[]},{"text":"Ryan tries to make small talk in Stanley's car.","elements":[]},{"text":"While waiting for the client, Dwight swishes fluoride in his mouth and swallows it. When they head into the client's office, Jim quietly asks, \"Horsefly or handkerchief?\" Dwight answers, \"Handkerchief.\"","elements":[]},{"text":"In Phyllis's car, she tells Karen that \"Jim is sooo hot\" and starts to ask Karen personal questions about Jim.","elements":[]},{"text":"Upon returning to the office, Andy apologizes for bad-mouthing Dwight.","elements":[]},{"text":"Before giving his box of possessions to Michael, Dwight emotionally gives away selected items to other co-workers.","elements":[]},{"text":"In a talking head interview, Pam describes seeing Dwight in the office when she came in on a Saturday.","elements":[]},{"text":"In a talking head interview, Michael wishes Dwight luck.","elements":[]}]}],"images":[]},{"title":"Trivia","level":2,"content":[{"type":"list","elements":[{"text":"The episode is the first that Karen learns of Jim's former crush on Pam and sets that storyline into motion.","elements":[]},{"text":"This is the only time in which Michael said something positive about his step-father, Jeff.","elements":[]},{"text":"When telling her story about \"Noelle\" and \"Kurt\", Angela uses both her and Dwight's middle names.","elements":[]},{"text":"Michael once again claims Phyllis is the oldest even though they are the same age.","elements":[]},{"text":"In the picture Jim shows of when he and Dwight used to go on sales calls, Dwight is taller than Jim, even though Jim is taller than Dwight during the series. This implies that Jim was very young and wasn't finished growing.","elements":[]},{"text":"Jim says he and Dwight used to go on sales calls all the time, suggesting they don't do it very often anymore. However, in Suit Warehouse, Dwight reveals that he and Jim often pretend to be brothers in joint sales calls so that they can better appear to family owned buisnesses. Clips are then played of them going to a construction company dressed in flannels and hardhats and going to a motorcycle shop in leather jackets and on a motorcycle. ","elements":[]},{"text":"Most of the salesman have their own unique stategies to selling. Michael closely relates to the client, Jim and Dwight directly compare Dunder Mifflin to the big chains, and Phyllis gets a makeover to appeal more to the client (in this case, she made herself and Karen look just like the client's wife).","elements":[]},{"text":"This is the first episode where Andy is revealed to be a bad salesman. Ryan continues to be a poor salesman.","elements":[]}]}],"images":[]},{"title":"Goofs","level":2,"content":[{"type":"list","elements":[{"text":"Michael's computer screen contradicts actual events. It displays phrases before \"Harvey\" says them, and contains some things that Harvey does not say at all.","elements":[]},{"text":"During the sales call, Dwight says that he does not celebrate any major holidays. At the beginning of the episode \"A Benihana Christmas\", Dwight is very pleased that he has a goose for Christmas. (Dwight may have been exaggerating for the purpose of the sales call.)","elements":[]},{"text":"When Dwight and Jim are exiting Jim's car before their sales meeting, a palm tree can be seen on the left side of the building in the background. Palm trees would not be growing in Pennsylvania.","elements":[]}]}],"images":[]},{"title":"Connections to Previous Episodes","level":2,"content":[{"type":"list","elements":[{"text":"As the sales team walk to their cars, Michael takes a bag of laundry from his trunk and throws it to Dwight. This is a reference to their laundry agreement which began in The Coup. Michael explains this to Andy in the car.","elements":[]}]}],"images":[]},{"title":"Cultural references","level":2,"content":[{"type":"list","elements":[{"text":"Michael's spelling mistakes have amusing consequences. He intended to type \"long time\" (not \"long tim\"), \"love you\" (not \"lobe yoy\"), and \"office\" (not \"offive\"). \"me so horny , love you long time\" is a reference to Full Metal Jacket. Specifically the scene in which Vietnamese prostitutes offer services to the US soldiers.","elements":[]},{"text":"Willy Wonka and the Chocolate Factory is a children's movie in which a group of children are given a tour of the chocolate factory and meet with various disasters one by one. One of the children falls into a chocolate river. Later in the episode, Andy sings the Oompa Loompa song from the movie, with altered lyrics.","elements":[]},{"text":"Andy teases Dwight for being late by asking for tardy sauce. This is a pun on tartar sauce, a condiment that traditionally accompanies fried fish.","elements":[]},{"text":"Michael refers to his dream team. The term was first used to describe the United States 1992 Olympic basketball team, the first year in which professional athletes were permitted to compete.","elements":[]},{"text":"Superfly is a classic 1972 blaxploitation film.","elements":[]},{"text":"Andy calls Michael's Sebring a motor carriage, an old-fashioned term for a car.","elements":[]},{"text":"The Amazing Race is a reality show wherein teams of two race around the world, accomplishing challenges along the way. Michael's nicknames for the sales teams are in the style of the nicknames used on the show.","elements":[]},{"text":"Abercrombie and Fitch is a chain of stores selling high-end casual clothing for college students.","elements":[]},{"text":"Superfriends was a children's animated television series featuring a team of superheroes. Michael mentions Hawkman, one of the less well-known members of the Superfriends.","elements":[]},{"text":"Lake Wallenpaupack is an artificial lake which is often used for recreation.","elements":[]},{"text":"Montauk is a tourist destination on Long Island, New York, known for its fishing. It is in a region of the island known as The Hamptons, known for being the location of vacation homes for the rich. Bayliner is a manufacturer of recreational boats. A 42-foot boat is quite large and costs approximately four times the median home price in Scranton.","elements":[]},{"text":"\"Kickstart My Heart\" by Mötley Crüe is the song Dwight listens to in the car before the sales call.","elements":[]},{"text":"Frances Willard Elementary School is a public school in Scranton. It teaches first through fifth grade (ages 6 through 10); there is no sixth grade class.","elements":[]},{"text":"The Boston Celtics are a professional basketball team.","elements":[]},{"text":"Michael botches the saying \"Fool me once, shame on you. Fool me twice, shame on me,\" which means \"It's my fault if I am fooled a second time.\" He inadvisedly mixes it with baseball terminology, wherein a player is out after his third \"strike\".","elements":[]},{"text":"Dwight's fake company name Beeswax, Not Yours, Inc. is based on the children's saying Mind your own beeswax, meaning \"Mind your own business.\"","elements":[]}]}],"images":[]},{"title":"Cast","level":2,"content":[],"images":[]},{"title":"Main cast","level":3,"content":[{"type":"list","elements":[{"text":"Steve Carell as Michael Scott","elements":[]},{"text":"Rainn Wilson as Dwight Schrute","elements":[]},{"text":"John Krasinski as Jim Halpert","elements":[]},{"text":"Jenna Fischer as Pam Beesly","elements":[]},{"text":"B.J. Novak as Ryan Howard","elements":[]}]}],"images":[]},{"title":"Supporting cast","level":3,"content":[{"type":"list","elements":[{"text":"Melora Hardin as Jan Levenson","elements":[]},{"text":"Leslie David Baker as Stanley Hudson","elements":[]},{"text":"Brian Baumgartner as Kevin Malone","elements":[]},{"text":"Kate Flannery as Meredith Palmer","elements":[]},{"text":"Mindy Kaling as Kelly Kapoor","elements":[]},{"text":"Angela Kinsey as Angela Martin","elements":[]},{"text":"Phyllis Smith as Phyllis Lapin","elements":[]}]}],"images":[]},{"title":"Recurring cast","level":3,"content":[{"type":"list","elements":[{"text":"Ed Helms as Andy Bernard","elements":[]},{"text":"Rashida Jones as Karen Filippelli","elements":[]},{"text":"Creed Bratton (actor) as Creed Bratton","elements":[]}]}],"images":[]},{"title":"Guest cast","level":3,"content":[{"type":"list","elements":[{"text":"Gil Glasgow as Jim and Dwight's client","elements":[]},{"text":"Warren Sweeney as Richard Corey (Michael and Andy's client)","elements":[]},{"text":"Mark Tomesek as Kenny (Phyllis and Karen's client)","elements":[]},{"text":"Landon H. Lewis Jr. as Stanley and Ryan's Client #1","elements":[]},{"text":"Leon Simmons Jr. as Stanley and Ryan's Client #2","elements":[]}]}],"images":[]}]}