{"sections":[{"title":"Trivia","level":1,"content":[{"type":"paragraph","text":"\"Trivia\" is the eleventh episode of the eighth season of the American comedy television series The Office and is the show's 163rd overall. It was directed by B.J. Novak and written by Steve Hely. It originally aired on NBC on January 12, 2012. It was viewed by 5.90 million people."},{"type":"paragraph","text":"\"Trivia\" received mostly positive reviews from critics, with many noting that the episode marked an improvement from the first part of the season. Despite this, several reviews were critical of the Dwight sub-plot. According to Nielsen Media Research, \"Trivia\" drew 5.87 million viewers and received a 2.9 rating\/7% share in the 18–49 demographic, staying relatively even with the previous three episodes, \"Christmas Wishes\", \"Gettysburg\" and \"Mrs. California\". It ranked third in its timeslot and was the highest-rated NBC series of the night."}],"images":[]},{"title":"Plot","level":2,"content":[{"type":"paragraph","text":"The cold opening begins with Dwight making a shushing gesture to the camera crew. Jim enters via the break room to hand Stanley a cup of orange juice and on his way to his desk, Andy shows Jim the time on his watch, to which Jim replies with a thumbs up. The entire office seem to go about their usual routine, but not one person is speaking. Jim reveals in a silent Talking Head that the whole office has arranged a challenge of a silent streak that has been going on for fourteen minutes thus far. Dwight receives a call and out of fear of breaking the streak, he picks up the phone and places it back down, refusing to answer and sparking a silent acknowledgement and cheer from his colleagues. In his office, Andy spots a raccoon eating a hamburger in the parking lot and excitedly (and silently) attempts to tell his employees. Kevin opens the wrapper of his candy bar and as he eats it, he exclaims, \"Oh yeah,\" breaking the silent streak. Oscar berates Kevin on his need to vocalize his phrase while Jim proposes that the entire office attempt to beat the record of twenty minutes after they have let out as much speaking as possible. Andy finally informs the office about the raccoon, Dwight tells Jim that the banging of his pen against his desk irritates Dwight, Erin asks the office if a first-aid kit is available for the noticeable cut on her hand and Darryl showcases a new song that he has written. The scene concludes with Jim counting down to restart the silent streak challenge."},{"type":"paragraph","text":"Andy, who is worried that he will not be able to meet the 8% quarterly sales growth figures that Robert California asked for by $830, starts to think of creative ways to sell more paper. During a conference room meeting, he proposes that everyone in the office buy paper to alleviate some of the burden, but no one is willing. He then decides to ask Oscar to make a rounding mistake in the books, but Oscar tells Andy that he does not have time to make the mistake because he is leaving for a trivia contest in a bar in Philadelphia. He tells Andy that the prize is $1000 and his team is determined to win it. Andy, encouraged by Darryl and Jim, decides to take the entire office to Philadelphia in an attempt to win the money and make up the sales growth difference. At the bar, which turns out to be a gay bar called the Liberty Well, Andy divides the office into three teams: Dunder Mifflin A-Team (Jim, Darryl, Andy, and Ryan), Dunder-Mifflin B-Team (Stanley, Phyllis, Creed, and Cathy), and the \"Just For Fun\" team (Kevin, Kelly, Erin, and Meredith). Oscar refuses to join Andy and stays on his original team. Initially, the Dunder Mifflin A-Team does well until they soon falter. However, much to Andy's surprise, the \"Just For Fun\" team (calling themselves The Einsteins) ends up doing much better than expected because of the group's trivial knowledge on a variety of issues. Humorously, the team misses the answers to a handful of common questions, including one about their namesake. They make it to the final round against Oscar's team and eventually win thanks to Kevin's correct answers. However, the Just for Fun team's luck runs out when they later get demolished while trying to win another bar's even more lucrative trivia contest."},{"type":"paragraph","text":"Meanwhile, Dwight heads down to Florida to meet with Robert California at the Sabre headquarters to discuss a possible manager position. While sitting in the waiting room, Dwight talks to Gabe, who describes himself as the \"toilet of the company\" who flushes all the unwanted items away. Robert then tells Dwight that he cannot meet with him but will have him meet with Bill, another executive, much to Dwight's frustration. However, Robert manipulates the situation by secretly calling Gabe and instructing him to not let Dwight speak with Bill either, but to have Gabe listen to Dwight's pitch and then reject him. Dwight, after being told by Gabe that he is not wanted as a manager, grabs and twists Gabe's arm and forces him to be taken to Robert's Florida condo. Initially, Robert tries to spare Dwight's feelings, but eventually turns him down by telling him he's a better salesman and his drive and energy would be wasted in a manager's position. Dwight then returns to Scranton."}],"images":[]},{"title":"Cultural references","level":2,"content":[{"type":"list","elements":[{"text":"Due to the episode largely taking place at a trivia contest, \"Trivia\" featured a plethora of cultural references:","elements":[]},{"text":"After Ryan uses his phone, the trivia reader chides him for checking his Grindr account, a geosocial networking application for gay men.","elements":[]},{"text":"Dwight compares himself to a Spanish conquistador, coming to Florida to \"claim what is rightfully [his].\"","elements":[]},{"text":"Several of the trivia teams featured names with culturally related puns. The teams included: The Queerenstein Bears, Joey Triviani, Impish Impresarios, Two Broke Dorks, Jason So-Gay-Kiss, Ladies Gaga, Aesop's Foibles, and Lawrence O-Trivier.","elements":[]},{"text":"Many of the references were either the answers to trivia questions, or incorrect guesses:","elements":[]},{"text":"The \"Einsteins\" erroneously guess \"See-atle\" when asked what city was on Ray Charles' mind when he wrote one of his most famous songs.","elements":[]},{"text":"After being asked a question about Albert Einstein, the \"Einsteins\" answer with Thomas Edison, much to the delight of the sarcastic trivia reader.","elements":[]},{"text":"Kelly is able to correctly guess a basketball question because she cross-referenced her knowledge of Khloé & Lamar and Dancing with the Stars.","elements":[]},{"text":"Kevin knows that the answer to the final trivia question is the 2001 French foreign film Les Jolies Choses, starring Marion Cotillard, because Cotillard \"exposes herself a number of times.\"","elements":[]},{"text":"Kevin phrases one of his trivia answers in the form of a question, as if he were playing Jeopardy!.","elements":[]},{"text":"Oscar incorrectly answers a trivia question with \"Le Scaphandre et le Papillon\".","elements":[]},{"text":"Phyllis mentions that Elizabeth Taylor's sixth husband was Richard Burton. They were actually married twice, making Burton her fifth and sixth husband.","elements":[]},{"text":"\"They haven't really improved on the Oreo, have they?\" Robert asks Dwight as he offers him some.","elements":[]},{"text":"The medal that Robert California offers Dwight is an Army Achievement Medal. The same medal can be seen displayed on Gabe's desk during Dwight's pitch to Gabe earlier in the episode.","elements":[]}]}],"images":[]},{"title":"Connections to previous episodes","level":2,"content":[{"type":"list","elements":[{"text":"Andy is trying to double the sales growth to 8% because Robert told him to do so in The Incentive.","elements":[]},{"text":"Gabe explains his appearances in the previous episodes, despite being \"permanently\" transferred to Florida by Jo Bennett in Search Committee.","elements":[]},{"text":"Andy calls Oscar \"C-Span,\" a name he gave him in The Incentive.","elements":[]},{"text":"Jo's autobiography, Take A Good Look is seen in the background at Sabre.","elements":[]},{"text":"Kathy is seen in a different desk clump after requesting a transfer to Andy in the previous episode Christmas Wishes.","elements":[]}]}],"images":[]},{"title":"Amusing details\/Trivia","level":2,"content":[{"type":"list","elements":[{"text":"Jenna Fischer (Pam Halpert) is credited but does not appear in this episode.","elements":[]},{"text":"After airing, the episode sparked a debate among fans, as well as critics, as to whether former leading actor Steve Carell had made an uncredited cameo as a member of an opposing trivia team. NBC later denied that Carell had made an appearance and stated that the situation was just a coincidence.","elements":[]},{"text":"While Gabe is interviewing Dwight, an Army Achievement Medal is seen on his desk in the background. Later on in the episode, Robert California offers his grandfather's Army Achievement Medal to Dwight.","elements":[]},{"text":"The gay bar Oscar goes to is in Philadelphia, the City of Brotherly Love. Oscar's association with this bar may be from his days in the closet. Although, you don't have to be in the closet to go to a gay bar.","elements":[]},{"text":"A possible explanation as to why Meredith knows that dyslexia is the number one learning disability among children is because she has a PhD in school psychology, which is revealed in the final season.","elements":[]},{"text":"Jo Bennet's autobiography is on the shelf behind Dwight.","elements":[]},{"text":"When someone asks what blind people think about, one of the things Erin lists off is \"darkness.\"","elements":[]}]}],"images":[]},{"title":"Cast","level":2,"content":[],"images":[]},{"title":"Main Cast","level":3,"content":[{"type":"list","elements":[{"text":"Rainn Wilson as Dwight Schrute","elements":[]},{"text":"John Krasinski as Jim Halpert","elements":[]},{"text":"B.J. Novak as Ryan Howard","elements":[]},{"text":"Ed Helms as Andy Bernard","elements":[]},{"text":"James Spader as Robert California","elements":[]}]}],"images":[]},{"title":"Supporting cast","level":3,"content":[{"type":"list","elements":[{"text":"Leslie David Baker as Stanley Hudson","elements":[]},{"text":"Brian Baumgartner as Kevin Malone","elements":[]},{"text":"Creed Bratton (actor) as Creed Bratton","elements":[]},{"text":"Kate Flannery as Meredith Palmer","elements":[]},{"text":"Mindy Kaling as Kelly Kapoor","elements":[]},{"text":"Ellie Kemper as Erin Hannon","elements":[]},{"text":"Angela Kinsey as Angela Martin","elements":[]},{"text":"Oscar Nunez as Oscar Martinez","elements":[]},{"text":"Craig Robinson as Darryl Philbin","elements":[]},{"text":"Phyllis Smith as Phyllis Vance","elements":[]},{"text":"Zach Woods as Gabe Lewis","elements":[]}]}],"images":[]},{"title":"Recurring Cast","level":3,"content":[{"type":"list","elements":[{"text":"Lindsey Broad as Cathy Simms","elements":[]}]}],"images":[]},{"title":"Guest Cast","level":3,"content":[{"type":"list","elements":[{"text":"Laurel Coppock as Stephanie","elements":[]},{"text":"Peter Gannon as Stu","elements":[]},{"text":"Brian Gattas as Xander","elements":[]},{"text":"Dan Gill as Philadelphia's Trivia Host","elements":[]},{"text":"Dan Levy as Stonewall Alliance's Trivia Host","elements":[]}]}],"images":[]}]}