{"sections":[{"title":"Turf War","level":1,"content":[{"type":"paragraph","text":"\"Turf War\" is the twenty-third episode of the eighth season of the American television comedy series The Office and is the show's 175th overall. It was directed by Daniel Chun and written by Warren Lieberstein and Halsted Sullivan. It originally aired May 3, 2012 on NBC. It was viewed by 4.44 million people."}],"images":[]},{"title":"Synopsis","level":2,"content":[{"type":"paragraph","text":"Dwight and Jim are on a sales hot streak due to the recent closing of the Binghamton branch, which left all of their clients up for the taking. Andy comes in to return Erin's socks, which she left at his place. Andy decides to stay and make a special dish of his and talk to Erin however Erin tells Andy of a new rule that Robert has set in place where visitors must sign in and wear name tags. Andy becomes annoyed by this and becomes even more confused upon learning that Robert closed the Binghamton branch, as they were doing fine. Robert comes in with sunglasses and insists that everyone be quiet before he pukes next to Jim and Dwight's desks. He admits that now that he and his wife's divorce is final he opened a crate of alcohol and got drunk last night. When Oscar confronts him on why Robert closed the Binghamton branch, Robert reveals to the camera that he has no memory of ever wanting to shut down the branch and that he had done it last night while drunk."},{"type":"paragraph","text":"A salesman from the Syracuse branch, Harry Jannerone, comes in demanding to speak to Jim and Dwight. He is angry that they're targeting clients from the Binghamton branch as they are in New York state and therefore should be Syracuse's clients. He also demands to speak to Lloyd Gross. Jim and Dwight reveal that Lloyd Gross is a fictional salesman that they made up in order to make more money due to the sales staff having commission caps. They enlist Toby to play him. Toby tries to play a no-nonsense guy, but Harry ends up scaring him off. They eventually decide to let Robert decide who should get the clients."},{"type":"paragraph","text":"Nellie comes up to Robert and tells him that she received his voice mail and then proceeds to answer several questions he asked in that voicemail. Robert, who had been completely drunk, has no memory of that message and enlists Pam to help him figure out what the message said."},{"type":"paragraph","text":"Jim, Dwight, and Harry approach Robert and ask how the Binghamton clients will be divided up. Robert is more focused on learning what the message on Nellie's phone was and tells them they will have to wait. The three are especially interested in the most important client, a large junk mail company that was Binghamton's largest client. When Andy hears that Robert is not allowing anyone to take it for the time being, Andy suddenly runs out to his car."},{"type":"paragraph","text":"Jim, Dwight, and Harry however are not very trusting of each other and suddenly find themselves racing to grab the client."},{"type":"paragraph","text":"Andy arrives first and claims that he is there from \"Big Red Paper Company\" and offers an awkward yet effective sales pitch."},{"type":"paragraph","text":"Pam tries to engage in conversation with Nellie and figure out what Robert's voicemail said, but Angela arrives and ruins Pam's plans. Angela reveals that Robert sent her in case Pam should fail. Gabe also comes in causing it to be even harder for Pam to get the information from Nellie."},{"type":"paragraph","text":"Jim and Dwight manage to get to the building first and Dwight latches the doors closed with his belt causing his pants to keep falling down. However, Harry still makes it into the building. They all race towards the client's office only to learn that he has already picked Big Red Paper Company as his new supplier."},{"type":"paragraph","text":"Pam ends up stealing Nellie's phone and she and Robert go through the messages and learn several secrets about Nellie such as she is a shopaholic, and she has failed to adopt a child. Pam feels guilty and deletes the messages."},{"type":"paragraph","text":"Pam goes to Nellie's office and the two share what appears to be the start of a friendship."},{"type":"paragraph","text":"Andy tries to convince Robert to rehire him because he just stole Robert's biggest client, but Robert declines harshly and warns Andy of a street fight. Andy then turns to David Wallace, to whom Andy suggests buying Dunder Mifflin; Wallace is skeptical, noting that the company has lost half its value over the last three years, but Andy seeks to turn this into a positive, countering that this consequence of Robert's mismanagement rendered it a bargain with significant upside."},{"type":"paragraph","text":"Jim, Dwight, and Harry all sit outside the client's office and drink some coffee. Harry predicts that Robert is going to run Dunder Mifflin into the ground within six months, leading to nervousness from Jim and Dwight."}],"images":[]},{"title":"Cultural references","level":2,"content":[{"type":"list","elements":[{"text":"Robert says he \"got into a case of Australian reds and Colombian whites\".","elements":[]},{"text":"In vino veritas is a Latin phrase that translates, \"in wine (there is the) truth\".","elements":[]},{"text":"Toby refers to Harry as \"Kemo Sabe\" (from The Lone Ranger).","elements":[]},{"text":"Dwight tells Jim to \"hit the NOS!\" and Jim replies, \"Like in Fast and Furious?\"","elements":[]},{"text":"Andy says that his wireless password is \"Eat Pray Love\".","elements":[]},{"text":"Robert compares shaping a company to training a geisha and claims he trained as one.","elements":[]},{"text":"A hula skirt is grass skirt from Polynesia or Hawaii.","elements":[]},{"text":"Andy's name for his new paper company is Big Red Paper Company, referring to the name and mascot of Cornell University's sports teams.","elements":[]},{"text":"When Robert excitedly says, \"Excellent, excellent\", he sounds like Mr. Burns from The Simpsons.","elements":[]}]}],"images":[]},{"title":"Connections to previous episodes","level":2,"content":[{"type":"list","elements":[{"text":"Robert calls Andy an \"ineffectual, privileged, effete, soft-penised debutante\", referring to Andy's Ivy League background and erectile dysfunction from the episode Angry Andy.","elements":[]},{"text":"Jim mentions his dream of owning a bike shop again (Lotto).","elements":[]}]}],"images":[]},{"title":"Amusing details\/Trivia","level":2,"content":[{"type":"list","elements":[{"text":"Dan Castellaneta voices Homer Simpson and many other characters on The Simpsons.","elements":[]},{"text":"When Robert California mentions \"Colombian whites\" (referring to cocaine) the camera shows Ryan nodding next to Creed, two characters who have a history with drugs.","elements":[]},{"text":"Dwight's pants fall down because he uses his belt to tie the door shut.","elements":[]}]}],"images":[]},{"title":"Cast","level":2,"content":[],"images":[]},{"title":"Main Cast","level":3,"content":[{"type":"list","elements":[{"text":"Rainn Wilson as Dwight Schrute","elements":[]},{"text":"John Krasinski as Jim Halpert","elements":[]},{"text":"Jenna Fischer as Pam Halpert","elements":[]},{"text":"B.J. Novak as Ryan Howard","elements":[]},{"text":"Ed Helms as Andy Bernard","elements":[]},{"text":"James Spader as Robert California","elements":[]}]}],"images":[]},{"title":"Supporting Cast","level":3,"content":[{"type":"list","elements":[{"text":"Catherine Tate as Nellie Bertram","elements":[]},{"text":"Leslie David Baker as Stanley Hudson","elements":[]},{"text":"Brian Baumgartner as Kevin Malone","elements":[]},{"text":"Creed Bratton (actor) as Creed Bratton","elements":[]},{"text":"Kate Flannery as Meredith Palmer","elements":[]},{"text":"Ellie Kemper as Erin Hannon","elements":[]},{"text":"Angela Kinsey as Angela Martin","elements":[]},{"text":"Paul Lieberstein as Toby Flenderson","elements":[]},{"text":"Oscar Nunez as Oscar Martinez","elements":[]},{"text":"Craig Robinson as Darryl Philbin","elements":[]},{"text":"Phyllis Smith as Phyllis Vance","elements":[]},{"text":"Zach Woods as Gabe Lewis","elements":[]}]}],"images":[]},{"title":"Recurring Cast","level":3,"content":[{"type":"list","elements":[{"text":"Andy Buckley as David Wallace","elements":[]}]}],"images":[]},{"title":"Guest Cast","level":3,"content":[{"type":"list","elements":[{"text":"Chris Bauer as Harry Jannerone","elements":[]},{"text":"Dan Castellaneta as Mr. Ramish (CEO of Prestige Direct Sale Solutions)","elements":[]},{"text":"Aimee Shyn as Receptionist","elements":[]}]}],"images":[]}]}