{"sections":[{"title":"Weight Loss","level":1,"content":[{"type":"paragraph","text":"\"Weight Loss\" is the first\/second episode of the fifth season of The Office and 73rd\/74th episode overall. It was written by Lee Eisenberg and Gene Stupnitsky, and was directed by Paul Feig. It first aired on September 25, 2008 and was viewed by 9.2 million people."}],"images":[]},{"title":"Synopsis","level":2,"content":[{"type":"paragraph","text":"The Scranton branch participates in a weight loss competition to see which branch can lose the most cumulative weight, with a prize of three extra vacation days (which later changes to five due to every branch performing poorly) for every employee in the winning branch. Although the branch is enthusiastic at first, the competition begins to take a huge toll on many of the employees, particularly Kelly, who stops eating and tries various kinds of diets, ultimately collapsing after one of the weigh-ins and later consuming a “tape worm” supplied by Creed. As a result, corporate sends a memo insisting that the staff need not resort to drastic measures to lose weight."},{"type":"paragraph","text":"Pam begins her three-month stay in New York to attend classes in graphic design at the Pratt Institute, leaving Jim to adjust to her being away. Pam is temporarily replaced by Ronni, an older woman, and she is quickly replaced by Ryan, who was recently fired by Dunder Mifflin for fraud. Ryan, who is shown to be planning to rise again in the company, tries to make up with several workers he had treated badly. He apologizes to his former girlfriend Kelly, and asks her out, only to be rejected because she's dating Darryl, and is mocked by Jim when Ryan apologizes to him."},{"type":"paragraph","text":"Michael successfully continues his casual bonding with Holly, with Jim noting that his success is due to Holly being \"kind of a major dork\". However, when Holly notices Michael talking in his office with a pregnant Jan, she asks Oscar to set her up with his yoga instructor. Michael learns of this and gets frustrated with Jim because he did not ask Holly out months earlier, which he wanted to but Jim told him not to. At one point, Angela chastises Kevin for improperly accounting for sales numbers. Holly, who thinks Kevin is mentally challenged, yells at Angela for treating Kevin so rudely, but when she refers to him as \"mentally challenged,\" Kevin awkwardly reveals that he is not. Embarrassed, Holly apologizes and walks away."},{"type":"paragraph","text":"Due to the poor results of the Scranton branch weigh ins, Dwight “randomly selects” Kevin, Phyllis and Stanley to get liposuction surgery. An insulted Phyllis is later approached by Dwight, who attempts to apologize by recruiting her for a two-person sale. Hours later, a sweaty and infuriated Phyllis returns to the office and reveals that there was no sale, and that Dwight left her in a warehouse five miles away without her purse or phone. Dwight tries to justify his actions by pointing out how many calories she burned on the walk home; in response, Phyllis calls corporate to report him."},{"type":"paragraph","text":"Due to Dwight’s actions, the next weigh in is skipped. Holly tries to hold a meeting involving positive body images, but is sabotaged by Michael in his Michael Klump persona (achieved by wearing a plus-size outfit over one of his sumo suits from Beach Games). Michael argues that Michael Klump is a “celebration of fat people,” as opposed to Oscar and Kevin’s opinions that it is his “making fun of fat people character.” Michael forces an inauthentic apology out of Dwight, then reminds his subordinates that the weight loss contest was not just about weight loss, but positive body image and healthy lifestyles as a whole. He then requests that Kelly cease her unhealthy dieting habits and begin eating once again."},{"type":"paragraph","text":"Phyllis takes over the Party Planning Committee after catching Angela cheating on Andy with Dwight. Andy has been making plans for his wedding with Angela, who irritatedly rejects all of his ideas. After Andy gives a heartfelt speech about not caring where they marry because he wants to be with her forever, Angela warms up to him a little. However, later in the episode Angela's disinterest resumes after Andy's persists in bringing his old a cappella group to be his best man, causing her and Dwight to resume their intimate affair."},{"type":"paragraph","text":"Jim, having an unsatisfactory summer due to not being able to see Pam, asks her on a last minute lunch date at an interstate rest stop in between Scranton and New York City. At the rest stop, in a pouring rain, Jim finally proposes to Pam, and she happily accepts. Holly buys Counting Crows tickets as a surprise for the yoga instructor, but he never calls. Michael denigrates the yoga instructor for not calling her back, much to her apparent pleasure. He then offers to buy the tickets from her, only to tear them up in front of her and tells her to forget about being stood up."},{"type":"paragraph","text":"The Scranton branch loses the competition to the Utica branch, much to the disappointment of the employees. Stanley, however, is pleased with the fact that he personally lost seven pounds and decides to take an extra five days off anyway. In the last scene, Toby is seen in a hospital in Costa Rica, having broken his neck due to a malfunctioning zip-line harness on the third day of his new life and has been subsequently hospitalized for five weeks."}],"images":[]},{"title":"Deleted scenes","level":2,"content":[{"type":"list","elements":[{"text":"Dwight describes his perfect last meal - including how he would use the razorblade inside the souffle to escape from prison.","elements":[]},{"text":"Oscar speaks with Toby about his time in Costa Rica.","elements":[]},{"text":"Oscar complains to Andy after turning the heat up.","elements":[]},{"text":"Kevin dumps the contents of his M&M's jar in the trash, which impresses Oscar - until he replaces them with Raisinets.","elements":[]},{"text":"Oscar says in a talking head that, while he is in very good shape, within the gay community, his physique is nowhere near as impressive.","elements":[]},{"text":"Jan criticizes Michael's foot-massaging.","elements":[]},{"text":"An alternate version of Jim's revelation that Michael claimed to have fathered Jan's baby, followed by Jim pulling out and reading aloud a letter from Jan, given to everyone in the office, in which she emphatically insists that Michael is not the baby's father, who is not anyone she or the office had ever met (though a deleted scene from Baby Shower would suggest that this might not be true).","elements":[]},{"text":"Ryan's mom drops him off at work.","elements":[]},{"text":"Ryan takes a call from David Wallace, who becomes surprised and outraged that Ryan is working for the company again. Over the phone, Wallace proceeds to tear into Ryan with such invective that he begins to cry, as the rest of the office looks on in shock (not unlike their reaction to Dwight's bended-knee mea culpa in The Coup). In a talking head interview, a still-tearful Ryan says that Wallace is now on his revenge list.","elements":[]},{"text":"Michael takes the call from Wallace; in addition to his anger over Ryan's presence, the CFO mentions Phyllis's complaint about being abandoned by Dwight.","elements":[]}]}],"images":[]},{"title":"Trivia","level":2,"content":[{"type":"list","elements":[{"text":"The scenes at the Pratt Institute were filmed at the University of Southern California.","elements":[]},{"text":"In this episode we learn that Holly Flax's given name is actually Hollis Flax, as revealed on the nameplate on her desk in the annex, which says, \"Hollis 'Holly' P. Flax, Human Resources\".  The nameplate is visible as the scene opens when Holly flips a paper down in the file she's looking at and looks over the wall of her cubicle to ask Kelly if she's okay when she hears her coughing.  ","elements":[]},{"text":"The maple syrup\/lemon juice\/cayenne pepper and water \"cleanse diet\" Kelly is on in this episode is called The Master Cleanse or Lemonade Diet.","elements":[]},{"text":"Pam's enthusiastic \"What up, 2-1-2\", is a reference to the 212 area code used in the Manhattan area of New York City. However, the Pratt Institute uses the 718 area code.","elements":[]},{"text":"According to Darryl's scale, Pam weighs 126 pounds, not 226 as Kevin calculates.","elements":[]},{"text":"Also according to Darryl's scale, by the end of the summer Stanley weighs 315 pounds.","elements":[]},{"text":"As of this episode, Amy Ryan is credited as a Special Guest Star.","elements":[]},{"text":"Aspiring actor Stefan Kumor appeared as an extra in two scenes from this episode. His local newspaper covered the story. Hudson native makes first splash into Hollywood.","elements":[]},{"text":"The song playing during the birthday party is \"Here You Come Again\" by Dolly Parton.","elements":[]},{"text":"The reason Dwight and Andy are wearing garbage bags is to lose water weight. Wearing a garbage bag helps make a person sweat since the bag keeps them heated.","elements":[]},{"text":"While writing to Pam on the computer about meeting up at a rest stop, Jim says the rest stop is located at exit 17 of a highway. However, the three main highways from Scranton to New York: I-78, I-80 and I-84 do not have any rest stops at exit 17. I-80 doesn't even have an exit 17.","elements":[]}]}],"images":[]},{"title":"Amusing details","level":2,"content":[{"type":"list","elements":[{"text":"As Darryl weighs the office staff and finds that they have lost no weight, he eats an ice cream sandwich.","elements":[]},{"text":"After Holly leads a yoga lesson, Michael asks Jim, \"Did you see Holly's butt?\", but Holly's butt was facing away from everyone else.","elements":[]},{"text":"Angela goes to bed at 8:30.","elements":[]},{"text":"Meredith appears to have some issue with her face. This is especially present in the scenes in the warehouse on the scale. In a deleted scene, Meredith says that she went on a fishing boat with some guys and that she doens't think she caught anything. This suggests that she did catch something that caused her face to appear the way it does.","elements":[]},{"text":"Holly, after engaging in an awkward encounter with Oscar, says, \"Okay...I'm just gonna head on back to my work area over here,\" pointing to the bullpen, even though she doesn't work in the bullpen, she works in the annex.","elements":[]},{"text":"When Holly informs Michael that they lost the contest, she knocks on the door with the opening phrase of shave and a haircut. After Michael invites her in, she knocks the final two notes.","elements":[]},{"text":"Angela tells the camera in a talking head interview her nighttime ritual. This was after she and Dwight came out of the warehouse. Presumably, the camera crew asked her, \"How do you sleep at night?\"","elements":[]},{"text":"It seems from Angela's talking head interview she was aware that the film crew knew of her affair with Dwight. However, in one of the final episodes of the series Promos, when she sees the scene of her and Dwight in the warehouse she seems shocked that the crew caught it on film. It is possible that Angela never thought the documentary would contain these scenes.","elements":[]},{"text":"When Jim leaves to see Pam in New York City, Michael gives him a condom from his wallet saying, \"You don't want to end up with a surprise pregnancy like me.\" In Company Picnic, Jim and Pam are very surprised to find out that she is in fact pregnant.","elements":[]},{"text":"While discussing his weight loss, Stanley shows the camera a picture of himself when he was younger. It appears that he was a member of the Black Panther Party.","elements":[]}]}],"images":[]},{"title":"Connections to previous episodes","level":2,"content":[{"type":"list","elements":[{"text":"Michael is wearing a sumo suit from Beach Games under his business suit. \"I'm so glad I bought instead of rented.\"","elements":[]},{"text":"In the hospital Toby watches the \"hug it out, bitch\" scene from Entourage, a scene which Michael re-creates in the episode The Coup.","elements":[]},{"text":"Michael is rude to Ronni, just as he often makes offensive or suggestive remarks to Pam.","elements":[]},{"text":"After Michael asks how the staff can live forever, Jim replies, \"Cryogenics. Beer me five.\" This refers to Andy's use of 'beer me' in Product Recall (\"Beer me that disc,\" and Jim's \"Lord beer me strength.\")","elements":[]},{"text":"We can see the name plate that was given to Kelly the episode \"Christmas Party\".","elements":[]},{"text":"Angela asks Andy if their first dance can be to her favorite song, \"The Little Drummer Boy\", a song which Angela previously sang karaoke to in A Benihana Christmas and Dwight hummed to in the pilot episode as he is setting up his desk.","elements":[]}]}],"images":[]},{"title":"Goofs","level":2,"content":[{"type":"list","elements":[{"text":"In a continuity error, when Jim is eating lunch with Michael and Holly in the break room, Michael appears to not have his goatee anymore. However, the next time we see Michael (doing his Michael Clump impersonation), he still has his goatee. This scene should perhaps have been a deleted scene due to the fact that is it completely out of place and not really connected to anything else in the episode.","elements":[]},{"text":"In Job Fair, Andy tells Mr. Maguire that he is from the Cornell Class of 1995. When talking to Angela he says he booked the Class of 1996. This was not the year he previously stated to Mr. Maguire, but in his recital of names to Angela he mentions Broccoli Rob. In Here Comes Treble, it is clear that Andy and Broccoli Rob were in the same Here Comes Treble group, which makes whether he graduated Cornell in 1995 or 1996 unclear.","elements":[]},{"text":"When Dwight and Angela exit from their last \"tryst\", the mini boombox changes from being held in Dwight's right hand to his left hand.","elements":[]}]}],"images":[]},{"title":"Cast","level":2,"content":[],"images":[]},{"title":"Main cast","level":3,"content":[{"type":"list","elements":[{"text":"Steve Carell as Michael Scott","elements":[]},{"text":"Rainn Wilson as Dwight Schrute","elements":[]},{"text":"John Krasinski as Jim Halpert","elements":[]},{"text":"Jenna Fischer as Pam Beesly","elements":[]},{"text":"B.J. Novak as Ryan Howard","elements":[]}]}],"images":[]},{"title":"Supporting cast","level":3,"content":[{"type":"list","elements":[{"text":"Melora Hardin as Jan Levinson","elements":[]},{"text":"Ed Helms as Andy Bernard","elements":[]},{"text":"Leslie David Baker as Stanley Hudson","elements":[]},{"text":"Brian Baumgartner as Kevin Malone","elements":[]},{"text":"Creed Bratton (actor) as Creed Bratton","elements":[]},{"text":"Kate Flannery as Meredith Palmer","elements":[]},{"text":"Mindy Kaling as Kelly Kapoor","elements":[]},{"text":"Angela Kinsey as Angela Martin","elements":[]},{"text":"Paul Lieberstein as Toby Flenderson","elements":[]},{"text":"Oscar Nunez as Oscar Martinez","elements":[]},{"text":"Craig Robinson as Darryl Philbin","elements":[]},{"text":"Phyllis Smith as Phyllis Vance","elements":[]}]}],"images":[]},{"title":"Recurring cast","level":3,"content":[{"type":"list","elements":[{"text":"Amy Ryan as Holly Flax","elements":[]},{"text":"Rich Sommer as Alex","elements":[]},{"text":"Andy Buckley as David Wallace (deleted scene)","elements":[]}]}],"images":[]},{"title":"Guest cast","level":3,"content":[{"type":"list","elements":[{"text":"Dale Raoul as Ronni","elements":[]},{"text":"Jim Petersmith as Bearded Professor","elements":[]},{"text":"Sandra Tsing Loh as Professor Monahan","elements":[]}]}],"images":[]},{"title":"References","level":2,"content":[{"type":"list","elements":[{"text":"↑ Hey, Look! Pam's Making Some Drawrings, Kristin Dos Santos, Watch with Kristin blog, August 7, 2008.","elements":[]}]}],"images":[]}]}