{"sections":[{"title":"Welcome Party","level":1,"content":[{"type":"paragraph","text":"\"Welcome Party\" is the twentieth episode of the eighth season of the American television comedy series The Office and the show's 172nd overall. It was written by Steve Hely and directed by Ed Helms. It originally aired on NBC April 12, 2012. It was viewed by 4.39 million people."}],"images":[]},{"title":"Synopsis","level":2,"content":[{"type":"paragraph","text":"Robert California forces the office to throw a welcome party for Nellie, but the Party Planning Committee works on ways to sabotage it. Jim and Dwight are sent to Nellie's apartment to help her move in. When Dwight suggests bringing in a magician to move her furniture magically, Nellie quickly admits her disdain for stage magicians, prompting Jim to call Pam about hiring a magician for Nellie's party. Jim and Dwight find a shoe box with a note to Nellie from herself saying not to open it. Inside, they find photos of her with another man and deduce him to be an ex-boyfriend. When Nellie finds them with the photos, she says that she lost everything when he broke up with her. One of the photos shows him as a stage magician, which became the root of her distaste of magicians. Jim calls Pam back telling her to reconsider some of the party ideas. Pam tries to convince the other employees to little or no avail."},{"type":"paragraph","text":"At the party, the employees vent their hatred of Nellie onto Pam to avoid admitting the truth, making Pam uncomfortable. The magician that was hired arrives, much to Nellie's dismay. Jim, Dwight, and Pam, out of solidarity to Nellie, sabotage the magician's tricks until he reaches breaking point and Dwight kicks him out. Nellie and Robert commend the employees for throwing a good party, but Kevin complains that the carrot cake has actual vegetables in it, which Pam made as a prank. When Jim and Pam leave for the day, Pam asks Hank why he let the magician into the elevator when he was asked not to. Hank, busy reading a magazine, claims not to have noticed him, stating that as a magician he could have slipped by."},{"type":"paragraph","text":"Meanwhile, Andy and Erin decide not to get together officially until he breaks up with Jessica. On their way back to Scranton, they stop at Jessica's family's log cabin, where they encounter a bunch of Jessica's friends and family having a bachelorette party and drinking. Andy and Erin decide to bail, but Jessica returns from her morning run. After staying a while, Andy asks Jessica into the kitchen where she deduces that he is breaking up with her. Erin is surprised however when Jessica says that Andy told her he didn't think Erin was relationship material. Andy doesn't deny saying that, instead opting to claim that he's gay and leaves awkwardly with Erin. In the car, Andy says he made those comments about Erin because he was with Jessica at the time. Erin is visibly disheartened and decides to get some sleep. Andy decides to head back to the cabin to tell Jessica and her party that he broke up with her because he wanted to be with Erin and that she is relationship material, while Erin overhears. Jessica and her party chase Andy and Erin back to the car. Erin passionately kisses Andy inside the car while the party throws cake at them, prompting a quick getaway."}],"images":[]},{"title":"Cultural References","level":2,"content":[{"type":"list","elements":[{"text":"Dwight mentions the video game Tetris.","elements":[]},{"text":"He also says he should have a \"Tweeter\" account, meaning the popular microblogging service Twitter.","elements":[]},{"text":"The Eiffel Tower is a famous landmark in Paris, France.","elements":[]},{"text":"Nellie's shoe box is a box from the shoe company Clark's, which is a British based company. This is an obvious reference to Nellie's homeland.","elements":[]},{"text":"Andy said he imagined being in a steam room with John Stamos while making love to Jessica.","elements":[]},{"text":"Erin says she got tired by seeing a turkey. A common assertion is that heavy consumption of turkey meat results in drowsiness, due to high levels of tryptophan contained in turkey. It's interesting Erin became sleepy without eating any of the turkey.","elements":[]},{"text":"Pam is listening to the song \"Fancy\" by Drake feat Swizz Beats.","elements":[]}]}],"images":[]},{"title":"Connections to previous episodes","level":2,"content":[{"type":"list","elements":[{"text":"Andy tries to make breaking up with Jessica easier by saying he's gay. He wondered if he was really gay in the season six episode Gossip.","elements":[]},{"text":"Andy and Erin are wearing Savannah, Georgia t-shirts. Possibly a reference to the episode Murder, the game was set in Savannah and Andy asked Erin on a date.","elements":[]}]}],"images":[]},{"title":"Cast","level":2,"content":[],"images":[]},{"title":"Main Cast","level":3,"content":[{"type":"list","elements":[{"text":"Rainn Wilson as Dwight Schrute","elements":[]},{"text":"John Krasinski as Jim Halpert","elements":[]},{"text":"Jenna Fischer as Pam Halpert","elements":[]},{"text":"B.J. Novak as Ryan Howard","elements":[]},{"text":"Ed Helms as Andy Bernard","elements":[]},{"text":"James Spader as Robert California","elements":[]}]}],"images":[]},{"title":"Supporting Cast","level":3,"content":[{"type":"list","elements":[{"text":"Catherine Tate as Nellie Bertram","elements":[]},{"text":"Leslie David Baker as Stanley Hudson","elements":[]},{"text":"Brian Baumgartner as Kevin Malone","elements":[]},{"text":"Creed Bratton (actor) as Creed Bratton","elements":[]},{"text":"Kate Flannery as Meredith Palmer","elements":[]},{"text":"Mindy Kaling as Kelly Kapoor","elements":[]},{"text":"Ellie Kemper as Erin Hannon","elements":[]},{"text":"Angela Kinsey as Angela Martin","elements":[]},{"text":"Oscar Nunez as Oscar Martinez","elements":[]},{"text":"Craig Robinson as Darryl Philbin","elements":[]},{"text":"Phyllis Smith as Phyllis Vance","elements":[]},{"text":"Zach Woods as Gabe Lewis","elements":[]}]}],"images":[]},{"title":"Recurring Cast","level":3,"content":[{"type":"list","elements":[{"text":"Hugh Dane as Hank","elements":[]},{"text":"Eleanor Siegler as Jessica","elements":[]}]}],"images":[]},{"title":"Guest Cast","level":3,"content":[{"type":"list","elements":[{"text":"Brett Gelman as The Magician","elements":[]},{"text":"Dana Powell as Megan","elements":[]},{"text":"Sue Redman as Lauren","elements":[]},{"text":"Zabeth Russell as Bachelorette Party Guest","elements":[]},{"text":"Greg Worswick as Kenny","elements":[]}]}],"images":[]}]}