{"sections":[{"title":"Whistleblower","level":1,"content":[{"type":"paragraph","text":"\"Whistleblower\" is the twenty-sixth episode of the sixth season and the 126th episode of The Office overall. It was written by Warren Lieberstein and Halsted Sullivan. It was directed by Paul Lieberstein. The episode aired on May 20th, 2010. It was the last episode of Season 6. It was viewed by 6.60 million people."}],"images":[]},{"title":"Synopsis","level":2,"content":[{"type":"paragraph","text":"After the press grills Michael about Sabre's printers catching on fire, CEO Jo Bennett shows up to the office. Jo smolders as she explains that the defect was found recently and the company was just about to send out a software patch with a letter offering free toner to those affected by the defect. Instead, someone took it upon themselves to alert the media and cause a massive PR problem for the company. She wants to know who it was. Because Andy found out about the problem first, most of the employees believe he's the responsible person. Jo decides to start at the top and pulls Michael into the conference room to interrogate him. She's always believed that an innocent person would recommend a harsh punishment. Michael does not disappoint. He is also adamant that none of his people would have leaked the story."},{"type":"paragraph","text":"Dwight refuses to waste any time. He immediately denies responsibility and gives Jo a long list of people she should fire. She's satisfied. Changing the subject, she mentions his very profitable year. Dwight doesn't have any real ideas as to where to go next. She strongly suggests he invest in real estate. After a lot of consideration, Dwight attempts to buy the Scranton Business Park and suggests in a conversation with Hank the security guard that he will implement sweeping changes to the place."},{"type":"paragraph","text":"Meanwhile, while Sabre's IT guy, Nick, checks everyone's computers for evidence, Michael is pressured by the others to get Andy to confess. Andy points out that Darryl was just as upset about the issue. After confronting Darryl, Michael is stunned when Darryl admits to disclosing the information to a woman at a bar who turned out to be a journalist. Then Pam confesses to Jim that she mentioned it in casual conversation with another mother at the day-care center whose husband also happened to be a journalist. When she tells Michael, he asks her and Darryl to meet him in Meredith's van. Kelly joins them as she revealed the news on Twitter out of boredom. The three suggest to Michael that he should try to talk to Jo about the situation so that they can confess without losing their jobs."},{"type":"paragraph","text":"When Michael changes his tune about harshly punishing the whistleblower, Jo realizes that he knows who it is. He refuses to name names. Jo takes him to her private plane and changes tactics. He admits his life hasn't been great this year. Besides the many small things that have made him realize he's not satisfied, he desperately misses Holly. Jo opens up about how she'd always dreamed of being a powerful woman who could set an example for young girls. Instead, she's going to be remembered as someone who sells cheap printers that burst into flames. There's a press release that someone will have to read and she's dreading having to do it. Michael offers to \"fall on his sword\" and announce the public apology for her."},{"type":"paragraph","text":"Back at the office, Gabe finishes interviewing everyone and deduces that Andy is the one who talked with the press. Everyone tries to suggest that it could be someone else, perhaps even Gabe. At that moment, Nick suddenly announces that he is quitting to go teach inner-city children in Detroit how to use computers. The employees don't even know his name and aren't interested in his news. In retaliation, Nick reveals all their private information he found on their computers, including that he found on Andy's computer the Quicktime video he shot with Darryl and a message he emailed to a local newspaper."},{"type":"paragraph","text":"At the end of the day, Andy finds himself harassed by the other employees. However, Erin commends Andy's bravery, and he leaves smiling."},{"type":"paragraph","text":"Michael is shown giving a public apology to a news crew, after which Jo tells him she will owe him a favor. When Michael jokingly asks to bring Holly back to Scranton, Jo responds by telling him that she will look into it, leaving him at a loss of words as the episode ends."}],"images":[]},{"title":"Trivia","level":2,"content":[{"type":"list","elements":[{"text":"During the cold opening, Michael announces that the office is at \"DEFCON 5.\" This is actually the lowest level of DEFCON, meaning the office is at peace and not in a crisis.","elements":[]},{"text":"This episode is one of the only episodes where Michael is shown in a semi-serious light.","elements":[]},{"text":"Dwight says that the office building is on 1725 Slough Avenue, a reference to the city of Slough, where Wernam-Hogg is located in the British series.","elements":[]},{"text":"Ryan creates a messaging-like application for the iPhone called the \"WUPHF.\" A service similar to this already exists, known as ping.fm.","elements":[]},{"text":"This is Nick's (the eighth IT Guy) last episode as he announces that he is leaving to teach kids about computers. It is revealed that no one remembers his name and brushes him off as he attempts to get a goodbye from Scranton Branch.","elements":[]}]}],"images":[]},{"title":"Connections to previous episodes","level":2,"content":[{"type":"list","elements":[{"text":"In this episode, David Wallace makes an appearance during an interview. He is supposed to discuss his feelings towards the Sabre printer controversy. However, he instead takes the time to promote his invention \"Suck-It,\" an idea that he shared in the episode Sabre.","elements":[]}]}],"images":[]},{"title":"Cultural references","level":2,"content":[{"type":"list","elements":[{"text":"There is a reference to the movie Airplane! during Michael's conversation in the private jet.","elements":[]},{"text":"When Jo asks for the whistleblower to confess, Phyllis quietly says to Andy \"Raise your hand Norma Rae,\" a reference to the 1979 movie Norma Rae.","elements":[]},{"text":"Michael makes a reference to \"Montego Bay,\" which is part of the Sandals resort (in Jamaica) to which he took Jan earlier in the series. He means to refer to \"Guantanamo Bay,\" which is located in Cuba.","elements":[]},{"text":"The scene where Jo is suggesting to Toby how to write his mystery novel is a reference to the movie Misery where Kathy Bates (Jo) is an obsessive fan of a mystery writer and tries to get him to write his novels the way she wants.","elements":[]},{"text":"There is a reference to the company Blockbuster during Michael's conversation in the private jet","elements":[]}]}],"images":[]},{"title":"Cast","level":2,"content":[],"images":[]},{"title":"Main cast","level":3,"content":[{"type":"list","elements":[{"text":"Steve Carell as Michael Scott","elements":[]},{"text":"Rainn Wilson as Dwight Schrute","elements":[]},{"text":"John Krasinski as Jim Halpert","elements":[]},{"text":"Jenna Fischer as Pam Halpert","elements":[]},{"text":"B.J. Novak as Ryan Howard","elements":[]},{"text":"Ed Helms as Andy Bernard","elements":[]}]}],"images":[]},{"title":"Supporting cast","level":3,"content":[{"type":"list","elements":[{"text":"Leslie David Baker as Stanley Hudson","elements":[]},{"text":"Brian Baumgartner as Kevin Malone","elements":[]},{"text":"Creed Bratton (actor) as Creed Bratton","elements":[]},{"text":"Kate Flannery as Meredith Palmer","elements":[]},{"text":"Mindy Kaling as Kelly Kapoor","elements":[]},{"text":"Ellie Kemper as Erin Hannon","elements":[]},{"text":"Angela Kinsey as Angela Martin","elements":[]},{"text":"Paul Lieberstein as Toby Flenderson","elements":[]},{"text":"Oscar Nunez as Oscar Martinez","elements":[]},{"text":"Craig Robinson as Darryl Philbin","elements":[]},{"text":"Phyllis Smith as Phyllis Vance","elements":[]}]}],"images":[]},{"title":"Special guest star","level":3,"content":[{"type":"list","elements":[{"text":"Kathy Bates as Jo Bennett","elements":[]}]}],"images":[]},{"title":"Recurring cast","level":3,"content":[{"type":"list","elements":[{"text":"Zach Woods as Gabe Lewis","elements":[]},{"text":"Andy Buckley as David Wallace","elements":[]},{"text":"David Koechner as Todd Packer","elements":[]},{"text":"Hugh Dane as Hank Tate","elements":[]},{"text":"Nelson Franklin as Nick","elements":[]},{"text":"Hidetoshi Imura as Hidetoshi Hasagawa","elements":[]},{"text":"Calvin Tenner as Glenn","elements":[]}]}],"images":[]}]}