{"sections":[{"title":"Work Bus","level":1,"content":[{"type":"paragraph","text":"\"Work Bus\" is the fourth episode of the ninth season of The Office and is the show's 180th overall. It was written by Brent Forrester and directed by Bryan Cranston. It aired on NBC on October 18, 2012 and was viewed by 4.28 million people."},{"type":"paragraph","text":"In the episode Jim convinces Dwight that the building is unsafe; Dwight rents a bus and sets up the office inside. Nellie asks for Andy's help in adopting a baby. Meanwhile, Jim tries to make Pam happy with some pie."}],"images":[]},{"title":"Synopsis","level":2,"content":[{"type":"paragraph","text":"Andy presents the office staff a video compilation of the team's softball season. While the staff are initially excited they soon realize it is Andy's horrible attempt to engage in the internet craze of making a \"fail video\". The video consists of the staff doing whatever was considered normal and Andy making vulgar noises over it. In retaliation Jim pulls up a video of Andy trying to carry the full water cooler, which ends with Andy falling down and spilling the water all over himself. The office staff begin to chant \"Fail! Fail!\" at Andy to which he eventually gets angry and leaves."},{"type":"paragraph","text":"Toby and Erin are testing for electromagnetic field hotspots around the office due to non-insulated wiring and they find many spots, which they mark with red tape. Dwight scoffs at needing to insulate the wires, stating that he refuses to do so because it is too costly."},{"type":"paragraph","text":"Jim meanwhile is being extremely nice to Pam due to her being supportive of Jim wanting to go to Philadelphia to work with his friend on their new business. He is looking for a way to pay her back."},{"type":"paragraph","text":"Nellie is looking eagerly to fulfill her lifelong dream of adopting a child. She asks Andy if he is willing to help her out by writing a character reference, but Andy rejects her, still hating her for what she did to him."},{"type":"paragraph","text":"The office staff are still angry at Dwight for caring more about money than about their own safety. Dwight argues that in order to insulate the wires they would have to open the walls and close the office building down for a week. Pam makes a comment about how she would love a week off work and Jim immediately sets off to work on achieving this. He puts a popcorn bag in the microwave and only pops one kernel before placing it under Dwight's desk. He achieves making Dwight believe the electromagnetic radiation caused it to occur and finally scares Dwight when Jim tells him it may cause infertility."},{"type":"paragraph","text":"Jim believes he got them a week off work, but Dwight reveals he has gotten them a new workspace for the week, a bus. The office staff find it cramped and uncomfortable. Meanwhile, Erin learns of Nellie wanting to adopt a child, and having been a foster kid herself, offers to help Nellie write her letter."},{"type":"paragraph","text":"Jim, having failed at getting Pam a week off work, decides to cheer her up by convincing Dwight to drive the bus to LaVerne's pie stand, Pam's favorite pie shop. Dwight refuses at first but after convincing Andy and the rest of the office staff Dwight is forced to do so. The bus drives off, leaving Clark and Darryl behind but they don't seem to mind in the least."},{"type":"paragraph","text":"While the bus drives along it picks up a hitchhiker, Creed, who smiles and loudly announces that he is playing hooky from work, before realizing that the entire office staff is on the bus."},{"type":"paragraph","text":"Nellie submits her letter to Andy, and he loudly and rudely tells Nellie how poorly written the letter is and how her dream will never come true. Nellie quietly goes to the front of the bus and behind a curtain. Erin has clearly heard this as well."},{"type":"paragraph","text":"Dwight decides to stop the bus, as he is tired of being pushed around by Jim. The fact that Philip was not his child has been gnawing away at him, and he climbs out the emergency exit door in the roof and goes off to sulk. Pam notices this is uncharacteristic of Dwight and tells Jim to go find out if he is okay."},{"type":"paragraph","text":"After some awkward conversation about how Dwight is sad that he is still childless after all this time he eventually comes to the realization that the office staff are kind of like his children. Jim is finally able to convince him to go to the pie stand."},{"type":"paragraph","text":"Andy hears who he believes to be Nellie sobbing behind the curtain and jokes with Pete about British women being over-emotional, but Pete remarks, \"I don't think that's Nellie.\" It's revealed that Erin is crying from what Andy said about the letter and Nellie is comforting her."},{"type":"paragraph","text":"Jim and Pam make up while eating pie and Kevin tries to get Oscar to hit him in the face with his pie and Oscar eventually does. Andy feels terrible about what he said and adds a few sentences to Nellie's letter about how she would make a wonderful mother and signs it."},{"type":"paragraph","text":"Once back at the office building, Andy insists they keep playing the games they played while on the road and annoys the office staff with his constant singing and banjo playing."}],"images":[]},{"title":"Cultural references","level":2,"content":[{"type":"list","elements":[{"text":"The cold open features Andy showing the office various sports bloopers that he edited to make look funnier than they actually are, a reference to the popular \"Fail\" internet memes.","elements":[]},{"text":"Andy says, \"A blooper reel?! What is this, 2005? Do I look like Bob Saget?\" referencing the TV show America's Funniest Home Videos which Saget hosted from 1989 to 1997.","elements":[]},{"text":"Dwight notes that he is fine living in an EMF field, because most of his super-hero idols got their powers from massive amounts of electricity.","elements":[]},{"text":"Andy, by Nellie's own admission, thinks that she should \"go back to Loch Ness\", a reference to the mythical Loch Ness monster.","elements":[]},{"text":"Darryl asks Clark to teach him PowerPoint.","elements":[]},{"text":"On the work bus, members of the Dunder Mifflin staff re-create the Spartan cheerleaders' chant from Saturday Night Live.","elements":[]},{"text":"Andy later plays \"Foggy Mountain Breakdown\" by Earl Scruggs on the banjo.","elements":[]}]}],"images":[]},{"title":"Connections to previous episodes","level":2,"content":[{"type":"list","elements":[{"text":"Pam rests her head on Jim's shoulder like she did in episodes Diversity Day; Goodbye, Toby; Niagara; and Garden Party.","elements":[]},{"text":"Toby again is worried about the safety of the building. He was previously concerned twice about radon; the first time, only for Michael to hassle him about it, and the second time, when everyone was talking about what they should spend the surplus on.","elements":[]},{"text":"In \"The Chump,\" Dwight tries to make himself impotent.","elements":[]},{"text":"Darryl is trying to get Clark to teach him PowerPoint. Previously in the season 4 episode Money, after Ryan Howard is promoted to Michael Scott's immediate superior, he directs Michael to do a presentation teaching PowerPoint to the staff. During the presentation Ryan asks, \"Why is Darryl here? He works in the warehouse. It's not a party. Darryl, back downstairs. This isn't information you need.\" Darryl responds, \"This information here? Yeah, you're right. I don't need this.\" ","elements":[]}]}],"images":[]},{"title":"Amusing details\/Trivia","level":2,"content":[{"type":"list","elements":[{"text":"Andy asks Toby, \"How are you not murdered every hour?!\", similar to Michael's hatred towards Toby.","elements":[]},{"text":"The Andy Bernard \"Get Glue\" sticker was released alongside the episode.","elements":[]},{"text":"Oscar asks Kevin: \"What is 19,154 pies divided by 61 pies?\" While Kevin is applauded for answering: \"314 pies\", the correct answer would be just 314. Also, 3, 1, and 4 are the first three digits of the number pi.","elements":[]},{"text":"\"Bildenkinder\" is not a German phrase. It's not even a real word. The term for \"building children\" would be \"Gebäudekinder\" (which doesn't exist either).","elements":[]},{"text":"When Pam asks how long Dwight has been weird to Jim, Jim says \"for the last 12 years?\" Given the show takes place in modern times, Jim has been working alongside Dwight since the year 2000.","elements":[]}]}],"images":[]},{"title":"Cast","level":2,"content":[],"images":[]},{"title":"Main Cast","level":3,"content":[{"type":"list","elements":[{"text":"Rainn Wilson as Dwight Schrute","elements":[]},{"text":"John Krasinski as Jim Halpert","elements":[]},{"text":"Jenna Fischer as Pam Halpert","elements":[]},{"text":"Ed Helms as Andy Bernard","elements":[]}]}],"images":[]},{"title":"Supporting Cast","level":3,"content":[{"type":"list","elements":[{"text":"Catherine Tate as Nellie Bertram","elements":[]},{"text":"Leslie David Baker as Stanley Hudson","elements":[]},{"text":"Brian Baumgartner as Kevin Malone","elements":[]},{"text":"Creed Bratton as Creed Bratton","elements":[]},{"text":"Clark Duke as Clark Green","elements":[]},{"text":"Kate Flannery as Meredith Palmer","elements":[]},{"text":"Ellie Kemper as Erin Hannon","elements":[]},{"text":"Angela Kinsey as Angela Lipton","elements":[]},{"text":"Jake Lacy as Pete Miller","elements":[]},{"text":"Paul Lieberstein as Toby Flenderson","elements":[]},{"text":"Oscar Nunez as Oscar Martinez","elements":[]},{"text":"Craig Robinson as Darryl Philbin","elements":[]},{"text":"Phyllis Smith as Phyllis Vance","elements":[]}]}],"images":[]}]}