{"sections":[{"title":"WUPHF.com","level":1,"content":[{"type":"paragraph","text":"\"WUPHF.com\" is the ninth episode of the seventh season of The Office and the 135th overall. The episode was directed by Danny Leiner and was written by Aaron Shure. It first aired on November 18, 2010. It was viewed by 7.28 million people."}],"images":[]},{"title":"Synopsis","level":2,"content":[{"type":"paragraph","text":"In the cold opening, the power goes out briefly when Michael overuses an outlet. When he unplugs the item that was causing the loss of power, the power comes back on. Because of this outage, the company server has shut down and needs to be brought back up immediately. However, the server was set up eight years ago, and everyone has since forgotten the password. After a brief guessing game by the employees of Dunder Mifflin, the password turns out to be \"bigboobz\", with a \"z\". "},{"type":"paragraph","text":"Erin comments to Pam that Ryan's new project WUPHF.com is using a lot of Dunder Mifflin supplies after a brief scene of him collecting a large stack of papers from the printer. As the new office administrator and an investor in WUPHF.com, Pam ignores it. Michael and Ryan talk about WUPHF.com and how it has an offer to be purchased, but Ryan insists the company can be worth a lot more money if they had more investors to fine-tune it before they sell. The two make an announcement that they are inviting more people in as investors. No one bites, so the current investors - Darryl, Andy, Pam, and Stanley - meet with Ryan and Michael in the conference room. Everybody wants to sell the company that only has 9 days before bankruptcy, except Ryan, who uses Michael's friendship against him to keep the majority vote. Kelly enters the room, claiming she came up with the idea and that she wants to sue. Ryan coddles her and tells the investors that he'll take care of everything. In the break room, Pam tries to convince Michael that Ryan is using him and that other people could be hurt financially if Ryan doesn't sell WUPHF.com, which is only valuable because of its domain name that will be bought by the Washington University Public Health Fund. Michael claims he has faith in Ryan. Michael tests Pam's theory and when Ryan dodges attempts to hang out, Michael sees some truth. Later, Darryl pulls Ryan out of his closet and the four investors try to bully Ryan into selling, but Michael comes in. He eventually gives Ryan an ultimatum to make WUPHF.com profitable in 9 days. After pondering, Ryan decides to sell the domain name."},{"type":"paragraph","text":"Meanwhile, Jim is on a hot sales streak. After talking with Kevin and realizing he isn't getting any commission from his latest sales, he approaches Gabe. Gabe informs him of Sabre's new commission cap but insists Jim still keep busy. With no motivation, Jim grows extremely bored. He decides to focus his efforts on pranking Gabe by editing Jo Bennett's audiobook to insult Gabe and make him sit through the entire thing."},{"type":"paragraph","text":"As the owner of the business park, Dwight hosts a Hay Festival in the parking lot. He gets so carried away that he misses his scheduled rendezvous with Angela, who meets Robert Lipton, a widower taking his son to the Hay Festival. The two begin to flirt, and Robert asks Angela if it's alright for him to call her at home. Angela voids Dwight's contract and tapes it to the door of their sexual lounge. At the end of the festival, Dwight crowns himself \"Hay King\" to rectify years of him losing to Mose as a child."}],"images":[{"src":"https:\/\/vignette.wikia.nocookie.net\/theoffice\/images\/6\/61\/Wuphf.png\/revision\/latest\/scale-to-width-down\/200?cb=20131024132649","caption":""}]},{"title":"Deleted Scenes","level":2,"content":[{"type":"list","elements":[{"text":"Michael tells Angela that someone is going to do his taxes. Ryan interrupts and says that Michael could be a billionaire. Ryan tells the audience that WUPHF.com used to be a prototype.","elements":[]},{"text":"Dwight and Nate meet a busty girl named Sheri and recommended her to play the role of Mother Harvest.","elements":[]},{"text":"Darryl invested with Ryan because the internet has a history of rewarding annoying, white boys.","elements":[]},{"text":"Michael and Ryan take Andy to Michael's office under false pretenses. Andy says, \"The Nard Dog does not invest in friends' companies.\"","elements":[]},{"text":"Dwight is eating lunch dressed as the Hay King and is interrupted by Angela.","elements":[]},{"text":"Michael interrupts Toby's video chat with Sasha to have a conversation about Ryan using him.","elements":[]},{"text":"Dwight reads a poem called \"Mother Earth\". It goes as follows:","elements":[]}]},{"type":"list","elements":[{"text":"Kevin is still stuck in the Hay Maze.","elements":[]}]}],"images":[]},{"title":"Amusing Details","level":2,"content":[{"type":"list","elements":[{"text":"In a previous episode when Ryan sends himself a WUPHF, he gets a call from Erin who says, \"Ryan, you've got a WUPHF on line one.\" When he sends himself a WUPHF in this episode, he does not get a phone call.","elements":[]},{"text":"The WUPHF flier Oscar is holding while discussing finances with Ryan says \"What ISN'T WUPHF?\"","elements":[]},{"text":"The little boy that Dwight speaks with will appear as his nephew in The Farm. This most likely wasn't planned, because in that episode it seems that Dwight's sister and her son do not live in the area.","elements":[]},{"text":"Robert Lipton's son, who appears in this episode, does not appear for the rest of the series. Robert's wife is deceased, so the son would've been in his full custody.","elements":[]},{"text":"Michael separates the trash into whites and colors, confusing it with laundry. He later says he's been doing it for eight years.","elements":[]},{"text":"Nate kneels on the ground while presenting Dwight with the hay crown.","elements":[]}]}],"images":[]},{"title":"Playing Cards","level":2,"content":[{"type":"list","elements":[{"text":"Jim is an Ace","elements":[]},{"text":"Dwight is a King","elements":[]},{"text":"Oscar is a Queen","elements":[]},{"text":"Phyllis is the Old Maid","elements":[]},{"text":"Pam is a \"solid seven\"","elements":[]},{"text":"Toby is the instruction card that you throw away","elements":[]},{"text":"Ryan is a Two (sometimes twos are wild)","elements":[]},{"text":"Michael is the Joker.","elements":[]}]}],"images":[]},{"title":"Cultural references","level":2,"content":[{"type":"list","elements":[{"text":"When trying to guess the server password, Pam mentions The Lord of the Rings films.","elements":[]},{"text":"Michael and Ryan's WUPHF skit is similar to the Apple Get A Mac advertising campaign.","elements":[]},{"text":"MLK stands for Martin Luther King Jr. His \"I Have A Dream\" speech is a 17-minute public speech delivered on August 28, 1963, in which he called for racial equality and an end to discrimination.","elements":[]},{"text":"John Legend is an American singer-songwriter and actor.","elements":[]},{"text":"Silicon Valley is home to many of the world's largest technology corporations as well as thousands of small startups.","elements":[]},{"text":"Michael compares his employees to playing cards. \"Pam is a solid 7\" serves as a double entendre about her appearance. He compares Ryan to a \"2\" and says that they can sometimes be wild, referencing \"deuces wild\" varieties of card games in which a deuce represents any suit or number.","elements":[]},{"text":"When Pam tries to persuade Michael that Ryan is taking advantage of him, Michael responds with, \"You may be right. I may be crazy,\" the opening lines to the song \"You May Be Right\" by Billy Joel. After Pam calls him on this, she gives him permission to continue, and he does with the song's next line, \"But it just may be a lunatic you're looking for.\"","elements":[]}]}],"images":[]},{"title":"Connections to previous episodes","level":2,"content":[{"type":"list","elements":[{"text":"In The Promotion, Ryan cons Pam out of $50 with the promise of $5000 a year later as the result of a friend who \"has an algorithm to predict the winner of any given college basketball game.\"","elements":[]},{"text":"Jim edits together snippets of Jo's autobiography Take A Good Look, which he got from her in Manager and Salesman.","elements":[]},{"text":"In the aforementioned episode, Jim gives up the manager position because he learns that Sabre has no cap on commissions.","elements":[]},{"text":"In Lecture Circuit Part 2 Michael is shown to have a system where he remembers people's names by first calling them an offensive nickname like 'baldy' or 'fatso' and then finding a way to connect that to their real name. In this episode, he refers to former IT guys by their offensive nicknames first, specifically 'glasses, turban, ear hair, fatty three, shorts, fatty two, lozenge, and fatso.' Given enough time, he may have remembered the real names of the IT workers.","elements":[]},{"text":"Turban is a reference to Sadiq, who appears a few times in the first few seasons before he is replaced by Nick as the IT technician","elements":[]},{"text":"Ryan wears a WUPHF.com t-shirt to advertise while being part of Dunder Mifflin's Lip Dub in Nepotism.","elements":[]},{"text":"When discussing past IT workers, Jim asks, \"What's was the name of the guy in the glasses, again?\" in reference to the glasses-wearing IT worker, Nick. This is a reference to Whistleblower, when Nick gets angry with the office, especially Jim, for not knowing his name.","elements":[]}]}],"images":[]},{"title":"Cast","level":2,"content":[],"images":[]},{"title":"Main cast","level":3,"content":[{"type":"list","elements":[{"text":"Steve Carell as Michael Scott","elements":[]},{"text":"Rainn Wilson as Dwight Schrute","elements":[]},{"text":"John Krasinski as Jim Halpert","elements":[]},{"text":"Jenna Fischer as Pam Halpert","elements":[]},{"text":"B.J. Novak as Ryan Howard","elements":[]},{"text":"Ed Helms as Andy Bernard","elements":[]}]}],"images":[]},{"title":"Supporting cast","level":3,"content":[{"type":"list","elements":[{"text":"Leslie David Baker as Stanley Hudson","elements":[]},{"text":"Brian Baumgartner as Kevin Malone","elements":[]},{"text":"Creed Bratton (actor) as Creed Bratton","elements":[]},{"text":"Kate Flannery as Meredith Palmer","elements":[]},{"text":"Mindy Kaling as Kelly Kapoor","elements":[]},{"text":"Ellie Kemper as Erin Hannon","elements":[]},{"text":"Angela Kinsey as Angela Martin","elements":[]},{"text":"Paul Lieberstein as Toby Flenderson","elements":[]},{"text":"Oscar Nunez as Oscar Martinez","elements":[]},{"text":"Craig Robinson as Darryl Philbin","elements":[]},{"text":"Phyllis Smith as Phyllis Vance","elements":[]},{"text":"Zach Woods as Gabe Lewis","elements":[]}]}],"images":[]},{"title":"Recurring cast","level":3,"content":[{"type":"list","elements":[{"text":"Kathy Bates as Jo Bennett (voice & picture only)","elements":[]},{"text":"Mark Proksch as Nate","elements":[]}]}],"images":[]},{"title":"Guest cast","level":3,"content":[{"type":"list","elements":[{"text":"Jack Coleman as State Senator Robert Lipton","elements":[]},{"text":"Delaney Ruth Farrell as Sasha Flenderson (Deleted Scene)","elements":[]},{"text":"Griffin Gluck as \"Mixed-Bred\"","elements":[]},{"text":"Selah Victor as Sheri\/Mother Harvest","elements":[]}]}],"images":[]}]}